[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wOS0yNy9iaXRjb2luLWJ0Yy1yZWZ1Z2UtYXBwZWFsLWlzLWJlaW5nLXRvdXRlZC1hZ2Fpbi1hcy11cy1zaHV0ZG93bi1wcm9zcGVjdHMtcmlzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Appeal Touted Again as US Government Shutdown Prospects Increase - Bloomberg",
        "content": "The increasing prospects of a US federal government shutdown has some Bitcoin advocates predicting a rally similar to one that happened in response to the regional bank crisis earlier this year.\n\n“We actually saw Bitcoin rally as a sort of safety-hedge against further banking unrest,” said Stephane Ouellette , co-founder and CEO of FRNT Financial. “It will be very interesting to see if the market going to buy Bitcoin during all different types of periods of US-economic/financial uncertainty or just in a banking crisis context as we saw earlier in the year.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMjYvd2hlcmUtYXJlLWJpdGNvaW4tbWluZXJzLWluLTIwMjMtdGV4YXMuaHRtbNIBT2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA5LzI2L3doZXJlLWFyZS1iaXRjb2luLW1pbmVycy1pbi0yMDIzLXRleGFzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin miners beef up Texas operations ahead of extinction-level event, exclusive data shows - CNBC",
        "content": "Foundry's Kevin Zhang with Jihan Wu, the founder and chairman of Bitdeer and a co-founder of Bitmain. Kevin Zhang\n\nCrypto winters don't scare Kevin Zhang, who has been in the business of mining bitcoin for ten years. He's lived through a few bear markets in the last decade, but no matter where he has set up shop — the U.S., Sweden, the Republic of Georgia, and China — he's survived every one. In fact, it is precisely when things look most grim for the sector that Zhang typically doubles down. In 2013, for example, China banned bitcoin for the first time. The world's largest cryptocurrency immediately began to crash, and it was a slow bleed down in price for the next few years. As a wave of Western companies went bankrupt, Zhang decided to jump into mining. \"I saw an opportunity to leverage my Chinese language skills and cultural background to become one of the earliest and largest overseas customers of Chinese ASIC manufacturers,\" said Zhang, who was born in America but spent his early childhood in Beijing and Shenzhen. For the next four years, he sourced gear and institutional knowledge from China, ultimately scaling up a site in Montana to become the largest bitcoin mining facility in North America. Zhang has since brought that same cavalier attitude to Foundry, a mining firm tucked under Barry Silbert's crypto empire. In May 2020, bitcoin miners suffered two big blows: Much of the world shut down as Covid cases spiked and the most recent halving had just slashed the mining reward from 12.5 to 6.25 bitcoin per block mined. Zhang and the team at Foundry shrugged off the double whammy of blackswan events and spent hundreds of millions of dollars on its mining business, deploying tens of thousands of machines. By Nov. 2021, bitcoin hit an all-time peak of nearly $70,000. But the stakes are higher this time around.\n\nBitcoin miners are barreling toward the \"halving\" — a major market-making event that some fear will be a death knell to many in the industry. It happens roughly every four years and refers to an inflation-curbing schedule baked into bitcoin's code where the reward for mining a new block of transactions gets cut in half. Historically, it also coincides with the start of a bull run in the price of cryptocurrencies. Whereas traders eagerly await the halving, hoping for a potential spike in bitcoin's price, it represents a direct hit to revenues for miners, as they will receive 50% less bitcoin for every block they verify. In a capital-intensive industry with already tight margins, the reduced reward has the potential to prove apocalyptic for some operators. \"This is the ultimate test for miners,\" said Zhang, Foundry's senior vice president of business development. \"Some may not make it through; some may. But I feel confident that if they work with us, and work with other strong actors, they may have a good chance to survive this.\" When the halving takes effect in Apr. 2024, the reward for miners will drop to 3.125 bitcoin, or around $83,000. By comparison, the first blocks of bitcoin mined in 2009 carried a reward of 50 bitcoin. Without a commensurate surge in bitcoin's price to counterbalance the diminished block rewards, many mining outfits — especially those burdened by rising energy costs, paying down on machines bought at peak pricing in 2021 — could get obliterated overnight. But rather than seeing the 2024 halving as an extinction-level event, Foundry is expanding its operations — diving into machine sales, on-site deployment, and logistics. FoundryX is a marketplace for buying and selling miners, both new and used — while their recently unveiled logistics arm deals in the deployment and shipment of miners across state lines and international borders. Managed site services is another program newly debuted where, for its U.S. customers, Foundry will help staff and manage miners on-site. \"Foundry is in this for the long haul,\" said Zhang. \"We're taking a long-term bet on bitcoin and on the fact that bitcoin mining will survive and will bounce back even stronger.\" After China launched a fresh campaign against bitcoin mining in 2021, much of the industry migrated west to the U.S. Since then, some states have battled it out to attract mining companies, while others have actively legislated against them. The controversy goes to energy consumption. Mining at-scale involves data centers packed with highly specialized computers that crunch math equations in order to validate transactions and simultaneously create new tokens. It requires expensive equipment, some technical know-how, and a lot of electricity. Whereas places like Texas and Wyoming welcome the trade, New York lawmakers have created rules designed, in part, to keep miners out. A mining pool lets a single miner combine its hashing power with thousands of other miners all over the world. Even though some miners opt to hide their geographic footprint with a virtual private network, pools still function as a useful gauge of the general geographic spread of the mining industry. Foundry opted to show states even with small amounts of hashrate — an industry term used to describe the computing power of all miners in the bitcoin network — to demonstrate that mining is happening across the country on the Foundry USA Pool.\n\nWhinstone CEO Chad Harris takes CNBC on a tour of the largest bitcoin mine in North America.\n\nThe new data also confirms that Texas has cemented its position as the crypto capital of the United States, as miners flock there for abundant clean energy and a permissive regulatory environment. Texas made up 8.43% of the hashrate in the U.S. as of the end of 2021, and that percentage has jumped to 28.50% as of July 27, 2023 — though Foundry notes that the data was aggregated during a period of heavy curtailment in July, so Texas's percentage of actual hashrate is even greater than what's reflected on their latest map. Zhang added that Texas's growth in Foundry's map also had to do with the fact that the firm took on more clients there in the past two years. Given that the U.S. is currently the world leader in terms of its share of the collective hashrate of the bitcoin network, that makes Texas the bitcoin capital of the world. Texas has grown to dominate bitcoin mining partly because of support from local authorities and the operator of the Texas energy grid, ERCOT. ERCOT has historically struggled with fluctuating energy prices and sporadic service, so it strikes deals with flexible energy buyers like bitcoin miners to help keep excess energy online during low-demand cycles, then offers incentives for miners to stop their work, allowing that excess energy to flow back to the grid when demand is high. Research from Castle Island Venture's Nic Carter and a collective of other industry practitioners including Lancium's Shaun Connell and the former interim chief of ERCOT, Brad Jones, found that over the past decade, instances of negative pricing surged considerably, accounting for more than 6% of all hours in 2022 across wholesale markets in the U.S. The research paper went on to note that negative priced power may increase further in Texas, in particular, given that the state is rapidly onboarding wind and solar to its grid. Those conditions are ideal for bitcoin miners.\n\nwatch now\n\n\"All you have to do is pay the miners slightly more than what they would have made mining for bitcoin that hour,\" said bitcoin mining engineer Brandon Arvanaghi, who now runs Meow, a company that enables corporate treasury participation in crypto markets. Arvanaghi calls the setup a \"a win-win.\" For years, Riot has been powering down operations at its Rockdale mine, about an hour from Austin, to help ease the burden on the state's grid. In July, for instance, bitcoin miner Riot Platforms raked in more than $31.7 million to keep its mining operations offline — $24.2 million came from energy sold back to the ERCOT grid and the other $7.4 million came via demand response credits. \"August was a landmark month for Riot in showcasing the benefits of our unique power strategy,\" said Jason Les, CEO of Riot, in a recent press release. \"The effects of these credits significantly lower Riot's cost to mine Bitcoin and are a key element in making Riot one of the lowest cost producers of bitcoin in the industry.\" Even during the bear market, Texas miners are building out, buying new sites and fresh fleets of hardware. Riot Platforms, for example, has aggressive expansion plans in place in other parts of the state, including Navarro and Milam counties. \"Riot's ability to source such a significant expansion opportunity in Texas exemplifies the Company's partnership-driven approach with all stakeholders, including the Company's business partners, ERCOT, and all levels of government, to commit to sustainable economic development,\" Les said of the expansion plan. Bitdeer, which operates its biggest facility four-tenths of a mile down the road Riot's mine in Rockdale, is also in expansion mode. The mining company was spun off from Chinese bitcoin mining giant Bitmain and went public via SPAC earlier this year. Meanwhile, Cipher Mining purchased 11,000 new mining machines for its facility in Odessa, Texas, while Foundry has acquired mining sites from the bankruptcy estate of Compute North in Minden, Nebraska, and Big Spring, Texas.\n\nElsewhere in the U.S., previous leaders in bitcoin mining saw their influence wane. In the last two years, Foundry's dataset shows that Georgia — a miner-friendly state offering competitive pricing on electricity, as well as a mix of renewable power sources including solar and nuclear, has seen its share of the U.S. hashrate plunge from 34.17% to 9.64%. The drop was driven by a combination of factors, including Texas's growth overall and Foundry's expanding operations in particular, as well as by measurement differences — one large miner in the state declined to have their activity included in this year's map. Though its growth was stagnant compared to the previous study, New York's share of the U.S. hashrate declined from 9.53% in 2021 to 8.75%, driven mainly by the state's moratorium against new miners issued in Nov. 2022. Other mining winners that showed notable growth during the period included New Hampshire and Pennsylvania, while Nebraska, North Carolina, Kentucky, Oklahoma and Washington all saw significant drops. Despite the plunge in bitcoin valuations since 2021, as well as increasing regulatory scrutiny from the Securities Exchange Commission and other agencies looking to regulate some cryptocurrencies like securities, the total U.S. hashrate — a proxy for industry competition — has more than doubled since the end of 2021. According to an analyst note from JPMorgan Chase on Sept. 1, the bitcoin network's overall hashrate set a record high for the eighth consecutive month in August. Foundry says the rise is driven in part by institutions entering the space. JP Morgan researchers also note that the mining business has gotten less lucrative — miners make an average of $66,400 per day per exahash of mining capacity, versus nearly $342,000 at bitcoin's peak in Nov. 2021. Meanwhile, the aggregate market cap of the 14 U.S.-listed miners tracked by the bank has plunged below $10 billion. Riot was the biggest loser in August, down 39%, while Bitdeer was the biggest winner, up 30%."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNi91cy1ob3VzZS1sYXdtYWtlcnMtcHVzaC1zZWNzLWdlbnNsZXItdG8tYXBwcm92ZS1zcG90LWJpdGNvaW4tZXRmLWltbWVkaWF0ZWx5L9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNi91cy1ob3VzZS1sYXdtYWtlcnMtcHVzaC1zZWNzLWdlbnNsZXItdG8tYXBwcm92ZS1zcG90LWJpdGNvaW4tZXRmLWltbWVkaWF0ZWx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "U.S. House Lawmakers Push SEC’s Gensler to Approve Spot Bitcoin ETF ‘Immediately’ - CoinDesk",
        "content": "On the eve of his scheduled appearance before the House Financial Services Committee, four members of that panel sent Gensler a letter contending that a spot bitcoin ETF is “indistinguishable” from the crypto futures ETFs for which the agency has already granted its blessing. Because of that, the agency should sign off on applicants requesting SEC approval, such as Fidelity, BlackRock’s iShares and Grayscale Investments, which shares CoinDesk’s parent company, Digital Currency Group."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2dlbnNsZXItdGVzdGltb255LXBva2Vtb24tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Gensler: Bitcoin is not a security, but tokenized Pokemon cards may be - Blockworks",
        "content": "During an almost five-hour long hearing, House Financial Services Committee members from both sides of the aisle grilled SEC Chair Gary Gensler on everything from crypto asset classification to his agency’s ambitious agenda.\n\nGensler appeared on Capitol Hill for a second time this month to face lawmakers’ questions on how he is running the SEC.\n\n“It’s clear that you are working to consolidate your own power even though it means crushing opportunities for everyday Americans and frankly the financial future of this country,” Rep. Tom Emmer, R-Minn., said when addressing Gensler during the hearing.\n\n“Even the federal courts are highlighting the damage you, sir, are doing to our constituents, and they’re telling you that you don’t have the legal authority to accomplish your goal of squashing competition in the financial markets.”\n\nGensler opted to address digital assets head-on in his opening statement, reiterating a stance he has maintained throughout his entire tenure: Crypto companies are capable of registering compliantly, they simply don’t want to.\n\n“There is nothing about the crypto asset securities markets that suggests that investors and issuers are less deserving of the protections of our securities laws,” Gensler said during his prepared remarks Wednesday. “Congress could have said in 1933 or in 1934 that the securities laws applied only to stocks and bonds. Yet Congress included a long list of 30-plus items in the definition of a security, including the term ‘investment contract.’”\n\nRep. Ritchie Torres, D-N.Y., who also co-signed a bipartisan letter sent to Gensler Tuesday regarding the agency’s reluctance to approve a bitcoin spot ETF, was one of the Democrats to take a somewhat rare stance against the SEC’s treatment of cryptocurrencies.\n\nRep. Torres asked Gensler whether or not an ‘investment contract’ requires an actual contract, to which Gensler replied with a quote from former Supreme Court Justice Thurgood Marshall about Congress’ definitions being vague.\n\n“I do not go to MIT, but in the Bronx, if I ask whether any investment contract includes a contract, the answer is typically yes or no,” Torres responded.\n\nWhen Torres asked Gensler whether purchasing a Pokemon card was a security, the SEC head said no.\n\n“If I were to purchase a tokenized Pokémon card on a digital exchange via a blockchain? Is that a security transaction?” Torres asked.\n\n“I’d have to know more,” Gensler answered.\n\nThe hearing comes amid increased bipartisan cooperation on crypto policy in the House. Five crypto-related bills managed to make it through committee markup and have been ordered to a full floor vote, potentially this fall.\n\nThe Financial Innovation and Technology (FIT) for the 21st Century Act, co-sponsored by French Hill, R-Ark., Glenn Thompson , R-Penn., and Dusty Johnson, R-S.D. and the Clarity for Payment Stablecoins Act, introduced by Patrick McHenry, R-N.C., have fairly promising bipartisan support in the House.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY2FuLWJpdGNvaW4tc3Vydml2ZS10aGUtbmV4dC1yZWNlc3Npb24v0gFaaHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS9jcnlwdG9jdXJyZW5jeS9jYW4tYml0Y29pbi1zdXJ2aXZlLXRoZS1uZXh0LXJlY2Vzc2lvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Can Bitcoin Survive the Next Recession? - Finance Magnates",
        "content": "Bitcoin, often known as digital gold, has acquired popularity as a speculative asset as well as a potential store of wealth and hedge against economic downturns. As speculation about an approaching recession grows, concerns about Bitcoin's resiliency and ability to withstand economic storms emerge. Lets examine the dynamics of Bitcoin in the face of a possible recession and seek advice from industry professionals.\n\nBitcoin's So Far Journey\n\nBitcoin, which was created over a decade ago by the pseudonymous Satoshi Nakamoto, was regarded with suspicion and uncertainty at first. It has, however, defied expectations by obtaining widespread acceptability and drawing an increasing number of investors, institutions, and organizations.\n\nOne of Bitcoin's distinguishing features is its decentralized nature. It runs on a blockchain network managed by a distributed network of nodes rather than a central authority. This decentralization, paired with a limited number of 21 million coins, has established Bitcoin as a digital alternative to traditional fiat currencies, which are susceptible to inflationary pressures.\n\nBitcoin's Spot Trading Volume Hits Five-Year Low Amid Recession Fears\n\nBitcoin's spot exchange trading volumes have plummeted to their lowest levels in nearly five years, reflecting heightened macroeconomic uncertainty that has made investors cautious. A recent report from CryptoQuant, an on-chain analytics platform, highlights the decline in daily BTC volumes on spot exchanges, which have not seen a significant rebound.\n\nThe report attributes this decline to two primary factors: the U.S. government's crackdown on the cryptocurrency industry and growing fears of an impending recession. These concerns have led investors to adopt a cautious approach, with daily Bitcoin transactions showing no signs of resurgence.\n\nChallenges for Short-Term Holders\n\nConversely, the past few months have posed challenges for short-term Bitcoin holders (STHs). While long-term holders continue to accumulate Bitcoin, holding nearly 75% of the entire supply, the supply held by short-term holders hit a multi-year low of 2.56 million BTC last month.\n\nDespite the challenging market conditions, Bitcoin's fundamental market indicators remain robust. The hash rate has surged by an impressive 661% in the last two years. Additionally, with the next Bitcoin halving on the horizon, data analysis suggests that investors may need to exercise patience for the next bullish phase.\n\nBitcoin as a Recession Hedging Tool\n\nOne of the key justifications for Bitcoin's longevity during a recession is its ability to act as a hedge. Historically, traditional hedges such as gold and government bonds have been sought desired during economic downturns. Bitcoin is frequently compared to gold owing to its rarity and ability to store value.\n\nBitcoin supporters believe that its restricted quantity and position as \"digital gold\" make it an appealing option for investors seeking refuge from economic turmoil. During times of uncertainty and currency depreciation, some people resort to Bitcoin to retain money and protect their assets from the loss of purchasing power.\n\nConsiderations and Obstacles\n\nWhile Bitcoin's potential as a hedge is enticing, investors and regulators must examine the following obstacles and considerations:\n\nPrice Volatility: Bitcoin's price has historically been quite volatile. While volatility might provide opportunities for traders, it can also turn off risk-averse investors. Regulatory Framework: The regulatory framework for cryptocurrencies is continually evolving. Government actions and regulations have the potential to have a significant impact on the bitcoin market. Market Sentiment: Market sentiment, news, and social media trends can all have an impact on Bitcoin's price. This can result in dramatic price changes. Adoption and Liquidity: The usefulness of Bitcoin as a hedge is dependent on its adoption and liquidity. Bitcoin's position as a store of wealth may strengthen as acceptance expands. Diversification: A key risk management method is to diversify one's financial portfolio. Bitcoin should be viewed as a component of a diversified portfolio, not as the single buffer against recession.\n\nConclusion\n\nThe topic of whether Bitcoin will survive the next economic downturn is complicated and multidimensional. While Bitcoin has showed promise as an economic hedge, it is not without danger. Bitcoin's performance is influenced by price volatility, regulatory uncertainty, and market sentiment.\n\nAs the global economic environment evolves, Bitcoin's status as a digital asset and potential store of value will almost certainly be called into question. Investors must perform extensive research, determine their risk tolerance, and select a diversified investing strategy that corresponds with their financial objectives.\n\nFinally, whether Bitcoin can weather the storms of a recession is unknown. However, its resiliency and growing acceptability in mainstream finance indicate that it will continue to pique the curiosity and debate of investors, economists, and policymakers in the coming years."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNy9zZWNzLWdlbnNsZXItdGhyb3dzLW1vcmUtY3J5cHRvLXB1bmNoZXMtaW4tY29uZ3Jlc3Npb25hbC1oZWFyaW5nL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNy9zZWNzLWdlbnNsZXItdGhyb3dzLW1vcmUtY3J5cHRvLXB1bmNoZXMtaW4tY29uZ3Jlc3Npb25hbC1oZWFyaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "SEC’s Gensler Throws More Crypto Punches in Congressional Hearing - CoinDesk",
        "content": "A judge in the D.C. Circuit Court of Appeals told the SEC in August to rethink its view on these applications for bitcoin ETFs. Circuit Judge Neomi Rao wrote that the agency’s rejection in the Grayscale Investments case had been \"arbitrary and capricious.\" Gensler’s testimony didn’t reveal what the agency will do next, or when it will act."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2UtY2hhcnRzLXZhbHVl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Don't lose sleep over bitcoin price charts - Blockworks",
        "content": "When I tell people I work in Bitcoin, the first thing I’m asked is what went wrong.\n\nOnce I have the privilege of explaining the fraud of Mr. Bankman-Fried and that it had nothing to do with Bitcoin — and represents, in fact, the antithesis of the ethos of decentralization that Bitcoin introduced — I’m then asked about the price, when I “got in,” and if we’ll ever see all-time highs again.\n\nIt’s not their fault. Mainstream media is focused on headlines that drive clicks — the overnight millionaires, the rapid price appreciation and crashes, missing the forest for the trees.\n\nBitcoin is a financial revolution\n\nI unequivocally believe Bitcoin will go down as one of the most pivotal innovations in history.\n\nIn the US, Bitcoin attracts a certain cross section of people, usually consisting of those angered by the 2008 global financial crisis: Libertarians, technologists and grizzled former legacy finance professionals. They are people who are fighting for a cause, motivated because they see and understand the cracks in the existing financial system.\n\nBut around the world, those who truly need Bitcoin are finding it. As non-sovereign money, Bitcoin represents an escape hatch — a transfer of power away from government back to the people when control of the financial system is abused by those in power. Citizens are given the off-ramp to save their money in a currency that their government does not have the ability to produce more of and is more difficult to seize, a harder money.\n\nA money’s hardness represents our ability to produce more of it. The harder money is, the better chance it has of holding value over time. Gold is a particularly hard money, as it is very difficult and costly to extract more of it than annual global production dictates. For centuries, the world transacted either in gold or in fiat currencies backed by gold.\n\nToday, the majority of economies transact in central bank-backed fiat currencies, where the cost of production is nothing more than either the paper that it is printed on or adding a row in a database.\n\nIn the United States, the expansion of the money supply is decided by the Federal Reserve, behind closed doors by unelected officials. When the money supply is inflated to allow the government to spend more, the buying power of existing dollars is devalued. Nobel Prize winner Milton Friedman once said: “Inflation is the only form of taxation that can be levied without any legislation”\n\nThe money supply has steadily increased for decades, but the pace has accelerated since 2008. Then in 2020, the Covid emergency provided an immense expansion of the money supply. This liquidity injection into markets resulted in the largest monetary expansion in US history.\n\nWe are witnessing what happens when money is not hard, as the US dollar has rapidly lost purchasing power, and costs of everyday goods and services are on the rise. Inflation dominates not just headlines, but decisions made in the grocery store.\n\nThis puts citizens in an environment where they’re forced to outpace inflation. A dollar tomorrow is worth less than a dollar today. This compels Americans to be capital allocators and make “their dollar work for them.” They invest and reach further out on the risk curve, risking their savings in effort to maintain or even increase their buying power. Keeping up a side hustle of investing detracts from their ability to perform their primary job to the best of their abilities, therefore devaluing their contribution to the economy and society.\n\nEven worse, inflation gives incentives for high time preference and spending in the present. With your dollar worth most in the present, it makes sense to spend rather than save, leading to the consumption-based culture we live in today. With consumers saving a lower percentage of their income each year, we spend more time worrying about the future and how we’ll one day be able to retire.\n\nBitcoin fixes this\n\nCompare the fiat system with Bitcoin’s hardcoded monetary policy. Due to the economic incentives placed on actors in the Bitcoin ecosystem, there will never be more than 21 million bitcoin issued. New coins are created by the network every 10 minutes as miners confirm transactions. The issuance of coins is cut in half every four years and currently 6.25 BTC is issued every block.\n\nThe beauty of Bitcoin’s supply issuance is its relationship with network effects. As Bitcoin adoption grows over time, the demand for BTC increases exponentially with a growing number of users looking to acquire it. At the same time, the supply issuance decreases every four years. This supply/demand mismatch brings an increase in bitcoin’s price over time, giving the incentive to save rather than spend. This brings higher time preference among adopters, buying only what is needed today, knowing your savings will be worth more in the future. No more second job as a capital allocator trying to outpace inflation, as people save more and spend less time worrying about retirement.\n\nRead more from our opinion section: Raise your hand if you fully trust your bank\n\nWhile the mainstream headlines speak of doom and gloom, Bitcoin is working. This last month saw all-time-highs in both mining hash rate and unique addresses being used. The network is becoming more secure and adoption is increasing despite Bitcoin’s price in USD, as more people are coming into the ecosystem.\n\nThe people who need Bitcoin most are still finding it, as adoption continues to grow exponentially in the Global South, particularly in countries like Turkey and Argentina where inflation has spiraled out of control due to government mismanagement of currency. While we’re far away from bull market highs of bitcoin priced in USD, Bitcoin continues to make all-time highs month after month when priced in Turkish liras and Argentinian pesos. The escape latch is working as designed for those who need it most, giving people the ability to protect savings and transact freely when the financial infrastructure around them is crumbling.\n\nI can think of no more worthy way to spend my career than playing my role in pushing the adoption of this world-altering technology. Every day I’m inspired on the front lines, helping the innovators in this space. The rails and infrastructure are being set in place for the next billion adopters, and it’s a privilege to be a part of it. Block after block, Bitcoin is working.\n\nMitch Kochman is Director of Platform Sales at BitGo, where he manages BitGo’s premier client relationships with exchanges, miners and payments platforms. He is predominantly focused and passionate about the Bitcoin-only ecosystem. Mitch has been with BitGo since 2022 and previously spent 11 years at IBM as a sales executive leading global software strategy at several major banks, the last of which being J.P. Morgan Chase. Mitch graduated from University of Maryland with a B.S. in Information Systems and Accounting.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjcvYml0Y29pbi1zbGlkZXMtYmFjay10b3dhcmRzLTI2ay1hcy1zdXJnaW5nLWludGVyZXN0LXJhdGVzLXRyaWdnZXItbWFjcm8taml0dGVycy_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOS8yNy9iaXRjb2luLXNsaWRlcy1iYWNrLXRvd2FyZHMtMjZrLWFzLXN1cmdpbmctaW50ZXJlc3QtcmF0ZXMtdHJpZ2dlci1tYWNyby1qaXR0ZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Slides Back Towards $26K as Surging Interest Rates Trigger Macro Jitters - CoinDesk",
        "content": "Although interest rates are continuing to trend upwards, which in theory should put pressure on the price of bitcoin, some have argued that the typical relationship between interest rates and bitcoin is breaking down, while others believe there's a bullish argument to be made about bitcoin based on its technical aspects."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNi9zZWMtZXh0ZW5kcy1hcmstZ2xvYmFsLXgtZXRmLWRlYWRsaW5lcy1hcy1nb3Zlcm5tZW50LXNodXRkb3duLWxvb21zL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOS8yNi9zZWMtZXh0ZW5kcy1hcmstZ2xvYmFsLXgtZXRmLWRlYWRsaW5lcy1hcy1nb3Zlcm5tZW50LXNodXRkb3duLWxvb21zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "SEC Extends Ark, Global X ETF Deadlines as Government Shutdown Looms - CoinDesk",
        "content": "As the federal government braces for a potential shutdown brought about by a budget impasse in Congress, the securities regulator extended its next deadlines for the two applications well before the interim deadlines arrived. The SEC has a total of 240 days to make a final decision on any application after it starts reviewing, but there are a number of potential time marks during that period in which it has to do certain things or extend the time it’s allowed."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2FuY2hvcndhdGNoLXJhaXNlcy0zbS10by1zb2xpZGlmeS1iaXRjb2luLWN1c3RvZHktYW5kLWluc3VyYW5jZS1wbGF0Zm9ybS0zMDE5Mzg0NjguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "AnchorWatch Raises $3M to Solidify Bitcoin Custody and Insurance Platform - PR Newswire",
        "content": "AnchorWatch's Trident Vault software provides a protocol native custody solution to owners of Bitcoin, backed by regulated high-quality insurance\n\nNASHVILLE, Tenn., Sept. 26, 2023 /PRNewswire/ -- Today, AnchorWatch , an insurer that covers commercial entities holding Bitcoin, announced a $3M funding round led by Ten31 with participation from Axiom BTC, Timechain, Bitcoin Opportunity Fund, UTXO Management (the asset management arm of Bitcoin Magazine and host of the Bitcoin Conference), and others. AnchorWatch's proprietary Trident Vault software provides a protocol native custody solution to owners of bitcoin, backed by regulated high-quality insurance.\n\nAnchorWatch\n\nWith this latest investment, AnchorWatch will be in position to complete all regulatory and capital requirements needed to deliver Trident Vault to customers and start selling policies. Additionally, AnchorWatch will undergo security audits by a number of credentialed firms to further solidify Trident Vault as a sound and viable custody solution for enterprise use.\n\nTrident Vault is the first bitcoin vault designed specifically for commercial use and integrating dispersed workflows for remote teams. It introduces key holder seniority and time-locked spending conditions to institutional bitcoin custody, bringing compliance and governance on-chain.\n\n\"Bitcoin owners are still faced with the binary choice between self-custody and third-party sole custodians,\" said Robert Hamilton, cofounder and CEO at AnchorWatch. \"In the case of the latter, high-risk trading strategies, or worse, blatant fraudulent activities have resulted in catastrophic losses for customers. Thus, they are hesitant to rely on the commercial key holder to deliver the services promised. AnchorWatch makes owning and holding the bearer asset practical, safe, easy, secure and verifiable.\"\n\nAnchorWatch achieves its superior collaborative custody in two ways. First, their Trident Vault enables supported custody by holding a minority of keys and employing protocol-level governance and compliance. With layered security, Trident Vault allows bitcoin to be custodied in a method that suits its technology by dispersing custody physically and among unrelated entities, reducing risks of loss from catastrophic events like fires and floods, but also from theft by internal and external bad actors.\n\nSecondly, AnchorWatch embeds regulated property insurance on the bitcoin in a Trident Vault itself. This guarantees that assets are insured in the case of catastrophe via regulated and collateralized property insurance. Because Trident enables superior security during custody, AnchorWatch is able to offer insurance at affordable rates.\n\n\"AnchorWatch is building both the technical infrastructure to advance bitcoin's potential as programmable money and the credentialed legal/financial infrastructure for bitcoin to be held by commercial institutions via its insurance offerings,\" said Jonathan Kirkwood, Managing Partner at Ten31. \"This is a pivotal step that directly aligns with our mission at Ten31 to establish bitcoin as a viable asset for institutions, and investing in the companies at the forefront of innovating in the ecosystem.\"\n\nAnchorWatch caters to family trusts, funds and pensions, family and multifamily offices, bitcoin miners and mining pools, and any other businesses that hold bitcoin. The Trident Vault is particularly applicable to estate and inheritance planning purposes. It can be utilized by estate attorneys, investment advisors, or technical advisors who advise multiple clients in the custody of their bitcoin.\n\nTo learn more about AnchorWatch, visit https://www.anchorwatch.com/ .\n\nAbout AnchorWatch\n\nAnchorWatch is an insurance provider, operating in the United States as a managing general agent (MGA) and captive insurer, building bespoke insurance products and technology designed for Bitcoin from the ground up. AnchorWatch property and casualty insurance policies are designed for individuals and commercial entities and cover Bitcoin stored in approved cold storage, facilitated via its robust Trident Vault software. Trident Vault combines the benefits and control of self-custody with the safety and governance of supported-custody in a way that brings new confidence to storing Bitcoin, all backed by high-quality insurance coverage.\n\nAbout Ten31\n\nTen31 is the leading platform investing in companies building infrastructure and technology in the Bitcoin ecosystem. With a footprint in Nashville and Austin, Ten31 seeks to support the ecosystem's most promising founders and companies, leveraging its deep understanding of Bitcoin, extensive experience, and broad reach to create value for its partners. Since the fund's inception, Ten31 has directed more than $100 million in equity to companies building on Bitcoin and the Lightning Network. For more information, visit www.ten31.vc\n\nContact\n\nInkhouse for Ten31\n\n[email protected]\n\nSOURCE Ten31"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3doYXRpcy9mZWF0dXJlL0EtdGltZWxpbmUtYW5kLWhpc3Rvcnktb2YtYmxvY2tjaGFpbi10ZWNobm9sb2d50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "A Timeline and History of Blockchain Technology - TechTarget",
        "content": "Blockchain was officially introduced in 2009 with the release of its first application -- the Bitcoin cryptocurrency -- but its roots reach back several decades. Many of the technologies that form the basis for blockchain today were in the works long before the emergence of Bitcoin.\n\nStill, blockchain most identifies with Bitcoin -- for better or worse. In the wild and raucous years that followed Bitcoin's debut, blockchain earned a reputation akin to the Wild West. Its decentralized, peer-to-peer (P2P) architecture allowed just about anyone to participate in the process, making it seem too risky for business use. That started to change in 2016 when a burgeoning open source community began developing complete enterprise platforms.\n\nSince then, the technology has taken on a life of its own, with interest coming from many quarters, despite the sometimes scary cryptocurrency headlines of late. Governments, businesses and other organizations are researching and deploying blockchain technology to meet needs that have nothing to do with digital currency. In the face of proliferating cyberthreats and government data privacy regulations, blockchain offers security, immutability, traceability and transparency across a distributed network, making it well suited for use cases that have become difficult to support and protect with traditional infrastructures.\n\nWhat is blockchain? Blockchain is a type of database that's a public ledger for recording transactions without the need for a third party to validate each activity. It's distributed across a P2P network and consists of data blocks linked together to form a continuous chain of immutable records. Each computer in the network maintains a copy of the ledger to avoid a single point of failure. Blocks are added in sequential order, and they're permanent and tamperproof. This article is part of Blockchain for businesses: The ultimate enterprise guide Which also includes:\n\nTop 10 benefits of blockchain for business\n\nTop 10 benefits of blockchain for business What are the 4 different types of blockchain technology?\n\nWhat are the 4 different types of blockchain technology? 7 must-have blockchain developer skills Download 1 Download this entire guide for FREE now! A blockchain starts with an initial block -- often referred to as the Genesis block -- that records the first transactions. The block is also assigned an alphanumeric string called a hash, which is based on the block's timestamp. Blocks are added to the chain sequentially. Each block uses the hash from the previous block to create its own hash, thus linking the blocks together. Blockchain also uses a computational process called consensus to validate a block's authenticity before it can be added to the chain. As part of this process, most of the nodes on the blockchain network must agree that the new block's hash has been calculated correctly. Consensus ensures that all copies of the distributed ledger are in the same state. Initially, blockchain provided a distributed public ledger to support Bitcoin, so transactions could be recorded without the need for a central authority to establish trust in a trustless environment. Not only were transactions more efficient, but also the costs typically associated with third-party verification were eliminated. Blockchain also provided greater transparency, traceability and security than conventional approaches to handling distributed transactions.\n\nBlockchain's historical building blocks Although blockchain as an entity has a relatively short history, its influence today is widespread and its applications wide-ranging and growing. Through the decades, blockchain's development and evolution include some of the following notable developments: Pioneers like Merkle and his tree, Chaum and digital cash, Haber and timestamping, Dwork and proof of work (PoW), Black and hashcash, Finney and reusable PoW dotted the early years of the pre-blockchain landscape.\n\nThe presumed pseudonym Satoshi Nakamoto was created to introduce the concept of cryptocurrency and blockchain. Shortly thereafter, cryptocurrency was launched and Nakamoto conducted the first bitcoin transaction, a bitcoin exchange was established and a programmer paid 10,000 bitcoin for two pizzas.\n\nBitcoin's price soared from pennies to tens of thousands of dollars, all the while draped in controversies, shutdowns, crackdowns, bankruptcies, scams, scandals and arrests.\n\nBlockchain started to somewhat divorce itself from Bitcoin when the decentralized blockchain platform Ethereum eventually became one of the biggest applications of blockchain technology and opened the door to numerous business applications beyond cryptocurrencies.\n\nAnd buoyed by AI, IoT, non-fungible tokens (NFTs), decentralized finance (DeFi) and smart contracts, as well as initiatives by the likes of Walmart and Amazon, blockchain has gained legitimacy as a safe, viable alternative to traditional methods of conducting business and individual transactions. Block-by-block description of blockchain's inner workings.\n\n1979 One of the early pre-blockchain technologies is the Merkle tree, named after computer scientist and mathematician Ralph Merkle. He described an approach to public key distribution and digital signatures called tree authentication in his Ph.D. thesis for Stanford University. Merkle eventually patented this idea as a method for providing digital signatures. The Merkle tree provides a data structure for verifying individual records.\n\n1982 In his Ph.D. dissertation for the University of California, Berkeley, David Chaum described a vault system for establishing, maintaining and trusting computer systems among mutually suspicious groups. The system embodied many of the elements that comprise a blockchain. Chaum is also credited with inventing digital cash, and in 1989, he founded the company DigiCash.\n\n1991 Stuart Haber and W. Scott Stornetta published an article describing how to timestamp digital documents to prevent users from backdating or forward-dating electronic documents. The goal was to maintain the document's complete privacy without requiring record-keeping by a timestamping service. Haber and Stornetta updated the design to incorporate Merkle trees, which enabled multiple document certificates to live on a single block.\n\n1993 The beginnings of the PoW concept were published in a paper by Cynthia Dwork and Moni Naor to provide \"a computational technique for combatting junk mail, in particular, and controlling access to a shared resource, in general.\"\n\n1997 Adam Black introduced hashcash, a PoW algorithm that provided denial-of-service countermeasures.\n\n1999 Markus Jakobsson and Ari Juels published the term proof of work. Also, the P2P network was popularized by the now defunct peer-to-peer file sharing application Napster. Some argued that Napster was not a true P2P network because it used a centralized server. But the service still helped breathe life into the P2P network, making it possible to build a distributed system that could benefit from the compute power and storage capacity of thousands of computers.\n\n2000 Stefan Konst introduced the concept of cryptographically secured chains in his paper \"Secure Log Files Based on Cryptographically Concatenated Entries.\" His model, which showed that entries in the chain can be traced back from the Genesis block to prove authenticity, was the basis for today's blockchain models.\n\n2004 Hal Finney introduced reusable PoW, a mechanism for receiving a non-exchangeable -- or non-fungible -- hashcash token in return for an RSA-signed token. The PoW approach today plays a vital role in Bitcoin mining. Cryptocurrencies like Bitcoin and Litecoin use PoW, and Ethereum shifted to the proof-of-stake protocol to secure a network using a fraction of the energy that PoW uses.\n\n2008 Satoshi Nakamoto, thought to be a pseudonym used by an individual -- or group of individuals -- published a white paper introducing the concept of cryptocurrency and blockchain and helped develop the first Bitcoin software. Blockchain infrastructure, according to the white paper, would support secure, P2P transactions without the need for trusted third parties such as banks or governments. Nakamoto's real identity remains a mystery, but there has been no shortage of theories. The Bitcoin/blockchain architecture was introduced and built on technologies and concepts from the previous three decades. Nakamoto's design also presented the concept of a \"chain of blocks,\" making it possible to add blocks without requiring them to be signed by a trusted third party. Nakamoto defined an electronic coin as a \"chain of digital signatures,\" in which each owner transfers the coin to the next owner by \"digitally signing a hash of the previous transaction and the public key of the next owner and adding these to the end of the coin.\"\n\n2009 Cryptocurrency was launched during the Great Recession, when the government pumped large amounts of money into the economy. Bitcoin was worth less than a penny then. Nakamoto mined the first Bitcoin block, validating the blockchain concept. The block contained 50 bitcoin and was known as the Genesis block -- aka block 0. Nakamoto released Bitcoin v0.1 to the web service SourceForge as open source software. Bitcoin is now on GitHub. The first Bitcoin transaction took place when Nakamoto sent Hal Finney 10 bitcoin in block 170. The Bitcoin-dev channel was created on the text-based instant messaging system Internet Relay Chat for Bitcoin developers. The first Bitcoin exchange -- Bitcoin Market -- was established, enabling people to exchange paper money for bitcoin. Nakamoto launched the Bitcoin Talk forum to share Bitcoin-related news and information. In the spirit of cryptocurrency as money with fixed supply, Nakamoto set up a system to ensure the number of bitcoin mined won't ever exceed 21 million. Blockchain's evolution through the years has been intimately tied to cryptocurrencies, namely Bitcoin.\n\n2010 On May 22, Bitcoin made history when a programmer Laszlo Hanyecz paid 10,000 bitcoin for two delivered Papa John's pizzas. The two pizzas back then were valued at about $40, a transaction that would balloon to a value of more than $260 million at today's bitcoin price level. A short time later that year, programmer Jed McCaleb launched Mt. Gox, a Tokyo-based Bitcoin exchange. Mt. Gox was short for Magic: The Gathering Online eXchange -- a carryover from a fantasy card game. At its peak, Mt. Gox handled more than 70% of all Bitcoin transactions. But in August, a hacker exploited a bug in the blockchain code and created more than 184 billion bitcoin in block 74,638, tarnishing Bitcoin's reputation. Nakamoto published a new version of the Bitcoin software, but by the end of the year, he disappeared from the Bitcoin scene completely.\n\n2011 One-fourth of the 21 million bitcoin had been mined. By early February, the value of a bitcoin was equal to the U.S. dollar. Shortly thereafter, McCaleb sold Mt. Gox to Mark Karpelès. And soon after that, the bitcoin reached parity with the euro and British pound sterling. WikiLeaks started accepting bitcoin donations. However, Mt. Gox was hacked and bitcoin were stolen, causing an artificial drop in value and resulting in suspension of trading. Litecoin was released in October, representing one of the earlier Bitcoin spinoffs and considered the first alternative cryptocurrency.\n\n2012 The interest in cryptocurrencies solidified. Bitcoin's price hovered around $5 for most of the year with several fluctuations. Early that year, Mihai Alisie and Ethereum creator Vitalik Buterin launched Bitcoin Magazine and published their first issue in May. A few months later, the Bitcoin Foundation was established to promote Bitcoin and restore public perceptions of cryptocurrency after several scandals. McCaleb and Chris Larsen founded OpenCoin, which led to the development of the Ripple transaction protocol for currency transactions and real-time payments. Coinbase raised more than $600,000 in its crowd-funded seed round on its way to becoming one of the top Bitcoin exchanges.\n\n2013 Bitcoin's upward trajectory continued. In February, Coinbase reported selling $1 million worth of bitcoin in a single month at more than $22 each. By the end of March, with 11 million bitcoin in circulation, the currency's total value exceeded $1 billion. And in October, the first reported bitcoin ATM launched in a Vancouver, B.C., coffee shop. But it wasn't all good news for digital currency. Both Thailand and China banned cryptocurrencies. The U.S. Federal Court seized Mt. Gox's funds in the U.S. for transmitting money without a license. And the FBI shut down the dark web marketplace Silk Road, confiscating about 144,000 bitcoin worth more than $1 billion and resulting in a life prison sentence for the owner Ross Ulbricht for a litany of crimes, including drug trafficking, computer hacking and money laundering.\n\n2014 Despite setbacks, one of the more important milestones in blockchain's history occurred when Bitcoin Magazine co-founder Buterin published a white paper proposing a decentralized application platform, leading to the creation of Ethereum and the Ethereum Foundation. Ethereum paved the way for blockchain technology to be used for applications other than cryptocurrency. It introduced smart contracts and provided developers with a platform for building decentralized applications. Financial institutions and other industries began to recognize and explore blockchain's potential, shifting their focus from digital currency to the development of blockchain technologies. But Bitcoin stayed in the spotlight -- for better and worse. The Mt. Gox Bitcoin exchange filed for bankruptcy. The Bitcoin Foundation vice chairperson was arrested for money laundering. And the U.K. tax authority classified bitcoin as private money. Yet several companies accepted bitcoin by year's end, including the Chicago Sun-Times, Overstock.com, Microsoft, PayPal and Expedia. Bitcoin's acceptance only added fuel to blockchain's fire.\n\n2015 The Ethereum Frontier network launched, enabling developers to write smart contracts and decentralized apps that could be deployed to a live network. Ethereum was on its way to becoming one of the biggest applications of blockchain technology. It drew in an active developer community that continues to this day. In addition, Nasdaq initiated a blockchain trial. The Linux Foundation launched the Hyperledger project. And nine major investment banks joined forces to form the R3 consortium, exploring how blockchain could benefit their operations. Within six months, the consortium grew to more than 40 financial institutions.\n\n2016 The term blockchain gained acceptance as a single word, rather than being treated as two concepts, as they were in Nakamoto's original paper. The Chamber of Digital Commerce and the Hyperledger project announced a partnership to strengthen industry advocacy and education. A bug in the Ethereum decentralized autonomous organization code was exploited, resulting in a \"hard fork\" in the Ethereum network. The Bitfinex cryptocurrency exchange was hacked and nearly 120,000 bitcoin were stolen -- a bounty worth about $66 million.\n\n2017 Bitcoin hit a record high of nearly $20,000. Japan recognized bitcoin as legal currency. Seven European banks formed the Digital Trade Chain Consortium to develop a trade finance platform based on blockchain. The Block.one software company introduced the EOS blockchain operating system, based on the EOS cryptocurrency and designed to support commercial decentralized applications. About 15% of global banks used blockchain technology in some capacity.\n\n2018 Entering its 10th year, bitcoin's value continued to drop, ending the year at about $3,800. The online payment firm Stripe stopped accepting bitcoin payments. Google, Twitter and Facebook banned cryptocurrency advertising. South Korea banned anonymous cryptocurrency trading but announced it would invest millions in blockchain initiatives. The European Commission launched the Blockchain Observatory and Forum to accelerate the development of blockchain. Baidu introduced its blockchain-as-a-service platform.\n\n2019 Walmart launched a supply chain system based on the Hyperledger platform. Amazon announced the general availability of its Amazon Managed Blockchain service on AWS to help users build resilient Web 3.0 applications on public and private blockchains. Ethereum network transactions exceeded one million per day. Blockchain research and development took center stage as organizations embraced blockchain technology and decentralized applications for a variety of use cases.\n\n2020 A Deloitte survey revealed that nearly 40% of respondents incorporated blockchain into production, and 55% viewed blockchain as a top strategic priority. Ethereum launched the Beacon Chain in preparation for Ethereum 2.0. Stablecoins, whose value is tied to another asset class, rose significantly because they promised more stability than traditional cybercurrencies. Interest increased in combining blockchain with AI to optimize business processes.\n\n2021 Bitcoin reached an all-time high of $68,789.63 on Nov. 10, 2021. During its bull run, the bitcoin market cap surpassed $3 trillion. Coinbase went public and was acknowledged as the seventh biggest new listing of all time on the U.S. stock exchange. The DeFi market offering services through smart contracts on blockchain grew a whopping 600% from the previous year, reaching a value of $200 billion. And NFT artwork made headlines, selling for more than $69 million in Ethereum at the auction house Christie's. Well-known entrepreneurs and athletes attempted to capture the meteoric rise in bitcoin's value, including Elon Musk initially accepting cryptocurrency as payment on new Tesla vehicles and Aaron Rogers taking a portion of his multimillion-dollar NFL salary in bitcoin. Interest in using blockchain for applications other than cryptocurrency continued as governments and enterprises considered blockchain for a variety of use cases, including voting, real estate, fitness tracking, intellectual rights, IoT and vaccine distribution in the midst of the COVID-19 pandemic. Moreover, multiple cloud providers now offered blockchain as a service, and the demand for qualified blockchain developers was greater than ever. The global blockchain technology market was valued at nearly $6 billion in 2021 and seen surpassing a trillion dollars by 2030, according to market researcher Statista. Blockchain's business applications spread far and wide beyond cryptos.\n\n2022 NFTs continued their ascent, eco-friendly blockchain networks emerged and blockchain applications increased among companies. Bitcoin mining crept closer to Nakamoto's 21 million coin limit, reaching 19 million and leaving less than 10% of bitcoin to be mined. All-time high prices for bitcoin and other cryptocurrencies plummeted in the spring due to investor concerns about inflation and the new COVID-19 Omicron variant. Some cryptocurrency exchanges went bankrupt. The collapse of the FTX exchange and arrest of its CEO Sam Bankman-Fried amplified fears about cryptocurrency's riskiness. The open source blockchain platform Terra also collapsed. Speculation of new U.S. government regulation of cryptocurrency added to the uncertainty but at the same time was thought to help legitimize the industry. Globally, Danish shipping company Maersk announced the shutdown of the blockchain-based TradeLens digital ledger it co-developed with IBM because of a lack of player participation. And the Australian Stock Exchange scrapped a seven-year plan to move its trading platform to blockchain. More than 100 countries were involved in the creation of their own central bank digital currencies, according to Statista. CBDCs are digital versions of real-world fiat money to eventually help speed cross-border retail transactions on blockchain in contrast to the slower speeds and price volatility of cryptocurrency. Blockchain's vaunted claims of imperviousness came under attack -- and not just figuratively. Blockchain analysis firm Chainalysis identified nearly 200 cryptocurrency or blockchain hacks, resulting in losses of $3.8 billion. The most noteworthy incident occurred when the video game blockchain Ronin Network reported the theft of $625 million worth of Ether and USDC stablecoins. The U.S. Treasury Department blamed a North Korean hacker collective for the attack.\n\n2023 The bad news for cryptocurrency continued as the SEC indicted executives at the Coinbase and Binance exchanges and filed charges against crypto-asset entrepreneur Justin Sun and three of his wholly owned companies for the unregistered offer and sale of crypto-asset securities. Businesses are still moving ahead with blockchain, but they're proceeding with greater caution. While blockchain technology has been mostly applicable to finance services and banking, other viable applications include gaming, media and entertainment, real estate, healthcare, cybersecurity, smart contracts, NFTs, IoT, transportation, supply chain management and the government. But the latest iteration of the internet, Web 3.0, with its offer of decentralization and data security, may well be the greatest driver of blockchain technology. Bitcoin for now has found some relatively solid footing in the $25,000 to $30,000 range. Bitcoin mining should reach Nakamoto's 21 million limit sometime around 2140."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTI2L3NlYy1kZWZlcnMtZGVjaXNpb24tb24tYXJrLTIxc2hhcmVzLXNwb3QtYml0Y29pbi1ldGYtZmlsaW5nLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "SEC Once Again Defers Decision on ARK 21Shares Spot Bitcoin ETF Filing - Bloomberg",
        "content": "The US Securities and Exchange Commission once again delayed making a decision on whether to approve the first US exchange-traded fund that invests directly in Bitcoin.\n\nThe primary US securities regulator deferred on a filing from crypto exchange-traded-products issuer 21Shares and Cathie Wood’s ARK Investment Management, according to documents posted on its website Tuesday."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLWNyZWF0b3ItY2FzZXktcm9kYXJtb3ItcGl0Y2hlcy1icmMtdG9rZW4tYWx0ZXJuYXRpdmUtcnVuZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals creator Casey Rodarmor pitches BRC-20 alternative 'Runes' - Cointelegraph",
        "content": "The inventor of Bitcoin Ordinals is proposing a new Bitcoin-based fungible token protocol as a potential alternative to the BRC-20 token standard.\n\nThe BRC-20 standard was launched in March by anonymous developer “Domo.” Within two months, the BRC-20 market cap reached $1 billion, with PEPE and ORDI among the most notable BRC-20 tokens created on Bitcoin.\n\nNew terrible idea just dropped: Runes.\n\n\n\nA worse-is-better fungible token protocol for Bitcoin.https://t.co/TPVrUvWxm8 — Casey (@rodarmor) September 25, 2023\n\nBRC-20 enables the minting and transfer of fungible tokens via the Ordinals protocol on Bitcoin. But the issue with BRC-20 tokens is that they spam Bitcoin with “junk” unspent transaction outputs, or UTXOs, argues Rodarmor.\n\nBRC-20 tokens have the “undesirable consequence of UTXO proliferation,” he explained in a Sept. 25 blog post, proposing Runes as a UTXO-based alternative.\n\n“Protocols that are UTXO-based fit more naturally into Bitcoin and promote UTXO set minimization by avoiding the creation of ‘junk’ UTXOs.”\n\nTLDR on Runes - A potential fungible token protocol for Bitcoin\n\n\n\nᚱᚢᚾᛖᛊ\n\n\n\n- Casey remains skeptical, citing \"99.9% are scams and memes,\" but recognises they don't appear to be going away.\n\n- Employs a UTXO-based system, notably simpler than BRC-20.\n\n- Uses the letter 'R' in the… https://t.co/zYP43f70gh — Franken (@ItsFranken) September 25, 2023\n\n“If this protocol had a small on-chain footprint and encouraged responsible UTXO management, it might serve as harm reduction compared to existing protocols,” Rodarmor added.\n\nUTXOs represent the amount of cryptocurrency left in a wallet following a completed transaction, where the balance is used in subsequent transactions and is stored in the UTXO database.\n\nBitcoin’s UTXO model plays a role in making Bitcoin an auditable and transparent ledger by preventing the double-spending problem.\n\nRodarmor said other fungible token protocols on Bitcoin, such as Really Good for Bitcoin, Counterparty and Omni Layer, have problems of their own.\n\nRodarmor’s problems with existing fungible token protocols on Bitcoin: Source: Casey Rodarmor\n\nWhile Rodarmor admitted 99.9% of fungible tokens are filled with scams and memes, he believes the right fungible token protocol can add value to the Bitcoin network:\n\n“Creating a good fungible token protocol for Bitcoin might bring significant transaction fee revenue, developer mindshare, and users to Bitcoin.”\n\nRelated: Ordinals still make up majority of Bitcoin txs despite price collapse\n\nIn a Sept. 25 Twitter Spaces with The Ordinals Show co-host Trevor Owens, Rodarmor said he came up with the Runes idea last week and that he wasn’t sure whether he would pursue it any further.\n\nShortly after the call, Owens floated offering $100,000 from the Bitcoin Frontier Fund to prospective developers who can get a Rune application up and running as a means to further Rodarmor’s proposal.\n\nOpen $100k investment offer in upcoming @BTCFrontierFund accelerator for first team who can get a working (not terrible) Rune indexer, issuance and/or transfer app, up live and running\n\n\n\nDon't make the tickers required to be unique, will be a shit show\n\n\n\nDM me. Serious offer. pic.twitter.com/6W0IwlhB9x — trevor.btc (@TO) September 26, 2023\n\nCointelegraph reached out to Rodarmor for comment but did not receive an immediate response.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Blockchain games aren’t really decentralized… but that’s about to change"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxlZ2FsbHktcmVjb2duaXNlZC1kaWdpdGFsLWN1cnJlbmN5LXNoYW5naGFpLWNoaW5h0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin gains legal recognition as digital currency in Shanghai, China - Cointelegraph",
        "content": "The Shanghai No.2 Intermediate People’s Court in China has reportedly recognized Bitcoin (BTC) as a unique and non-replicable digital asset while acknowledging its scarcity and inherent value.\n\nThe Chinese court released a report on Sept. 25 discussing the development of internet technologies. The report stated that with the development of internet technology, digital currencies such as Bitcoin stand out as unique and non-replicable. The report states that among a sea of digital currencies, Bitcoin is different and unique from other digital assets.\n\nThe report also sheds light on some of the unique properties of Bitcoin, including its scarcity and property attributes. The report states that Bitcoin has key currency features such as scalability, ease of circulation, storage and payment. Bitcoin continues to see global usage despite its decentralized nature and lack of central authority administration.\n\nThe latest judicial report acknowledging Bitcoin and its attributes as an asset class gives Bitcoin and other digital currencies in China more legitimacy. Despite a blanket ban on cryptocurrencies in China, legal arguments for defining bitcoins as personal property have gained a lot of traction from the local Chinese courts.\n\nThe latest recognition from one of the key courts in Shanghai comes despite the hostile attitude of the Chinese government toward Bitcoin. China imposed a blanket ban on all forms of cryptocurrency activities, including Bitcoin mining, in 2021. However, several courts in China have recognized Bitcoin and other digital assets as legal properties protected by law.\n\nRelated: China announces plans for new national financial regulator\n\nAs Cointelegraph reported on Sept. 1, a People’s Court in China released a report assessing the legality of virtual assets and analyzing the criminal law attributes of these assets. The report observed that digital assets qualify as legal property and thus are protected by the law.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: DeFi faces stress test, DoJ fears run on Binance, Hong Kong’s crypto trading: Hodler’s Digest, July 30–Aug. 5"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvdXMtZ292ZXJubWVudC0yNTBrLWJpdGNvaW4tcHJpY2UtcHJlZGljdGlvbi10aW0tZHJhcGVyLWhhbGwtb2YtZmxhbWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "US gov't messed up my $250K Bitcoin price prediction: Tim Draper, Hall of Flame - Cointelegraph",
        "content": "Tim Draper is a prominent venture capitalist, the founder of Draper University and the creator of the Meet The Drapers television series. He invested early in Tesla, SpaceX and Coinbase and has 254,000 followers on X.\n\n“Let me get my second prediction to actually happen, and then we’ll move on to other predictions,” Tim Draper tells Hall of Flame, refusing to be drawn on price predictions for XRP and Ethereum.\n\nThis makes sense, given it’s been six years since he forecast that Bitcoin would reach $250,000 by 2022.\n\nOops! I predicted $250k in 2022. My tweet last night was missing a zero. $250k is the number! — Tim Draper (@TimDraper) April 13, 2018\n\nSpoiler alert: It didn’t.\n\nWhich is not to say it won’t happen eventually, as Draper has been pretty far-sighted in the past.\n\nBack in 2014, Draper scooped up around 30,000 Bitcoin for $19 million after the U.S. Marshals took down Silk Road. Fast forward to today, and those Bitcoin have increased 4,165% in value to be worth a whopping $810.5 million.\n\nAround the same time, he made a prediction that Bitcoin would reach $10,000 in three years, and lo and behold, it hit that mark in 2017.\n\nDraper explains that he only dropped the $250,000 prediction because people kept asking after he totally nailed his first Bitcoin price guess.\n\n“The only reason I’ve given the second prediction was that the first one was so good. I had a lot of pressure to put another one out there,” Draper declares.\n\nHe has politely requested a deadline extension on Bitcoin reaching a quarter of a million, with a timeline that would give a university lecturer a heart attack.\n\n“Give me until the end of June next year,” he says.\n\nDraper accuses the U.S. government of messing up his price prediction. He had expected the growth of blockchain to be reminiscent of the internet era, similar to when he made his earlier investments in companies like Hotmail and Skype.\n\nHe emphasizes the significant benefit that the United States reaped by maintaining a hands-off approach to overregulating the internet.\n\n“I expected a much more light touch, the way Bill Clinton was with the internet; they said, hey, we got the internet! We regulated the internet, and Bill Clinton smartly left it alone, and it was fantastic for the whole world.”\n\nI went on a rant. I actually said all these things. US Government is killing the golden goose of Silicon Valley. Regulations smother innovators. #freedom #trust https://t.co/dUk6s8nDcV — Tim Draper (@TimDraper) May 8, 2023\n\nInvesting Alpha\n\nDespite the media coverage, Draper doesn’t spend his days making predictions; in fact, his schedule is quite packed.\n\nAt 65 years old, he remains highly active, renowned as a serial investor who chucked cash early in companies like Tesla, SpaceX, Coinbase, and, well … Theranos.\n\nHe enjoys playing basketball because it energizes him and puts him in an investment mindset.\n\n“When I play basketball, I’m thinking about how I can get the defender to move one way, and then I’ll move another,” he explains.\n\nDraper claims he possesses alpha instincts both on the basketball court and in the investment world.\n\n“I’m very aggressive; if I see something I like, I go right after it,” he says.\n\n“I guess as an investor, I invest like a chess move because I’m always evaluating not just the entrepreneur or the idea. But what happens if it’s successful? how great could it be? What does the world look like then?”\n\nWhat led to Twitter Fame?\n\nDraper started with a very modest Twitter following.\n\n“I think I had one Twitter follower, and it was my mother,” he jokes.\n\nWhile you might assume that one of Draper’s investments or media appearances helped his following to skyrocket, he describes his growth as very natural, attributing it to the content he has been consistently posting over the years, which has kept people coming back for more.\n\nHe is proud of how “truly organic” his following is.\n\n“I think I have the most steady increase of Twitter followers of any influencer,” he declares.\n\nPeople behaving badly! India's government banned Bitcoin, a currency providing great hope for prosperity in a country that desperately needs it. Shame on India leadership. Pathetic and corrupt. #India #bitcoin — Tim Draper (@TimDraper) July 17, 2019\n\nWhat type of content can people expect?\n\nDraper isn’t here to clutter up his followers’ feeds with nonsense.\n\nHe’s all about adding a little sprinkle of value to their lives, and he sticks to only posting about three times a week.\n\n“I tend to post where it’s something I feel like people should see or where one of my startups has done something extraordinary, and I want to promote them,” he explains.\n\nCongratulations to Draper VC startup Otter! https://t.co/JXRXJ4af0O — Tim Draper (@TimDraper) June 29, 2023\n\nWhat content does Tim Draper like?\n\nWithin the 2,400 accounts he follows on Twitter, he relies on a select group of trusted people to keep him informed about the crypto industry.\n\nAmong his trusted crew are Gemini founders Cameron and Tyler Winklevoss, Coinbase CEO Brian Armstrong, Ripple co-founder Chris Larsen and Silicon Valley investors Brad and Bart Stephens.\n\nCongratulations and thank you to Brian Armstrong and his team @coinbase for a very successful Direct IPO. We @drapervc are thrilled to be venture investors in this leading #crypto company as it brings the old world of currency and banking together with the modern world. #Bitcoin — Tim Draper (@TimDraper) April 15, 2021\n\nTim Draper predictions\n\nDraper is backing his 250,000 Bitcoin prediction so hard that if it doesn’t hit, he’ll bow out of predictions altogether.\n\n“If it’s not $250,000 or higher, then don’t listen to me ever again on that kind of prediction,” he laughs.\n\nWhen questioned about the chances of a Bitcoin ETF getting approved, he doesn’t sound hopeful.\n\n“It might have to wait for [Republican candidate] Nikki Haley to be president,” he declares.\n\n“Maybe it’s the cushy relationship they have with banks, maybe it’s the fact that they have uncertainty about it. Maybe a lot of our government is pretty old, maybe they’re just out of touch. But they’re missing something very, very important for the good of society, and I’m hoping they all come around.”"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvY29tbWVudGFyeS8yMDIzLzA5LzI3L3dvcmxkL2FpLWJpdGNvaW4tZW5lcmd5LWNhcmJvbi1mb290cHJpbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin's power-hungry history offers lessons for AI's future - The Japan Times",
        "content": "Surging interest in artificial intelligence systems will add further strain to global electricity grids with the potential to rival the massive energy consumption of bitcoin. Thankfully, the premier cryptocurrency has shown us a way to mitigate the impact.\n\nA doubling of data center revenue at Nvidia last quarter shows that demand for generative applications like ChatGPT hasn’t yet hit its peak. The U.S. chipmaker is the key provider of shovels in this AI goldrush, but those processors are neither cheap nor lean. Its latest flagship, the GH200 Grace Hopper Superchip, which is the size of a postcard, draws up to 1,000 watts — equivalent to a portable heater.\n\nThough most customers will be opting for something less fancy than the Superchip, they do buy processors in bulk to connect together into a massive AI server and that is where the hunger for electricity really kicks in. One study published last year looked at the energy consumption required to train a single large language model used to output text in multiple languages."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMjYvYXJiaXRydW0tdXNlcnMtY2FuLW5vdy10cmFkZS1iaXRjb2luLW1pbmluZy1wb3dlci13aXRoLWVhY2gtb3RoZXIv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wOS8yNi9hcmJpdHJ1bS11c2Vycy1jYW4tbm93LXRyYWRlLWJpdGNvaW4tbWluaW5nLXBvd2VyLXdpdGgtZWFjaC1vdGhlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Arbitrum Users Can Now Trade Bitcoin Mining Power With Each Other - CoinDesk",
        "content": "Some miners, however, may have excess capacity that would otherwise lie vacant. Marketplaces such as Lumerin offer the rights to this power to buyers, who get a chunk of the bitcoin rewards."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWxlZ2FsbHktcmVjb2duaXNlZC1pbi1zaGFuZ2hhaS1wYXZlcy13YXktZm9yLWNyeXB0by1leHBhbnNpb24taW4tY2hpbmEvODg1NzcvMdIBjQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYW1wL2FydGljbGUvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1sZWdhbGx5LXJlY29nbmlzZWQtaW4tc2hhbmdoYWktcGF2ZXMtd2F5LWZvci1jcnlwdG8tZXhwYW5zaW9uLWluLWNoaW5hLzg4NTc3LzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin legally recognised in Shanghai, paves way for crypto expansion in China - Forbes India",
        "content": "\n\n\n\nShanghai has recognised Bitcoin as a unique and non-replicable digital asset. They have acknowledged its scarcity and inherent value. This recognition comes despite China's official stance against crypto. The development was even shared by Tron Network founder Justin Sun on his social media.\n\n\n\nOn September 25, the Chinese court published a report outlining the advancements in internet technology. In the report, they emphasised that with the development of internet technology, digital currencies, particularly Bitcoin, stand out for being unique and non-replicable from other digital assets.\n\nThe report also highlights Bitcoin's distinct characteristics, which include its scarcity and widespread acceptance. It underscores that Bitcoin exhibits essential currency traits like scalability, ease of circulation, storage, and transaction usability. Despite being decentralised and lacking central authority oversight, Bitcoin retains key currency functions, serving as a medium of exchange, store of value, and widely accepted means of payment globally.\n\n\n\n\n\nThe report highlights that Bitcoin can be acquired through mining, inheritance, or buying and selling. This legal perspective strengthens the legitimacy of Bitcoin and other digital currencies within China. It indicates that courts may be more open to recognising crypto as personal property.\n\n\n\n\n\nIn 2021, China imposed a blanket ban on all crypto activities, including Bitcoin mining, and barred foreign exchanges from serving its mainland customers. However, this latest recognition from one of the key courts in China provides a new perspective for the crypto realm in China.\n\n\n\n\n\nSeveral other Chinese courts have recognised Bitcoin and other digital assets as legal properties protected by law. In May 2022, a Shanghai court recognised Bitcoin as a virtual property. In September 2022, a lawyer argued that Chinese law could protect crypto holders in theft or breach cases despite the national crypto ban.\n\n\n\n\n\nThe Chinese Government has taken no official stand with respect to lifting the ban on conducting crypto activities in the country. The recognition of Bitcoin by some Chinese Courts as a unique digital currency gives hope that China could lift the ban on crypto in the future.\n\n\n\n\n\nThe global crypto community has welcomed this news, as it legitimises Bitcoin and sets a precedent for future legal recognition of cryptos in other jurisdictions as well. Cryptocurrencies are slowly gaining acceptance in mainstream finance, reinforcing their legitimacy.\n\n\n\n\n\nThe writer is the founder at yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhvbGRzLXN0ZWFkeS1hcy1zLXAtNTAwLXBsdW5nZXMtdG8tMTEwLWRheS1sb3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price holds steady as S&P 500 plunges to 110-day low - Cointelegraph",
        "content": "On Sept. 20, the United States Federal Reserve delivered a message that reverberated through financial markets: Interest rates are expected to remain at their highest level in over two decades, possibly for longer than most market participants’ expectations. This attitude comes against the backdrop of stubbornly high inflation — with the core inflation rate hovering at 4.2%, well above the central bank’s 2% target — and unemployment at record lows.\n\nAs investors grapple with this new reality, a pressing question arises: Will the S&P 500 and Bitcoin (BTC) continue to underperform in the face of a tighter monetary policy?\n\nThe impact of the Fed’s decision was swift and severe. The S&P 500 plunged to its lowest level in 110 days, signaling growing unease among investors.\n\nS&P 500 index (blue, right) vs. U.S. 10-year Treasury yield (orange, left)\n\nNotably, the 10-year Treasury yield surged to levels not seen since October 2007. This movement reflects the market’s belief that rates will continue to climb or, at the very least, that inflation will eventually catch up with the current 4.55% yield. In either case, anxiety is mounting over the Fed’s ability to sustain these elevated interest rates without destabilizing the economy.\n\nBitcoin does not necessarily follow traditional markets\n\nOne intriguing development amid this financial turbulence is the apparent disconnect between the S&P 500 and cryptocurrencies, particularly Bitcoin. Over the past five months, the 30-day correlation between the two assets presented no clear trend.\n\n30-day rolling correlation: S&P 500 futures vs. Bitcoin/USD. Source: TradingView\n\nSuch divergence suggests that either Bitcoin has anticipated the stock market correction or external factors are at play. One plausible explanation for this decoupling is the hype surrounding the possible introduction of a spot Bitcoin exchange-traded fund and regulatory concerns that have hindered the upside potential of cryptocurrencies. Meanwhile, the S&P 500 has benefited from robust second-quarter earnings reports, though it’s essential to remember that those numbers reflect the situation from three months prior.\n\nAs the Fed holds firm on its commitment to high interest rates, the financial landscape is entering uncharted territory. While some may interpret the central bank’s stance as necessary to combat inflationary pressures, others worry that keeping rates elevated could burden families and businesses, particularly as existing loans come due and must be refinanced at significantly higher rates.\n\nA decoupling could favor Bitcoin price\n\nSeveral factors could lead to cryptocurrencies decoupling from traditional markets such as the S&P 500. If the government encounters difficulties in issuing longer-term debt, it can raise concerns. The failure to issue long-term bonds may indicate fiscal instability, which incentivizes investors to seek hedges against potential economic downturns. In such cases, alternative assets like gold and Bitcoin might become attractive options.\n\nRelated: Will Bitcoin price hold $26K ahead of monthly $3B BTC options expiry?\n\nEven with a strong dollar, inflation can force the U.S. Treasury to raise the debt limit, which leads to currency devaluation over time. This risk remains relevant as investors seek to safeguard their wealth in assets less susceptible to inflation.\n\nFurthermore, the state of the housing market plays a pivotal role. Should the housing market continue to deteriorate, it could negatively impact the broader economy and the S&P 500. The housing market’s interconnectedness with the banking sector and the potential for consumer credit deterioration could trigger a flight to assets with scarcity and hedging capabilities.\n\nThere’s also the potential for political instability, globally or even during the U.S. elections in 2024. This could introduce uncertainty and impact financial markets. In some countries, there is a growing fear of capital controls, and historical instances of international economic embargoes highlight the risk of governments imposing such controls, further driving investors toward cryptocurrencies.\n\nUltimately, unlike traditional stocks and bonds, cryptocurrencies are not tethered to corporate earnings, growth or yield above inflation. Instead, they march to their own drumbeat, influenced by factors like regulatory changes, resilience to attacks and predictable monetary policy. Thus, Bitcoin could vastly outperform the S&P 500 without needing any of the scenarios discussed above.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzI3L2JpdGNvaW5zLWVjby1mcmllbmRseS1ldm9sdXRpb24tYS13aW4td2luLWZvci10aGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin's Eco-Friendly Evolution: A Win-Win for the Environment and Investors - The Motley Fool",
        "content": "There's no denying that the process of mining Bitcoin (BTC -1.19%) consumes a significant amount of energy. If the cryptocurrency were a country, it would consume the 32nd most electricity in the world -- ahead of large countries like Argentina, The Netherlands, and other highly developed nations with populations in the tens of millions.\n\nEnvironmentalists often use statistics like these to portray Bitcoin as a gluttonous and unnecessary nuisance that generates huge amounts of carbon emissions and exacerbates global climate change. Yet these comparisons fail to paint the complete picture of Bitcoin's energy consumption.\n\nLike many industries, Bitcoin mining is working to reduce its carbon footprint, and its miners increasingly utilize renewable energy sources. Based on the current trajectory, Bitcoin has the potential to reach net-zero emissions and eventually even take on a more proactive approach by combating climate change.\n\nBut don't just take my word for it.\n\nBitcoin goes green\n\nIn a recently published report, the Massachusetts Institute of Technology highlighted how new energy strategies among Bitcoin mining companies are turning the narrative of Bitcoin's negative impact on the environment on its head.\n\nThe report describes how Bitcoin miners are constantly searching for the cheapest and most readily available forms of energy to power their machines and minimize their expenses, a dynamic that underpins Bitcoin's evolution toward becoming more environmentally friendly.\n\nThe MIT researchers note that as costs associated with electricity produced from fossil fuels continue to rise, miners have begun shifting toward renewable energy sources such as wind and solar to power their operations, since electricity from those sources is becoming cheaper and more accessible. Today, more than 50% of the Bitcoin mining sector is estimated to run off renewable energy sources.\n\nPutting unused energy to work\n\nArguably, the most interesting topic discussed in MIT's report was Bitcoin's potential role in cleaning up emissions from notorious polluters in the natural gas and oil industries.\n\nDue to a lack of appropriate distribution infrastructure, oil and natural gas companies are frequently forced to burn or \"flare\" off excess natural gas that they are unable to transport from wellheads to markets. While clearly wasteful, this practice also creates an additional problem. The flaring of natural gas also releases methane into the atmosphere -- and methane's impacts as a greenhouse gas are over 80 times more potent than carbon dioxide's in terms of warming effects.\n\nThis previously unused natural gas can be an ideal and cost-effective energy source to power Bitcoin mining operations. The energy producers have come to recognize this, and now companies like ExxonMobil are setting up systems to capture that natural gas at the source and generators to burn it on-site, with the electricity generated powering Bitcoin mining equipment that is also on-site, producing additional revenue.\n\nMIT researchers suggest a similar strategy could be employed at the millions of abandoned and orphaned oil and natural gas wells around America that are still leaking methane into the atmosphere. By constructing operations at these locations, Bitcoin miners could have convenient access to inexpensive energy, reduce greenhouse gas emissions, and even fund well-sealing efforts.\n\nAppealing to institutional investors\n\nSo, Bitcoin is becoming greener and can help climate change by utilizing previously wasted energy. This is obviously beneficial, but how does it help Bitcoin's value appreciate?\n\nWell, the answer lies in a similar report published by KPMG, one of the Big Four international accounting firms. In its analysis, KPMG analysts describe how Bitcoin positively contributes to the three pillars of the increasingly popular ESG investing framework as it heads toward net-zero emissions.\n\nShort for environmental, social, and governance, ESG ratings measure a company's or asset's sustainability and ethical impact. ESG-compliant investment strategies have gained significant traction in recent years, particularly among institutional investors.\n\nIn line with MIT's report, KPMG found that Bitcoin's ability to recycle unused energy and clean up emissions helps it meet the standard of a positively rated ESG asset. Should Bitcoin solidify an ESG-friendly reputation, it could become a more attractive investment option for institutional investors.\n\nClosing thoughts\n\nAlthough the improvements to Bitcoin's carbon footprint and its potential to contribute to climate change mitigation have attracted less coverage than the earlier discussions about its negative environmental impact received, circumstances are slowly changing. With two prominent organizations acknowledging that Bitcoin is no longer as much the electricity-hungry climate detriment it is often portrayed as, the cryptocurrency might be turning over a new leaf.\n\nAs the conversation around Bitcoin's environmental sustainability gains momentum, another barrier hindering widespread adoption will likely begin to dissipate. Most importantly, though, investors stand to benefit as this could lead to more demand for the crypto, resulting in even higher prices."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXRyZWFkLXdhdGVyLXUtMDE0NzQ5MTI4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether tread water; U.S. equities slide with mega-cap tech giants leading the declines - Yahoo Finance",
        "content": "Bitcoin dipped on Wednesday morning in Asia to trade range-bound below US$26,300. Ether edged higher but failed to reclaim the US$1,600 mark. Other top 10 non-stablecoin cryptocurrencies traded mixed in the past 24 hours, with Binance’s BNB token leading the winners. The Open Network’s (TON) Toncoin led the losers. U.S. stock futures were up during early morning trading in Asia after Wall Street recorded losses of over 1% on Tuesday. More key inflation data is expected Thursday as investors look out for signs of a U.S. recession and further interest rate hikes. Mega-cap tech giants including Amazon, Apple and Tesla led the Wall Street declines.\n\nBitcoin ‘firm within September trading range’\n\nBitcoin edged 0.28% lower to US$26,209.51 in the 24 hours to 07:40 a.m. in Hong Kong for a weekly loss of 3.70%, according to CoinMarketCap data. The world’s largest cryptocurrency fell to US$26,090.71 on Tuesday evening. But it managed to stay above the US$26,000 support level maintained for the past 14 days.\n\nWith Bitcoin staying “firm within its September trading range,” blockchain analytics firm K33 Research wrote in an emailed note, “a narrowing trading range accompanied by a slow news cycle has provided traders with few reasons to participate actively in the market.”\n\nThe options pricing of Bitcoin derivatives on the CME market “shows a more positive longer term than short-term outlook but has become slightly more bearish in tandem with BTC’s price decline over the last week,” the K33 report added.\n\nEther was also trading flat. It edged up 0.33% to US$1,592.60 over the past 24 hours but lost 3.10% for the week. The token hit US$1,598.10 on Tuesday evening. But it failed to rise above the US$1,600 level it gave up on Sunday.\n\nWhile Ether is trading near a 14-month low against Bitcoin (0.061 BTC per ETH), that trend could be about to change, K33 report.\n\n“We reiterate our stance that rotating towards ETH is a sound play for the coming months, as futures-based ETFs can turn the trend. The first half of October will be pivotal in that regard, as the final deadlines for the ongoing futures ETH ETFs are coming up in this period,” wrote K33.\n\nStory continues\n\nMost other top 10 non-stablecoin cryptocurrencies booked losses for the past 24 hours. The exceptions were Ether, Binance’s BNB and Tron’s TRX. Toncoin continued to lead the losses. It dropped 1.66% in the past 24 hours to US$2.12 for a weekly decline of 17.75%.\n\nBNB, the native token of cryptocurrency exchange Binance Holdings Ltd, led the winners. The coin gained 1.06% to US$212.17, but it recorded a weekly loss of 2.30%.\n\nBNB’s daily rise coincided with the announcement Tuesday that Binance, the world’s largest crypto exchange, is collaborating with Japan’s largest banking group Mitsubishi UFJ Trust and Banking Corporation to issue fiat-pegged stablecoins in 2024.\n\nThe total crypto market capitalization dipped 0.28% in the past 24 hours to US$1.04 trillion, while trading volume dropped 10.02% to US$22.56 billion.\n\nWall Street losses amid recession fears\n\nImage: Getty Images\n\nU.S. stock futures were trading higher as of 09:40 a.m. in Hong Kong. The S&P 500 futures led the gains with a 0.21% increase. Wall Street closed lower Tuesday with all three major indexes booking losses of over 1%. The Nasdaq Composite led the losers with a 1.57% slide.\n\nMajor Asian stock indexes were mixed on Tuesday morning. China’s Shanghai Composite and Hong Kong’s Hang Seng booked gains, while South Korea’s Kospi and Japan’s Nikkei 225 dipped.\n\nU.S. economic data released Tuesday raised fears of recession. The Consumer Confidence Index tracked by the Conference Board dropped to 103.0 in September, lower than the analysts’ expectation of 105.5.\n\nThe data showed that “consumers continued to be preoccupied with rising prices in general, and for groceries and gasoline in particular,” wrote Dana Peterson, chief economist at The Conference Board.\n\n“Consumers also expressed concerns about the political situation and higher interest rates,” Peterson said.\n\nThe Expectations Index, based on consumers’ short-term outlook for income, business, and labor market conditions, declined to 73.7 in September from 83.3 in August. A reading below 80 signals a recession within the next year, according to the Conference Board.\n\n“Consumers may be hearing more bad news about corporate earnings, while job openings are narrowing, and interest rates continue to rise — making big-ticket items more expensive,” wrote Peterson.\n\nMeanwhile, new single-family home sales in the U.S. fell 8.7% to a seasonally adjusted annual rate of 675,000 in August, lower than the analysts’ projection of 698,000. The tight house supply, elevated prices and historically high mortgage rates contributed to the drop in home sales, according to Bloomberg on Wednesday.\n\nThe Federal Reserve in September kept interest rates unchanged between 5.25% and 5.50%, the highest level since early 2001. But the central bank might need to make another 25-basis-point rate hike by the end of 2023, and keep the rates higher for longer, according to remarks from Fed Chair Jerome Powell last Wednesday.\n\nThe Fed meets on Nov. 1 to make its next decision on interest rates. The CME FedWatch Tool predicts a 82.5% chance of no interest rate hike in November, up from 81.5% on Tuesday. It also gives a 65.8% chance of another pause in December, up from 60.9% on Tuesday\n\nOn the corporation front, the U.S. online retail giant Amazon.com, Inc. was among the worst performers on Tuesday. Its share price closed 4.03% lower. The Federal Trade Commission and 17 states sued Amazon Tuesday, claiming the firm wields illegal monopoly power.\n\nThe share prices of technology giants Apple, Inc. and Tesla, Inc. also dropped 2.34% and 1.16 respectively on Tuesday.\n\nInvestors are now waiting for the U.S. second-quarter personal consumption expenditure price index (PCE) on Thursday, which will provide further insights into inflation.\n\nElsewhere, China’s monthly industrial profits in August surprisingly rose 17.2% from a year earlier, reversing a 6.7% annual decline in July. The industrial profit from January to August fell 11.7% from the same period last year. But the drop decelerated compared to a 15.5% slide in the first seven months of the year.\n\n(Updates with equity section.)"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXhhcy1ob21lLW5lYXJseS0zMC1wZXJjZW50LWJpdGNvaW4taGFzaC1yYXRlLWZvdW5kcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Texas is home to nearly 30% of all Bitcoin hash rate — Foundry - Cointelegraph",
        "content": "The U.S. state of Texas accounts for over 28% of all Bitcoin (BTC) hashing power in the United States, according to the latest Hashrate Map by crypto mining service provider Foundry USA.\n\nThe newly updated map shows Texas with 28.5% of all the country’s Bitcoin hash rate, followed by Georgia claiming 9.64% of the hash rate, New York with 8.75% and New Hampshire accounting for 5.33%. Bitcoin’s hash rate represents how fast a mining machine operates when trying to calculate a valid block hash.\n\nA snapshot of Foundry’s pool in December 2021 shows a different picture. Texas controlled 8.43% of the country’s hash rate at the time, while Georgia had 34.17%. Meanwhile, Kentucky stood at 12.40%, and New York held 9.53%. Compared with 2021, more U.S. states are mining Bitcoin in 2023.\n\nOverall, by July 2023, the Bitcoin global hash rate had reached 400 exahashes per second (EH/s), nearly twice as high as at the end of 2021, when it stood at 174 EH/s, said Foundry.\n\nHash rate map in July 2023. Source: Foundry USA\n\nThe data was pulled between July 21–27, 2023, when Texas faced power curtailment. According to the report, the data captured during curtailments means that the Texas hash rate may be “higher than what’s reported on the map.”\n\nDuring power curtailment, Bitcoin miners lower their production to balance energy supply and demand in the grid. Essentially, it is a way to balance energy consumption during peak times. In Texas, a program grants large energy consumers, such as Bitcoin miners, incentives for being flexible with energy use.\n\nRiot Platforms is one Bitcoin miner participating in Texas’ curtailment program. In August, the company mined fewer Bitcoin than in July but received over $31 million in power credits from the state.\n\nTexas has been evolving as a hub for crypto mining thanks to its cheaper energy and welcoming regulatory framework. According to data from the Energy Information Administration, the state’s electricity prices are below the U.S. average.\n\nAs of January 2023, Texas’ average residential electricity tariff was $0.14 per kilowatt-hour (kWh), an 8.3% discount compared with the national average of $0.15 per kWh. The costs are even lower for large consumers like crypto miners.\n\nThe state became a hotbed for large mining operations following China’s crackdown on crypto mining in 2021.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLTI2ay1tb250aGx5LTMtYmlsbGlvbi1idGMtb3B0aW9ucy1leHBpcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Will Bitcoin price hold $26K ahead of monthly $3B BTC options expiry? - Cointelegraph",
        "content": "The upcoming $3 billion in Bitcoin (BTC) monthly options expiration on Sept. 29 could prove pivotal for the $26,000 support level.\n\nBTC price faces serious headwinds\n\nOn one side, Bitcoin’s recognition in China appears to be strengthening, following a judicial report from a Shanghai Court that acknowledged digital currencies as unique and non-replicable.\n\nConversely, Bitcoin’s spot exchange trading volumes have dwindled to a five-year low, according to on-chain analytics firm CryptoQuant. Analyst Cauê Oliveira pointed out that a significant factor behind this decline in trading activity is the growing fear surrounding the macroeconomic outlook.\n\nDespite the increase in long-term holders, the reduced trading volume poses a risk in terms of unexpected volatility. This means that price swings resulting from liquidations in derivative contracts could potentially cause structural market damage if there aren’t enough active participants.\n\nFurthermore, there is growing unease among traditional financial institutions when it comes to handling crypto-related payments.\n\nJPMorgan Chase, the largest bank in North America, is reportedly prohibiting transfers “related to crypto assets” within its retail division, Chase. The stated rationale is to protect against potential involvement in fraudulent or scam activities.\n\nLastly, Bitcoin holders are feeling apprehensive as the Dollar Strength Index (DXY), a measure of the dollar’s strength against other currencies, reached 106 on Sept. 26, its highest level in 10 months.\n\nHistorically, this index exhibits an inverse correlation with risk-on assets, tending to rise when investors seek safety in cash positions.\n\nBitcoin bulls too optimistic?\n\nThe open interest for the Sep. 29 options expiration currently stands at $3 billion. However, it is expected that the final amount will be lower due to bullish expectations of Bitcoin’s price reaching $27,000 or higher.\n\nThe unsuccessful attempt to break above $27,200 on Sept. 19 may have contributed to overconfidence among Bitcoin investors.\n\nThe 0.58 put-to-call ratio reflects the imbalance between the $1.9 billion in call (buy) open interest and the $1.1 billion in put (sell) options.\n\nHowever, if Bitcoin’s price remains near $26,300 at 8:00 am UTC on Aug. 25, only $120 million worth of the call (buy) options will be available. This difference happens because the right to buy Bitcoin at $27,000 or $28,000 is useless if BTC’s price is below this level on expiry.\n\nBitcoin bears eye sub-$26,000 for max profit potential\n\nBelow are the four likeliest scenarios based on the current price action. The number of options contracts available on Sept. 29 for call (buy) and put (sell) instruments varies depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit.\n\nThis crude estimate disregards more complex investment strategies. For instance, a trader could have sold a call option, effectively gaining negative exposure to Bitcoin above a specific price. Unfortunately, there’s no easy way to estimate this effect.\n\nBetween $25,000 and $26,000: 1,400 calls vs. 19,300 puts. The net result favors the put instruments by $430 million.\n\n1,400 calls vs. 19,300 puts. The net result favors the put instruments by $430 million. Between $26,000 and $27,000: 6,200 calls vs. 12,600 puts. The net result favors the put instruments by $170 million.\n\n6,200 calls vs. 12,600 puts. The net result favors the put instruments by $170 million. Between $27,000 and $27,500: 9,900 calls vs. 10,100 puts. The net result is balanced between call and put options.\n\n9,900 calls vs. 10,100 puts. The net result is balanced between call and put options. Between $27,500 and $28,000: 12,000 calls vs. 8,900 puts. The net result favors the call instruments by $85 million.\n\nIt’s worth noting that for the bulls to level the playing field ahead of the monthly expiration, they need to achieve a 3.2% price increase from $26,200. In contrast, the bears only need a modest 1% correction below $26,000 to gain a $430-million advantage on Sept. 29.\n\nRelated: Crypto bills could be delayed as many prepare for US gov’t shutdown\n\nGiven that Bitcoin traded below the $26,000 support level between Sept. 1 and Sept. 11, it wouldn’t be surprising if this level were breached again as the options expiration approaches. Moreover, investor sentiment is becoming increasingly risk-averse, as evidenced by the S&P 500 dropping to its lowest level since June.\n\nConsequently, unless there is significant news or an event that strongly favors Bitcoin bulls, the likelihood of BTC’s price breaking below $26,000 by Sept. 29 remains high.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWRhbmdlci11cy1kb2xsYXItaW5kZXgtZ29sZGVuLWNyb3Nz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price at risk? US Dollar Index confirms bullish 'golden cross' - Cointelegraph",
        "content": "The Dollar Strength Index (DXY) achieved its highest level in nearly 10 months on Sept. 22, indicating growing confidence in the United States dollar compared to other fiat currencies like the British pound, euro, Japanese yen and Swiss franc.\n\nDXY “golden cross” confirmed\n\nMoreover, investors are concerned that this surge in demand for the U.S. dollar might pose challenges for Bitcoin (BTC) and cryptocurrencies, although these concerns are not necessarily interconnected.\n\nU.S. Dollar Index (DXY). Source: TradingView\n\nThe DXY confirmed a golden cross pattern when the 50-day moving average surpassed the longer 200-day moving average, a signal often seen as a precursor to a bull market by technical analysts.\n\nImpacts of the recession and inflation risks\n\nDespite some investors believing that historical trends are determined solely by price patterns, it’s important to note that in September, the U.S. dollar exhibited strength, even in the face of concerns about inflation and economic growth in the world’s largest economy.\n\nMarket expectations for U.S. gross domestic product growth in 2024 hover at 1.3%, which is lower than the 2.4% average rate over the preceding four years. This slowdown is attributed to factors such as tighter monetary policy, rising interest rates and diminishing fiscal stimulus.\n\nHowever, not every increase in the DXY reflects heightened confidence in the economic policies of the U.S. Federal Reserve. For example, if investors opt to sell U.S. Treasurys and hold onto cash, it suggests a looming recession or a significant uptick in inflation as the most likely scenarios.\n\nWhen the current inflation rate is 3.7% and on an upward trajectory, there’s little incentive to secure a 4.4% yield, prompting investors to demand a 4.62% annual return on five-year U.S. Treasurys as of Sept. 19, marking the highest level in 12 years.\n\nU.S. 5-year Treasury yield. Source: TradingView\n\nThis data unequivocally demonstrates that investors are avoiding government bonds in favor of the security of cash positions. This may seem counterintuitive initially, but it aligns with the strategy of waiting for a more favorable entry point.\n\nInvestors anticipate that the Fed will continue raising interest rates, allowing them to capture higher yields in the future.\n\nIf investors lack confidence in the Fed’s ability to curb inflation without causing significant economic harm, a direct link between a stronger DXY and reduced demand for Bitcoin may not exist. On one hand, there is indeed a decreased appetite for risk-on assets, evident from the S&P 500’s negative performance of 4.3% in September. However, investors recognize that hoarding cash, even in money market funds, does not ensure stable purchasing power.\n\nMore money in circulation is positive for Bitcoin’s price\n\nAs the government continues to raise the debt ceiling, investors face dilution, rendering nominal returns less significant due to the increased money supply. This explains why scarce assets, such as Bitcoin, and some leading tech companies may perform well even during an economic slowdown.\n\nRelated: How much is Bitcoin worth today?\n\nIf the S&P 500 continues its downtrend, then investors might exit risk markets regardless of their scarcity or growth potential, at least initially. In such an environment, Bitcoin could indeed face negative performance.\n\nHowever, it’s important to note that this analysis overlooks the fact that the same pressures from inflation and recession will likely increase the money supply, either through additional Treasury debt issuance or the Feds bond purchases in exchange for U.S. dollars.\n\nEither way, increased liquidity in the markets tends to favor Bitcoin since investors may seek refuge in alternative assets to protect against “stagflation” — a situation marked by stagnant economic growth alongside rampant inflation.\n\nTherefore, the DXY golden cross may not necessarily be a net negative for Bitcoin, particularly on longer timeframes.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA5LzI3L2JpdGNvaW4tbWluZXItbWFyYXRob24tcmVwb3J0ZWRseS1taW5lcy1pbnZhbGlkLWJ0Yy1ibG9jay_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wOS8yNy9iaXRjb2luLW1pbmVyLW1hcmF0aG9uLXJlcG9ydGVkbHktbWluZXMtaW52YWxpZC1idGMtYmxvY2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Marathon Confirms Mining Invalid BTC Block Due to a Bug - CoinDesk",
        "content": "The miner confirmed the mining of the invalid block on social media platform X (formerly Twitter), citing a bug during an experiment. \"We utilize a small portion of our hash rate to experiment with our development pool and research potential methods to optimize our operations,\" Marathon said. \"The error was the result of an unanticipated bug that came from one of our experiments,\" the company added."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV4Y2hhbmdlLXZvbHVtZS01LXllYXItbG93cy1mZWQtYnRjLWhvZGxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin exchange volume tracks 5-year lows as Fed inspires BTC hodling - Cointelegraph",
        "content": "Bitcoin (BTC) exchanges have seen trading volume collapse as traders deal with constant macroeconomic uncertainty.\n\nAccording to new research from on-chain analytics platform CryptoQuant published on Sept. 25, daily BTC volumes are at lows rarely seen since 2018.\n\nFed keeps Bitcoin investors wary of “possible recession”\n\nBitcoin price action has stayed in a familiar range for several months, and as time goes by, interest in transacting appears to be fading.\n\nCryptoQuant data, which tracks activity on both spot and derivatives exchanges, highlights the extent to which volumes have decreased since BTC/USD entered its current range in March.\n\nThe past week saw between 8,000 and 15,000 daily spot exchange transactions — a fraction of the standard March daily tally, which exceeded 600,000.\n\nFor contributing analyst Caue Oliveira, a principal force behind the phenomenon is the macroeconomic climate.\n\n“One of the main reasons cited is the growing fear regarding the macroeconomic scenario,” he wrote in part of the commentary accompanying the data.\n\n“The actions of the United States Central Bank perpetuate a constant feeling of uncertainty, leaving investors waiting for a possible recession.”\n\nOliveira referenced current economic policy in the U.S., where the Federal Reserve has flitted between interest rate hikes and pauses in 2023 while keeping overall conditions tight.\n\nContinuing, he noted that Bitcoin hodlers have chosen to keep hold of BTC capital as a result.\n\n“Instead of seeking quick profits through short-term trading, more and more people are viewing bitcoin and other cryptocurrencies as a long-term investment,” he concluded.\n\n“They are more interested in holding their coins, believing in their future value, than selling at the first sign of profit.”\n\nBitcoin: Trading Volume (Spot vs. Derivative) chart. Source: CryptoQuant\n\nLittle food for BTC price bulls\n\nAs Cointelegraph reported, times have become tough for Bitcoin speculators in recent weeks.\n\nRelated: Bitcoin price fights for $26K as US dollar strength hits 10-month high\n\nShort-term holders — entities holding BTC for 155 days at most — now hold almost their funds at an unrealized loss, with their cost basis higher than the current spot price.\n\nIn further research this week, fellow CryptoQuant contributor Yonsei_dent concluded that the cost basis of various Bitcoin newcomers would act as “strong resistance.”\n\n“Excluding investors who have been holding for the long term since 1.5 years (12m) + HODLers, investors who entered the market over the past year are believed to have a stronger tendency to buy and sell in the short term,” he warned.\n\nAn accompanying chart showed unspent translation output (UTXO) numbers split by age band, forming resistance and support levels.\n\nBitcoin UTXO age bands annotated chart (screenshot). Source: CryptoQuant\n\nExternal interest in BTC exposure, meanwhile, also remains distinctly absent. Google Trends data shows the lowest interest in “Bitcoin” as a search term since October 2020.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvbWluZWNyYWZ0LWJhbnMtYml0Y29pbi1wbGF5LWVhcm4taXBob25lLTE1LWNyeXB0by1nYW1pbmctZm9ybXVsYWUtcHJldmlldy13ZWIzLWdhbWVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Minecraft bans Bitcoin P2E, iPhone 15 & crypto gaming, Formula E: Web3 Gamer - Cointelegraph",
        "content": "Pull your sats out of Minecraft now\n\nBack in our July edition, we announced Satlantis, an independent Minecraft server run by the game’s fans, enabled players to earn Bitcoin by completing in-game quests using play-to-earn functionalities. We noted Minecraft developer Mojang’s previous NFT ban and concluded, “Time will show how this integration fairs against the ban.”\n\nTime has shown, as Microsoft subsidiary Mojang has asked Satlantis to remove the play-to-earn features, according to a Discord post by server founder David Dineno. The server accepted the request and removed the feature two days after the Discord post.\n\nThe Satlantis founder stood behind the play-to-earn model and expressed his annoyance with the situation, stating:\n\n“The Game That Shares its Profits with Players’ works. And it works well. All of the time, money, and energy that we put into this game together will not be forsaken by a few dinosaurs at some conglomerate.”\n\nDespite the setback, the Satlantis community can take solace in the fact that the team is actively exploring alternative platforms that “encourage innovation instead of stifling it.”\n\nThe community of Satlantis backed their platform and shared their disappointment in Mojang (and Microsoft, indirectly) through social media platforms:\n\n@Microsoft Since yesterday I hate Microsoft for not allowing play to earn on the minecraft server satlantis. This was the first time small money making was fun in a way that wasn't exploitative.\n\nI love the very helpful satlantis community. The best ones out there! @PlaySatlantis — 2Maique (@2Maique) September 24, 2023\n\nDineno advised players to withdraw their satoshi, emphasizing they will be diligently processed. Satlantis developers pledged to honor all in-game assets, including sats, prize pools, ASICs, players’ premium battle pass status and all other transferable data. The Minecraft server will remain operational, albeit without its play-to-earn features, as the team aims for a seamless transition to the next gaming frontier.\n\nHow can blockchain build upon eSports?\n\nBlockchain-based online gaming hub Ultra co-CEO and co-founder Nicolas Gilot says that eSports are struggling to generate profits, and a change of direction is needed.\n\n“In my view, it can create a better, more sustainable product for viewers and sponsors by broadening participation beyond the elite level,” he told Web3 Gamer.\n\nWeb3 gaming arguably needs a solid eSports foundation to reach the mainstream audience.\n\nThe Ultra team recently attended the major gaming conference Gamescom, where Gilot reports that interest from game developers and publishers, eSports organizations and investors was high as the video game industry seeks new ways to stay afloat during challenging times.\n\nBlockchain can act as the glue that binds all parties together, Gilot says. Without it, smaller teams, events and sponsorships won’t be as viable.\n\nSmart contracts can remove much of the admin burden, distribute prizes and earnings, and give confidence to publishers, brands and influencers to get involved at all levels.”\n\nUltra’s eSports hub, Ultra Arena, is designed to help more gamers attract sponsors earlier and move up the ranks as they grow and improve, Gilot noted. “The Ultra blockchain also helps by building a player persona across all areas — not just competitive gaming but how they buy games and digital collectibles and interact with others in-game.”\n\nWeb3 Gamer: Mainstream eSports has shiny stages and massive marketing budgets. There are commentators, pre-game shows, and physical places and streams for the fans to watch the games live. How do you compete?\n\nGilot: We don’t want to! We want to see players who level up through Ultra Arena take the stage at those massive LAN events, which will be a proud moment for all of us.\n\nWhat we do want is to feed into those experiences, helping grow the existing scene by opening it up to many more players, brands and publishers. For teams and brands, Ultra Arena will nurture more esports fans and provide more ways to activate fans pre and post-event with the help of blockchain technology. This could be unlocking access to an exclusive in-game digital collectible through attending the event itself or sponsor-branded skin being airdropped to you for watching on Twitch. Extending fan engagement will ultimately add value for all key stakeholders and support the journey to sustainable profitability.\n\nWeb 3 Gamer: Is there enough traction and interest on Web3 for a competitive stage that can make mainstream players willing to spend money?\n\nFor us, it’s not about how to make esports out of Web3 games, it’s more about how Web3 technology can be used to improve the existing esports model. It’s the game, not the tech, that should be front and center.\n\nThe current eSports model is probably overly reliant on sponsorship and advertising. To improve it, there needs to be a focus on cross-industry value creation, directly involving publishers, brands, esports teams and competitive players. Within Ultra Arena, we want to drive mutual growth by opening up the existing model to many more stakeholders, with grassroots competitive players turning pro, smaller brands gaining traction and startup teams becoming massive eSports powerhouses.\n\nApple iPhone 15: What does it offer for Web3 gaming?\n\nWhen technology companies run out of innovation juice, the first instinct is to hop on the gaming train. Apple made no exception when it unveiled the brand-new iPhone 15 and iPhone 15 Pro. The devices are pretty much the same as their 14th-generation counterparts, with an A17 Pro chip, the usual camera enhancements and a coat of new paint … but there is one significant difference.\n\nApple iPhone 15 Pro will be available with four new color options. (Apple)\n\nThe iPhone 15 Pro can run demanding game titles such as Resident Evil 4 (2023), Resident Evil Village, Death Stranding and the soon-to-come Assassin’s Creed Mirage natively, meaning the games run directly on the device’s system without any external layers.\n\nThe new pro model features hardware-accelerated ray tracing, which enables games to present dynamic lighting effects. Thanks to Apple’s scaling solution MetalFX, the iPhone 15 Pro can offer better graphics with little performance loss.\n\nThe new smartphone, which will act as a handheld gaming device, will be able to display games on 4K monitors through upscaling and support third-party gamepads such as PlayStation’s DualSense controller, which is already being sold at Apple Stores. The possibilities are endless with the addition of Apple’s upcoming VR headset.\n\nAll in all, it’s clear that the newly introduced Apple iPhone 15 Pro line will become a gaming powerhouse more than anything. The real question is how Web3 game developers can benefit from such advantages.\n\nDevelopers can utilize the mighty system of the device to make mobile games with better graphics and more comprehensive gameplay. Web3 games on PC will also be easier to port over as features and graphics won’t have to be excised for better performance on mobile platforms.\n\nHardware is one thing, but economics is another. Currently, Apple has stringent rules for NFT apps that practically force users to go through in-app purchases subject to Apple’s 30% commission, while apps are not permitted to support crypto payments.\n\nIt’ll be interesting to see what Web3 gaming companies come up with on the new monster iPhone. The tools are there for developers to leverage; let’s hope they fully utilize them to give us great Web3 experiences.\n\nOh, I nearly forgot the most revolutionary addition: The models come with USB-C.\n\nFormula’s second swing in Web3\n\nFormula’s first attempt at Web3 gaming didn’t work out as F1 Delta Time, a pioneering racing game and one of the first licensed titles utilizing NFTs and crypto technology, ceased operations in March 2022. After warming up in the formation lap with its first Web3 game, Formula is ready to return to the blockchain circuits with Formula E: High Voltage.\n\nFormula E: High Voltage promotional artwork. (Formula E: High Voltage)\n\nDeveloped by Animoca Brands, the new Formula game focuses on Formula E, a motorsport championship with fully electric-powered race cars, instead of Formula 1’s models. Players are put in the shoes of a team principal responsible for their Formula E team’s strategic decisions and management with the ambition to become champions.\n\nVarious factors will determine your team’s performance, such as racetrack distance, difficulty, weather and temperature. Official Formula E racetracks in Berlin, New York, Rome, London, Jakarta, Seoul, Cape Town and Diriyah will be included, with more to be added later.\n\nRace cars and drivers are available as nonfungible tokens, with each driver possessing distinctive abilities from a pool of over 200 unique skills.\n\n🏁🎮⚡️EARLY ACCESS IS NOW OPEN!⚡️🎮🏁\n\n\n\nGo to https://t.co/HoSlvc0xSP to create your account and register below! 400,000 pool of @REVV_Token available for winners! 👀\n\n\n\n📢REGISTER HERE: https://t.co/hIWA3lHi1T\n\n\n\nNew wallets added every 24 H – 10AM UTC! (registration closes 9AM UTC) pic.twitter.com/eFlA2LfufG — Formula E: High Voltage (@FormulaE_HV) September 19, 2023\n\nFormula E: High Voltage is available on early access until Oct. 2. Will Formula E: High Voltage take pole position among Web3 racing games? We’ll have to wait and see.\n\nGods Unchained Launches New Mode\n\nThe free-to-play Web3 trading card game Gods Unchained has launched a new permanent game mode called Sealed Mode, where players will build a deck from a randomized pool of cards to triumph over each other. The idea is similar to that of FIFA Ultimate Team’s Draft mode.\n\n⚜️ 𝗦𝗘𝗔𝗟𝗘𝗗 𝗠𝗢𝗗𝗘 𝗜𝗦 𝗟𝗜𝗩𝗘! ⚜️\n\n\n\nDiscover a brand-new way to play Gods Unchained! ✨\n\n\n\n🎴 Build your best deck from a random card pool\n\n⚔️ Compete in a challenging gauntlet run\n\n🏆 Win exclusive Sealed Mode rewards!\n\n\n\n🎮 Play Sealed Mode Now: https://t.co/oEkOFXw6vn pic.twitter.com/lUz5ktbyE0 — Gods Unchained (@GodsUnchained) September 14, 2023\n\nCommon card games are played with two players who have their own decks of cards that represent creatures and spells. Players take turns to strategically deploy their cards using resources. In order to win, players must reduce their opponent’s health to zero while protecting their own.\n\nSealed Mode begins as players pick one of the three Gods that represent the players, just like Heroes from Hearthstone. Once players pick their Gods, they receive a randomized pool of 60 cards. The goal is to craft a deck with at least 30 cards from these 60 while trying to combine cards that work well together to defeat other players.\n\nPlayers are given a pool of randomized cards in Sealed Mode. (Gods Unchained)\n\nOnce players finalize their decks, they take on other players in a series of games until they win seven times or lose three times. Winning more games earns players better rewards, like cards and cool cosmetic items. The rewards get better the more they win.\n\nSealed Mode rewards players when they win. (Gods Unchained)\n\nThe card collection in Sealed Mode includes cards from past Gods Unchained sets, including Welcome, Core, Genesis, Etherbots, Mortal Judgement, Winter Wanderlands and Band of the Wolf. Players who wish to play Sealed Mode are required to pay a fee of 15 GODS tokens, worth roughly $2.5.\n\nMore from Web3 gaming space:\n\n– PUBG developer Krafton introduces its upcoming metaverse project Overdare, previously known as Project Migaloo.\n\n— Leaked internal documents from May 2022 show that Microsoft’s Xbox roadmap included support for crypto wallets.\n\n– South Korean gaming conglomerate NHN Corporation ventures into the Web3 space in a partnership with Mysten Labs’ Layer 1 blockchain, Sui.\n\n– Proof of Play, an NFT gaming studio founded by the co-creators of FarmVille, completes a seed funding round with $33 million in investment.\n\n– Free-to-play battle royale game My Pet Hooligan launches in early access on the Epic Games Store.\n\n– My Pet Hooligan developer AMGI Studios signs a 12-month deal with Amazon Prime Gaming.\n\n– Star Atlas launches browser-based gaming metaverse SAGE Labs.\n\n– Aavegotchi announces its Gotchi-themed game center."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sYXdtYWtlcnMtY2FsbC1zZWMtY2hhaXItYXBwcm92ZS1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "US lawmakers call on SEC chair to approve spot Bitcoin ETFs 'immediately' - Cointelegraph",
        "content": "Four members of the United States Congress are requesting Securities and Exchange Commission Chair Gary Gensler “immediately” approve the listing of spot Bitcoin (BTC) exchange-traded funds, or ETFs.\n\nIn a Sept. 26 letter to Gensler, U.S. Representatives Mike Flood, Wiley Nickel, Tom Emmer and Ritchie Torres claimed the SEC was “discriminat[ing] against spot bitcoin exchange traded products,” citing the legal precedent set by Grayscale Investments in winning a review of its own ETF offering. The four lawmakers told Gensler there was “no reason to continue to deny” spot crypto ETF applications following the Grayscale court decision, which ruled the SEC’s reasoning was “arbitrary and capricious” in having already approved investment vehicles tied to Bitcoin futures.\n\n“A regulated spot bitcoin ETP would provide increased protection for investors by making access to bitcoin safer and more transparent,” said the letter. “Congress has a duty to ensure the SEC approves investment products that meet the requirements set out by Congress.”\n\nThe lawmakers added:\n\n“We urge you to approve the listing of spot-bitcoin ETPs immediately.”\n\nBipartisan letter from @USRepMikeFlood @RepWileyNickel @GOPMajorityWhip and @RitchieTorres to SEC Chair Gensler on not approving a bitcoin spot ETF: “there is no reason to continue to deny such applications under inconsistent and discriminatory standards.” https://t.co/6x5XaUsUqT — Ron Hammond (@RonwHammond) September 26, 2023\n\nRelated: Grayscale wins the court battle, but what does this mean for a spot Bitcoin ETF?\n\nThe request came ahead of Gensler’s scheduled appearance before the House Financial Services Committee on oversight of the SEC. All four lawmakers are members of the committee and could address the matter in the Sept. 27 hearing. The proceeding will likely not be affected by the looming threat of a government shutdown, with lawmakers unable to reach an agreement on spending as of the time of publication.\n\nTo date, the SEC has not approved the listing of any spot BTC ETF. Many had expected the commission to reconsider pending ETF applications following the SEC’s loss to Grayscale in court in August. However, the regulator subsequently delayed decisions on ETFs from seven major firms — BlackRock, WisdomTree, Invesco Galaxy, Valkyrie, Bitwise, VanEck and Fidelity.\n\nMagazine: SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLWhhdmUtbm90LWRpc3BsYWNlZC1tb25leS10cmFuc2ZlcnMtYmxvY2tzcGFjZS1nbGFzc25vZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals haven't wrestled blockspace from money TXs: Glassnode - Cointelegraph",
        "content": "Despite concerns that Bitcoin Ordinals are clogging the network, there is little evidence to suggest inscriptions are taking blockspace away from higher-value Bitcoin (BTC) monetary transfers.\n\n“There is minimal evidence that inscriptions are displacing monetary transfers,” on-chain analytics firm Glassnode explained its Sept. 25 “The Week On-chain” report.\n\nThe firm explained that this is likely because inscription users tend to set low fee rates, expressing a willingness to wait longer periods of time for confirmation.\n\n“Inscriptions appear to be buying and consuming the cheapest available blockspace, and are readily displaced by more urgent monetary transfers.”\n\nBitcoin Ordinals were introduced in February 2023 and have since accounted for the lion’s share of network activity when it comes to daily transaction count.\n\nHowever, this hasn’t necessarily been reflected in its share of mining fees, with inscriptions only attributing to about 20% of Bitcoin transaction fees, Glassnode noted.\n\nInscription fee share between images, text, audio, video and other data types on Bitcoin. Source: Glassnode\n\nMore inscriptions means more revenue — but there’s a catch\n\nWhile inscriptions have strengthened the base-load demand for blockspace and increased fees for miners, Glassnode says Bitcoin’s hash rate has also increased 50% since February.\n\nThis has resulted in tougher competition for miners looking to swoop in on revenue fees, says Glassnode:\n\n“With extreme miner competition in play, and the halving event looming, it is likely that miners are on the edge of income stress, with their profitability to be tested unless BTC prices increase in the near term.”\n\nBitcoin is currently priced at $26,216, but many industry pundits expect some degree of price appreciation in the lead-up to Bitcoin’s halving event scheduled for April 2024.\n\nRelated: Bitcoin Ordinals creator Casey Rodarmor pitches BRC-20 alternative ‘Runes’\n\nCurrently, most inscriptions come as a result of BRC-20 tokens, which were introduced one month after Casey Rodarmor launched the Ordinals protocol on Bitcoin in February.\n\nOn Sept. 25, Rodarmor pitched “Runes” as a potential alternative to BRC-20s, suggesting that an unspent transaction output-based fungible token protocol wouldn’t leave as many “junk” unspent transaction outputs on the Bitcoin network.\n\nMagazine: Blockchain games aren’t really decentralized… but that’s about to change"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9kb3VibGUtZGlnaXQtYnJlYWtvdXQtYml0Y29pbi1wcmljZS_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvZG91YmxlLWRpZ2l0LWJyZWFrb3V0LWJpdGNvaW4tcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Crypto Analyst Predicts Huge Double-Digit Breakout For Bitcoin Price - NewsBTC",
        "content": "The Bitcoin price has been trading sideways for a while now but this will not always be the case. While there is a chance that the price could end up swinging downward and crashing, a crypto analyst has predicted that a surge in the cryptocurrency’s price is on the horizon.\n\nBitcoin Price Breakout Is Coming\n\nA crypto analyst who has grown to prominence on the TradingView site has put forward a bullish prediction for the Bitcoin price. The analyst who goes by the pseudonym Tolberti mapped out a yellow trend line which he believes points toward the next bull rally for the coin.\n\nThe trend line sits just above the $26,000 level which means that the cryptocurrency is currently close to it. The analyst explains that the BTC price remains bullish despite recent performance, especially as the month of October draws close.\n\nUsing the Fibonacci retracement which sat at 0.618, Tolberti points out the next significant resistance for Bitcoin. From here, he puts it at $29,167, which after beating, the analyst expects the Bitcoin price to surge above $30,000. A surge of this magnitude would mean that the Bitcoin price rises at least 15% from its current level.\n\nTolberti's chart outlining the forecast | Source: Tradingview.com\n\nHowever, it is not all easy sailing from here as the bears will not give up the fight easily. Speaking about the yellow trend line, the analyst said it is “a gateway to the ultra-huge bull market. Once it breaks, I expect a massive uptrend.” But he cautioned traders to “be aware of a possible retest first. Your stop-loss needs to be safe!”\n\nHow High Can BTC Price Go?\n\nTolberti’s bullish profile for the Bitcoin price also runs through to the long term. Just like a lot of other analysts, Tolberti expects the cryptocurrency to trade in the six digits in the next bull market. For his long-term prediction, he puts Bitcoin at a price of $125,000. According to a previous analyst, he believes that the Bitcoin price will reach this level sometime in the second quarter of 2025.\n\nInterestingly, Bitcoin is not the only cryptocurrency the analyst is bullish on. Altcoins were not left out of the post with the likes of Ethereum (ETH), Dogecoin (DOGE), and XRP making an appearance as other bullish tokens.\n\nGiven this forecast, Tolberti believes that the current price of Bitcoin is a good price for investors to buy. “26k is still a good price for Bitcoin to buy in the long term because I expect 120k in 2025,” the post read.\n\nBitcoin is currently showing strength because it continues to hold above $26,000 after the SEC delayed the 21Shares Spot Bitcoin ETF decision. It is currently trending at $26,275, although it’s down 3% in the last week.\n\nBTC price shows strength above $26,000 | Source: BTCUSD on Tradingview.com\n\nFeatured image from Breet, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA5LzI3L2Nhbi1iaXRjb2luLWpvaW4tdHJpbGxpb24tZG9sbGFyLWNsdWItaW4tNS15ZWFycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Can Bitcoin Join the Trillion-Dollar Club in 5 Years? - The Motley Fool",
        "content": "Bitcoin's (BTC -1.30%) undoubtedly one of the best financial assets to have owned in the past decade, as its price has shot up about 20,000% since September 2013. That translates to a ridiculous compound annual growth rate (CAGR) of 70%, which trounces what investors in the stock market would have been able to achieve.\n\nBut what does the future hold? Can the world's most valuable cryptocurrency join the trillion-dollar club in the next five years? Here are some reasons why I believe Bitcoin's market cap essentially doubling by 2028 is a very real possibility.\n\nAttracting institutional capital\n\nWhat's unique about Bitcoin is that its early adoption was solely by individuals, primarily by computer scientists who were intrigued by this new internet money. Only in the past few years has it started to draw greater interest from institutions.\n\nNowadays, there are even publicly traded mining companies, a huge step of progress from Bitcoin's start when even a regular laptop could process transactions to the network. Governments own Bitcoin, and so do major corporations.\n\nThe latest news that has caught investors' attention is the potential approval of Bitcoin spot exchange-traded funds (ETFs). Applications have been filed by well-known asset managers, like BlackRock and Fidelity, among others, that would boost the accessibility and convenience of gaining exposure to the digital asset. If ETFs come to market, they would certainly help support the idea that Bitcoin is a legitimate financial asset.\n\nNeeding regulatory clarity\n\nGary Gensler, chair of the Securities and Exchange Commission, has previously stated that he views every other crypto besides Bitcoin as a security, which requires a ton of regulatory oversight. By labeling Bitcoin as a commodity, the argument can be made that its creation and existence hasn't violated any laws, mainly because there's evidence that it isn't controlled by a single entity.\n\nThere has been increased interest in finding ways to better regulate the industry, especially after the high-profile blowup of FTX and others last year. Perhaps this is still a key reason that some investors remain on the sidelines.\n\nShould those spot ETFs get approved, and a clearer regulatory framework come about, the risk of owning Bitcoin will definitely be reduced.\n\nMore likely than not\n\nFor Bitcoin's market cap to double in the next five years, its price would need to rise at a roughly 15% CAGR. Based on the cryptocurrency's past performance, this is an extremely conservative outlook, but it is still a forecast that will most likely outperform the stock market.\n\nI think there's a greater than 50% chance that Bitcoin will reach the trillion-dollar club by 2028. The arguments I've outlined above are two of the most important developments that I believe will work in Bitcoin's favor in the near term. Investors should pay attention to any updates in this regard.\n\nAdditionally, I have confidence that Bitcoin isn't going anywhere. It has been around for almost 14 years and has never been hacked. The Lindy effect says that the life expectancy of a new technology increases with every passing year that it remains relevant. The longer Bitcoin stays around, the less likely it is to cease to exist.\n\nBitcoin also has the greatest brand recognition in the world of cryptocurrencies. Plus, there is an exhaustive list of financial services and products that are built to support its adoption. This bodes well for its future.\n\nNonetheless, there's a lot of uncertainty surrounding this outlook, so investors should size their positions according to how much risk they are willing to accept. As part of a well-diversified portfolio, a 1% stake in Bitcoin makes perfect sense. Should the asset continue its long-term trend of skyrocketing in value, it can have a meaningful effect on one's portfolio. On the flip side, if Bitcoin becomes irrelevant and its price declines, losing a 1% position won't be a big deal.\n\nIt's also critical to accept that there will continue to be a lot of volatility. Bitcoin has experienced multiple drawdowns of greater than 50% throughout its history, something that likely won't change going forward."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnN1cmFuY2UtY29tcGFueS1hbmNob3J3YXRjaC1yYWlzZXMtJTI0My1taWxsaW9uLXRvLWJyaW5nLW11bHRpc2lnLW1haW5zdHJlYW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Insurance Company AnchorWatch Raises $3 Million to Bring Multisig Mainstream - Nasdaq",
        "content": "AnchorWatch, a leading insurer specializing in safeguarding Bitcoin holdings for commercial entities, announced a successful $3 million funding round today. The round was led by Ten31, with notable participation from Axiom BTC, Bitcoin Magazine Fund, Timechain, Bitcoin Opportunity Fund, and other investors. The infusion of capital will empower AnchorWatch to fulfill regulatory requirements and capital needs, paving the way for the launch of its Trident Vault software and the sale of insurance policies tailored for Bitcoin holders.\n\nAnchorWatch's Trident Vault software represents an another innovative solution for Bitcoin custody, combining protocol-native custody with high-quality, regulated insurance coverage. This addresses a critical gap in the Bitcoin market, providing greater confidence and security to BTC owners.\n\nTrident Vault is a Bitcoin vault designed exclusively for commercial use. It streamlines remote team workflows, introduces key holder seniority, and features time-locked spending conditions, thereby enhancing compliance and governance on-chain.\n\n“Bitcoin owners are still faced with the binary choice between self-custody and third-party sole custodians,” said Robert Hamilton, cofounder and CEO of AnchorWatch. “In the case of the latter, high-risk trading strategies, or worse, blatant fraudulent activities have resulted in catastrophic losses for customers. Thus, they are hesitant to rely on the commercial key holder to deliver the services promised. AnchorWatch makes owning and holding the bearer asset practical, safe, easy, secure, and verifiable.”\n\nAnchorWatch achieves collaborative custody through two key mechanisms. Firstly, Trident Vault facilitates assisted custody by holding a minority of keys and implementing protocol-level governance and compliance. This method enhances security by dispersing custody across different physical locations and unrelated entities, mitigating risks from events like fires, floods, and theft by internal or external actors.\n\nSecondly, AnchorWatch embeds regulated property insurance directly into Trident Vaults. This insurance ensures that assets are protected in the event of catastrophic incidents through regulated and collateralized property insurance. Thanks to Trident's advanced security, AnchorWatch can provide this insurance at competitive rates.\n\nJonathan Kirkwood, Managing Partner at Ten31, highlighted the significance of AnchorWatch's approach: “AnchorWatch is building both the technical infrastructure to advance bitcoin’s potential as programmable money and the credentialed legal/financial infrastructure for bitcoin to be held by commercial institutions via its insurance offerings. This is a pivotal step that directly aligns with our mission at Ten31 to establish bitcoin as a viable asset for institutions, and investing in the companies at the forefront of innovating in the ecosystem.”\n\nAnchorWatch caters to a diverse range of clients, including family trusts, funds, pensions, family offices, Bitcoin miners, and mining pools. The Trident Vault is especially valuable for estate and inheritance planning purposes, serving estate attorneys, investment advisors, and technical advisors who oversee multiple clients' Bitcoin custody needs.\n\nAnchorWatch's commitment to advancing Bitcoin custody and insurance solutions positions them at the forefront of the Bitcoin industry, ready to provide much-needed security and peace of mind for Bitcoin holders.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhhbHZpbmdzLWJ0Yy1wcmljZS1yYWxsaWVzLXVzLXRyZWFzdXJpZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Do Bitcoin halvings spark BTC price rallies, or is it US Treasurys? - Cointelegraph",
        "content": "The relationship between Bitcoin’s price and U.S. Treasury yields has long been considered a strong indicator due to historical data and the underlying rationale.\n\nBitcoin halvings vs. 10-year Treasury yields\n\nIn essence, when investors turn to government-issued bonds for safety, assets like Bitcoin (BTC), which are considered risk-on, tend to perform poorly.\n\nA noteworthy chart shared by TXMC on X (formerly known as Twitter) makes the argument that Bitcoin halvings have coincided with “relative local lows” in the 10-year Treasury yield. Despite the questionable use of the term “relative,” which doesn’t precisely match a three-month low, it’s still worth examining the macroeconomic trends surrounding past halvings.\n\n#BTC halvings have coincidentally arrived at local lows in treasury yields each of the first 3 times. After these moments, risk assets rose broadly while growth expectations also improved.\n\n\n\nThus a myopic Bitcoin narrative about supply shocks was born. But it was always macro. pic.twitter.com/KGQ4TMeKWC — (@TXMCtrades) September 18, 2023\n\nFirst and foremost, it’s important to emphasize that the author asserts that the correlation should not be taken as a “direct causal link between yields and BTC price.” Furthermore, TMXC argues that over 92% of Bitcoin’s supply has already been issued, suggesting that daily issuance is unlikely to be the factor “propping up the asset’s price.”\n\nCould the 10-year yield chart be useful vs. Bitcoin?\n\nFirst, it’s essential to recognize that human perception is naturally inclined to spot correlations and trends, whether real or imaginary.\n\nFor instance, during Bitcoin’s first halving, the 10-year yield had been steadily rising for four months, making it challenging to label that date as a pivotal moment for the metric.\n\nU.S. government bonds 10-year yield, 2012. Source: TradingView\n\nOne might give some benefit of the doubt since, in fact, leading up to Nov. 28, 2012, yields dipped below 1.60%, a level not seen in the previous three months. Essentially, after the first Bitcoin halving, fixed-income investors chose to reverse the trend by selling off Treasurys, thereby pushing yields higher.\n\nHowever, the most intriguing aspect emerges around Bitcoin’s third halving in May 2020, in terms of the “relative” bottom of yields. Yields plunged below 0.8% approximately 45 days before the event and remained at that level for more than four months.\n\nU.S. government bonds 10-year yield, 2020. Source: TradingView\n\nIt’s challenging to argue that the 10-year yield hit its lowest point near the third halving, especially when Bitcoin’s price only gained 20% in the ensuing four months. By comparison, the second halving in July 2016 was followed by a mere 10% gain over four months.\n\nConsequently, attempting to attribute Bitcoin’s bull run to a specific event with an undefined end date lacks statistical merit.\n\nRelated: Bitcoin price at risk? US Dollar Index confirms bullish ‘golden cross’\n\nTherefore, even if one concedes the idea of “relative” local lows on the 10-year yield chart, there’s no compelling evidence that Bitcoin’s halving date directly impacted its price, at least in the subsequent four months.\n\nWhile these findings don’t align with TMXC’s hypothesis, they raise an interesting question about the macroeconomic factors at play during actual Bitcoin price rallies.\n\nNo Bitcoin rally is the same, regardless of the halving\n\nBetween Oct. 5, 2020 and Jan. 5, 2021, Bitcoin saw a remarkable 247% increase in its value. This rally occurred five months after the halving, prompting us to question what notable events surrounded that period.\n\nFor instance, during that time, the Russell 2000 Small-Capitalization index outperformed S&P 500 companies by a significant margin, with a 14.5% difference in performance.\n\nRussell 2000 small-cap index relative to the S&P 500 (blue, right) vs. Bitcoin/USD (orange, left). Source: TradingView\n\nThis data suggests that investors were seeking higher-risk profiles, given that the median market capitalization of Russell 2000 companies stood at $1.25 billion, significantly lower than the S&P 500's $77.2 billion.\n\nConsequently, whatever drove this movement, it appears to have been associated with a momentum toward riskier assets rather than any trends in Treasury yields four months prior.\n\nIn conclusion, charts can be misleading when analyzing extended time periods. Linking Bitcoin’s rally to a solitary event lacks statistical rigor when the upswing generally initiates three or four months after the said event.\n\nThis underscores the need for a more nuanced understanding of the cryptocurrency market, one that acknowledges the multifaceted factors influencing Bitcoin’s price dynamics rather than relying solely on simplistic correlations or isolated data points.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLTMway1vY3RvYmVyLWFuYWx5c3QtYnRjLWNsaW1ic9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price to $30K in October, says analyst as BTC price climbs 2% - Cointelegraph",
        "content": "Bitcoin (BTC) broke higher into the Sept. 27 Wall Street open as one analyst predicted a return to $30,000 in October.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price reaches for $27,000 in fresh uptick\n\nData from Cointelegraph Markets Pro and TradingView followed BTC price action as bulls gathered steam to reach $26,823 on Bitstamp.\n\nThe 2% jump to near-weekly highs came as market commentators already eyed thin overhead resistance, with a breakout on the cards should it not be replenished.\n\n“Ask liquidity is pretty wide and thin here again so likely a move higher is going to come from perps,” popular trader Skew explained, continuing the topic.\n\nSkew added that “this can create some good opportunities with inefficiencies & potential premiums later.”\n\n$BTC Binance Spot / Binance Perp\n\nPretty clear predatory move in the making pic.twitter.com/qJI2WFvizx — Skew Δ (@52kskew) September 27, 2023\n\nOn-chain monitoring resource Material Indicators revealed an uptick in activity from one specific class of whales well known for its impact on BTC price action (PA).\n\nMaterial Indicators further noted that the move above $26,500 had invalidated a warning signal that came on the back of a daily chart “death cross” at the start of the week.\n\n“Purple buys dips and sells rips. I’m happy to swim in their wake,” co-founder Keith Alan confirmed.\n\n#FireCharts integrates a CVD chart binned by order class which shows that historically, the Purple Class of Whales with order sizes in the $100k - $1M range have had the most influence over #Bitcoin PA. pic.twitter.com/gWPefQya05 — Material Indicators (@MI_Algos) September 27, 2023\n\n“There we go, Bitcoin is up and breaks above crucial areas,” analyst Michaël van de Poppe told X subscribers in part of the day’s coverage.\n\n“I’d prefer to see $26,500 and, if we do, we’re likely to see $30,000 in October.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/X\n\nCrypto traders dodge mass liquidations\n\nData from monitoring resource CoinGlass meanwhile confirmed that short liquidations remained modest.\n\nRelated: Bitcoin exchange volume tracks 5-year lows as Fed inspires BTC hodling\n\nAround $13 million in BTC shorts had been liquidated for the day at the time of writing, with the cross-crypto tally at $39 million.\n\nCrypto liquidations chart (screenshot). Source: CoinGlass\n\nBTC/USD traded at around $26,700 at the time of writing, as volatility remained.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtcHVzaGVzLWRlYWRsaW5lLWFyay0yMXNoYXJlcy1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "SEC pushes deadline for ARK 21Shares spot Bitcoin ETF to January - Cointelegraph",
        "content": "The United States Securities and Exchange Commission (SEC) is taking the maximum time allowed for the regulator to reach a decision on a spot Bitcoin (BTC) exchange-traded fund, or ETF, offering from ARK 21Shares.\n\nIn a Sept. 26 notice, the SEC said it would designate a longer period on whether to approve or disapprove of a proposed rule change that would allow ARK 21Shares’ spot BTC ETF on the Cboe BZX Exchange. The commission’s previous delay on Aug. 11 gave the regulator until Nov. 11 to decide whether to approve, disapprove, or again defer a decision.\n\n“The Commission finds that it is appropriate to designate a longer period within which to issue an order approving or disapproving the proposed rule change so that it has sufficient time to consider the proposed rule change [...] and the issues raised therein,” said the SEC.\n\nThe delay came the same day the SEC deferred a decision on the Bitcoin ETF offering from fund manager GlobalX. It’s unclear why the commission chose to designate longer periods to determine the fate of the spot Bitcoin ETF applications weeks ahead of their next deadlines in October and November — the regulator has usually waited until a few days before any deadline to file a delay.\n\nWith the additional 60 days to consider ARK 21Shares’ offering, the SEC’s final deadline for ARK 21Shares will be Jan. 10 — 240 days after the initial application was filed. The next deadline for GlobalX’s ETF will fall on Nov. 21.\n\nUPDATE: Wow. The SEC just came out SUPER early and delayed the @ARKInvest / @21Shares #Bitcoin ETF filing. This thing wasn't due for a decision until Nov 11.\n\n\n\nAlso delaying the @GlobalXETFs application which was due Oct 7. pic.twitter.com/7DiBq1h4Ef — James Seyffart (@JSeyff) September 26, 2023\n\nThe filing followed a letter from a group of four U.S. Representatives calling for SEC chair Gary Gensler to “immediately” approve a spot Bitcoin ETF. The lawmakers claimed the SEC was practicing “inconsistent and discriminatory standards” in approving ETFs linked to crypto futures but not spot investment vehicles.\n\nRelated: Following SEC delays, ARK Invest and 21Shares file for spot Ether ETF\n\nTo date, the SEC has not approved any spot BTC ETF for listing on a U.S.-based exchange. Many industry experts had speculated the commission would reconsider pending ETF applications following the SEC’s loss to Grayscale in court in August.\n\nAt the time of publication, the next deadlines for spot crypto ETF applications from 7 major firms — BlackRock, WisdomTree, Invesco Galaxy, Valkyrie, Bitwise, VanEck and Fidelity — are scheduled for October. The SEC can delay or extend these deadlines until March.\n\nMagazine: SEC delays BTC ETF decision, Grayscale triumphs over SEC and BitBoy gets the boot: Hodler’s Digest, Aug. 27 – Sept. 2"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMivwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjctc2VwdGVtYmVyLTIwMjMvYXJ0aWNsZXNob3cvMTAzOTgzMjUzLmNtc9IBwwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjctc2VwdGVtYmVyLTIwMjMvYW1wX2FydGljbGVzaG93LzEwMzk4MzI1My5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $26,200; Toncoin, Polygon fall up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe major cryptocurrencies were trading in the red on Wednesday amid worries about the impact of higher-for-longer interest rates. The global cryptocurrency market cap was trading at around $1.05 trillion, falling 0.25% in the last 24 hours.Bitcoin was down 0.25% at $26,229 as of 11:55 a.m., while Ethereum was flat at $1,590.\"The crypto market remained flat during the last 24 hours as traders await the Fed chief’s speech on Thursday, which will give us a clear picture of future rate hikes,\" said Shivam Thakral, CEO of BuyUcoin.Meanwhile, Edul Patel, Co-Founder & CEO of Mudrex, said, \"Bitcoin’s price has consolidated above the $26100 level. This could be because of the US 10-year Treasury yield moving up to 4.55%, matching its highest level in about 16 years.\"Barring BNB and Tron, all major crypto tokens were trading lower on Wednesday. Toncoin , Solana and Polygon fell up to 3%. Meanwhile, Litecoin , Polkadot, and Dogecoin declined by 1-2%.The total volume in DeFi is currently $2.25 billion, 11.4% of the total crypto market 24-hour volume. The volume of all stablecoins is now $19.04 billion, which is 96.46% of the total crypto market 24-hour volume.Bitcoin's dominance is currently 48.95%, according to CoinMarketCap. Meanwhile, BTC volume in the last 24 hours stood at approximately $7.29 billion, falling 30.35% in the last 24 hours.Notably, this Friday, a substantial number of BTC and ETH options contracts are set to expire on Deribit, with 117,000 BTC options and 1.1 million ETH options reaching their expiration. This event has the potential to increase volatility in the prices of these cryptocurrencies, said CoinDCX Research Team.Bitcoin's recent price action has been characterized by sideways trading, falling below the key support level of $26,500. This trend suggests a possible downside, potentially breaking the important $26,000 barrier.Despite numerous attempts, the primary cryptocurrency struggled to clear the $27,500 resistance, leading to a remarkable pullback. Bitcoin's downward trajectory pushed it below the vital $27,000 and $26,500 support levels, signalling bearish sentiment.While it briefly dipped below the key $26,200 level and is nearing $26,000, it recently stabilized around $26,026, showing some signs of easing losses. Currently, Bitcoin faces resistance at $26,350 and $26,500, with the potential to rise if it breaks above $26,700, or fall to $25,400 or even $25,000 if it doesn't."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iZXlvbmQtZmluYW5jZS1hbmQtYml0Y29pbi1ob3ctYmxvY2tjaGFpbi1pcy1kaXNydXB0aW5nLXNlY3VyZS1tZXNzYWdpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Beyond finance and Bitcoin: How blockchain is disrupting secure messaging - Cointelegraph",
        "content": "In the evolving landscape of decentralized messaging apps, Session stands out as a frontrunner, offering a robust, open-source and fully decentralized platform that puts security first and gives back data control to users.\n\nBlockchain is, by default, associated with financial applications and profit-making opportunities, with Bitcoin (BTC) being its first use case and decentralized finance (DeFi) representing its most promising trend.\n\nHowever, the technology is industry-agnostic and can transform any data-driven market where privacy and security are core elements.\n\nThe financial sector has already embraced the potential of blockchain technology, with influential global institutions such as the International Monetary Fund and the Bank for International Settlements regularly discussing it. However, there is another sector in need of increased security and decentralization — communication.\n\nThe most popular messaging apps, including WhatsApp, Telegram, Signal and Threema, use centralized servers, which leaves them vulnerable to security challenges like hacking attacks. This can affect the millions of users sharing their data with these apps. For example, in 2021, Facebook (now Meta) experienced a personal data leak that affected a whopping 500 million users, who saw their details shared online.\n\nWhile these centralized messaging apps apply advanced encryption methods, their centralized architecture is a security issue. Users have to trust these entities in the first place — sharing one’s name, phone number and even their bank account details with an unknown entity doesn’t come naturally to the modern individual without an element of trust.\n\nDecentralized messaging apps can bring more utility to the crypto world\n\nBuilding a decentralized messaging infrastructure can ensure greater privacy and security for end users and give them more control over their information while providing blockchain technology a considerable new market to demonstrate its potential to regular people. Acquiring new users beyond the tech-savvy crypto community is still a big task for blockchain, and communication is the most relevant market where this should happen.\n\nPreviously, explaining the benefits of decentralized, peer-to-peer (P2P) communication was more difficult, as most people would opt for a good user experience in any case. Today, decentralized messaging apps can leverage a large user base of cryptocurrency users who understand the power of censorship-resistant architecture very well. Eventually, regular people may use these messaging apps and join the Web3 space without necessarily hunting for profits or having to buy tokens.\n\nHow this decentralized messaging app offers privacy and security on layer 1\n\nSeveral decentralized messaging apps are addressing the persistent challenges of their centralized counterparts. The most popular of them is Session, an open-source, completely decentralized and end-to-end encrypted messaging app.\n\nSession has been running on the Oxen Service Node Network, a proprietary layer-1 network that comprises more than 1,700 community nodes dispersed worldwide. This infrastructure offers a private messaging experience for people who want to communicate freely without the fear of censorship or surveillance. The app, which currently boasts more than 800,000 monthly active users, is free to use and doesn’t require a phone number or email address to register.\n\nSource: Session\n\nAnother privacy-focused application that utilizes cryptocurrency to provide users with a better experience than competing apps is Brave Browser, which uses BAT (Basic Attention Token) to allow users to be paid directly by advertisers for their attention. Today, they have nearly 60 million users, and Session is well underway to become the Brave Browser of messaging apps.\n\nBy integrating crypto seamlessly into the app's infrastructure, it is able to provide security features that would not be possible without decentralization, and which centralized apps struggle to compete with. Likewise, users can easily avoid interacting with the token that powers the app if they choose to, meaning that the potential market for the product is not limited to crypto users only.\n\nThese sorts of applications can unlock the true potential of Web3. The key to mass adoption is that users don’t need to know how it works — it just works.\n\nSource: Protonmail\n\nChris McCabe, CEO of Session, said:\n\n“Session is a rare gem in the decentralized app space. It’s not just about blockchain. It’s about building an easy-to-use and functional platform. By putting the user first and letting crypto do the hard work behind the scenes, Session has carved out a niche that resonates with the real world.”\n\nThe door to mass adoption\n\nSession has been able to establish a strong reputation and uniquely large user base while running on a layer 1 chain. The next step on the road to mass adoption will allow it to fully take advantage of the power of Web3.\n\nThe app is in the process of transitioning from the layer-1 Oxen chain to an EVM-compatible chain, and the OXEN coin will become Session Token: a new ERC-20 token that will run on a layer 2 chain and be compatible with most Web3 applications. Session Token (SENT) will have a totally upgraded tokenomic structure that is designed to drive growth and enable scalability for Session and its network.\n\nEVM-compatible layer 2 networks such as Arbitrum, Optimism and Polygon bring more opportunities for Web3 integrations, easier access to liquidity and decentralized exchanges, as well as a familiar onboarding process. This is a major change that will resolve many of the challenges that have previously affected Sessions’ crypto layer.\n\nAdditionally, the use cases of the Session tokens will extend beyond just a means of exchange within the app to potentially support in-app purchases, governance, premium features or bridging communications with other DApps.\n\nIn essence, Session’s move to EVM compatibility is not only a technological advancement but a significant step that has the potential to revolutionize the crypto communication market and redefine the landscape of decentralized and more secure messaging.\n\nLearn more about Session"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY2FuLWJpdGNvaW4tb3ZlcnRha2Utb3RoZXItbWVhbnMtb2YtcGF5bWVudHMtaW4tMjAyNC_SAWhodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L2Nhbi1iaXRjb2luLW92ZXJ0YWtlLW90aGVyLW1lYW5zLW9mLXBheW1lbnRzLWluLTIwMjQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Can Bitcoin Overtake Other Means of Payments in 2024? - Finance Magnates",
        "content": "As the world of cryptocurrency continues to expand, Bitcoin remains the most well-known and extensively used digital currency. It has established itself as a valuable store of value and a potential inflation hedge. However, many fans and investors are wondering whether Bitcoin can transition from being solely a store of wealth to a mainstream form of payment in 2024 and beyond.\n\nThe Evolution of Bitcoin: From Digital Gold to Digital Cash\n\nSatoshi Nakamoto, the enigmatic developer of Bitcoin, envisioned it as a peer-to-peer electronic payment system. It has undergone considerable changes over the years, with many now perceiving it as digital gold or a long-term store of value rather than a medium of exchange for everyday transactions.\n\nThe limits of Bitcoin's blockchain technology contributed to the shift from a digital currency system to a digital gold narrative. Because of scalability concerns and transaction fees, the Bitcoin network was less viable for modest, everyday transactions when compared to speedier and cheaper alternatives such as credit cards or digital wallets.\n\nSolutions for Layer 2 and Scalability\n\nThe rise of layer 2 solutions is one of the primary advances targeted at tackling Bitcoin's scalability difficulties. These are alternative protocols or networks developed on top of the Bitcoin blockchain, with the goal of enabling faster and more cost-effective transactions.\n\nThe Lightning Network is the most well-known example of a layer 2 Bitcoin solution. Off-chain transactions are possible, allowing users to conduct microtransactions and peer-to-peer payments with cheap costs and near-instant settlement. While still in its early phases, the Lightning Network shows promise in terms of boosting Bitcoin's utility as a payment method.\n\nAdoption by Institutions and Merchant Acceptance\n\nBitcoin's trajectory to becoming a mainstream payment method is inextricably linked to its acceptance by institutions and retailers. Some well-known organizations and financial institutions have begun to accept Bitcoin in recent years. Bitcoin has been incorporated to the balance books of major firms such as Tesla and Square, indicating the cryptocurrency's rising acceptance.\n\nFurthermore, some payment processors and fintech firms have integrated Bitcoin into their platforms, allowing users to seamlessly purchase, sell, and spend Bitcoin. The extent to which Bitcoin is accepted by mainstream merchants, on the other hand, remains a key element. Adoption by stores and enterprises would greatly improve its usability as a payment mechanism.\n\nConsiderations for Regulation\n\nThe regulatory climate has a significant impact on Bitcoin's presence in the payments sector. Governments and regulatory organizations throughout the world are actively monitoring cryptocurrencies, and their attitude to regulation may have an impact on Bitcoin's adoption as a payment method.\n\nClear and supportive legislation can instill trust and stability in businesses and consumers, encouraging increasing use of Bitcoin for payment. Stringent or ambiguous laws, on the other hand, may stifle its growth as a payment method, since firms may be hesitant to accept it due to compliance issues.\n\nPayment Methods That Compete\n\nOther digital payment mechanisms, such as stablecoins, central bank digital currencies (CBDCs), and developing cryptocurrencies, compete with Bitcoin. Stablecoins, such as USDC and USDT, provide price stability, making them more suitable for routine transactions.\n\nCBDCs, or digital representations of a country's fiat currency issued by its central bank, compete with Bitcoin as well. These digital currencies seek to combine the advantages of blockchain technology with the security of traditional fiat currencies.\n\nConsumer Attitudes and Trust\n\nConsumer behavior and trust are important elements influencing Bitcoin payment adoption. Bitcoin remains a somewhat confusing and volatile asset for many people. Price fluctuation, in particular, can prevent people from using Bitcoin for regular transactions because they are concerned about the currency's purchasing power.\n\nTo obtain widespread acceptability, Bitcoin must first establish customer confidence, ensuring that people are comfortable using it for both large and small transactions. The importance of education and user-friendly interfaces in attaining this goal cannot be overstated.\n\nDecentralized Finance's (DeFi) Role\n\nOne of the most notable advances in the blockchain space has been decentralized finance, or DeFi. On blockchain networks, DeFi platforms strive to imitate traditional financial services such as lending, borrowing, and trading. These services frequently accept cryptocurrency as payment and collateral.\n\nBitcoin's integration into the DeFi ecosystem could influence its evolution as a payment method. Projects that connect Bitcoin to DeFi platforms or allow it to be used as collateral for decentralized loans could broaden Bitcoin's utility beyond that of a store of value.\n\nExternal Events and Timing\n\nTiming and external events will also have an impact on Bitcoin's route to becoming a widespread payment method in 2024 or later. Economic crises, currency depreciation, or advancements in blockchain technology could hasten or slow its adoption.\n\nFor example, if a big economic crisis occurs, Bitcoin's appeal as a hedge against inflation and a means of transferring wealth across borders may increase, potentially leading to more widespread payment use.\n\nThe Rise of Stablecoins, the Threat to Visa, and the Uncharted Path of Digital Payments\n\nThe rise of dollar-pegged cryptocurrencies poses a significant challenge to industry giants like Visa, underscoring the immense potential in the digital payment sphere. Surprisingly, this trend has yet to be fully reflected in the stock market.\n\nStablecoins, with Tether as the largest representative, are typically tethered one-to-one to the U.S. dollar. They serve as the foundation of the cryptocurrency economy, often backed by cash or short-term Treasuries. Historically, these tokens have provided substantial liquidity to crypto trading and acted as a gateway for dollars into the digital assets realm. Now, their role in facilitating payments is on the rise.\n\nIn 2022, stablecoins facilitated transactions exceeding $11 trillion on the blockchain, surpassing PayPal's processing volumes and nearing Visa's transaction value of $11.6 trillion, according to a report by macro hedge fund Brevan Howard. More than 25 million blockchain wallets hold over $1 in stablecoin, with 80% of these wallets containing $100 or less. To put this into perspective, a bank with 25 million accounts would rank as the fifth-largest in the United States.\n\nThe surge in stablecoin usage highlights a lucrative opportunity for expansion in the payment sector. The issuer of Tether, for instance, is poised to generate nearly $6 billion in profit this year—surpassing BlackRock's earnings—thanks to its straightforward strategy of earning interest on the deposits backing its token.\n\nCoinbase, $COIN, is acquiring a minority stake in Circle Internet Financial. — unusual_whales (@unusual_whales) August 21, 2023\n\nCrypto brokerage Coinbase Global also made a notable move by acquiring a minority stake in Circle Internet Financial, issuer of the USD Coin, the second-largest stablecoin.\n\nHowever, the predominant challenge for stablecoins and companies looking to capitalize on their popularity remains regulation, or the lack thereof. U.S. lawmakers and regulators have scrutinized stablecoins early on, but progress toward regulatory clarity has been sluggish, with a potential resolution years away. This regulatory uncertainty is likely to continue dampening investor interest in the sector.\n\nFinal Thoughts on Bitcoin's Future\n\nWhile Bitcoin has made great progress in becoming a recognized asset and store of value, it is still a long way from becoming a widespread form of payment. Layer 2 solutions, institutional adoption, favorable legislation, and competition from alternative payment systems are all important factors in influencing its future.\n\nBitcoin's capacity to address scalability challenges, create consumer trust, and achieve wider acceptance by merchants and institutions will determine if it can surpass traditional forms of payment in 2024. The ability of the cryptocurrency to adapt to shifting market conditions and customer tastes may eventually determine its progression from digital gold to digital cash.\n\nBitcoin's place in the payments environment will undoubtedly be a source of curiosity and debate among enthusiasts, investors, and industry players as the cryptocurrency field evolves."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLXJlY292ZXJ5LTI2ay_SAURodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvYml0Y29pbi1wcmljZS1yZWNvdmVyeS0yNmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Price Could See Recovery If It Holds This Key Support - NewsBTC",
        "content": "Bitcoin price is consolidating above the $26,000 support. BTC could start a recovery wave if it clears the $26,500 resistance zone in the near term.\n\nBitcoin is still consolidating above the $26,000 support zone.\n\nThe price is trading below $26,400 and the 100 hourly Simple moving average.\n\nThere is a major bearish trend line forming with resistance near $26,300 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could start a decent recovery wave unless there is a clear move below $26,000.\n\nBitcoin Price Eyes Recovery\n\nBitcoin price remained stable above the $26,000 support zone. BTC seems to be forming a short-term support base above the $26,000 level and is currently consolidating.\n\nRecently, the price made a recovery wave attempt above the $26,200 level. However, the bears remained active below the $26,500 level. They rejected the 50% Fib retracement level of the downward move from the $26,712 swing high to the $26,026 low.\n\nBitcoin is now trading below $26,400 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $26,300 level. There is also a major bearish trend line forming with resistance near $26,300 on the hourly chart of the BTC/USD pair.\n\nThe next key resistance could be near the $26,350 level or the 100 hourly Simple moving average, above which the price could revisit the $26,500 resistance or the 76.4% Fib retracement level of the downward move from the $26,712 swing high to the $26,026 low.\n\nSource: BTCUSD on TradingView.com\n\nTo start a recovery wave, the price must settle above $26,500. In the stated case, the price could climb toward the $27,000 resistance. Any more gains might call for a move toward the $27,500 level.\n\nMore Losses In BTC?\n\nIf Bitcoin fails to start a fresh increase above the $26,300 resistance, it could continue to move down. Immediate support on the downside is near the $26,050 level.\n\nThe next major support is near the $26,000 level. A downside break and close below the $26,000 level might start another major decline. The next support sits at $25,400. Any more losses might call for a test of $25,000.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level.\n\nMajor Support Levels – $26,050, followed by $26,000.\n\nMajor Resistance Levels – $26,300, $26,500, and $27,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9hbmFseXN0LXVuY292ZXJzLWJsYWNrcm9jay1sb25nLWludGVyZXN0LWluLWJpdGNvaW4tbWluaW5nLWRldGFpbHMv0gFsaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYml0Y29pbi1uZXdzL2FuYWx5c3QtdW5jb3ZlcnMtYmxhY2tyb2NrLWxvbmctaW50ZXJlc3QtaW4tYml0Y29pbi1taW5pbmctZGV0YWlscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Sep 2023 07:00:00 GMT",
        "title": "Analyst Uncovers BlackRock Long Interest In Bitcoin Mining – Details - NewsBTC",
        "content": "Based on a recent report by Bloomberg analyst Jamie Coutts, asset managers’ interest in Bitcoin stretches beyond exchange-traded funds (ETF) into the mining sector. In particular, Coutts speaks about BlackRock, describing the asset manager’s application with the US Securities and Exchange Commission (SEC) to offer a Bitcoin spot ETF as “unsurprising.”\n\nThe analyst stated that BlackRock and other prominent global asset managers, namely Vanguard and State Street, have been involved in the Bitcoin mining industry for over three years.\n\nIn hindsight, #BlackRock's massive #Bitcoin spot ETF play shouldn't have been that surprising. Along with other behemoths (Vanguard, StateStreet) who espouse #ESG-driven investing principles, they started scooping up public mining stock back in 2020 ESG, Institutionalization🧵 pic.twitter.com/VcKX8TrgZ2 — Jamie Coutts CMT (@Jamie1Coutts) September 26, 2023\n\nBlackRock And Other ESG-Driven Companies Investing In Bitcoin Mining, Analyst Says\n\nJames Coutts stated that BlackRock began its venture into Bitcoin mining in 2020 by investing in Marathon Digital, the second-largest publicly traded mining company.\n\nNotably, this development occurred when the Bitcoin mining industry faced high criticism, likely due to the substantial reliance on fossil fuels.\n\nOver the last three years, Coutts reports that BlackRock, Vanguard, and State Street have increased their respective investments in Bitcoin mining companies, regardless of the market cycle.\n\nInterestingly, all three asset managers are known to promote Environmental, Social, and Governance (ESG) investment principles, part of which is limiting fossil fuel use. However, it appears that investing in Bitcoin mining may not damage the ESG credentials of these companies.\n\nAccording to a report by Daniel Batten, co-founder of CH4 Capital, James Coutt notes that Bitcoin mining currently derives 50% of its energy from sustainable sources. And this percentage is likely to increase as Bitcoin mining has the unique ability to monetize stranded energy and stabilize energy grids.\n\nPotential Effect Of Bitcoin Mining Institutionalization\n\nBased on James Coutts’s report, BlackRock and the two other asset managers in the discussion are currently the top investors in the three largest publicly traded mining companies, namely Marathon Digital, Riot Platforms, and Cleanspark.\n\nTogether, these mining companies collectively own 8.9% of the global hash rate, which is significant as public miners only account for 15% of the global hash power.\n\nSource: Bloomberg Intelligence\n\nFor now, James Coutts believes that the involvement of these asset managers in Bitcoin mining poses little challenge to the network’s decentralization.\n\nHowever, the analyst notes that there may be a future clash of network and ESG values, especially given the activist tendencies of BlackRock, Vanguard, and State Street.\n\nHowever, this would not prevent the Bitcoin network from operating as expected. But it may lead other miners whose operations still rely on fossil fuels to start processing “censored transactions.”\n\nAt the time of writing, Bitcoin trades at $26,198.48, with a 0.57% gain in the last month, according to data from Tradingview.\n\nBTC trading at $26,198.48 on the hourly chart | Source: BTCUSDT chart on Tradingview.com\n\nFeatured image from The New Yorker, chart from Tradingview\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vdGltZXNvZm1hbHRhLmNvbS9hcnRpY2xlL3Byb3MtY29ucy11c2luZy1iaXRjb2luLW9ubGluZS1nYW1ibGluZy1hMi4xMDU3NTIy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Pros and cons of using Bitcoin in online gambling - Times of Malta",
        "content": "This last decade has seen us witness a huge surge in the popularity of cryptocurrencies, with Bitcoin (BTC) in particular emerging as the most popular form of crypto. Numerous businesses in the online space, including plenty of online casinos, are now letting their players to make transactions with Bitcoin.\n\nA lot of good crypto gambling sites now offer the numerous advantages over traditional gambling that BTC offers, including added privacy and faster transactions. However, as with most things, using cryptocurrencies for online gambling does come with a few limitations.\n\nThis article is an attempt to take an in-depth look at the pros and cons of gambling with Bitcoin to provide a comprehensive understanding of the many benefits and undeniable limitations of this relatively new type of currency.\n\nCrypto gambling pros\n\nEnhanced privacy\n\nAccording to a report issued by experts from a leading antivirus and online safety company, 71% of adults globally have taken measures that will help them improve their online privacy. What this tells us is that online privacy is becoming increasingly important for consumers.\n\nMost of the time, this is centred around employing VPNs and privacy settings on their devices, others have gone further in order to secure their transactions by utilising cryptocurrencies such as Bitcoin to make transactions.\n\nWhenever you want to make a traditional banking transaction, numerous organisations, ranging from your credit or debit card company to third-party payment processors and, of course, the gambling sites themselves, require access to your sensitive data. BTC, on the other hand, offers an unparalleled level of anonymity.\n\nWhile you may have to submit some of your private information when purchasing crypto with your credit or debit card, every other transaction that you make with Bitcoin, including depositing and withdrawing money from an online casino, will stay completely anonymous.\n\nLower transaction costs\n\nFiat currency transactions regularly pass through numerous institutions before they reach your cryptocurrency casino. And, because everyone wants a cut, this regularly culminates in higher transaction costs.\n\nCryptocurrency transactions on the other hand work through the blockchain, enabling transactions from your BTC wallet straight to your online casino with Bitcoin. Because of this, there are much lower transaction costs for both you and the online casino. Online Bitcoin casinos regularly pass on the savings to their players through bonuses and other good offers.\n\nSecurity and the prevention of fraud\n\nBitcoin transactions are extremely secure thanks to the decentralised nature of the blockchain technology. So long as you keep your cryptocurrency wallet keys totally private, there is no possible way that anyone can access your funds.\n\nCrypto casinos also benefit from the reduced risk of chargebacks, fraud and any other payment related issues, which gives players and the online casino the peace of mind.\n\nCrypto gambling cons\n\nHigh volatility\n\nThe ever changing value of crypto can be subject to substantial fluctuations. While BTC’s heightened volatility can often lead to bigger profits in the case of a market upturn, this can also work against you on occasions. For example, if you buy crypto at a higher value before withdrawing any winnings at a lower value, you will have actually made a financial loss.\n\nRequires learning\n\nAnother factor you need to consider is that working with crypto requires users to be at least basically tech-savvy in order to use Bitcoin effectively. Unlike old fashioned fiat currencies, Bitcoin is a little bit more complex and requires some learning before you can appreciate how it works exactly.\n\nUncertain regulation\n\nThe regulatory uncertainty around BTC is concerning. Different nations seemingly pass new regulations every other day, which makes it difficult to keep up to date with BTC’s progress. In fact, there are some countries that have gone as far as to ban it altogether. Failure to observe these set regulations can leave both players using crypto and online casinos liable to legal action.\n\nConclusion\n\nDespite its popularity and general acceptance in the world of online gambling, Bitcoin does come with a couple of drawbacks. However, apart from the legal technicalities, opting to use crypto for online gambling ultimately depends on your personal preferences, especially when it concerns your privacy and financial security which BTC excels at.\n\nDisclaimer: Play responsibly. Players must be over 18. For help visit https://www.gamcare.org.uk/"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1wcmljZS1wcmVkaWN0aW9uLWZvci1oYWxsb3dlZW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price prediction for Halloween 2023 - Finbold - Finance in Bold",
        "content": "With the quickly approaching Halloween, an interesting belief has arisen among cryptocurrency traders during this time of the year when it comes to Bitcoin (BTC), and chart patterns and machine learning (ML) algorithms indicate that there could be some truth behind this view.\n\nAs it happens, the price of Bitcoin on each Halloween, with the exception of 2018 and 2022, was higher than the year before, and if the ML algorithms, patterns, and other indicators are correct, this year should be no different, according to the latest data on September 26.\n\nSpecifically, the self-learning machine algorithm on the cryptocurrency market tracking platform CoinCodex has suggested that the flagship decentralized finance (DeFi) asset would grow its price by 9.56% by Halloween and trade at $28,703 on October 31, 2023.\n\nBitcoin 3-month price prediction. Source: CoinCodex\n\nIndeed, the phenomenon known as ‘Uptober’ has demonstrated its strength even during 2022, when the entire cryptocurrency sector was under massive selling pressure due to a combination of factors that ultimately culminated with the crash of what was once one of the largest crypto exchanges in the world, FTX.\n\nIn fact, by the end of the month or by Halloween 2022, Bitcoin was changing hands above the $21,000 price level, a significant increase from the $19,300 area it recorded 30 days earlier – on October 1, as Finbold reported on October 29, 2022 – despite being 66.56% lower than on October 31, 2021.\n\nNotably, on October 31, 2021, Bitcoin traded at $61,300 with a market valuation of $1.156 trillion, up 344.39% from its Halloween 2020 price of $13,794. Meanwhile, 28,488 respondents from the CoinMarketCap community bet the BTC price prediction for Halloween 2022 at $21,248.\n\nBitcoin price analysis\n\nAs things stand, Bitcoin is currently trading at the price of $26,198, which represents an increase of 0.39% in the last 24 hours, a decline of 3.49% across the previous seven days, and a 0.52% gain on its monthly chart, according to the most recent data on September 26.\n\nBitcoin 30-day price chart. Source: Finbold\n\nAll things considered, Bitcoin does, indeed, demonstrate a strong possibility of reaching the predicted increase in price and continuing the tradition of ‘Uptober’ by this Halloween, as well, despite regulatory uncertainty in the United States that has triggered a mass exodus of investors from the maiden crypto asset.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5sYXRlc3RseS5jb20vcXVpY2tseS90ZWNobm9sb2d5L25vcnRoLWtvcmVhLXMtbGF6YXJ1cy1ncm91cC1ob2xkcy00Ny1tbi1pbi1jcnlwdG8tbW9zdGx5LWJpdGNvaW4tcmVwb3J0LTU0NDI1NjguaHRtbNIBgAFodHRwczovL3d3dy5sYXRlc3RseS5jb20vcXVpY2tseS90ZWNobm9sb2d5L25vcnRoLWtvcmVhLXMtbGF6YXJ1cy1ncm91cC1ob2xkcy00Ny1tbi1pbi1jcnlwdG8tbW9zdGx5LWJpdGNvaW4tcmVwb3J0LTU0NDI1NjguaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 14:01:18 GMT",
        "title": "Technology News | ⚡North Korea’s Lazarus Group Holds $47 Mn in Crypto, Mostly Bitcoin: Report - LatestLY",
        "content": "The report tracked 295 wallets recognised by the US government as belonging to Lazarus Group. However, there is a notable decrease in the amount of crypto held by the group from $86 million on September 6, shortly after the Stake.com hack in which Lazarus was implicated."
    }
]