[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LnVuY2cuZWR1L2ZhY3VsdHktc3RhZmYvYmxvY2tjaGFpbnMtYW5kLWJpdGNvaW4tdGhlLWZpbmFuY2lhbC1mcm9udGllci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Blockchains and Bitcoin: the financial frontier - UNC Greensboro",
        "content": "How soon before most companies ask if you’d like to pay for your order in Bitcoin? Will you be using smart contracts to manage your corporation’s transactions with vendors and clients? Will “blockchain technology” become a coveted skill on resumes?\n\nIt’s questions like these that interest Business Management Professor Nir Kshetri with UNC Greensboro’s Bryan School of Business and Economics. He’s had his finger on the pulse of emerging technologies that affect everything from salaries to e-commerce to cybersecurity.\n\nMost recently, he is advancing research on cryptocurrency and the Metaverse, a burgeoning digital environment for people to interact, shop, and work through virtual reality, augmented reality, or gaming engines. Both of these tools could one day become an ordinary part of doing business.\n\n“Students need to learn about this,” says Kshetri. “They might be doing work in the Metaverse. They might be collaborating in the Metaverse or launching a product in the Metaverse. They have to understand how these tools function. They have to be aware of the scams that exist.”\n\nWho’s buying crypto?\n\nDr. Nir Kshetri\n\n“In the U.S. the last survey showed 16 percent of the U.S. population owns some type of crypto,” Kshetri explains. “It may be more than that now.”\n\nCryptocurrency has been around since the invention of Bitcoin in 2009. There are now about 20 thousand types of digital currency in circulation.\n\nWith that comes news reports of speculative booms and collapses, early investors becoming millionaires seemingly overnight, social media influencers promoting NFTs, and scandals such as the fall of the crypto exchange FTX. The U.S. government still looks at the ventures with skepticism. The risk of scams remains high.\n\n“Crypto is defusing less rapidly than other technologies,” said Kshetri. “It is a very complicated technology for people to understand.”\n\nThe majority of mainstream cryptocurrencies, he says, are also not backed by any fiat currency or physical resource. “They are just decentralized ways of making payment.”\n\nAs their value is determined by speculative interest, his advice to anyone curious in personally investing in cryptocurrency now is to keep its high risks at the front of the mind. “If you’re not prepared to lose it all, you should not invest.”\n\nFinancial lifelines\n\nCryptocurrencies Ethereum (ETH), Bitcoin (BTC), and Ripple (XRP).\n\nInternationally, cryptocurrency has created a new financial platform for people who never had even one electronic payment option. In countries where the fiat currency is hindered by economic upheaval or rapid inflation, it may keep a family alive.\n\n“In many developing countries, only ten percent of people have a bank account,” says Kshetri. “Access to financial services is one of the most important tools that give people power.”\n\nKshetri’s most recent research focuses on cryptocurrency in developing and economically unstable countries such as Venezuela, where the bolivar’s inflation rate is at 65,000 percent. Venezuelans living outside the country can send money back home as cryptocurrency without paying high exchange fees.\n\n“There’s a new transfer agency focused on Latin America that can convert money into the bolivar,” says Kshetri. “The transfer fee is less than one percent.”\n\nHe also observed how people around the world sustained their families during the COVID-19 pandemic by playing online games through the Metaverse. “A lot of people were locked down and could not work,” he says. “The only way to make a living, in Venezuela, in the Philippines, Brazil, Ghana, was to go online and play games, using non-fungible tokens or NFTs.”\n\nAt one point, 2.5 million daily active users played just one of these Metaverse games. The NFT value has since dropped by about 90 percent. But at the time, Kshetri says, “they were lifelines for many of the people playing.”\n\nWhat do companies like about blockchains?\n\nCryptocurrencies use “blockchains” to record purchases. A blockchain works like a ledger, tracking purchases and exchanges of goods. Each interaction is recorded within a digital “block” of data. The records are maintained by a peer-to-peer network of computers around the world.\n\nMetaverse, which is still in early development, will utilize virtual reality.\n\nShould something happen to company servers, or a bad actor tries to sabotage the records, the other nodes in the network should cross-reference with each other and account for an incorrect or missing entry.\n\nThe possibilities of blockchains go beyond currency. They can be used to catalog inventory. They can cut out middlemen between the buyer and seller and therefore lower transfer fees. They provide a provable record for addressing disputes.\n\n“One application is called the ‘smart contract,'” says Kshetri. “The computer code enforces the contract. Say that you are a supplier to my company. After someone verifies that the shipment arrived, then the smart contract has the cryptocurrency automatically transferred from my account to your account without any intervention from people.”\n\nThe future of digital commerce\n\nCryptocurrency’s future will likely be decided by how stable it gets and what kinds of regulations come into play. Governments can’t easily track how cryptocurrency is being spent, and whether it is being used for criminal or terrorist purposes. And setting regulations must be weighed against the rights of the individual.\n\n“If you have your hundred-dollar fiat currency right now, no one knows how you are spending it,” says Kshetri. “Digital currency has to guarantee some people a level of privacy. It also has to guarantee the government’s ability to monitor that it is not going to adversaries.”\n\nHowever cryptocurrency is implemented, Kshetri will be there to see how it evolves so that students, investors, and business owners capitalize on its potential.\n\n“Blockchain is a good technology. Blockchain combined with cryptocurrency has many applications. They can be used to solve many problems in the world.”\n\nStory by Janet Imrick, University Communications\n\nPhotography by Mike Dickens, Bryan School of Business and Economics; and Jiyoung Park, University Communications\n\nGraphics by Jaysen Buterin and De’Andre Gilliard, University Communications"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMDkvYml0Y29pbi1ldGhlci1mYWxsLWFmdGVyLWdvLXRvLWNyeXB0by1iYW5rLXNpbHZlcmdhdGUtYW5ub3VuY2VzLWxpcXVpZGF0aW9uLmh0bWzSAXRodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMy8wOS9iaXRjb2luLWV0aGVyLWZhbGwtYWZ0ZXItZ28tdG8tY3J5cHRvLWJhbmstc2lsdmVyZ2F0ZS1hbm5vdW5jZXMtbGlxdWlkYXRpb24uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, ether fall after go-to crypto bank Silvergate announces liquidation - CNBC",
        "content": "watch now\n\nCrypto prices fell Thursday after Silvergate, a bank that has been at the center of the industry's growth, made a decision to shut down. Bitcoin slid 7% to $20,474.50, according to Coin Metrics. Ether lost about the same amount and was last trading at $1,440.45. The slight move lower began late Wednesday, a few hours after Silvergate Capital announced it will wind down operations and liquidate its crypto-friendly bank. The relatively small size of the move indicates that cryptocurrency investors priced the news in last week when the company first warned it may not be able to continue operating and it shut down the SEN, or Silvergate Exchange Network, according to Conor Ryder, research analyst at Kaiko. The declines deepened by Thursday afternoon, however, after shares of SVB Financial, whose Silicon Valley Bank, which largely banks tech startups, announced a plan to raise more than $2 billion in capital to help offset losses on bond sales. Although SVB has said it has minimal exposure to crypto, its need to recapitalize on the heels of the Silvergate event has linked the two events in some people's minds.\n\nStock Chart Icon Stock chart icon Bitcoin on Thursday\n\nBitcoin and ether have held up relatively well despite a challenging macroeconomic environment — still the biggest driver of crypto price action despite a declining correlation between crypto and stocks — and a series of setbacks for the space, including the recent Silvergate developments and the post-FTX regulatory crackdown on the industry that began in February. Even their single-digit drops on Thursday pale in comparison to the 60% and 41% declines suffered by SVB and Silvergate, respectively. Bitcoin's correlation with stocks is lower than it was for much of 2022 and its volatility has been near historic lows for the past few weeks.\n\nVertigo3d | iStock | Getty Images"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzA5L2JpdGNvaW4tZGlwcy1iZWxvdy0yMWstdG8tcmVhY2gtbG93ZXN0LWxldmVsLWluLTctd2Vla3MtYXMtc2lsdmVyZ2F0ZS1iYW5rLXNodXRkb3duLXNoYWtlcy1pbnZlc3RvcnMv0gGVAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDkvYml0Y29pbi1kaXBzLWJlbG93LTIxay10by1yZWFjaC1sb3dlc3QtbGV2ZWwtaW4tNy13ZWVrcy1hcy1zaWx2ZXJnYXRlLWJhbmstc2h1dGRvd24tc2hha2VzLWludmVzdG9ycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Dips Below $21K to Reach Lowest Level In 7 Weeks as Silvergate Bank Shutdown Shakes Investors - CoinDesk",
        "content": "Layer 2 platform Polygon’s MATIC token was down over 8% over the past 24 hours and 16% in the past seven days to recently trade below $1. SOL, the token of the Solana blockchain, tumbled 9% for the day to $17.09. SOL, which had been hovering above the $20 range most of this year, has lost 20% over the past seven days."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL3doYXQtYXJlLWJpdGNvaW4tb3JkaW5hbHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "What are Bitcoin ordinals? - Cointelegraph",
        "content": "What are Bitcoin NFTs? Bitcoin NFTs — aka Bitcoin ordinals, aka digital artifacts — are a way to inscribe digital content on the Bitcoin blockchain. The Bitcoin ordinals protocol was launched in January 2023 by Casey Rodarmor. The protocol allows inscribing of digital content like art onto the Bitcoin blockchain. Unlike nonfungible tokens (NFTs) on Ethereum and other blockchains, Rodarmor wanted to create an immutable on-chain presence of a piece of art, text or video. The genesis ordinal was a pixel art of a skull that Rodarmor inscribed on Dec. 14, 2022. As the NFT space based on Ethereum’s ERC-721 standard skyrocketed in 2021, Rodarmor, who was a programmer and an artist, saw the opportunity to create a similar yet unique experience on the Bitcoin blockchain. His solution was Bitcoin ordinals, based on ordinal theory, which he went on to implement through 2022. Ordinal theory concerns itself with satoshis, giving them individual identities and allowing them to be tracked, transferred and imbued with meaning. The ordinals hype really kicked off in February 2023, six weeks after the genesis ordinal was created. The number of inscriptions doubled every week for a few weeks. However, the number could have been much higher if the infrastructure to inscribe and trade ordinals had been better planned and executed. The rise of Bitcoin ordinals has seen the Bitcoin network explode in terms of usage, fees and storage space as shown in the chart above. This may also be the first big breakthrough for the Bitcoin application tier and can help move the narrative from a pure “store of value” to something more utilitarian.\n\nHow do Bitcoin ordinals work? Bitcoin ordinals are based on ordinals theory that essentially has brought life to satoshis (sats) and allows them to be treated as atomic units on the Bitcoin blockchain. Ordinals, in their simplest state, are a numbering scheme for sats. Ordinals theory drives the mechanics behind how Bitcoin ordinals work. Ordinals theory defines satoshis (sats) as the atomic unit that can be identified and traded individually on the Bitcoin network. There are 100 million sats that make up 1 Bitcoin (BTC). Sats are numbered based on the order of mining, and this number, which uniquely identifies a sat, is an ordinal number. Related: Bitcoin vs. Satoshi: Key differences explained By being a unit of transaction, sats can also be inscribed with digital content that make up Bitcoin ordinals. They become immutable digital collectibles that can be transacted on the Bitcoin network using Bitcoin wallets. As per ordinal theory, sats can be attached to security tokens, accounts or stablecoins using ordinal numbers as stable identifiers. Due to the broad set of use cases that ordinals can support, Rodarmor prefers not to equate Bitcoin ordinals with NFTs. The use case of ordinals to number a sat that’s been attached to or inscribed with a JPEG can be called a nonfungible token on the Bitcoin blockchain. Although the ordinal’s use that found market fit is that of NFTs on the Bitcoin blockchain, ordinals are much more than just nonfungible tokens.\n\nHow to mine Bitcoin ordinals? Mining, minting or inscribing Bitcoin ordinals are the terms that have been used to refer to this process. Unlike minting NFTs on the Ethereum blockchain, which is a relatively matured process, mining Bitcoin ordinals is a technically complex process and lacks intuitive tools. Bitcoin ordinals, in the initial days, could only be mined by those who ran a Bitcoin node. For tech-savvy users, a Bitcoin node with the ord app, a command line wallet, would be the gateway to mining ordinals. Node operators would load their wallets with some sats to pay for the gas fees and perform an inscribing process on their ordinals. However, no-code ordinal mining applications like the Gamma or the Ordinals Bot aim to allow users to upload the content that they want to inscribe to create their Bitcoin ordinal. The user journey takes them through a payment process using a QR code and is intuitive enough for the less technically gifted. The tools around Bitcoin ordinals are still at a very early stage. It has only been a few months since the genesis ordinals were inscribed. As demand from ordinary users and followers increases, the ecosystem and the tooling should start maturing with more user-friendly journeys.\n\nHow to buy, sell and trade ordinals Much like the process of minting Bitcoin ordinals, the trading process hasn’t had the matured tooling. Yet there are a few tools to trade these digital artifacts. As Bitcoin ordinals grow in popularity, most of the trades have been largely over-the-counter. Collections, such as “Planetary Ordinals” and “Bitcoin Punks,” among the first 1,000 inscriptions were transacted mostly without an NFT marketplace such as OpenSea or Blur. However, tools like the Ordinals Wallet, Hiro and Xverse allow users to buy and sell Bitcoin ordinals. Users can buy some sats within the wallet, using on-ramp payment plugins, and perform the transactions to buy and sell ordinals. The typical user journey involved in buying Bitcoin ordinals using Ordinals Wallet is as follows. Go to ordinalswallet.com Click on “Create Wallet” Take a backup of the recovery phrase for your wallet Set up a password for wallet access Use the address of the Ordinals Wallet to send some sats to the wallet Go to “Collections” at the top of the page Choose the ordinals collection and the inscription that you would like to buy Buy the ordinal (using the sats in your wallet).\n\nHow have ordinals been perceived by the broader Bitcoin ecosystem? Bitcoin ordinals are a great innovation that can highlight various applications unique to the chain, thereby driving developers to participate and create the tools needed by users. Bitcoin ordinals have certainly seen a hype that potentially peaked sometime in February 2023, based on transaction data. However, the hype around the application tier on the Bitcoin blockchain is just getting started. For instance, Stacks (STX) has seen a rise in price since the ordinals episode warmed up. It is clearly the early days for the Bitcoin ecosystem, but if developers are attracted to the chain, then the network effects between developers and users could come in time for the next crypto cycle. Related: Bitcoin DeFi ecosystem explained However, there are downsides to the way ordinals have been designed. As the inscribed content is all on-chain with ordinals unlike with most Ethereum-based NFTs, the size of the blockchain would increase. As new applications emerge and network utilization and transactions increase, so will the cost of transactions. The other potential impact of Bitcoin ordinals is whether it will affect the fungibility of sats. So far, satoshis have been exchanged with one sat being valued the same as another. With various applications of ordinals, this may not be true in the future. A sat with a Bitcoin Punk inscribed in it could be priced differently. Nonetheless, it would be interesting to see how this narrative evolves over the next few months and years."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMTAvYml0Y29pbi1mYWxscy1iZWxvdy0yMDAwMC02My1iaWxsaW9uLXdpcGVkLW9mZi1jcnlwdG9jdXJyZW5jeS1tYXJrZXQuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAzLzEwL2JpdGNvaW4tZmFsbHMtYmVsb3ctMjAwMDAtNjMtYmlsbGlvbi13aXBlZC1vZmYtY3J5cHRvY3VycmVuY3ktbWFya2V0Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "More than $70 billion wiped off crypto market in 24 hours as bitcoin drops below $20,000 - CNBC",
        "content": "In this article BTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nJonathan Raa | Nurphoto | Getty Images\n\nBitcoin briefly fell 8% to below $20,000 on Friday, hitting a near-two-month low, after a stock market sell-off in the U.S. and the collapse of a crypto-focused lender. The cryptocurrency market saw more than $70 billion wiped off its value over the course of the 24 hours. Bitcoin was last trading lower by just 2.7% at $19,944.66, according to Coin Metrics. Ether was last down 2.6% at $1,414.21. The crypto sell-off has been prompted by a number of factors. The movement of cryptocurrency prices is quite closely correlated to U.S. stock markets, in particular the tech-heavy Nasdaq .\n\nOn Tuesday, U.S. Federal Reserve Chairman Jerome Powell indicated that interest rates may go higher —and stay higher — than expected. The raising of interest rates over the past year has weighed on risk assets such as stocks, and in particular cryptocurrencies. \"There is just little reason to buy bitcoin now as the market is saturated with negative developments, not just specifically for the crypto industry, but also for the wider financial market as well,\" Yuya Hasegawa, an analyst at Japanese crypto firm Bitbank, told CNBC via email.\n\nBanking worries\n\nAnother major factor weighing on crypto prices is the collapse of Silvergate Capital, a major lender to the crytpo industry. Silvergate said Wednesday it is winding down operations and liquidating its bank. Silvergate's fall is another example how the collapse of major cryptocurrency exchange FTX continues to have an impact on the industry. FTX was a big customer of Silvergate. Separately, on Friday morning the Federal Deposit Insurance Corporation closed Silicon Valley Bank and took control of its deposits, making it the largest U.S. bank failure since the global financial crisis. The bank's parent company, SVB Financial, said late Wednesday that it sold off $21 billion worth of its holdings at a $1.8 billion loss. SVB was a major bank in the technology start-up space.\n\nwatch now"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMTAvcmV2aWV3aW5nLWNvZGUtaXMtbWluZC1udW1iaW5nLXFhLXdpdGgtYml0Y29pbi1tYWludGFpbmVyLWFuZHJldy1jaG93L9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMTAvcmV2aWV3aW5nLWNvZGUtaXMtbWluZC1udW1iaW5nLXFhLXdpdGgtYml0Y29pbi1tYWludGFpbmVyLWFuZHJldy1jaG93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Reviewing Code Is Mind-Numbing: Q&A With Bitcoin Maintainer Andrew Chow - CoinDesk",
        "content": "So I do think James putting that in there was probably a mistake. The Taproot deployment section wasn't defined until after Taproot. The code changes themselves were merged into Bitcoin Core but not active. It's not unusual to just say we'll deal with deployment after we figure out what we want the code changes to be."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMTAvYml0Y29pbi1mYWxscy1iZWxvdy0yMGstYXMtMjAyMy1yYWxseS1yZXZlcnNlcy_SAV9odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzEwL2JpdGNvaW4tZmFsbHMtYmVsb3ctMjBrLWFzLTIwMjMtcmFsbHktcmV2ZXJzZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Falls Below $20K as 2023 Rally Reverses - CoinDesk",
        "content": "\"Silvergate is one of several factors in bitcoin’s underside test,\" Joe DiPasquale, CEO of crypto fund manager BitBull Capital, wrote in an email to CoinDesk. \"In addition to Silvergate, there is market concern of greater interest rate hikes by the [Federal Open Market Committee] and softening stock market prices. The [Securities and Exchange Commission] also shows increasing scrutiny of crypto. Taken together, the market has continued to tighten and retest support levels.\""
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAzLzA5L2FydGh1ci1oYXllcy1wcm9wb3Nlcy1iaXRjb2luLWJhY2tlZC1uYWthZG9sbGFyLXdoaWNoLXdvdWxkLXJlbHktb24tZXhjaGFuZ2VzLXRvLW1haW50YWluLWRvbGxhci1wZWcv0gGSAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMDkvYXJ0aHVyLWhheWVzLXByb3Bvc2VzLWJpdGNvaW4tYmFja2VkLW5ha2Fkb2xsYXItd2hpY2gtd291bGQtcmVseS1vbi1leGNoYW5nZXMtdG8tbWFpbnRhaW4tZG9sbGFyLXBlZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Arthur Hayes Proposes Bitcoin-Backed Stablecoin Called NakaDollar - CoinDesk",
        "content": "That was because of how algorithmic stablecoins like UST operated. One UST could be redeemed or minted for exactly $1 worth of LUNA at any time. In theory, that helped UST retain its value while creating demand for both tokens."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzA5L2JpdGNvaW4tbWluZXItaHV0LTgtdGFsa3Mtb3BlcmF0aW9uYWwtaXNzdWVzLWFuZC11c2J0Yy1tZXJnZXItaW4tZWFybmluZ3MtY2FsbC_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDMvMDkvYml0Y29pbi1taW5lci1odXQtOC10YWxrcy1vcGVyYXRpb25hbC1pc3N1ZXMtYW5kLXVzYnRjLW1lcmdlci1pbi1lYXJuaW5ncy1jYWxsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Hut 8 Talks Operational Issues and U.S. Bitcoin Corp. Merger in Earnings Call - CoinDesk",
        "content": "Hut 8 did receive a letter of no action from the Canadian competition authority for its proposed merger with U.S. Bitcoin Corp., meaning the authority doesn't plan to challenge the move, Leverton said on the call. The company's main focus is on completing the merger, she said, which will give it access to additional power for mining rigs."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDMvMDkvdGhuZHItZ2FtZXMtbGF1bmNoZXMtcGxheS10by1lYXJuLWJpdGNvaW4tYmxvY2tzLXB1enpsZS1nYW1lL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDMvMDkvdGhuZHItZ2FtZXMtbGF1bmNoZXMtcGxheS10by1lYXJuLWJpdGNvaW4tYmxvY2tzLXB1enpsZS1nYW1lL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "THNDR Games Launches Play-to-Earn Bitcoin Blocks Puzzle Game - CoinDesk",
        "content": "“80% of our users are new to bitcoin and we love that we’re the top of the funnel,” said Dickerson. “I hope this is a way for people to introduce their friends and family to bitcoin – that's why this has been a fun, safe, familiar place to learn.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMTAvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXBsdW5nZXMtdG8tbWlkLWphbnVhcnktbGV2ZWxzL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMTAvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXBsdW5nZXMtdG8tbWlkLWphbnVhcnktbGV2ZWxzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Plunges to Mid-January Levels - CoinDesk",
        "content": "\"There's a lot of people that are scared that maybe the domino effect is just starting,\" Eddy Gifford, a wealth adviser for investment adviser Tactive. \"There's FTX, now Silvergate, who's next? We also had news out of the Fed where [Federal Reserve Chair Jerome] Powell was very hawkish on raising interest rates likely higher than anyone wanted to even expect – and potentially keeping those rates higher for longer. In those situations, risk assets in general tend to decline, because valuations are a function of the ability to meet estimates and interest rate environment.\""
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDkvY3J5cHRvLXRyYWRlcnMtc3VmZmVyLW92ZXItMzAwbS1vZi1sb3NzZXMtaW4tbGlxdWlkYXRpb25zLWFtaWQtbWFya2V0LWNyYXNoL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDkvY3J5cHRvLXRyYWRlcnMtc3VmZmVyLW92ZXItMzAwbS1vZi1sb3NzZXMtaW4tbGlxdWlkYXRpb25zLWFtaWQtbWFya2V0LWNyYXNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Crypto Traders Suffer Over $300M of Losses in Liquidations Amid Market Crash - CoinDesk",
        "content": "Soaring long liquidations suggest that cryptocurrency prices’ sudden nosedive caught investors off-guard. BTC, the largest cryptocurrency by market capitalization, has plummeted more than 6% in the past 24 hours, and earlier in the day reached its lowest level in seven weeks at around $20,050. Popular altcoins dogecoin (DOGE) and tron (TRX) have led the price decline."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzA5L3ByaWNlLW5vdC1pbnRyaW5zaWMtdmFsdWUtaXMtdGhlLXRydWUtbWVhc3VyZS1vZi1iaXRjb2lucy1zdWNjZXNzL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzA5L3ByaWNlLW5vdC1pbnRyaW5zaWMtdmFsdWUtaXMtdGhlLXRydWUtbWVhc3VyZS1vZi1iaXRjb2lucy1zdWNjZXNzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Price, Not Intrinsic Value, Is the True Measure of Bitcoin’s Success - CoinDesk",
        "content": "Others say the market is inefficient. They tend to think all employer retirement accounts have participants pigeonholed without any choice other than some mixtures of stocks and bonds. They point to a variety of areas in the market that have been inefficient – take energy in 2022 as a great example, because it currently makes up so little of the massive indexes. And they argue the price of assets often don’t reflect their value and that prices can be inaccurate."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDkva3dlbnRhLWRleC1sdXJlcy10cmFkZXJzLXRvLWNhcHR1cmUtYml0Y29pbi1ldGhlci1yZXR1cm5zLXJlZ2FyZGxlc3Mtb2YtZGlyZWN0aW9uL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzA5L2t3ZW50YS1kZXgtbHVyZXMtdHJhZGVycy10by1jYXB0dXJlLWJpdGNvaW4tZXRoZXItcmV0dXJucy1yZWdhcmRsZXNzLW9mLWRpcmVjdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Kwenta DEX Lures Traders to Capture Bitcoin, Ether Returns Regardless of Direction - CoinDesk",
        "content": "KWENTA is used to incentivize the growth of the Kwenta decentralized autonomous organization (DAO) and has two primary functions – staking and platform governance. Trading volumes for the token have grown steadily in the past few weeks to nearly $50 million from just $3 million at the start of this year, statistics show, contributing to $880 million in lifetime volumes since the platform’s early 2021 launch."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzEwL3doeS1iaXRjb2luLWV0aGVyZXVtLWFuZC1zb2xhbmEtYXJlLWNyYXNoaW5nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Why Bitcoin, Ethereum, and Solana Are Crashing Today - The Motley Fool",
        "content": "What happened\n\nCryptocurrencies have had a rough couple of days as word spread that the influential Silicon Valley Bank, which trades under SVB Financial Group (SIVB.Q -36.36%), is facing a liquidity crisis. While this isn't directly a hit to crypto, many venture capital firms use Silicon Valley Bank, so there's a risk of a broader financial impact, which is why cryptocurrencies are down Friday.\n\nAs of 10:30 a.m. ET, Bitcoin (BTC 1.67%) had fallen by 8.5% over the prior 24 hours, Ethereum (ETH -1.09%) had fallen 8.8%, and Solana (SOL 10.64%) was down 5.7%. Looking further back, over the past seven days, those cryptocurrencies are down 11.2%, 10.7%, and 18.5% respectively.\n\nSo what\n\nThe two major events of the past week have been the collapse of Silvergate Capital and the potential collapse of Silicon Valley Bank. Silvergate provided a direct gateway into cryptocurrencies for many wealthy investors and institutions, and even operates many publicly traded funds. But it was seen as a more crypto-specific bank.\n\nThis week's bank run on Silicon Valley Bank is more concerning for the broader tech ecosystem. It is used by many start-ups and provides services small companies need in order to scale their businesses quickly.\n\nContagion, or cascading risks from one entity to another, is the biggest fear here. That could lead to less lending and investors pulling back their investments. Silicon Valley's venture capital firms provide the fuel for the tech ecosystem, and anything that impacts them could impact a lot of smaller start-ups.\n\nAs far as crypto goes, dozens of blockchain start-ups have been funded by venture capitalists in Silicon Valley. If they face pressure from regulators, banks and ultimately, investors, they may not be able to build the tools and services that are intended to make cryptocurrencies like Bitcoin, Ethereum, and Solana more useful, and thus more valuable.\n\nIn short, these ecosystems are intertwined, and the fear this week is that a collapse of Silicon Valley Bank will make this crypto winter even worse.\n\nNow what\n\nThe risk to financial institutions can't be understated because they're critical to making the financial system work. When lending pulls back all at once or there's a credit crisis, there can be an economywide impact, as we saw in 2008 and 2009.\n\nThe Labor Department's February jobs report Friday morning did provide some positive news. The U.S. economy added 311,000 non-farm jobs last month, but more people entered the workforce to seek jobs, so the unemployment rate rose to 3.6%. So far, the tech sector slowdown, the crypto collapse, and the downfall of some banks haven't spilled over to the broader economy.\n\nInvestors with a long-term view should start looking at this as a buying opportunity for high-quality cryptocurrencies. Despite the downturn in token values, the crypto industry continues to grow and innovate, which is ultimately what's going to drive value.\n\nI don't know if we are at or even near the bottom, but I am betting on innovation in the blockchain winning in the long term. The Ethereum and Solana blockchains are where most developers are building, and that's where I'm looking to be a buyer if this crash gets worse."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTEwL2JpdGNvaW4tZHJvcHMtYmVsb3ctMjAtMDAwLWxldmVsLWZvci1maXJzdC10aW1lLXNpbmNlLWphbnVhcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Drops Below $20000 Level for First Time Since January - Bloomberg",
        "content": "Bitcoin is having its worst week since November as an equity selloff, jitters in the banking sector and an escalating US regulatory crackdown on crypto combine to hurt investor sentiment.\n\nThe largest token fell as much 3.2% on Friday, breaking below $20,000 for the first time since January, after falling more than 8% on Thursday, data compiled by Bloomberg show. Smaller coins like Ether , Solana and Cardano also fell, though Bitcoin recouped some of its losses on Friday afternoon and other tokens turned positive after earlier declines."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8wOS91cy10cmVhc3VyeS1kZXBhcnRtZW50LXByb3Bvc2VzLTMwLWV4Y2lzZS10YXgtb24tY3J5cHRvLW1pbmluZy1maXJtcy_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDMvMDkvdXMtdHJlYXN1cnktZGVwYXJ0bWVudC1wcm9wb3Nlcy0zMC1leGNpc2UtdGF4LW9uLWNyeXB0by1taW5pbmctZmlybXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "U.S. Treasury Department Proposes 30% Excise Tax on Crypto Mining Firms - CoinDesk",
        "content": "“The increase in energy consumption attributable to the growth of digital asset mining has negative environmental effects and can have environmental justice implications as well as increase energy prices for those that share an electricity grid with digital asset miners,” according to the document. “Digital asset mining also creates uncertainty and risks to local utilities and communities, as mining activity is highly variable and highly mobile. An excise tax on electricity usage by digital asset miners could reduce mining activity along with its associated environmental impacts and other harms,” the document added."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTA5L3NvbGFyLXBvd2VyLXJpc2luZy1oZWF0LWFuZC1iaXRjb2luLWFyZS13aWxkLWNhcmRzLWZvci10ZXhhcy1ncmlk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Solar Power, Rising Heat and Bitcoin Are Wild Cards for Texas' Grid - Bloomberg",
        "content": "This is from the Green Daily newsletter. Sign up to receive it in your inbox.\n\nNo electricity grid in the US has added more renewable power over the past decade than the Texas grid has. Back in 2012, both California and the Midwest generated more power from wind, solar and other renewables than the Lone Star State. But in 2022, Texas was the winner. The future of the state’s grid is a study in supply, demand and uncertainty."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzA5L2RvZXMtYml0Y29pbi1iZWxvbmctaW4teW91ci1yZXRpcmVtZW50LXBvcnRmb2xpby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Does Bitcoin Belong in Your Retirement Portfolio? - The Motley Fool",
        "content": "After U.S. lawmakers reintroduced the Financial Freedom Act in mid-February, there is fresh debate about the role crypto should play in retirement plans. The goal of the Financial Freedom Act is simple: Let Americans invest their retirement savings how they want, even if it means investing in crypto.\n\nThere's just one problem with that. Right now, the official guidance from the U.S. Department of Labor is that employers should not offer any crypto options in their 401(k) plans. Moreover, at the beginning of February, a trio of regulators -- the SEC, the North American Securities Administrators Association, and the Financial Industry Regulatory Authority -- warned against crypto exposure in self-directed individual retirement accounts (IRAs). With that in mind, here's a closer look at the pros and cons of adding cryptocurrencies such as Bitcoin (BTC 1.72%) to your retirement portfolio.\n\nPros of adding crypto to your retirement portfolio\n\nThe overwhelming advantage to adding crypto to a retirement portfolio is the opportunity for truly life-changing gains. For example, over the period from 2011 to 2021, Bitcoin was the top-performing asset class in the world, and it wasn't even close. Over that time period, Bitcoin delivered annualized returns of 230% to investors. In comparison, the next-best asset class (big tech stocks) returned only 20% on an annualized basis.\n\nIf you're behind schedule on your retirement savings, or if you are planning on retiring early, it's easy to see the allure of investing in crypto. Rather than investing for 30 years in a relatively safe asset class and methodically churning out returns in order to save for retirement, Bitcoin theoretically gives you the option of investing for maybe 10 years and having a big enough nest egg to settle down and retire comfortably.\n\nCons of adding crypto to your retirement portfolio\n\nOf course, this type of thinking assumes two key things. One, it assumes that past returns are a reliable predictor of future returns. But that's not necessarily the case with crypto, which has a relatively short track record. Sure, Bitcoin might have a nearly 15-year track record, but newer altcoins come and go. Moreover, we don't really know how Bitcoin is going to perform in the future.\n\nSecondly, by putting a significant portion of your retirement assets into crypto, you are ignoring the fact that the crypto market is extremely volatile. At just the moment that you think you've reached your retirement savings goals, you could have your precious nest egg snatched away from you.\n\nThe past two years are a great example of this volatility at work. After a banner year in 2021, when just about every crypto approached all-time highs, the crypto market suffered through a house of horrors in 2022. Nearly every major crypto -- even Bitcoin -- fell by 65% or more last year. That means your retirement savings would have been largely wiped out if you were counting on crypto to finance your retirement.\n\nAnother big disadvantage to adding Bitcoin to your retirement portfolio is that there are few formal options available from top financial institutions. As long as the U.S. Department of Labor refuses to give a seal of approval to crypto for 401(k) plans, employers are going to be very leery about offering these plans. They have a fiduciary duty to protect their employees, and right now, crypto is not viewed as a responsible way to exercise that fiduciary duty.\n\nAs a result, individual investors are left with a DIY approach. In practical terms, this means opening up an account with a major cryptocurrency exchange and designating all funds in that account for retirement. But what happens if that cryptocurrency exchange turns out to be the next FTX (FTT -2.22%) and fails? Or what if you're investing in a lot of speculative altcoins instead of more trusted names like Bitcoin because you don't have access to professional investment advice?\n\nShifting sentiment in Washington?\n\nBased on the above, it's easy to see why there is such a contentious debate happening right now around the topic of crypto in retirement accounts. On one hand, you have free market advocates, who think the government should stay out of the game and the free market should decide what happens next. They point to examples like Fidelity Investments, which led the way in April 2022 with the introduction of crypto retirement plan offerings for employers.\n\nOn the other hand, you have the supporters of government intervention, who think the government has an important role to play in protecting individual investors from losing their retirement nest eggs. They point to examples like the recent meltdown of FTX as proof that investing in crypto is fraught with peril.\n\nThe 5% rule\n\nKeep an eye on this space. Things could change soon if the Financial Freedom Act eventually passes. For now, a good rule of thumb is that, for DIY individual investors, the maximum amount of retirement savings that should be allocated to crypto is 5%. This is the cap currently proposed by many financial advisors, and it ensures that the overwhelming majority of your retirement portfolio is tied up in less risky and less speculative assets. Thus, even if Bitcoin goes to $0, you won't face a complete obliteration of your retirement portfolio."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZXZpZXdpbmctY29kZS1taW5kLW51bWJpbmctcS0xNTM1MzQ3NjQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Reviewing Code Is Mind-Numbing: Q&A With Bitcoin Maintainer Andrew Chow - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nFew people understand the key technical issues currently facing the world’s dominant cryptocurrency. Andrew Chow is one of them.\n\nChow is one of four “maintainers” for Bitcoin Core (or just Core), the most popular software for connecting to the Bitcoin network.\n\nMaintainers review changes to Bitcoin Core known as “commits,” which are submitted – by fellow Bitcoin developers – as “pull requests” or “PRs.” Chow and other maintainers then approve or “merge” those changes into Core’s source code. The “code review” is critical to ensuring no buggy code gets merged.\n\nThe process is transparent, and as Chow combs through commits he livestreams the process on Twitch.\n\nChow is a gamer at heart, and only got into Bitcoin in high school to pay for video games he couldn’t otherwise afford. His parents wouldn’t give him a credit card, open a bank account for him or even give him an allowance. He resorted to freelancing on the BitcoinTalk forum and began writing code in exchange for bitcoin (BTC).\n\nChow, who says he's now in his mid-20s, gets paid as an engineer at the Bitcoin infrastructure firm Blockstream, where aside from a few corporate tasks, his main priority is working on Bitcoin Core.\n\nHe says code review is one of the biggest challenges Bitcoin faces today. Most Core developers are keen on writing code for new features, but few enjoy the more mundane task of reviewing code submitted by their peers. Chow says more contributors need to focus on code review to tackle the 300-plus PRs in Core’s GitHub repository. The community has a Bitcoin Core PR Review Club that meets weekly to help newer contributors learn about the review process.\n\nChow agreed to an interview with CoinDesk at the Advancing Bitcoin conference in London. He elaborated on why code review is so critical, explained what Bitcoin Core contributors do every day, and weighed in on the current debate over op_vault and Speedy Trial. Here’s a partial transcript of that interview.\n\nStory continues\n\nCoinDesk: How did you discover Bitcoin?\n\nAndrew Chow: When I was younger, in high school, I didn't have a bank account because I was under 18. My parents didn't open one for me. I didn't have a credit card – even a supervised credit card – and I didn't have an allowance. But Steam was selling games for bitcoin. If you do PC gaming, you can download Steam and it has basically all the PC games.\n\nAlso, on purse.io, you could sell bitcoin for stuff. Well, I wanted to play games. I wanted to buy them. I mean, I'm okay with pirating but, you know, pirating things is kind of sketchy. You don't know what you're downloading. It could be complete malware.\n\nSo I was, like, this bitcoin thing is fully electronic. Maybe I can use that to buy games – but how do I get bitcoin? Maybe I can do some work and get paid in bitcoin.\n\nI know a few people who did that. So that's how I learned programming. I’d go on BitcoinTalk and people would say, “I will pay you however much to write me a script that does this.”\n\nWell, that seemed simple enough. I also had a friend in high school. He was, like, “Hey, have you heard about this bitcoin thing? I think you might like it.” He was definitely buying drugs with bitcoin.\n\nSo that's how I got into Bitcoin. And eventually I was like, “Well, I'm using this wallet and I'm running into these issues. I clearly know how to write a program. Maybe I can fix this wallet.” That's how I got into doing development.\n\nI was running this thing called Armory. Which was basically not maintained. I mean, it's still kind of maintained by one guy, so barely.\n\nBy the time I was using it, it was kind of a mess and it didn't always work. I was finding that some of the problems that were happening in Armory were caused by things that Bitcoin Core was doing. So I started going into Bitcoin Core and asking what’s Bitcoin Core doing? Oh, Bitcoin Core has this bug that's causing us to have a bug.\n\nArmory was doing something not recommended, which was to read the block files directly from Bitcoin Core – you're not supposed to do that. When they changed the format, it broke everything.\n\nI was trying to reconcile the two, and then Armory just kind of fell off my map. That's how I transitioned to Bitcoin Core. I eventually stopped working on Armory because I got more done on Core.\n\nYesterday we talked about the ratio of Bitcoin contributors who review code versus contributors who write code. Can you share your thoughts on that?\n\nOur main bottleneck in Bitcoin Core has been review. We have 300-plus PRs open and they need to be reviewed. Whether it’s just to make sure the code is good or just conceptually like, “Do we even want this change?”\n\nThe problem with every PR is that one person usually writes it, but we need multiple people to review it, give an approval or leave comments. Therefore, we must have more reviewers than people writing, but that's just not how it works.\n\nPersonally, I find code review to be a little bit boring. It's a little annoying and it can be kind of mind-numbing. But I still do it. I guess it's like a necessary evil and it's because I don't find it fun. If I do it enoug I start feeling like I’ll burn out because it's no longer enjoyable.\n\nSo you have to find some balance between writing code and reviewing code. It’s a bit of a catch-22. We have to have more reviewers than coders, but how do you become competent enough to review code if you're not writing code? It's a conundrum.\n\nWe're in a bear market and organizations like Brink that fund Bitcoin development are saying funding is down by about 50%. Why do we need to pay Bitcoin contributors and developers?\n\nFundamentally, every piece of software has bugs. There will always be bugs to find and bugs to fix. That's just general software maintenance that must happen.\n\nAnd even then, the software that exists now cannot last forever. Operating systems will evolve and libraries will evolve and change. Eventually the software will just stop compiling on a computer; it might just stop running. And so, there needs to be constant work just to keep it up to date.\n\nSo there are always things to update, even without new features. But there are new features and we do want to improve Bitcoin. Not just the consensus rules, but also how we relay transactions, what kind of transactions we accept into the mempool and the peer-to-peer protocol.\n\nThere can be DoS vectors we want to fix or change that maybe haven't been discovered yet. There's always something.\n\nIf I'm a new Core contributor, what are some of the big issues I would need to know about?\n\nThere are currently a number of issues that exist, like pinning attacks, that are pretty well documented. It seems to be that no one exploits them, but that's not a good reason to not fix them.\n\nThere's been a lot of work on the mempool – how and what transactions are accepted into the mempool, what methods there are for fee bumping, and things like that. It's relevant to Lightning and other [layer 2] networks.\n\nWhat’s a “pinning attack?”\n\nIf both of us open a Lightning channel together, I can make it so that you can never bump the fee on that transaction. So I can make it perpetually low-fee and it never gets mined, then try to double-spend it later.\n\nThere's a bunch of attacks you can do with the existing mempool policy rules. These are documented on the mailing list and they're definitely problems. If someone tried to exploit them it would be annoying, but I don't think we've seen anyone try to exploit them.\n\nWe still want to fix them and there's been a lot of work on making improvements so that we don't have these pinning attacks, or at least, if you want to pin a transaction, it'll be really expensive.\n\nWe also discussed op_vault and Speed Trial yesterday. There have been some tensions around James O’Beirne’s recommendation to deploy op_vault using Speedy Trial. Any comments?\n\nWith a new proposal like that, deployment should be the last thing to think about.\n\nSome ideas on how to deploy things are, for some reason, contentious. If you want to have a discussion about the proposal, having deployment in there kind of causes it to be derailed.\n\nSo I do think James putting that in there was probably a mistake. The Taproot deployment section wasn't defined until after Taproot. The code changes themselves were merged into Bitcoin Core but not active. It's not unusual to just say we'll deal with deployment after we figure out what we want the code changes to be.\n\nSpeedy Trial was an experiment for Taproot. We've tried different deployment methods over the years with varying degrees of success."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWRyb3BzLXRvLTIwLThrLWFzLXJlZ3VsYXRvcnktYW5kLW1hY3JvZWNvbm9taWMtcHJlc3N1cmUtbW91bnRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin price drops to $20.8K as regulatory and macroeconomic pressure mounts - Cointelegraph",
        "content": "Bitcoin (BTC) traders saw continued downward pressure after the 5.5% decline in BTC price on March 7. Higher odds of further interest rate increases by the U.S. Federal Reserve and regulatory pressure in the cryptocurrency space explain some of the movement.\n\nFinancial markets showed signs of stress as the inverted bond curve reached its highest level since the 1980s. Longer-term dated yields have stalled at 4%, while two-year treasury notes traded above 5% yield in March.\n\nSince July, longer-dated treasury yields have failed to keep pace with the surging two-year benchmark, resulting in the inverted curve distortion that typically precedes economic downturns. According to Bloomberg, the indicator reached a full percentage point on March 7, the highest level since 1981, when Fed Chair Paul Volcker faced double-digit inflation.\n\nThis week, BlackRock, the world's largest asset manager, increased its forecast for U.S. federal funds to 6%. Rick Rieder, chief investment officer of global fixed income at BlackRock, believes the Fed will keep interest rates high for \"an extended period to slow the economy and get inflation down to near 2%.\"\n\nFear of cryptocurrency regulation grows\n\nAccording to a Wall Street Journal report, the Biden administration wants to apply the wash sale rule to crypto, which would put an end to a strategy in which a trader sells and then immediately buys digital assets for tax purposes.\n\nFurthermore, the Public Company Accounting Oversight Board, an organization that keeps an eye on audits of public companies in the United States, recently put out a warning to investors about proof-of-reserves reports that auditing firms send out.\n\nThe organization, backed by the U.S. Securities and Exchange Commission, said that “Investors should note that PoR engagements are not audits and, consequently, the related reports do not provide any meaningful assurance.”\n\nLet's look at derivatives metrics to better understand how professional traders are positioned in the current market conditions.\n\nBitcoin margin markets have returned to normalcy\n\nMargin markets provide insight into how professional traders are positioned because they allow investors to borrow cryptocurrency to leverage their positions.\n\nFor example, one can increase exposure by borrowing stablecoins and buying Bitcoin. Borrowers of Bitcoin, on the other hand, can only take short bets against the cryptocurrency.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe above chart shows that OKX traders' margin lending ratio dropped dramatically on March 9, moving away from a situation that previously favored leverage long positions. Given the general bullishness of crypto traders, the current margin lending ratio at 16 is relatively neutral.\n\nOn the other hand, a margin lending ratio above 40 is very rare, even though it has been the norm since Feb. 22. It is partially driven by a high borrowing cost for stablecoins of 25% per year. Following the recent anomaly, the margin market has returned to a neutral-to-bullish state.\n\nOptions traders are pricing in a low risk of extreme price corrections\n\nTraders should also analyze options markets to understand whether the recent correction has caused investors to become more risk-averse. The 25% delta skew is a telling sign whenever arbitrage desks and market makers overcharge for upside or downside protection.\n\nThe indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the premium for protective put options is higher than the premium for risk call options.\n\nIn short, if traders anticipate a Bitcoin price drop, the skew metric will rise above 10% and generalized excitement has a negative 10% skew.\n\nRelated: US REPO task force names crypto as target in efforts involving $58B in sanctioned assets\n\nBitcoin 60-day options 25% delta skew: Source: Laevitas\n\nEven though Bitcoin failed to break the $25,000 resistance on Feb. 21 and then experienced a 14% correction in 16 days, the 25% delta skew remained in the neutral zone for the past month. The current positive 3% skew indicates a balanced demand for bullish and bearish option instruments.\n\nDerivatives data shows that professional traders are unwilling to go bearish, as evidenced by options traders' neutral risk assessment. Furthermore, the margin lending ratio indicates that the market is improving as some demand for bearish bets has emerged, but the structure remains neutral-to-bullish.\n\nGiven the enormous downward price pressure from a macroeconomic standpoint, as well as ongoing regulatory pressure in the United States, bulls should probably be content that Bitcoin derivatives have remained solid.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTA4L2JhbmtydXB0LW10LWdveC1zLWJpZ2dlc3QtY3JlZGl0b3Itd29uLXQtc2VsbC1yZXR1cm5lZC1iaXRjb2luLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bankrupt Mt. Gox’s Biggest Creditor Won’t Sell Returned Bitcoin (BTC) - Bloomberg",
        "content": "The largest creditor of the failed Mt. Gox crypto exchange intends to hold rather than sell the Bitcoin that’s due to be disbursed to it this year.\n\nThe Mt Gox Investment Fund — which bought claims against the bankrupt digital-asset platform — doesn’t plan to sell the tokens that are scheduled to be returned in October, according to a person familiar with the fund’s thinking, who asked not to be identified discussing private information."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91a3JhaW5lLXMtY2VudHJhbC1iYW5rLXNlZXMtYm90aC1wcm9taXNlcy1hbmQtdGhyZWF0cy1pbi1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Ukraine's central bank sees both promises and threats in Bitcoin - Cointelegraph",
        "content": "The National Bank of Ukraine (NBU) has expressed a mixed stance on cryptocurrencies such as Bitcoin (BTC) after a year of war in the country.\n\nThe central bank of Ukraine sees both good and bad in digital assets, taking a more skeptical approach to crypto due to financial and economic issues caused by the invasion, according to the NBU press office.\n\nIn April 2022, the NBU prohibited citizens from buying cryptocurrencies like Bitcoin using the national currency, the hryvnia (UAH), only allowing such purchases via foreign currency accounts. The central bank also set a monthly limit on such purchases, prohibiting Ukrainians from buying more crypto than 100,000 UAH ($3,300) worth per month. The restrictions also apply to cross-border peer-to-peer transactions.\n\nThe administrative restrictions involving operations with cryptocurrencies in Ukraine are temporary, a press officer for the NBU told Cointelegraph on March 9. The limits will be “gradually weakened as the functioning of the economy and financial market of Ukraine normalizes,” the NBU said, adding:\n\n“The National Bank is taking part in building a system of transparent and understandable regulation, which will contribute to the development of fair and efficient circulation of virtual assets.”\n\nAccording to the regulator, the specified restrictions were necessary for Ukraine in order to stabilize the situation in the foreign exchange market and preserve macro-financial stability.\n\n“Transactions with cryptocurrencies can be used to bypass currency regulation, in particular — as a channel for unproductive capital outflow from the country, which currently poses threats to macro-financial stability,” the NBU representative stated.\n\nRelated: Ukraine netted $70M in crypto donations since start of Russia conflict\n\nUkraine’s central bank also sees risks of “substitution of the national currency and the emergence of parallel money circulation.” According to the NBU, such risks are especially high during the war and are beyond the effective control of the regulator. “This can pose a threat to the monetary sovereignty of the state,” the NBU spokesperson noted, adding:\n\n“To minimize such risks, especially during the full-scale war, the National Bank will take a strong position on preventing the narrowing of the scope of application of the hryvnia as the only legal means of payment in Ukraine.”\n\nDespite taking a cautious approach to crypto during the war, Ukraine’s central bank is still bullish on technological innovations related to digial assets. According to the NBU, there are many promises associated with crypto, including better access to financial services, competition in the field of payment services, the attraction of investments, crypto donations and other benefits.\n\nAs such, the central bank supports the need to create “civilized conditions for the development of the virtual assets market in Ukraine,” the NBU press office stated.\n\nThe latest remarks from the NBU came soon after Yurii Boiko, commissioner of Ukraine’s National Commission on Securities and Stock Market, declared that the war had no impact on the authority’s regulatory stance. According to the official, Ukraine has continued to follow in the footsteps of the European Union concerning digital asset laws."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJhdHRsZXMtMjBrLWFzLXRyYWRlci1jYWxscy1iYW5rLWNoYW9zLTIwMDgtYWxsLW92ZXItYWdhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin battles $20K as trader calls bank chaos '2008 all over again' - Cointelegraph",
        "content": "Bitcoin (BTC) struggled to reclaim $20,000 support at the March 10 Wall Street open as fears mounted over Silicon Valley Bank (SVB) contagion.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nTrader targets $18,000 BTC price\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it nursed fresh losses, reaching $19,569 on Bitstamp.\n\nThe pair had seen further downside prior to the open as embattled SVB Financial saw another 60% wiped off its stock price.\n\nIn a move that mimicked crypto exchange banking partner Silvergate, SVB also began to spark knock-on effects for non-United States banks on the day.\n\nFor Cointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, the writing was on the wall.\n\n“First it was Silvergate, then Silicon Valley Bank and now First Republic Bank. All sinking massively on the markets. It’s 2008 all over again,” he summarized.\n\nWith that, U.S. equities started the March 10 session in the red as nervous traders waited to see the full extent of the SVB contagion.\n\nIs a banking crisis beginning to hit?\n\nJapanese banks DOWN 5%-6.2%.\n\nBank of America DOWN 6.2%\n\nBarclays DOWN 6.2%\n\nJPM DOWN 5.4%\n\nWells Fargo DOWN 6.13%\n\nThe dogs which are not barking in the night are Eurozone G-SIBs... Yet! — Alasdair Macleod (@MacleodFinance) March 10, 2023\n\n“Both Silvergate and Silicon Valley seemingly invested in low yield treasuries before the Fed tightening cycle... treasuries that nobody would want to buy now with ‘risk free’ treasuries at 5% directly from the government,” part of comments by trader and analyst Scott Melker stated.\n\n“They were forced to sell at a steep discount, taking on massive losses. This further shakes the market faith, causes more withdrawals and leads to insolvency.”\n\nMelker said that the setup was a “slippery slope.”\n\nIn terms of BTC price action, van de Poppe, meanwhile, eyed levels as low as $18,000 for a potential long entry. Above $20,000, on the other hand, was now a short opportunity.\n\nLevels I'd be looking at with #Bitcoin:\n\n\n\n- Potential shorts around $20.6K and/or $21.4K.\n\n- Potential longs at $18.1-18.6K including bull. divs and/or HL confirmation. pic.twitter.com/CifRSlaHQW — Michaël van de Poppe (@CryptoMichNL) March 10, 2023\n\nCommentators see Fed pivot pressure building\n\nA silver lining came in the form of what markets commentator Holger Zschaepitz described as “mixed” U.S. jobs data, helping allay fears of a significant policy shift by the Federal Reserve.\n\nRelated: Why is Bitcoin price down today?\n\n“Traders are now pricing in a 25bps hike from the Fed in March following today’s jobs data. Previously, 50bps was priced,” popular analytics account Tedtalksmacro added on Twitter, also calling the data a “mixed bag.”\n\nData from CME Group’s FedWatch Tool confirmed the switch-around in market expectations for the upcoming Federal Open Market Committee (FOMC) meeting due March 22.\n\nFed target rate probabilities chart. Source: CME Group\n\nFor some, however, the extent of the SVB crisis was reason to believe that the Fed would have no choice but to abandon its monetary tightening and “pivot” on interest rate hikes.\n\n“SVB dealing with a full blown run on the bank. The bad news is this is going to accelerate very quickly into a systemic crisis,” crypto entrepreneur David Bailey reacted.\n\nHe added, “The good news is the Fed will have no choice but to pivot imminently or risk imploding the entire financial system.”\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNsaXBzLXVuZGVyLTIway1hbWlkLWJpZGVuLWJ1ZGdldC1zaWx2ZXJnYXRlLWNvbGxhcHNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Breaking: Bitcoin slips under $20K amid Biden budget, Silvergate collapse - Cointelegraph",
        "content": "Bitcoin (BTC) briefly slipped below $20,000 for the first time in nearly two months, following the latest budget from United States President Joe Biden and the collapse of “crypto-bank” Silvergate.\n\nThe price of BTC dipped to $19,945 on March 10 before recovering to hover just above $20,000, according to data from CoinMarketCap.\n\nBitcoin had a stellar start to 2023 but fell as much as 5% in an hour on March 3 amid uncertainty at Silvergate. The price doesn’t appear to have been able to lift since.\n\nPrice chart of Bitcoin over the last seven days. Source: Cointelegraph Markets Pro\n\nThe announcement that Silvergate Bank, one of the key banks in the United States that services crypto firms, had entered into voluntary liquidation on March 8 has emerged as a possible strong headwind for the crypto industry.\n\nRelated: Bitcoin price drops to $20.8K as regulatory and macroeconomic pressure mounts\n\nMeanwhile, a supplementary budget explainer paper on March 9 revealed that United States crypto miners could eventually be subject to a 30% tax on electricity costs under a Biden budget proposal that aims to “reduce mining activity.”"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRtZXgtY28tZm91bmRlci1hcnRodXItaGF5ZXMtcHJvcG9zZXMtYml0Y29pbi1iYXNlZC1zdGFibGVjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "BitMEX co-founder Arthur Hayes proposes Bitcoin-based stablecoin - Cointelegraph",
        "content": "While United States regulators increasingly scrutinize stablecoins, the community continues to pitch new ideas for stablecoins independent of the U.S. dollar.\n\nArthur Hayes, co-founder and former CEO of BitMEX cryptocurrency exchange, has proposed creating a new stablecoin with a value pegged to the sum of $1 worth of Bitcoin (BTC) and one inverse perpetual swap of BTC against USD. He outlined the idea of the potential Satoshi Nakamoto Dollar (NUSD), or NakaDollar, in a blog post titled “Dust on Crust” on March 8.\n\nUnlike major reserve-backed U.S. dollar-pegged stablecoins like Tether (USDT) and USD Coin (USDC), the proposed NakaDollar will not depend on any USD reserves, but solely upon derivatives exchanges that list liquid inverse perpetual swaps, Hayes said.\n\nThe proposed stablecoin would be explicitly based on a set of short BTC positions and USD inverse perpetual swaps, maintaining its 1:1 peg to the U.S. dollar via mathematical transactions between the new decentralized autonomous organization (DAO) — NakaDAO — authorized participants and derivatives exchanges.\n\nThe process of creating the NakaDollar stablecoin will be entirely free from any movements of USD, which require the services of banks, Hayes stated. He still noted that the proposed NUSD stablecoin would not be decentralized, adding:\n\n“The points of failure in the NakaDollar solution would be centralized crypto derivatives exchanges. I excluded decentralized derivative exchanges because they are nowhere near as liquid as their centralized counterparts [...]”\n\nThe news comes amid the owner of Silvergate Bank, a major crypto-focused bank in the United States, shutting operations and liquidating business amid the ongoing market downturn. The shutdown came quickly after the New York Department of Financial Services abruptly ordered the Paxos Trust Company to stop the issuance of Binance USD (BUSD), one of the largest U.S. dollar-pegged stablecoins on the market. As previously reported, Paxos held deposits in several banks, including Silvergate and Signature.\n\nRelated: ​​Stablecoins and Ether are ‘going to be commodities,’ reaffirms CFTC chair\n\nHayes is not alone in considering USD-independent stablecoins amid the ongoing pressure from regulators. In February, Binance CEO Changpeng Zhao suggested that the cryptocurrency industry will likely move to other fiat currencies as a base for stablecoins, including euro, yen, or Singapore dollars."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZhbGxzLXRvLWEtbXVsdGktbW9udGgtbG93LWJ1dC1kYXRhLXBvaW50cy10by1hLXBvc3NpYmxlLXNob3J0LXRlcm0tYm91bmNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin price falls to a multi-month low, but data points to a possible short-term bounce - Cointelegraph",
        "content": "March started off on a low due to a resurrection of inflationary fears. On March 7, hawkish comments from United States Federal Reserve chairman Jerome Powell amplified the market’s expectation of a 50-basis point hike in the upcoming policy rate meeting on March 22 to March 23.\n\nOn March 8, the U.S. government’s $1 billion Bitcoin (BTC) transfer of assets seized from Silk Road sparked fears of a sell-off. Later on the same day, the largest crypto-friendly bank confirmed its collapse and planned to liquidate its crypto positions voluntarily. The week’s events sent Bitcoin to a two-week low of $20,050.\n\nA spike in negative sentiment may preclude a bounce\n\nThe flurry of bad news and price drops caused a significant dip in CryptoQuant's Coinbase premium index, which measures the difference in trading prices on Coinbase and Binance. Higher prices indicate stronger demand in the U.S. versus the rest of the world. The premium dipped to a two-month low on the morning of March 9 as negative news piled on.\n\nCoinbase premium index. Source: CryptoQuant\n\nOn-chain analytics firm Santiment reported fear, doubt and uncertainty (FUD) settling in the markets, increasing the “probabilities” of contrarian price bounces during this “period of disbelief.“\n\nHowever, the funding rate for BTC perpetual swaps is still neutral, with no major liquidations in the futures market. It doesn’t show considerable negative bias to suggest the possibility of a short squeeze. The Fear and Greed Index also slipped to two-month lows of 44 but stayed well above historic bounce levels between 10 to 25. This suggests that any positive rallies are likely to be short-lived.\n\nBesides negative sentiment, on-chain data shows positive accumulation among the most critical stakeholders, miners and whales. The holdings of Bitcoin miners have been on the rise since the start of 2023, heading for a six-month peak. Glassnode data also shows an increase in the number of Bitcoin wallets with more than 1,000 BTC.\n\nThe holdings of one-hop BTC miner addresses. Source: Coinmetrics\n\nThe on-chain Realized Price of BTC, which represents the average daily dollars moved through the Bitcoin network, currently sits at $19,800. Historically, this on-chain metric has formed a crucial bull-bear pivot line. If the prices slide back below this level, it could invalidate the early 2023 gains and throw the market back into a long-term bearish trend.\n\nThe elephant in the room: Fed rate hikes\n\nThe Fed’s upcoming rate hike is the most important piece of the puzzle that traders need to solve before placing their bets. A higher Consumer Price Index print on March 14 could send the global markets to a risk-off environment heading to the Fed meeting later in the month.\n\nRelated: Fed signals a sharp rate hike in March due to inflation — Here’s how Bitcoin traders can prepare\n\nTechnically, the BTC/USD broke below February lows of $21,400, triggering wider sell-off toward the $20,650 support level. The pair can slip back into a bear trend toward 2022 lows if this support breaks. Consecutive daily closes below this level will be a strong bearish sign.\n\nBTC/USD daily price chart. Source: TradingView\n\nThe compilation of negative news over a bearish macroeconomic setting has led to an increase in market volatility, which could likely fuel a short-term upside bounce. However, the market’s reaction to the CPI print and Fed’s policy rate decision in during March remain crucial to momentum traders.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zYXRvc2hpY2hhaW4tYnJpbmdzLWJpdGNvaW4tZGVmaS1hbm5vdW5jZXMtMTUwMDAwMDQ1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "SatoshiChain Brings Bitcoin to DeFi; Announces Mainnet Launch Date and Upcoming Airdrops - Yahoo Finance",
        "content": "SatoshiChain\n\nVictoria, Seychelles, March 09, 2023 (GLOBE NEWSWIRE) -- SatoshiChain, the blockchain platform that brings Bitcoin to DeFi, has announced that its Mainnet will officially launch on June 1st, 2023. The launch marks a significant milestone for SatoshiChain and its community, as it enables users to fully utilize the blockchain's features and benefits, including decentralized applications and smart contracts.\n\n\"We are thrilled to announce the official launch date of the SatoshiChain Mainnet,\" said Christopher Kuntz, a co-founder of SatoshiChain. \"Our team has been working tirelessly on this project for quite some time, intent on bridging the gap between bitcoin and EVM chains in a way that is not only fast and secure but also user-friendly and developer-friendly at the same time.\"\n\nSatoshiChain is designed to enable fast, secure, and low-cost transactions while supporting a range of use cases, including DeFi, gaming, supply chain management, and more, with all transactions, gas fees, and smart contracts powered by bridged BTC as the base layer token. The Mainnet will be fully compatible with EVM-compatible blockchains, allowing users to easily migrate their Ethereum-based decentralized applications to the SatoshiChain platform. The platform also provides users with a suite of resources to build and deploy their own decentralized applications.\n\nPrior to the Mainnet launch, SatoshiChain is launching the Incentivized Testnet: an airdrop of SatoshiChain Governance tokens ($SC) for early adopters and Testnet participants. The airdrop is a way to reward the community for their support and participation in the development and testing of the chain. Users who participated in the airdrop process by completing various tasks before the Mainnet launch will be eligible to receive $SC tokens. Details about the Incentivized Testnet and airdrop are available on the SatoshiChain website and social media channels.\n\nSatoshiChain's commitment to creating a decentralized future is reflected in its efforts to provide a reliable and efficient blockchain platform that is accessible to everyone with the goal of multi-chain interoperability. With the initial Mainnet launch, SatoshiChain is taking a significant step towards achieving this goal.\n\nStory continues\n\nAbout SatoshiChain\n\nSatoshiChain is a blockchain platform that enables fast, secure, and low-cost transactions while supporting decentralized applications and smart contracts with bridged bitcoin as the base layer token. The platform is fully compatible with EVM-compatible blockchains, making it easy for users to migrate their decentralized applications from other platforms. SatoshiChain is committed to creating a decentralized future by providing a reliable and efficient blockchain platform that is accessible to everyone.\n\nTo learn more about SatoshiChain and get involved, please visit the website at https://satoshichain.net/\n\nCONTACT: For media inquiries, please contact: Name: Christopher Kuntz Email: info(at)satoshichain.net\n\n\n\n"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4taGFzaHByaWNlLWRyb3BzLWFzLW1pbmVycy1mYWNlLXBvc3NpYmxlLTMwLWVuZXJneS10YXgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin hashprice drops as miners face possible 30% energy tax - CryptoSlate",
        "content": "Bitcoin’s (BTC) hashprice has significantly plummeted in recent weeks, dropping to its early January levels — a potential sign that the mining bull run might be over.\n\nHashprice measures the market value for each unit of hashing power. BTC’s price determines Hashprice’s value alongside the network difficulty and transaction fees.\n\nWith BTC’s network difficulty soaring to new all-time highs and the asset’s value dropping to a two-month low, miners could face a hard time as hashprice fell to $61.38/P.H./Day, according to hashrate index data.\n\nWhat does this mean for miners?\n\nHashrate Index researcher Jaran Mellerud said Bitcoin’s mining difficulty and hashrate soared by over 20% in 2023 following the digital asset improved price performance.\n\nHe noted that BTC’s performance incentivized many marginal operators to turn on their machines, which increased market competition.\n\nHowever, the flagship digital asset’s crash below $20,000 has erased half of the gains it made in 2023. This means miners face a 2022-like situation where BTC’s falling value made mining unprofitable.\n\nMellerud highlighted that BTC’s hashrate would likely increase as more miners plug in their machines in the coming months. Already, several miners have revealed intentions to increase their mining capacity by bringing more devices online.\n\nMellerud added:\n\n“If hashprice is to stay at the current level, the Bitcoin price must increase considerably… The recent hashprice development shows the importance of hedging revenues.”\n\nMiners face a 30% crypto-mining tax\n\nU.S.-based BTC miners’ situation could be compounded by the proposed 30% taxation on all energy costs involved in cryptocurrency mining.\n\nU.S. President Joe Biden’s 2024 budget plan included a new tax proposal on crypto mining. The government said crypto mining activities require colossal energy usage and could hurt the environment. It added that mining activities could raise electricity prices and cause uncertainties around local energy utilities.\n\nThe CEO of Satoshi Act Fund, Dennis Porter, described the proposal as “unfair and targeted discrimination.” He added that the taxation would “effectively kill Bitcoin mining in the USA.”\n\nPublic miners’ stock tank\n\nFollowing the series of events, the stocks of several Bitcoin miners have tanked in the last 24 hours.\n\nAccording to Google Finance data, Riot’s stock is down 12.22% to $5.53, while Hut 8 shares fell 14% to $1.75. Marathon Digital and Canaan also saw their shares decline by 11% and 7%, respectively.\n\nMentioned in this article"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL3RoZS1iaWdnZXN0LWNyeXB0by1oZWlzdHMtb2YtYWxsLXRpbWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "17 biggest crypto heists of all time - Cointelegraph",
        "content": "Let's take a look at the biggest crypto thefts of all time in this article. Also, the article will outline why crypto exchanges keep getting hacked; why are crypto heists getting larger and what we can do to protect ourselves from crypto heists.\n\nDue to the funds being placed digitally (most of the time), hackers find it easier to steal virtual currencies than physical cash. Also, cryptocurrencies stored in huge sums can be transferred anonymously, leading to major heists in the crypto industry.\n\nBitcoin ( BTC ) came into the picture after the Global Financial Crisis of 2008-09 to prevent the world from financial crises in the future. However, as evidenced by various cryptocurrency scams since their introduction to the world, cryptocurrencies also do not provide enough security to the users' funds.\n\nCrypto fraudsters, especially scammers, prey on naive buyers in the physical world by reading the fine print in contracts.\n\nWhat are the biggest cryptocurrency heists in history?\n\nThe biggest crypto heists to date are MT Gox, Linode, BitFloor, Bitfinex, Bitgrail, Coincheck, KuCoin, PancakeBunny, Poly Network, Cream Finance, BadgerDAO, Bitmart, Wormhole, Ronin network, Beanstalk, Harmony Bridge, and FTX.\n\nMT Gox\n\nMt. Gox remains the greatest cryptocurrency robbery in history, with over 850k Bitcoin stolen between 2011 and 2014. Mt. Gox claimed that a fault that caused the loss is due to an underlying bug in Bitcoin, known as transaction malleability. Transaction malleability is the process of altering a transaction's unique identifier by altering the digital signature that was used to produce it.\n\nIn September 2011, it was discovered that MtGox's private keys were compromised, and the firm did not use any auditing techniques to discover the breach. Furthermore, because MtGox re-used Bitcoin addresses regularly, the stolen set of keys was used to steal new deposits constantly, and by mid-2013, over 630k BTC had been taken from the exchange. Surprisingly, WizSec (a group of Bitcoin security specialists) claims that proof of ongoing theft may be gleaned from blockchain transactions to support this assertion.\n\nMany companies use cold and hot wallets to minimize large losses, as shown with Mt. Gox. All coins are transmitted to the exchange's cold wallet, which is manually transferred to the hot wallet as necessary. If an exchange's server is hacked, the thief can only steal money from the hot wallet, allowing the exchange to decide how many coins it is prepared to risk.\n\nLinode\n\nLinode, a web hosting firm, was utilized by Bitcoin exchanges and whales of the community to store their hot wallets. Linode was hacked in June 2011, and the virtual services that stored the hot wallets were targeted.\n\nUnfortunately, this resulted in the theft of at least 46k BTC, the actual number of which is still unknown. Bitcoinia, which lost over 43k BTC, and Bitcoin.cx, which lost 3k BTC, were among the casualties, as was Gavin Andresen (Bitcoin developer), who also lost 5k BTC.\n\nBitFloor\n\nWhile these thefts are less severe, high-impact Bitcoin burglaries have continued, with 24k BTC stolen from BitFloor in May 2012. An attacker gained access to an unprotected (i.e., unencrypted) backup of wallet keys and stole the virtual currency worth roughly a quarter-million dollars in the crime. As a result, BitFloor creator Roman Shtylman decided to shut down the exchange.\n\nBitfinex\n\nThe usage of multisig (the requirement of multiple keys to authorize a BTC transaction) is not a silver bullet in and of itself, as evidenced by another huge heist at Bitfinex, which resulted in the theft of 119,756 BTC.\n\nBitfinex exchange had teamed up with BitGo to act as a third-party escrow for customer withdrawals. Bitfinex also appears to have chosen not to use cold wallets in order to obtain a statutory exemption from the Commodities and Exchange Act. While the idea of employing threshold signatures is appealing, it does not guarantee that the authority to authorize transactions is spread.\n\nBitgrail\n\nBitgrail was a small Italian exchange that traded in obscure cryptos like Nano (XNO), previously known as RaiBlocks. Nano was worth as little as 20 cents in November 2017; however, when prices lingered around $10, the exchange was hacked in February 2018, putting BitGrail's losses at $146 million.\n\nThe cyber theft of a cryptocurrency deceived more than 230,000 people. Unfortunately, small exchanges do not implement basic protection, such as a cold storage wallet, putting a lot of money at risk. According to the director of the national center for cyber crimes, Ivano Gabrielli, it became evident that the BitGrail CEO was implicated in the BitGrail scandal.\n\nCoincheck\n\nCoincheck, based in Japan, had $530 million worth of NEM (XEM) tokens stolen in January 2018. The identity of the Japanese hackers who broke into the security system is still a mystery.\n\nFollowing the investigation, Coincheck revealed that hackers were able to gain access to their system due to a staffing deficit at the time. The hackers were able to comprise the system successfully due to funds being kept in hot wallets and insufficient security measures in place.\n\nKuCoin\n\nKuCoin announced in September 2020 that hackers had obtained private keys to their hot wallets before withdrawing substantial quantities of Ethereum (ETH), BTC, Litecoin (LTC), Ripple (XRP), Stellar Lumens (XLM), Tron (TRX) and Tether (USDT). Lazarus Group, a North Korean hacker group, has been accused of committing a robbery on cryptocurrency exchange KuCoin, resulting in a $275 million loss of funds. However, the exchange was able to recoup approximately $240 million in payments later.\n\nPancakeBunny\n\nThe flash loan attack, in which hackers were able to siphon $200 million from the platform, occurred in May 2021 and is among the more severe cases of cryptocurrency theft. The hacker loaned a big sum of Binance Coin (BNB) before manipulating its price and selling it on PancakeBunny's BUNNY/BNB market to carry out the attack.\n\nA flash loan must be borrowed out before repaying the amount all at once. The hacker obtained a large number of BUNNY via a flash loan, then dumped all of the BUNNY on the market to lower the price, and then repaid the BNB using PancakeSwap.\n\nPoly Network\n\nIn August 2021, a hacker stole approximately 600 million USD worth of digital tokens in one of the greatest cryptocurrency thefts ever. A hacker known as \"Mr. White Hat\" exploited a weakness in the network of Poly Network, a DeFi platform.\n\nThe narrative has gotten stranger by the day since the initial theft. Mr. White Hat not only maintained a public and consistent dialogue with Poly Network, but they also returned everything that had been stolen a week later, except $33 million in Tether (USDT) that had been frozen by the issuers.\n\nMr. White Hat was once given a 500,000 USD prize for returning all stolen cash, as well as a job offer to become Poly Network's senior security officer.\n\nCream Finance\n\nThe hackers stole $130 million in Cream Finance's October 2021 incident. It was Cream Finance's third cryptocurrency robbery of the year in which hackers took $37 million in February 2021 and $19 million in August 2021.\n\nThe monies appear to have been obtained through a flash loan in a highly complicated transaction costing over 9 ETH in gas and involving 68 different assets. The attacker used MakerDAO's DAI to produce a huge number of yUSD tokens while also taking advantage of the yUSD price oracle computation.\n\nConsequently, on the Ethereum network, they were able to take all of Cream Finance's tokens and assets, totaling $130 million.\n\nBadgerDAO\n\nA hacker succeeded in stealing assets from multiple cryptocurrency wallets on the DeFi network, BadgerDAO, in December 2021. The incident is related to phishing when a malicious script was injected into the website's user interface via Cloudflare.\n\nThe hacker exploited an application programming interface (API) key to steal $130 million funds. The API key was created without the knowledge or permission of Badger engineers to inject malicious code into a fraction of its clients regularly. However, about $9 million was recovered as the hackers were yet to withdraw funds from Badger's vaults.\n\nBitmart\n\nIn December 2021, a hack of Bitmart's hot wallet resulted in the theft of about $200 million. At first, it was thought that $100 million had been stolen via the Ethereum blockchain, but additional research found that another $96 million had been stolen via the Binance Smart Chain blockchain.\n\nOver 20 tokens were taken, including altcoins such as BSC-USD, Binance Coin (BNB), BNBBPay (BPay), and Safemoon, as well as substantial quantities of Moonshot (MOONSHOT), Floki Inu (FLOKI) and BabyDoge (BabyDoge).\n\nWormhole\n\nAn attack on Wormhole, the Ethereum and Solana bridge, defrauded users of an estimated $328 million, ranking as the fourth-largest breach in the history of DeFi. The attacker used minted tokens to claim ETH that was held on the Ethereum side of the bridge by exploiting a mint function on the Solana side of the Wormhole bridge to create 120,000 wrapped Ethereum (wETH) for themselves, according to CertiK's (blockchain security and smart-auditing company) preliminary investigation.\n\nRonin Network (Axie Infinity)\n\nRonin Network, a cryptocurrency network focused on gaming, revealed on March 29, 2022, that it had been hacked and that a staggering $620 million had been lost. According to Etherscan, an attacker \"used hacked private keys to generate bogus withdrawals\" from the Ronin bridge over two transactions. The popular Axie Infinity game's publishers, Sky Mavis, and the Axie DAO were impacted by the exploit on Ronin validator nodes.\n\nBeanstalk\n\nThe governance protocol of Beanstalk, an Ethereum-based stablecoin platform, was the target of an attack in April 2022. The value kept in the Beanstalk protocol was given to the Ukraine fund after the fraudulent proposal was implemented, and the attacker(s) utilized it to repay their flash loan. Out of the $181 million that was stolen in the end, the assailant made a profit of $76 million.\n\nHorizon Bridge (Harmony)\n\nIn June 2022, hackers broke into Harmony Protocol, which allows transactions between Ethereum, Binance, and Bitcoin blockchains. They stole $100 million worth of cryptocurrencies, including ETH, Binance Coin (BNB), USDT, USD Coin (USDC), and Dai.\n\nFTX\n\nHackers stole $323 million from the Bahamas-based parent business FTX.com, $2 million from Alameda Research, and $90 million from its US platform in November 2022. However, FTX claimed to have recovered $1.7 billion in cash, $3.5 billion in purportedly liquid cryptocurrencies, and $300 million in liquid equities."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWxldmVscy10by13YXRjaC1hcy10cmFkZXItc2F5cy1saWdodHMtb3V0LWJlbG93LTIxLTZr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin price levels to watch as trader says 'lights out' below $21.6K - Cointelegraph",
        "content": "Bitcoin (BTC) rested at multi-week support at the March 9 Wall Street open as concerns over a deeper BTC price drop increased.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nTrader: $19,700 “on the table”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD circling $21,800 on Bitstamp.\n\nWith $22,000 in danger of flipping from support to resistance, popular trader Pentoshi was among those warning that further undoing of support may come next.\n\n“We made it. Best r/r currently however not a fan of the slow bleed. Would have liked a SFP (one may still come),” he wrote in an update on a prior BTC price forecast.\n\n“Below this can get ugly w 19.7-20.5k on the table.”\n\nBTC/USD annotated chart. Source: Pentoshi/Twitter\n\nAn accompanying chart showed the significance of the current spot price zone within Bitcoin’s broader range — and the potential consequences of the range were lost.\n\nTrader and commentator Nunya Bizniz flagged a similarly bearish signal currently playing out in the form of Bitcoin’s 200-day exponential moving average (EMA).\n\nBased on historical patterns, he warned, room for losses clearly remained.\n\nBTC daily:\n\n\n\nBack above 200ema after low.\n\n\n\nOnce this has occurred the bottom is generally in.\n\n\n\nTwice price never looked back and now for the 3rd time price has fallen back below.\n\n\n\nWhat price may look like based on 2012 & 2015.\n\n\n\n$17K to $15K revisited? pic.twitter.com/LOnA0RRHcO — Nunya Bizniz (@Pladizow) March 9, 2023\n\nThe 200-day EMA also featured in the roadmap of fellow popular trader and commentator Pierre, who inferred that there would be little stopping BTC/USD from dropping to its 100-day MA should a breakdown now ensue.\n\nBTC/USD annotated chart. Source: Pierre/Twitter\n\nDollar dips after resistance rematch\n\nData from the Binance order book, meanwhile, showed the “busy” area of bid and ask liquidity surrounding spot price.\n\nRelated: Bitcoin keeps liquidating longs as BTC price action gives up $22K support\n\nWith fresh United States jobs data due, monitoring resource Material Indicators was bracing for volatility, this as yet remaining absent.\n\nIn a glimmer of hope on the day, macro markets began climbing on the Wall Street open, with the U.S. dollar losing ground gained earlier in the week.\n\nThe U.S. Dollar Index (DXY) was down 0.4% at the time of writing, while the S&P 500 and Nasdaq Composite Index both aimed for 0.5% increases.\n\nU.S. Dollar Index (DXY) 1-hour candle chart. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTA5L2NyeXB0by1leGNoYW5nZS1rdWNvaW4tc3VlZC1pbi1uZXcteW9yay1zLWNyYWNrZG93bi1vbi1pbmR1c3RyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Crypto Exchange KuCoin Sued in New York's Industry Crackdown - Bloomberg",
        "content": "New York Attorney General Letitia James is taking another swing at the digital asset industry with a lawsuit against KuCoin, one of the largest and most popular crypto exchanges.\n\nJames alleges KuCoin cannot legitimately claim to be an exchange because it isn’t registered with the US Securities and Exchange Commission or properly designated by the Commodity Futures Trading Commission as required under New York law. “Today’s action is the latest in our efforts to rein in shadowy cryptocurrency companies and bring order to the industry,” James said in a statement."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1wcmljZS1zaWx2ZXJnYXRlLWNyeXB0by1iYW5rLWIyMjk3MTQyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin price takes a dive as crypto bank liquidates - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThe price of bitcoin is once again on the slide after another crypto-friendly institution announced plans to liquidate.\n\nSilvergate Bank said that it would begin winding down operations in accordance with applicable regulatory processes, claiming that all customer funds would be repaid.\n\n“In the light of recent industry and regulatory developments, Silvergate believes that an orderly wind down of bank operations and a voluntary liquidation of the bank is the best path forward,” the company announced in a statement published on Wednesday evening.\n\n“The bank’s wind down and liquidation plan includes full repayment of all deposits.”\n\nBitcoin suffered a minor flash crash following the announcement, having already begun to dip in price when concerns about the bank first began to surface last week.\n\nSince the start of the month, the world’s biggest cryptocurrency is down 8 per cent, having fallen below $21,700 on Thursday morning.\n\nSeveral other leading cryptocurrencies, including Ethereum (ETH), Cardano (ADA) and Dogecoin (DOGE) also saw notable losses, pushing the overall crypto market cap below $1 trillion for the first time since mid February.\n\n( )\n\nThe demise of one of the most prominent banks within the cryptocurrency industry, coming less than a year after the collapse of leading exchange FTX, has once again raised concerns about the health of the crypto sector in the US.\n\n“As the impact of FTX’s collapse continues to ripple outward, today we are seeing what can happen when a bank is over reliant on a risky, volatile sector like cryptocurrencies,” Ohio Democrat Senator Sherrod Brown said in a statement.\n\n“I’ve been concerned that when banks get involved with crypto, it spreads risk across the financial system and it will be taxpayers and consumers who pay the price. That’s why I am continuing to work with my colleagues in Congress and financial regulators to establish strong safeguards for our financial system from the risks of crypto.”\n\nSome industry commentators claimed the bank’s downfall was related to issues with the broader financial sector, rather than being specific to cryptocurrency.\n\n“The problem is not about crypto, but concentration risks,” Sheila Warren, CEO of the Crypto Council for Innovation, told The Independent.\n\n“In this case, this is a voluntary wind down under California law, which implies that they will be able to make depositors whole. Neither taxpayer money, nor the FDIC [Federal Deposit Insurance Corporation], are involved.\n\n“Hopefully, this situation serves as a needed reminder to regulators of the risk of concentration, which is certainly not unique to the crypto industry, and will cause them to encourage responsible distribution across the banking sector.”"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kb2dlY29pbi1oaXRzLTQtbW9udGgtbG93cy12cy1iaXRjb2luLTUwLWRvZ2UtcHJpY2UtcmVib3VuZC1ub3ctaW4tcGxhedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Dogecoin hits 4-month lows vs. Bitcoin — 50% DOGE price rebound now in play - Cointelegraph",
        "content": "Dogecoin (DOGE) pared some losses versus Bitcoin (BTC) on March 10, a day after the DOGE/BTC pair fell to its lowest level since October 2022. Can the DOGE price see an extended rebound ahead?\n\nOn the daily chart, the DOGE/BTC pair reached 331 sats, up 4.75% compared to the previous day’s low of 316 sats. The bounce occurred around a multimonth descending trendline, which has capped the pair’s downside moves since November 2022.\n\nDOGE/BTC daily price chart. Source: TradingView\n\nDOGE price vs. BTC\n\nInterestingly, the DOGE/BTC descending trendline appears to be part of a prevailing falling wedge pattern. Traditional chart analysts consider the falling wedge a bullish reversal setup, notably because of the pattern’s 62% success rate in meeting its upside price targets.\n\nIn Dogecoin’s case, the price is wobbling around its falling wedge’s apex point, where its upper and lower trendlines converge. DOGE’s latest rebound from the lower trendline increases its possibility of testing the upper trendline for a breakout, as illustrated in the chart below.\n\nDOGE/BTC daily price chart featuring falling wedge breakout. Source: TradingView\n\nThe upside setup further draws support from the DOGE/BTC’s daily relative strength index (RSI), with a reading of around 28. From a technical perspective, an RSI below 30 means the pair is oversold, which could prompt its price to consolidate sideways or rebound.\n\nIn the event of a breakout, DOGE/BTC can rise toward 500 sats by April, up 50% from current price levels. The upside target is measured after adding the maximum distance between the falling wedge’s upper and lower trendline to the breakout point.\n\nHowever, a decisive drop below the falling wedge’s lower trendline risks invalidating the whole upside setup. Instead, DOGE can drop toward 280 sats, a historical support level down around 13% from current price levels.\n\nSuch a scenario is possible given Dogecoin’s stint with a failed falling wedge pattern in March 2022, where the DOGE/USD pair broke below the lower trendline — 50% losses followed.\n\nWhich way for DOGE price?\n\nHowever, Dogecoin could still fall in U.S. dollar terms, mainly due to increasing macroeconomic uncertainty.\n\nIn recent years, the Dogecoin price rallied primarily on the heels of news-driven events and Elon Musk’s support, including hopes of a DOGE payment option on Twitter.\n\nRelated: Why is the crypto market down today?\n\nHowever, Musk said on March 3 that he would shift his focus from cryptocurrencies to artificial intelligence. The billionaire entrepreneur didn’t name Dogecoin specifically, but many interpreted that Musk may distance himself from the industry moving forward.\n\n“I used to be in crypto, but now I got interested in AI\" — Elon Musk (@elonmusk) March 3, 2023\n\nThe price of Dogecoin has dropped by more than 20% to $0.06 since Musk’s tweet. Moreover, from a technical perspective, the price is well-positioned to drop by another 10% in the coming weeks in a retest of an old support level at around $0.055–0.042.\n\nDOGE/USD weekly price chart. Source: TradingView\n\nConversely, a bounce from the support range could have DOGE’s price rally test the triangle’s upper trendline at around $0.076, resulting in gains of approximately 15% from current price levels.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tc2VsbC1vZmYtZGVjb2RlZC1iaXRjb2luLWRvd24tMTktZnJvbS1pdHMtMjAyMy1oaWdocy1uZWFycy10aGUtdXNkLTIwMDAwLW1hcmsvdmlkZW9zaG93Lzk4NTQwNDA3LmNtc9IBogFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tc2VsbC1vZmYtZGVjb2RlZC1iaXRjb2luLWRvd24tMTktZnJvbS1pdHMtMjAyMy1oaWdocy1uZWFycy10aGUtdXNkLTIwMDAwLW1hcmsvYW1wX3ZpZGVvc2hvdy85ODU0MDQwNy5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Crypto sell-off decoded: Bitcoin down 19% from its 2023 highs, nears the USD 20,000 mark - The Economic Times",
        "content": "Find this comment offensive?\n\nChoose your reason below and click on the Report button. This will alert our moderators to take action\n\nName\n\nReason for reporting:\n\nFoul language\n\nSlanderous\n\nInciting hatred against a certain community"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLWZvcmthc3QtNTAwLW5mdC0wOTUxNDY0MzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether, Forkast 500 NFT index close lower on the day - Yahoo Finance",
        "content": "Bitcoin and Ether tumbled during Asia trading hours on Friday afternoon, with Dogecoin leading losses among the top 10 largest non-stablecoin cryptocurrencies by market capitalization, pressured by crypto bank Silvergate’s liquidation announcement, and a new U.S. tax proposal on crypto mining. Equities also weakened, pressured by the prospect of higher-than-expected interest rates and a tighter U.S. labor market. The Forkast 500 NFT index also closed lower on the day.\n\nSee related article: Bank bust\n\nFast facts\n\nBitcoin fell by 7.96% in the past 24 hours, to trade at US$19,929 by 4:30 p.m. in Hong Kong. Ether lost 8.2% to change hands at US$1,409, according to CoinMarketCap data.\n\nBitcoin and Ether, the two largest cryptocurrencies, were pressured by crypto bank Silvergate Capital’s announcement to cease operations and liquidate its banking unit. Crypto investors also reacted to the administration of U.S. President Joe Biden proposing an excise tax on crypto mining equal to 30% of the electricity cost used.\n\nThe crypto fear and greed index, which measures crypto market sentiment, declined to 34, its lowest since Jan. 13 and reflected market concern among investors.\n\nDogecoin was the worst performer of the day, losing 8.58% to trade at US$0.06546, followed closely by the Shiba Inu token, which fell 8.09% to US$$0.00001007.\n\nThe global crypto market cap decreased 6.62% over the last 24 hours to US$928.9 billion, with the total crypto market volumes rising by 60.53% to US$69.37 billion.\n\nThe Forkast NFT 500 index fell 1.7% to 4,164.86 over the last 24 hours, with Moonbirds down 12.77% as the biggest decliner, followed by the Bored Ape Kennel Club that lost 17.91%. The Forkast NFT 500 Index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day.\n\nAsian equity markets weakened, mirroring Wall Street’s overnight downtrend, amid mounting concern that the U.S. Fed’s key interest rate will end up higher than expected, combined with a tighter U.S. labor market.\n\nJapan’s Nikkei 225 fell 1.67%, the Shanghai Composite Index lost 1.4%, the Shenzen Component declined 1.19% and Hong Kong’s Hang Seng Index ended the day 3.04% lower, its lowest close in 11 weeks.\n\nEuropean stocks also tumbled on Friday. The STOXX 600 fell 1.7% and Germany’s DAX 40 lost 1.81%, as investors worldwide remained cautious after shares of Silicon Valley Bank (SVB), a major lender to technology startups, plunged more than 60% on Thursday. The SVB chaos led to four of the biggest U.S. banks losing more than US$50 billion in market value.\n\nThe U.S. Bureau of Labor Statistics is scheduled to release its February job report on Friday, which will include two key metrics that may provide hints on the Fed’s upcoming decision on interest rates, unemployment and nonfarm payroll. Analysts are forecasting 225,000 new jobs added, according to CNBC.\n\nSee related article: CFTC chair calls Ethereum a commodity, in contrast to SEC chair Gensler’s position\n\n(Updates to the ninth bullet to add information on Silicon Valley Bank jitters and adds corrections to unemployment data in the last bullet.)"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pbnZlc3RvcnMtbWlnaHQtaGF2ZS1hdm9pZGVkLWZ0eC1pZi10aGUtc2VjLWhhZC1hZGRyZXNzZWQtYml0Y29pbi1ldGZzLXNheXMtYml0Z28tY2Vv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Investors might have avoided FTX if the SEC had addressed Bitcoin ETFs, says BitGo CEO - Cointelegraph",
        "content": "The collapse of crypto exchange FTX and other bearish events in the space were at the center of discussions among lawmakers and witnesses at the inaugural hearing of the United States House Committee on Financial Services’ Subcommittee on Digital Assets, Financial Technology and Inclusion.\n\nAddressing lawmakers at the March 9 hearing, BitGo co-founder and CEO Mike Belshe criticized the U.S. Securities and Exchange Commission for enforcement actions against crypto firms “trying to do it right” — i.e. communicating with regulators and pursuing a path to operate in the country. He cited BitGo’s experience going through the process of approaching the SEC in 2018, seeking a regulatory path forward on the question of how the firm should custody assets, only to wait more than four years for a definitive answer.\n\nAccording to Belshe, the SEC’s reluctance to address a “basic” regulatory issue like the issuance of a Bitcoin (BTC) exchange-traded fund could have seemingly opened the door for bad actors like Sam Bankman-Fried to operate FTX as he did. The former CEO faces charges from the SEC, the Commodity Futures Trading Commission and federal prosecutors related to transferring user funds between the exchange and Alameda Research.\n\n“You do have to wonder if we couldn’t have avoided the massive amounts of money that flowed to FTX if the basic principle of a Bitcoin ETF had been provided and approved by the SEC,” said Belshe. “There had been 25-plus valid applications — some from Invesco and other reputable firms that have done ETFs for many years in the past.”\n\nBitGo co-founder and CEO Mike Belshe addressing the Subcommittee on Digital Assets, Financial Technology and Inclusion on March 9\n\nMuch of the discussion among lawmakers and industry experts at the hearing centered around which federal agencies could regulate certain crypto assets should Congress pass related legislation. Some Republican representatives seemed to be particularly critical of the Biden administration’s approach to crypto, as evidenced in the hearing’s title calling its actions an “attack on the digital asset ecosystem.”\n\n“This report summarizes President Biden’s political plan to lawlessly abuse the administrative state to push American crypto firms and their United States customers into offshore, unregulated, opaque and unsafe markets,” said Representative Tom Emmer, citing a Jan. 27 report from the White House on mitigating the risks associated with crypto. “This administration is weaponizing the banking sector to debank legal crypto activity here in the U.S., using scare tactics to run an entire industry out of the country.”\n\n#HappeningNow: Chairman @RepFrenchHill convenes the Subcommittee on Digital Assets, Financial Technology & Inclusion for a hearing on the Biden Administration’s attack on the digital asset ecosystem.\n\n\n\nTune In https://t.co/FGQaA37IYN pic.twitter.com/DqBA6O5rcc — Financial Services GOP (@FinancialCmte) March 9, 2023\n\nOther witnesses at the hearing were more critical of crypto as a whole rather than focusing on blaming any single agency, political party or presidential administration. Representative Brad Sherman, a well-known critic of the space, referred to crypto as a “scourge” in the economic system. Lee Reiners, the policy director of the Duke Financial Economics Center, claimed thatthough FTX was one “bad apple,” the entire crypto industry was “rotten.”\n\n“Crypto and the unique nature of crypto was what fueled FTX’s rise, and it’s what made FTX collapse in the blink of an eye,” said Reiners.\n\nRelated: Samsung investment arm to launch Bitcoin Futures ETF amid rising crypto interest\n\nThe House subcommittee hearing was the first in the new session of Congress to address issues related to the crypto market and the collapse of FTX since December 2022. Lawmakers with the Senate Banking Committee held their own hearing exploring the impact of the “crypto crash” in February."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdGhuZHItZ2FtZXMtcmVsZWFzZXMtbmV3LWdhbWUtdG8tZWFybi1iaXRjb2luLWFsb25nc2lkZS1nYW1pbmctcmVwdXRhdGlvbi1zeXN0ZW0tb24tbm9zdHLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "THNDR Games Releases New Game To Earn Bitcoin Alongside Gaming Reputation System On Nostr - Nasdaq",
        "content": "THNDR's new Sudoku and Tetris inspired mobile game “Bitcoin Blocks” lets players earn bitcoin while solving puzzles.\n\nTHNDR Games has released a new Bitcoin game called Bitcoin Blocks, which allows players to test their problem-solving skills against others to win Bitcoin. The game is similar to Tetris and Sudoku, and is available on the THNDR mobile gaming platform. THNDR has also announced the Gaming Graph, a reputation and badging system that will allow players to earn badges that are tied to their identity and can be transferred to other ecosystems.\n\n“The launch of Bitcoin Blocks marks an important milestone in the development of THNDR's mobile gaming platform,” the press release sent to Bitcoin Magazine states. The game is the first to showcase THNDR's social competitive layer and features, which include Leagues, THNDR's leveling system that pits community members against each other.\n\nGaming Graph will serve as a badging and reputation system for players that is easily transferable to other environments and clients, including Nostr. Through Cameri’s NIP-58, as players advance through THNDR Leagues and achieve gaming milestones, badges will be issued to their Nostr pubkey and tied to their identity, allowing users to build a virtual reputation. These established reputations built in THNDR games may have merit or value in other communities.\n\n“We're thrilled to add Bitcoin Blocks to the THNDR platform and continue our mission of spreading Bitcoin adoption through play,” Desiree Dickerson, THNDR CEO, explained. “By combining two familiar classics - Tetris and Sudoku - we hope to reach new users traditionally underrepresented in gaming and financial access and introduce them to Bitcoin. Bitcoin Blocks marks a major milestone for THNDR, as it showcases the first of many social, competitive features on the platform.\"\n\nTHNDR plans to continue rolling out competitive gaming and social features to the platform throughout the year. The company’s most recent title “Club Bitcoin: Solitaire,” has become the highest ranking bitcoin game of all time, reaching #21 in the U.S. App Store, according to THNDR.\n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vbmV3cy55YWhvby5jb20vYml0Y29pbi1wbHVtbWV0cy04LWNyeXB0by1tYXJrZXQtMTA1MjI5OTM4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Plummets 8% as Crypto Market Falls Below $1 Trillion - Yahoo News",
        "content": "There’s more pain for Bitcoin (BTC) investors as the price of the leading cryptocurrency crashed below $20,000 on Friday.\n\nAt the time of this writing, Bitcoin is down 8.3% over the day, trading at $19,900 the level last seen on January 13, according to Coingecko.\n\nEthereum (ETH) is following a similar pattern as the price of the world’s second-largest cryptocurrency is down 9.8% in the past 24 hours, changing hands at the nearly two-month low of $1,383.\n\nIn a remarkable change in fortunes for the broader crypto market, which kicked off the year with some hefty gains, pushing Bitcoin close to $25,000, the latest downtrend also saw the wider market capitalization of all cryptocurrencies fall below $1 trillion for the first time since January 19.\n\nBitcoin, Ethereum in freefall\n\nThe industry has been hit some serious headwinds in recent weeks, with the meltdown of the crypto-friendly Silvergate Bank, which entered into voluntary liquidation on March 8, arguably one of the key drivers behind the latest downturn.\n\nSilvergate has been providing a convenient banking avenue for many crypto businesses, however, “without the ability to channel fiat currency into the crypto world, crypto looks more like a quiet pond than a sparkling fountain of innovation,” Matrixport head of research Markus Thielen said in his latest note.\n\n“Silvergate has not only been the most important link between investors who wanted to channel money into crypto exchanges, crypto hedge funds, crypto venture capital funds, and crypto projects, but the bank also offered to settle balances between Silverbank clients at any time of the day, including weekends and public holidays,” he wrote.\n\n'Crypto Friendly' Bank Silvergate to Wind Down Operations\n\nDirector of Research at Kaiko Clara Medalie echoed Thielen’s remarks, saying that “the Silvergate collapse has certainly had the largest impact on market sentiment.”\n\n“When the news first broke, markets hadn't realized the extent of Silvergate's impact on the entire crypto ecosystem, but over the past few days, traders have priced the collapse in,\" Medalie told Decrypt. \"There are wider fears that Silvergate's collapse could dampen bank's willingness to work with crypto firms, essentially pulling us back to pre-2017 when the industry struggled to form banking relationships.”\n\nAccording to the Kaiko analyst, “with fewer fiat on-ramps, institutional investors will have a harder time deploying capital in crypto markets, which could have a wider impact on liquidity and market efficiency.”\n\nBearish pressure beyond Silvergate\n\nAdding more pressure on the nascent industry, the U.S. Treasury Department on Tuesday proposed a 30% excise tax on the cost of powering Bitcoin mining facilities, while the New York Attorney General's office filed a lawsuit against cryptocurrency exchange KuCoin for allegedly violating securities and commodities laws in the state.\n\nIn the complaint, Attorney General Letitia James also alleged that Ethereum “is a speculative asset that relies on the efforts of third-party developers in order to provide profit to the holders of ETH,” and as such is a security.\n\n“It is not surprising to see the recent plunge in the crypto market. President Biden's recent proposal to impose a 30% tax to reduce mining activity within the United States has undoubtedly played a significant role in this decline,” Jeff Mei, COO of crypto exchange BTSE, told Decrypt.\n\nAccording to Mei, “this tax proposal has raised concerns among investors, who fear it could lead to decreased profitability and lower adoption of crypto mining in the U.S.”\n\nNew York Attorney General Sues KuCoin, Claims Ethereum Is a Security\n\nMei also cited the recent lawsuit filed against KuCoin by the NY Attorney General's Office and hawkish comments from Fed Chair Jerome Powell regarding a possible uptick in inflation among the reasons that have also contributed to the market's decline.\n\nAccording to the COO, all these factors combined have created “a perfect storm,” which eventually led to the crypto market's biggest crash this year.\n\nYet, BTSE remains bullish on the long-term prospects of the crypto market.\n\n“We see strides being taken in regulatory clarity and infrastructure creation around the world, especially in Asia, setting the industry on a great path for future innovation and adoption,” Mei told Decrypt."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vdS50b2RheS9wZXRlci1zY2hpZmYtc2VuZHMtd2FybmluZy10by1jcnlwdG8tY29tbXVuaXR5LWFkdmlzZXMtc2VsbGluZy1iaXRjb2luLWJ0Y9IBXmh0dHBzOi8vdS50b2RheS9wZXRlci1zY2hpZmYtc2VuZHMtd2FybmluZy10by1jcnlwdG8tY29tbXVuaXR5LWFkdmlzZXMtc2VsbGluZy1iaXRjb2luLWJ0Yz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Peter Schiff Sends Warning to Crypto Community, Advises Selling Bitcoin (BTC) - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nGold bug and economist Peter Schiff, who is well known for his vocal criticism of cryptocurrencies, especially Bitcoin, advises BTC holders to hurry and sell their BTC.\n\nAdvertisement\n\nHe warns that a \"wave of blockchain-related bankruptcies will soon crash down on cryptocurrencies, turning the crypto winter into a deep freeze.\"\n\nIf #crypto really is the future, why is #Silvergate, the premier crypto bank already a thing of the past? A wave of #blockchain related bankruptcies will soon crash down on #CryptoCurrencies, turning the crypto winter into a deep freeze. Hurry, sell your #Bitcoin and buy #gold. — Peter Schiff (@PeterSchiff) March 10, 2023\n\nPeter Schiff's son, Spencer Schiff, a Bitcoin proponent, replied that Bitcoin is a lifeboat and will not sink with some bad occurrences.\n\nSan Francisco-based company Silvergate, which has offered banking services to crypto companies since 2013, including the failed FTX exchange, said on Wednesday that it was winding down operations, citing \"recent industry and regulatory developments.\"\n\nYet during the past two weeks, as news of Silvergate Bank's problems broke, Bitcoin has been declining. The sell-off worsened overnight as Bitcoin slid below the $20,000 mark for the first time since January.\n\nBitcoin (BTC) is down 8.21% over the past day and 11.24% on the week, as the leading cryptocurrency slid to a near two-month low of $19,791 in the early hours of Friday. The majority of cryptocurrencies have meanwhile suffered significant losses on the daily and weekly timeframe.\n\nContraindication?\n\nRecall that Peter Schiff recommended that holders of Bitcoin sell in January as the price reached $18,000, in advance of the first CPI data release of the year.\n\nWhen Schiff issued his statement of caution, Bitcoin had risen from a low of about $16,000 in late December to over $18,000.\n\nOn the contrary, Bitcoin increased in value by 37.2% following Schiff's recommendation to sell it. Before the rally somewhat stalled in mid-February, Bitcoin bulls drove prices up to highs of $25,270."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy81LWNvdW50cmllcy1sZWFkaW5nLXRoZS1ibG9ja2NoYWluLWFkb3B0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "5 countries leading blockchain adoption - Cointelegraph",
        "content": "Countries lead blockchain adoption for various reasons, including recognizing its potential to transform multiple sectors of the economy, promoting innovation and economic growth, and creating a favorable regulatory environment to attract blockchain businesses.\n\nTypes of blockchain communities that lead blockchain adoption\n\nBlockchain communities refer to groups of individuals, organizations and companies involved in developing and using blockchain technology. These communities form to share knowledge, collaborate on projects and advance the adoption of blockchain technology.\n\nThere are different types of blockchain communities, including:\n\nDeveloper communities: These groups of blockchain developers work together to create protocols, programs, smart contracts and other blockchain-based projects.\n\nIndustry communities: Communities developed around specific industries or sectors, such as banking, healthcare and supply chain management, are known as industry communities. Members of these communities work together to create blockchain solutions that can handle the particular problems faced by their respective sectors.\n\nUser communities: Individuals that use blockchain-based goods or services make up these communities. They exchange information and offer feedback to enhance the usability and functionality of blockchain goods.\n\nInvestment communities: These groups have grown around blockchain-based ventures like cryptocurrency or startups that use the technology. Members of these communities engage in due diligence projects, exchanging knowledge and views about potential investment opportunities.\n\nSocial impact communities: These groups are focused on leveraging blockchain technology to solve problems in the social and environmental spheres. Members of these communities work together to develop blockchain solutions that could create a more just and sustainable world.\n\nCountries leading blockchain adoption\n\nBlockchain technology can potentially boost numerous industries’ productivity, security, and transparency, reducing costs and enhancing customer experiences. Therefore, countries are investing in developing and using blockchain technology to address different societal and economic concerns.\n\nEl Salvador\n\nEl Salvador has emerged as a global pioneer in adopting blockchain technology after becoming the first nation to recognize Bitcoin as a legal tender. In June 2021, El Salvador’s government established a law recognizing Bitcoin as a legitimate payment method for goods and services alongside the U.S. dollar, the nation’s legal currency. Through this effort, the government aimed to prioritize financial inclusion in the country, where 70% of adults do not have a bank account.\n\nThe acceptance of Bitcoin (BTC) might make El Salvador a desirable location for international investors, a benefit mentioned by the country’s president, Nayib Bukele. To encourage the widespread adoption of Bitcoin, the government implemented several actions. The $150 million trust fund in the state development bank — Banco de Desarrollo de El Salvador — was approved by the legislature’s finance commission in August 2021. It was created to allow the automatic conversion of Bitcoin to the U.S. dollar, facilitating easy exchange between the two currencies for Salvadorans.\n\nThe nation debuted its Chivo (slang for “cool”) wallet in September 2021. Each wallet contained $30 in BTC. The government has established a network of crypto automated teller machines (ATMs) in El Salvador and 50 other U.S. cities, making sending money to their families easier.\n\nIn 2022, the crypto market crash affected the price of Bitcoin badly, raising concern for the Central American country that had invested so much in the cryptocurrency. However, Bukele showed no apprehension and, on the contrary, pledged to a dollar-cost average purchase of one BTC per day to confirm continued and full support for the digital asset.\n\nRelated: What is dollar-cost averaging (DCA), and how does it work?\n\nIn January 2023, El Salvador enacted the Digital Asset Issuance Law, establishing the parameters for a “Volcano Bond”— bonds backed by Bitcoin.\n\nPortugal\n\nPortugal has proactively created a favorable environment for blockchain and cryptocurrency startups. The nation has actively used blockchain technology in public services, healthcare and supply chain management. The Blockchain Panorama platform — which intends to encourage information exchange and cooperation among participants in the blockchain business — was introduced by the Portuguese government in 2019.\n\nSince then, Bitcoiners and crypto enthusiasts have flocked to the region, attracted by a pro-crypto environment offering the chance to use BTC in real life — paying bills and taxes with the cryptocurrency. Merchants’ adoption has also increased, with Spanish startup BitBase working on bringing more Bitcoin ATMs and stores to major cities.\n\nIn 2021, the Portuguese government approved a decree establishing the basic conditions for the creation of technological free zones (ZLTs) to promote tech-based innovation. It includes helping the implementation of blockchain technologies through experimentation and testing.\n\nSince then, the country has started adopting more stringent regulations on crypto taxes to follow other European countries’ legislation. In 2022, the government announced the reversal of a long-standing tax law that excluded crypto gains based on the assumption that they are not legal tender.\n\nSingapore\n\nSingapore is a leading country in blockchain adoption, with the government investing heavily in blockchain research and development. Due to its favorable regulatory climate, Singapore has become a hotspot for initial coin offerings (ICOs), with many blockchain businesses choosing to incorporate there.\n\nThe country’s financial regulatory body, the Monetary Authority of Singapore (MAS), is leading the country’s development of governance structures, technical standards and infrastructure to encourage blockchain and cryptocurrency adoption. Its primary role is to monitor and mitigate the crypto industry risks without hindering technological innovation.\n\nIn 2021, the crypto exchange Independent Reserve conducted a survey across all demographics of Singaporeans, revealing that 43% owned crypto. In 2022, a new survey by the same company highlighted that the population’s interest, trust and confidence in the future of cryptocurrency and blockchain was very high, with 58% of the population interviewed perceiving Bitcoin as an investment asset and a store of value.\n\nMalta\n\nAlong with Singapore, Malta started to promote blockchain adoption as early as 2017, when it gained a reputation as the “blockchain island” after drafting some industry regulations to speed the growth of blockchain technology. In 2018, the Maltese parliament passed three laws providing a regulatory framework for blockchain and digital currencies to regulate ICOs, digital assets, digital currencies and related services.\n\nConcerning the taxation of crypto assets, Malta specified that electronic money and utility tokens are not listed as capital assets in the Income Tax Act, excluding them from capital gains tax. In contrast, securities and virtual finance assets are considered capital assets and subject to taxation.\n\nAt the end of 2021, the Maltese government included blockchain and artificial intelligence (AI) within their commercial guide prospect and framework to commit to promoting the tech. The aim is to incentivize international companies to establish in Malta for testing and operating blockchain technology.\n\nMalta hasn’t achieved “blockchain island” status yet. Consistent and increased international scrutiny over the island’s domestic political and economic events led its leaders to pursue more conservative policies toward the industry than those previously promoted.\n\nHowever, many blockchain and crypto-focused businesses are thriving. For example, companies utilizing blockchain in the supply chain of products, like wine and olive oil, are a tangible reality on the island.\n\nRelated: How blockchain technology is used in supply chain management?\n\nUnited Arab Emirates (UAE)\n\nIn April 2018, the UAE government launched the Emirates Blockchain Strategy 2021 to become a smart region, with government services and private businesses powered by blockchain for more efficiency.\n\nThe region has always had a reputation for being the hotspot for digital innovation, and blockchain allows the government and businesses to save time, money and effort while allowing people to use a transparent and decentralized system. The UAE government is pushing for policies that welcome innovation in the metaverse and nonfungible token (NFT) marketplaces.\n\nRelated: Cryptocurrency regulation in the UAE and the Dubai Virtual Assets Law\n\nThe remaining emirates forming the UAE are aligning with Dubai and Abu Dhabi in implementing initiatives and regulations to promote blockchain and crypto businesses in the region. In February 2023, the Ras Al Khaimah (RAK) emirate announced the creation of the first free economic zone fully dedicated to virtual assets and digital companies, dubbed the RAK Digital Assets Oasis or RAK DAO.\n\nOther countries\n\nThe digital asset market — blockchain and cryptocurrency primarily — is growing worldwide. Neglecting some other regions that have become industry hotspots for innovation and investments would be unfair. Here are other top countries where adoption has grown massively in the last couple of years, encouraged by a crypto-friendly approach.\n\nUSA\n\nThe United States is home to the most extensive crypto ATM network. It is the highest contributor to the Bitcoin hash rate, implying that blockchain and crypto adoption is thriving in the country. While there is yet to be a consistent legal approach at the state or federal level, the government is trying to develop a more precise crypto regulatory framework to encourage adoption and investments.\n\nSwitzerland\n\nWith the city of Lugano aiming to become the cryptocurrency capital of Europe, Switzerland is one of the most exciting countries to watch in the blockchain space. The small European country welcomed blockchain and crypto payments as early as 2016, with a pro-crypto regulatory framework encouraging businesses to settle and invest in the area.\n\nSouth Korea\n\nSouth Korea has experienced a growing interest in blockchain and cryptocurrency, becoming a significant player in adoption in Asia. The country has taken a proactive but cautious approach to digital assets regulation to ensure the safe operation of the market for both consumers and entrepreneurs. Thorough attention is given to Anti-Money Laundering and combating the financing of terrorism laws to ensure market transparency and security.\n\nJapan\n\nJapan has always been at the forefront of Bitcoin and blockchain adoption since many Japanese were mining Bitcoin even when the cryptocurrency had little value. The first and most prominent Bitcoin exchange was Japanese-based Mt. Gox until it was hacked and halted operations.\n\nThe failure of Mt. Gox inspired the government to take measures to protect consumers while maintaining a leading role in the world’s cryptocurrency market. In 2022, the Japanese government awarded seven mayors with NFTs for their achievements, granting more official status to the technology and encouraging its adoption.\n\nNigeria\n\nA Google Trend data analysis revealed that the adoption of blockchain and cryptocurrency had experienced a clear uptrend in Nigeria, especially after the 2022 crypto market crisis when the country emerged as one of the most crypto-curious nations. It also appeared among the top countries with a high global crypto adoption index, according to a report by crypto data analysis company Chainalysis.\n\nThe Nigerian population faces an uncertain domestic situation, with high inflation and depreciation of the country’s fiat currency fueling an acceleration in the adoption of digital assets. The government seeks to implement a fair regulatory framework to protect consumers while encouraging innovation. In October 2021, the Central Bank of Nigeria launched the eNaira, a blockchain-based central bank digital currency (CBDC) pegged to the country’s national currency, the naira. Nigeria is one of the very few countries to fully roll out a CBDC to the population, alongside the Bahamas and Jamaica."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZmFsbC1hbWlkLWludGVyZXN0LXJhdGUtaGlrZS1mZWFycy1zaWx2ZXJnYXRlLWxpcXVpZGF0aW9uLWZvcmthc3QtbmZ0LTUwMC1pbmRleC1zbGlwcy0wLTc5L9IBggFodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWV0aGVyLWZhbGwtYW1pZC1pbnRlcmVzdC1yYXRlLWhpa2UtZmVhcnMtc2lsdmVyZ2F0ZS1saXF1aWRhdGlvbi1mb3JrYXN0LW5mdC01MDAtaW5kZXgtc2xpcHMtMC03OS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, Ether fall amid interest rate hike fears, Silvergate liquidation; Forkast NFT 500 index slips 0.79% - Forkast News",
        "content": "Bitcoin and Ether fell in evening trading in Asia on Thursday, with XRP the sole gainer over 24 hours among the top 10 non-stablecoin cryptocurrencies by market capitalization. The global crypto market cap dropped 1.51% to US$992.83 billion a day after U.S. crypto bank Silvergate said it would voluntarily liquidate. The new Forkast NFT 500 index slipped, and Asian equity markets were mixed.\n\nSee related article: Fed’s Powell says stablecoins could have role in financial sector if properly regulated\n\nFast facts\n\nBitcoin fell 1.71% to US$21,650 in 24 hours as of 6:00 p.m. in Hong Kong on Thursday, according to CoinMarketCap data. The biggest cryptocurrency by market capitalization is down 7.65% on the week. Ether fell 1.45% to US$1,532 after losing 6.85% in the past seven days.\n\nXRP remained a market outlier and the day’s biggest gainer among the top 10 cryptocurrencies by market cap. The token was also the third biggest gainer among all tokens, increasing 3.2% to US$0.39 and up 4.16% on the week.\n\nAltcoin Kava outperformed the broader market with a gain of over 6%, while Toncoin strengthened over 3.35%.\n\nThe global cryptocurrency market capitalization fell further, below the US$1 trillion benchmark, to US$992.83 billion. Total crypto market volume fell 5.1% to US$44.20 billion in the last 24 hours.\n\nIn his second day of congressional testimony, U.S. Federal Reserve Chair Jerome Powell reiterated his message that interest rates might need to rise more than previously estimated but also added that the March rate hike has not been set and remains data-dependent. The U.S. Dollar Index (DXY) has risen nearly 3.5% since Feb. 1.\n\nAsian stocks were mostly flat, following similar results in the U.S. Hong Kong’s Hang Seng Index saw the biggest loss of 0.63%, while Japan’s Nikkei 225 gained 0.63%. The Shanghai Composite in China slipped 0.22%.\n\nMarkets in Europe trended lower on the day. England’s FTSE MIB dropped 1.19% and the STOXX 600 slid 0.57%.\n\nThe Forkast NFT 500 index dropped 0.79% to 4,241.17 over the last 24 hours as of 6:00 p.m. on Thursday in Hong Kong. The Forkast NFT 500 Index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day.\n\n(Corrects market capitalization to ‘trillion’ in bullet point four.)\n\nSee related article: Ethereum validators win ‘short term’ as Blur, OpenSea rivalry drives up gas fees"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vbW9uZXkuY29tL2VsZWN0cnVtLWNyeXB0by13YWxsZXQtcmV2aWV3L9IBOWh0dHBzOi8vbW9uZXkuY29tL2VsZWN0cnVtLWNyeXB0by13YWxsZXQtcmV2aWV3Lz9hbXA9dHJ1ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Electrum Crypto Wallet Review - Money",
        "content": "Electrum is an open-source crypto wallet that was first released in 2011. Since then, it has become one of the most popular Bitcoin wallets due to its easy setup across devices, compatibility with major hardware wallets and open-source application.\n\nIf you’re looking for a cryptocurrency wallet that offers the best desktop experience and are happy trading bitcoin only, then the Electrum crypto wallet could be the best crypto wallet for you.\n\nRead on for our review of Electrum's crypto wallet.\n\nBest desktop Bitcoin wallet\n\nElectrum is our pick for the best desktop Bitcoin wallet thanks to its easy setup process, compatibility with hardware wallets and open-source application structure. Electrum’s desktop app also allows for a high degree of customization, making it an ideal desktop wallet for users well versed in crypto trading and who have programming experience.\n\nThe wallet does have some drawbacks, namely that it only supports Bitcoin and isn't ideal for beginners. Additionally, Electrum offers limited customer support compared to other popular wallets.\n\nWhile Electrum is compatible with Windows, Mac and Linux, the mobile version is currently only available on Android devices.\n\nElectrum crypto wallet pros and cons\n\nPros Easy setup process\n\nHardware wallet compatible\n\nOpen source application Cons Supports Bitcoin only\n\nLimited customer support\n\nPros explained\n\nEasy setup process\n\nElectrum focuses on offering a no-frills Bitcoin storage experience that is best for those looking for fast and secure Bitcoin trading. As such, setting up your Electrum Bitcoin wallet account is easy. You must download the free app from the Electrum website or the Google Play Store, set up two-factor authentication, create a new wallet and set your password.\n\nHardware wallet compatible\n\nThe Electrum Bitcoin wallet is compatible with several hardware wallet brands, including Ledger, Trezor and KeepKey. Using a hardware wallet allows you to store your private keys in an offline device, making it virtually impossible for them to be compromised by hackers or in a data leak. This adds yet another level of security that software wallets cannot attain on their own.\n\nOpen-source application\n\nOne of the biggest benefits of Electrum is that it's an open-source application. This means that Electrum has published its entire source code for users to inspect, evaluate and enhance. If you have some programming experience, you can modify this code to build entirely new features to suit your unique needs.\n\nCons explained\n\nSupports Bitcoin only\n\nElectrum is limited in its selection of supported cryptocurrencies. You cannot purchase Bitcoin with cash using Electrum or store any other cryptocurrency. This means you should look elsewhere for a crypto wallet that can store or exchange with other cryptocurrencies.\n\nLimited customer support\n\nElectrum does not offer direct customer support. Instead, it provides documentation on setting up two-factor authentication, using Electrum with the command line, and more. The official Electrum site also has a frequently asked questions page with more information about the service.\n\nElectrum posts updates and announcements on its official Twitter page, though it does not offer support over Twitter. If you've reviewed the official and unofficial documentation and can't find an answer to your question, you may have to seek support from the Electrum community by posting to BitcoinTalkForum, Reddit or GitHub.\n\nAds by Money. We may be compensated if you click this ad. Ad Upgrade your crypto wallet Owning and using your cryptocurrency should not be complicated. ZengGo can help store your investments safely so you can thrive in the digital economy. Click below to download your wallet. Learn More\n\nElectrum crypto wallet offerings\n\nElectrum is a bitcoin-only wallet that offers security features like multisig and cold storage. That said, the wallet doesn’t feature any other auxiliary services, so you’ll have to look elsewhere if you’re looking for a wallet that enables services like crypto staking.\n\nCold storage\n\nCold wallets store your keys or seed phrases, which give you access to your crypto on offline devices. This makes them much safer than hot wallets, which are always online. Electrum allows you to store your seeds in offline devices and make transactions without having to connect them to an online server, keeping them safe from hackers and data leaks.\n\nLightning Network connection\n\nElectrum offers Lightning Network transactions as a way to bypass the traditional Bitcoin transaction process. Instead of completing the entire transaction on the Bitcoin network, the Lightning Network only opens and closes the payment channels on-network, while the rest of the transaction is executed off-network. This allows for much cheaper and faster peer-to-peer (P2P) microtransactions.\n\nMultisig wallet\n\nElectrum offers multisig services to enhance the security of your wallet. With a multisig wallet setup, you can require two or more private keys, or signatures, to confirm all your transactions. Similar to multi-factor authentication, enabling multisig for your wallet adds another layer of security to your Electrum wallet, keeping your transactions more secure.\n\nElectrum crypto wallet pricing\n\nThe Electrum software wallet is free and users can download the mobile wallet from the Google Play store and the desktop wallet from the official website. There are no fees to set up your Bitcoin wallet. But, as with other crypto wallets, Bitcoin charges a variable fee for each transaction.\n\nElectrum transaction fees are paid in satoshis per byte. One bitcoin is made up of 100 million satoshis, so a fee of 300 satoshis is equivalent to 0.00000300 bitcoin. You can choose between Static, Mempool and ETA fees.\n\nStatic fees are fixed, range between 1 and 300 satoshis per byte, and do not depend on Bitcoin network conditions.\n\nMempool and ETA fees will depend on the blockchain network conditions at the time.\n\nETA fees will adjust depending on the estimated confirmation time that you select.\n\nMempool fees will vary depending on the volume of pending transactions on the blockchain.\n\nIt’s worth noting that none of the three pricing structures is inherently cheaper than the rest. Although ETA and Mempool fees vary depending on market conditions, users can generally slide the fee scale to the lowest price of 1 satoshi per byte. So, even though the fee you end up paying could be the same with all three structures, the transaction speed will depend on market conditions.\n\nElectrum crypto wallet financial stability\n\nElectrum is free, open-source software, so it is not at risk of shutting down due to financial problems. It's a decentralized wallet, so you also don’t have to worry about the reliability of one central server, since transactions are shared among a large number of servers.\n\nAds by Money. We may be compensated if you click this ad. Ad Unlock the world of Cryptocurrency Crypto Wallets make life on the blockchain simple and secure. Take control of your investment by downloading your wallet today. Learn More\n\nElectrum crypto wallet accessibility\n\nAvailability\n\nElectrum is available for download anywhere in the world. Since Electrum doesn’t take fiat currency payments in exchange for Bitcoin, there are no limitations to who can use Electrum. All you need to set up an Electrum wallet is internet access to download the software, create your account and execute your transactions.\n\nKeep in mind that you may have some tax obligations depending on where you live, so make sure to take some time to learn more about how crypto is taxed.\n\nThe desktop version of Electrum is available as a free download for Python, Linux, Windows and MacOS. You can also download the mobile version of Electrum for Android from the Google Play Store.\n\nContact information\n\nElectrum does not have a dedicated customer service department. Since Electrum is an open-source software and not a company, it doesn’t handle complaints and requests like a regular business would. Instead, you have to rely on help from the user community when you run into problems. If you need to report a bug or technical problem, you can do so on Electrum’s GitHub page.\n\nUser experience\n\nSetting up Electrum on a computer and Android mobile divide is easy. However, Electrum’s user interface is not apt for beginners. This wallet has been around since 2011, and its interface shows it. With outdated designs and unintuitive organization, this app can be difficult to navigate unless you have experience with other crypto wallets.\n\nIf you know your way around crypto wallets, you may appreciate Electrum’s favor for functionality over design.\n\nElectrum crypto wallet customer satisfaction\n\nElectrum doesn’t have a company profile on Better Business Bureau since it is open-source software. Thus, online customer satisfaction reviews of Electrum are limited. Electrum’s Trustpilot profile has 16 customer reviews, with an average rating of 3.3 out of 5 stars.\n\nThe customers who gave Electrum a 5-star rating praise its speed, desktop app and low fees. The 1-star reviews complain about technical difficulties during setup.\n\nElectrum crypto wallet FAQ What's the difference between a hardware and software wallet? chevron-down chevron-up Hardware wallets use a physical device to store private keys, while software wallets use a computer's hard drive to store private keys. In other words, a hardware wallet is a device — usually a thumb drive or a similar device — that you can plug into a computer to store your wallet's private keys. A software wallet, on the other hand, stores private keys within your computer's hard drive. Generally, hardware wallets are considered more secure than software wallets since they're not connected to the internet. The biggest risk associated with hardware wallets is misplacing the physical device and thus losing access to your cryptocurrencies. Getting a hardware wallet can be a good idea if you're worried about falling victim to one of the recent Generally, hardware wallets are considered more secure than software wallets since they're not connected to the internet. The biggest risk associated with hardware wallets is misplacing the physical device and thus losing access to your cryptocurrencies. Getting a hardware wallet can be a good idea if you're worried about falling victim to one of the recent popular crypto scams Who is Electrum Wallet best for? chevron-down chevron-up Electrum is best for users who are only interested in holding Bitcoin, have experience trading cryptocurrencies, don't need auxiliary services like crypto staking and prefer a desktop app. Electrum is one of the most bare-bones crypto wallets out there, with a hyper-focused target audience. This allows those with experience to trade Bitcoin quickly and inexpensively, but it's probably not the right choice for those who have never traded Bitcoin before. Electrum is one of the most bare-bones crypto wallets out there, with a hyper-focused target audience. This allows those with experience to trade Bitcoin quickly and inexpensively, but it's probably not the right choice for those who have never traded Bitcoin before. Is Electrum Wallet safe? chevron-down chevron-up Electrum is a safe platform for Bitcoin trading. As it's an open-source program, users are able to check Electrum's source code to detect potential problems and bugs. Additionally, Electrum is fully decentralized, meaning that its systems run on a number of servers around the world rather than in one centralized server. This makes Electrum Wallet virtually impossible to hack or for user data to be leaked.\n\nHow we evaluated the Electrum crypto wallet\n\nWe considered the following factors when evaluating Electrum Wallet:\n\nCrypto assets supported\n\nUser interface and navigation, including how this differs for beginners versus advanced users\n\nSecurity features, including password authentication measures and wallet storage type\n\nPricing structure and transaction fees\n\nFinancial stability\n\nAccessibility features, including support documentation and customer service options\n\nUser reviews from third-party platforms\n\nSummary of Money's Electrum crypto wallet review\n\nElectrum Wallet is an excellent choice for seasoned users looking for a no-hassle desktop wallet for Bitcoin. With many great features, like an easy setup process, compatibility with hardware wallets, an open-source software setup, and an excellent desktop app, we consider this to be the best Bitcoin wallet for desktops.\n\nThat said, Electrum can be challenging to navigate for people without prior Bitcoin trading experience. Its lack of dedicated customer support can also add a layer of difficulty for those who may need help every now and then.\n\nFinally, Electrum is extremely limited in its supported cryptocurrencies, only offering support for Bitcoin.\n\n"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMjMxMjMvcGVvcGxlLWFyZS1taW50aW5nLWJyYy0yMC1tZW1lLWNvaW5zLW9uLWJpdGNvaW4tdmlhLW9yZGluYWxz0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMzEyMy9wZW9wbGUtYXJlLW1pbnRpbmctYnJjLTIwLW1lbWUtY29pbnMtb24tYml0Y29pbi12aWEtb3JkaW5hbHM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "People Are Minting 'BRC-20' Meme Tokens on Bitcoin via Ordinals - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIf there was any suggestion that the hype around Ordinals—a way of inscribing media onto the Bitcoin blockchain akin to NFTs—had died down, that idea was dashed today. The buzz is only getting bigger and wilder, especially now that someone figured out how to mint a form of \"fungible tokens\" using the Ordinals protocol.\n\nOrdinal inscriptions surged to a new single-day peak of about 31,700 today, as of this writing, per a Dune dashboard that tracks public blockchain data. And it's all because of the launch of \"BRC-20,\" an experimental way to use the tech to let people mint and transfer whatever tokens they please via the Bitcoin blockchain.\n\nIt's the latest evolution in the Ordinals saga that has irritated some Bitcoin maximalists, yet also excited many creators and collectors about the expanding possibilities around the original blockchain network. Now the tech is being used in an analog to the ERC-20 token standard on Ethereum, but it's still very early and experimental.\n\nAD\n\nAD\n\nAn experiment into \"brc-20's\" and fungibility on bitcoin with ordinals 1/x pic.twitter.com/9khKLbEPk6 — domo (@domodata) March 9, 2023\n\nA pseudonymous on-chain data enthusiast named Domo launched the BRC-20 implementation on Wednesday. Domo calls BRC-20—short for \"Bitcoin Request for Comment\"—an experiment inspired by another pseudonymous user's tweet along with the Sats Names (.sats) standard.\n\n“I [heard] about the possibility of BRC-20 the past couple of days on Twitter and was curious if I could apply the .sats name format to create it,” Domo told Decrypt via Telegram. “Basically, what I was trying to do was to see if I could create an off-chain state with the tooling I had at hand (Dune Analytics) and inscriptions.”\n\nThere have been 23,926 BRC-20 ordinal inscriptions in the past 24 hours. It only took 6 weeks for people to figure out how to use ordinals to make fungible meme coins. At this point, nothing surprises me. pic.twitter.com/CnHD3qRTcA — Leonidas.og (@LeonidasNFT) March 9, 2023\n\nDomo's Ordi token kicked things off on Wednesday, but meme-inspired tokens like Doge, Pepe, and even Meme itself have been deployed by users via BRC-20 and Ordinals since.\n\nAD\n\nAD\n\nAccording to Dune, the vast majority of Ordinal inscriptions created since the BRC-20 implementation went live are text-based. Altogether, more than 385,000 total inscriptions have been made via Ordinals to date, with nearly all of them coming over the last six weeks.\n\n“This fits into a larger trend of text-based inscriptions becoming more popular due to their small file sizes, which can be as low as a few bytes,” pseudonymous NFT historian Leonidas told Decrypt on Twitter. “Because you pay fees proportionate to the file size being inscribed, it costs significantly less in fees to inscribe JSON [code] or text.”\n\nMining pools really need to send @domodata a gift basket for all this fee traffic he is driving. Domo threw a toy out there and people jumped on it, now I'm going to need to sell a kidney to inscribe anything today. — Psifour (@Psifour) March 9, 2023\n\nLaunched in late January thanks to the Bitcoin network’s Segwit and Taproot upgrades, Ordinals took the crypto world by storm as more and more enthusiasts came to the original blockchain network to mint what have colloquially been called Bitcoin NFTs. They don't function exactly like NFTs on Ethereum, for example, but the end result is similar.\n\nThe Ordinals protocol has been used for a wide array of on-chain media inscriptions thus far, including artwork, profile pictures, playable games, and video-based web apps. Even Bored Ape Yacht Club creator Yuga Labs auctioned its own original art collection via Ordinals, yielding $16.5 million in the process.\n\nAccording to a report released last week by Galaxy Research, the rapidly rising Bitcoin NFT market could be worth $4.5 billion by 2025\n\nDespite the social media buzz around BRC-20 tokens and the rising inscription tallies to match, Domo said that by no means should it be considered the \"standard” for Bitcoin-based tokens. They cautioned against anyone mass-minting such tokens on Twitter, calling them \"worthless,\" and recommends that other builders design and code their own, more robust solutions.\n\nBut it's a starting point. Even if it was meant as a fun experiment, the BRC-20 launch has already captured a lot of Bitcoin users' imaginations. Domo said that the responses have been better than expected.\n\nAD\n\nAD\n\n“I have yet to have any very angry reactions, which I’m relieved about,” they said. “However, some of the more technically inclined have pointed out (and rightfully so) that there are much better ways of achieving what I’m doing. And some others question why at all (fair enough).\"\n\n“At the end of the day, it was an experiment, and I think the majority understand that,\" Domo said. \"Those people seem to be having fun.\""
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi93aHktYml0Y29pbi1wbHVuZ2Utd2hhdC1vbi1jaGFpbi1kYXRhLXNheXMv0gFUaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9iaXRjb2luL3doeS1iaXRjb2luLXBsdW5nZS13aGF0LW9uLWNoYWluLWRhdGEtc2F5cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Why Did Bitcoin Plunge? Here’s What On-Chain Data Says - NewsBTC",
        "content": "Bitcoin has slipped under the $20,000 level today for the first time in two months. Here’s why this plunge may have taken place, according to on-chain data.\n\nBitcoin Price Dropped With Coinbase Premium Turning Negative\n\nAs pointed out by an analyst in a CryptoQuant post, the U.S. government’s recent movement may have played a role in the latest decline in BTC’s price. There are a couple of relevant indicators here: the Coinbase Premium and the Spent Output Age Bands (SOAB).\n\nThe “Coinbase Premium” measures the difference between the Bitcoin price listed on the cryptocurrency exchange Coinbase and that listed on Binance. Coinbase is an exchange that’s popularly used by U.S.-based investors (especially large institutions), while Binance has a more global-oriented audience.\n\nDue to this reason, the Coinbase Premium can provide hints about whether American holders are buying (or selling) more or less than global investors right now.\n\nWhen the value of the metric is positive, it means the price listed on Coinbase is greater than that on Binance currently, and hence the U.S.-based users have been putting on higher buying pressure than the global investors (or alternatively, they have just been selling less heavily).\n\nOn the other hand, negative values of the metric suggest that U.S. participants might be engaging in a higher amount of selling than the world user base at the moment.\n\nNow, here is a chart that shows how the Bitcoin Coinbase Premium has changed over the past week:\n\nLooks like the value of the metric has gone down in recent days | Source: CryptoQuant\n\nAs displayed in the above graph, the Bitcoin Coinbase Premium has turned negative recently. This means that U.S. investors may have been putting some extraordinary selling pressure on the cryptocurrency during this period.\n\nInterestingly, the price of the coin has declined while the premium has become negative, which may suggest that U.S. participants may have had more of a hand in this latest plunge.\n\nThe chart also contains data for the other indicator of interest here, the “SOAB,” which tells us which age bands (or groups) in the market have been moving their coins recently.\n\nCuriously, the 6m-12m age band, which includes all Bitcoin investors that have been holding onto their coins for at least 6 months and at most 12 months ago, has shown a large movement just a few days ago.\n\nAs for the source of these aged coins, the quant explains, “the transaction is linked to bitcoins seized by the U.S. government because they are related to Silkroad.”\n\nThe timing of this large Bitcoin transaction and the selling pressure rising on Coinbase is interesting and could suggest that there may be a link between the two.\n\n“It’s difficult to say what impact this transaction had on the price drop because we can’t see what’s happening on the exchange,” notes the analyst. “But everything suggests that it caused extra selling pressure.”\n\nBTC Price\n\nAt the time of writing, Bitcoin is trading around $19,800, down 11% in the last week.\n\nBTC has plunged over the past day or so | Source: BTCUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9wZW9wbGUtbWludGluZy1icmMtMjAtbWVtZS0wMzQyMjEyMzkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "People Are Minting 'BRC-20' Meme Tokens on Bitcoin via Ordinals - Yahoo Finance",
        "content": "If there was any suggestion that the hype around Ordinals—a way of inscribing media onto the Bitcoin blockchain akin to NFTs—had died down, that idea was dashed today. The buzz is only getting bigger and wilder, especially now that someone figured out how to mint a form of \"fungible tokens\" using the Ordinals protocol.\n\nOrdinal inscriptions surged to a new single-day peak of about 31,700 today, as of this writing, per a Dune dashboard that tracks public blockchain data. And it's all because of the launch of \"BRC-20,\" an experimental way to use the tech to let people mint and transfer whatever tokens they please via the Bitcoin blockchain.\n\nIt's the latest evolution in the Ordinals saga that has irritated some Bitcoin maximalists, yet also excited many creators and collectors about the expanding possibilities around the original blockchain network. Now the tech is being used in an analog to the ERC-20 token standard on Ethereum, but it's still very early and experimental.\n\nAn experiment into \"brc-20's\" and fungibility on bitcoin with ordinals 1/x pic.twitter.com/9khKLbEPk6 — domo (@domodata) March 9, 2023\n\nA pseudonymous on-chain data enthusiast named Domo launched the BRC-20 implementation on Wednesday. Domo calls BRC-20—short for \"Bitcoin Request for Comment\"—an experiment inspired by another pseudonymous user's tweet along with the Sats Names (.sats) standard.\n\n“I [heard] about the possibility of BRC-20 the past couple of days on Twitter and was curious if I could apply the .sats name format to create it,” Domo told Decrypt via Telegram. “Basically, what I was trying to do was to see if I could create an off-chain state with the tooling I had at hand (Dune Analytics) and inscriptions.”\n\nThere have been 23,926 BRC-20 ordinal inscriptions in the past 24 hours. It only took 6 weeks for people to figure out how to use ordinals to make fungible meme coins. At this point, nothing surprises me. pic.twitter.com/CnHD3qRTcA — Leonidas.og (@LeonidasNFT) March 9, 2023\n\nDomo's Ordi token kicked things off on Wednesday, but meme-inspired tokens like Doge, Pepe, and even Meme itself have been deployed by users via BRC-20 and Ordinals since.\n\nStory continues\n\nAccording to Dune, the vast majority of Ordinal inscriptions created since the BRC-20 implementation went live are text-based. Altogether, more than 385,000 total inscriptions have been made via Ordinals to date, with nearly all of them coming over the last six weeks.\n\n“This fits into a larger trend of text-based inscriptions becoming more popular due to their small file sizes, which can be as low as a few bytes,” pseudonymous NFT historian Leonidas told Decrypt on Twitter. “Because you pay fees proportionate to the file size being inscribed, it costs significantly less in fees to inscribe JSON [code] or text.”\n\nMining pools really need to send @domodata a gift basket for all this fee traffic he is driving. Domo threw a toy out there and people jumped on it, now I'm going to need to sell a kidney to inscribe anything today. — Psifour (@Psifour) March 9, 2023\n\nLaunched in late January thanks to the Bitcoin network’s Segwit and Taproot upgrades, Ordinals took the crypto world by storm as more and more enthusiasts came to the original blockchain network to mint what have colloquially been called Bitcoin NFTs. They don't function exactly like NFTs on Ethereum, for example, but the end result is similar.\n\nThe Ordinals protocol has been used for a wide array of on-chain media inscriptions thus far, including artwork, profile pictures, playable games, and video-based web apps. Even Bored Ape Yacht Club creator Yuga Labs auctioned its own original art collection via Ordinals, yielding $16.5 million in the process.\n\nWhat Are Ordinals? A Beginner's Guide to Bitcoin NFTs\n\nAccording to a report released last week by Galaxy Research, the rapidly rising Bitcoin NFT market could be worth $4.5 billion by 2025\n\nDespite the social media buzz around BRC-20 tokens and the rising inscription tallies to match, Domo said that by no means should it be considered the \"standard” for Bitcoin-based tokens. They cautioned against anyone mass-minting such tokens on Twitter, calling them \"worthless,\" and recommends that other builders design and code their own, more robust solutions.\n\nBut it's a starting point. Even if it was meant as a fun experiment, the BRC-20 launch has already captured a lot of Bitcoin users' imaginations. Domo said that the responses have been better than expected.\n\n“I have yet to have any very angry reactions, which I’m relieved about,” they said. “However, some of the more technically inclined have pointed out (and rightfully so) that there are much better ways of achieving what I’m doing. And some others question why at all (fair enough).\"\n\n“At the end of the day, it was an experiment, and I think the majority understand that,\" Domo said. \"Those people seem to be having fun.\""
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYXJ0aWNsZS9tYXJrZXRzL2JpdGNvaW4tZHJvcHMtYmVsb3ctMjAtMDAwLXNldC1mb3Itd29yc3Qtd2Vlay1zaW5jZS1mdHgtY3Jhc2gtaW4tbm92ZW1iZXItMTIzMDMxMDAwODg4XzEuaHRtbNIBkwFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vYW1wL2FydGljbGUvbWFya2V0cy9iaXRjb2luLWRyb3BzLWJlbG93LTIwLTAwMC1zZXQtZm9yLXdvcnN0LXdlZWstc2luY2UtZnR4LWNyYXNoLWluLW5vdmVtYmVyLTEyMzAzMTAwMDg4OF8xLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin drops below $20,000, set for worst week since FTX crash in November - Business Standard",
        "content": "Bitcoin is having its worst week since November as an equity selloff, fear over higher interest rates and an escalating US regulatory crackdown on crypto combine to hurt investor sentiment.\n\n\n\nThe largest token fell as much 3.2% on Friday, breaking below $20,000 for the first time since January, after falling more than 8% on Thursday. Smaller coins like Ether, Solana and Cardano also added to losses.\n\nA rout in US bank stocks on Thursday stoked concerns"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmFhLmNvbS50ci9lbi9lY29ub215L2JpdGNvaW4tY3J5cHRvY3VycmVuY2llcy10cnktdG8tcmVjb3Zlci1mcm9tLXN2YnMtZGVtaXNlLzI4NDI2NDXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, cryptocurrencies try to recover from SVB's demise - Anadolu Agency | English",
        "content": "Necessary Cookies\n\nThis cookie is used to distinguish between humans and bots. This is beneficial for the web site, in order to make valid reports on the use of their web site.\n\nFunctional Cookies\n\nRemembers the user's selected language version of a website.\n\nPerformance/Analytical Cookies\n\nRegisters a unique ID that is used to generate statistical data on how the visitor uses the website.Used by Google Analytics to throttle request rate.\n\nAccept Reject\n\nAdvertising/Marketing Cookies\n\nThis cookie is used to collect information on consumer behavior, which is sent to Alexa Analytics. (Alexa Analytics is an Amazon company.)"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMioQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luL2V4cGxhaW5lci13aHktY3J5cHRvLWhhcy1jb21lLXVuZGVyLWluZGlhcy1hbnRpLW1vbmV5LWxhdW5kZXJpbmctbGF3L2FydGljbGVzaG93Lzk4NTE1MTk2LmNtc9IBpQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luL2V4cGxhaW5lci13aHktY3J5cHRvLWhhcy1jb21lLXVuZGVyLWluZGlhcy1hbnRpLW1vbmV5LWxhdW5kZXJpbmctbGF3L2FtcF9hcnRpY2xlc2hvdy85ODUxNTE5Ni5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Explainer: Why crypto has come under India's anti-money laundering law - The Times of India",
        "content": "What does the notification state?\n\nWhat does the notification mean?\n\nNew rules will prevent misuse of crypto\n\n\n\nWhat is considered as money laundering and what are the consequences of being involved with the same?\n\n\n\nWhy now?\n\nThe notification reflects government's intent to regulate, and not ban crypto\n\nWhat is the RBI's take?\n\nWhat's the government's position\n\nConcerns:\n\n\n\nCentral Government has brought digital assets and fiat currencies, virtual digital assets , more commonly, the crypto currencies and such other digital assets, their trading, safe keeping and related financial services under the ambit of PMLA by this notification.Money laundering provisions will now apply to India's cryptocurrency sector as the government seeks to tighten oversight of digital assets in the country.The central government via a notification dated 7 March, 2023 has brought digital assets and fiat currencies, virtual digital assets, more commonly, the crypto currencies and such other digital assets, their trading, safe keeping and related financial services under the ambit of Prevention of Money Laundering Act ( PMLA).The Finance Ministry said the exchange between virtual digital assets and fiat currencies, exchange between one or more forms of virtual digital assets, and transfer of virtual digital assets, will fall under the purview of the PMLA Act.\"With this inclusion, crypto dealers, exchanges and intermediaries will now be required to perform KYC and maintain their records of their clients and users of the platform, as are usually done by the banks. Further, such dealers and exchanges will now have to report any suspicious activity to the government agencies. This will enable government to keep a closer watch on the crypto trading activities,\" said Shashank Agarwal, Advocate, Delhi High Court.The Indian Government imposed Anti-Money Laundering provisions on Virtual Digital Assets (VDA) vide Ministry of Finance notification dated 7th March 2023. As a result, VDA service providers / businesses have now become the ‘reporting entities’ under PMLA Act, and they have to follow similar reporting standards and KYC norms as the other regulated entities like banks, securities intermediaries, payment system operators, etc. do.This means that any financial wrongdoing involving cryptocurrency assets can now be investigated by the Enforcement Directorate.The definition of ‘virtual assets’ would be the same as that in the Income-Tax Act, the notification stated. The definition includes cryptocurrencies and non-fungible tokens. With the imposition of the new rules, Indian crypto exchanges will have to report suspicious activity to the Financial Intelligence Unit India (FIU-IND).It also mandates entities dealing in crypto to follow KYC, anti-money laundering regulations and due diligence as followed by banking and other financial entities which fall under the classification of reporting entities under PMLA.\"Cryptocurrency industry members will now be required to undertake the necessary steps to verify and maintain accounts of individuals, transactions, and report any suspicious activity to the Financial Intelligence Unit. Additional compliance requirements such as verification of source of funds, ownership and financial positions will further lend credibility to an industry, which has been subject to severe regulatory attention over the last few years. This move also empowers the government to access the information stored by crypto exchanges at any point in time,\" said Bagmisikha Puhan, (Associate Partner TMT Law Practice.“Cryptocurrency transactions continue to lack transparency and the trail is difficult to establish. This move pushes responsibility on the cryptocurrency markets to bring transparency to cryptocurrency trading,” said Prashant Garg, partner, technology consulting, EY.“The responsibility of maintaining transparency, identity, and following regulations is on cryptocurrency exchanges. Globally, banks are severing ties with exchanges, straining the exchanges and forcing them to look for an alternative model,” said Garg.\"The new rules are introduced to prevent misuse of crypto, such as money laundering, and they do not stop the regular, KYC-verified conversion of crypto to INR users do on the CoinSwitch app or CoinSwitch PRO platforms. We took a conscious decision in 2021 to limit crypto movement within our KYC-compliant ecosystem to ensure transparency and compliance with the laws of the land,\" said Ashish Singhal, Co-founder & CEO, CoinSwitch.\" In this digital era of finance, compliance is a must not just to safeguard interest of investors but also of the country and in this aspect the crypto industry is becoming increasingly important, governments and regulators around the world are paying closer attention to this rapidly evolving space. We welcome the government move for bringing ‘money laundering provisions’ in the crypto sector. Moreover, we see this as a step forward to make the ‘Indian crypto market’ having a compliant framework for Investment in ‘crypto currency’,\" said Lavin Kotian - CTO and Cofounder, TransBnk.\"The move by India to impose money laundering provisions on cryptocurrencies shows that governments around the world are recognizing the importance of having clear regulations in place for cryptocurrencies, which can help prevent criminal activities such as money laundering and terrorist financing. While this may lead to some short-term challenges for cryptocurrency traders and investors, it could ultimately lead to a more stable and trustworthy environment for the industry to thrive in the long run,\" said Vijay Pravin Maharajan, Founder & CEO, bitsCrunch.As per the Indian laws, “whosoever directly or indirectly attempts to indulge or knowingly assists or knowingly is a party who is actually involved in any process or activity connected with the proceeds of crime and projecting it as untainted property shall be guilty of offence of money laundering”.\" For the crypto space this means that if an individual is transferring crypto having a monetary value without complete disclosure to the government and the receiver is not reporting that as income or a payment, both parties can be held liable under the money laundering act. It is relatively easy for an individual to open a crypto wallet without having the need to disclose their identity or fulfil any KYC requirements and load funds in the form of crypto. The interesting part about this is that there is no limit to transfers, no transaction trail, valued at par globally, doesn’t require government approvals, and can easily be sent within a few minutes,\" said Abhinav Soomaney, Managing partner at CryptoTax International Pvt Ltd.As stated in the money laundering section, “whoever commits the offence of money laundering shall be punishable with rigorous punishment for a term no less than three years, but which may extend to seven years and shall also be liable to fine which may extend to five lakh rupees”.\" If there are laws and guidelines against crypto laundering, investors will have the fear of being penalized. To make things more streamlined, exchanges in India must track transfers made by investors within a tax year exceeding a certain amount and report the same to the tax authorities. It is very important to note that this law will be applicable to crypto traders, safekeepers, and financial service providers which will include exchange platforms and blockchain startup companies as well,\" said Soomaney.Enforcement Directorate and Income Tax Department are already probing several such money laundering cases against companies running cryptocurrency exchanges and transactions and nearly Rs 936 crore related to crypto currency has been attached or seized under PMLA, so far.In the last one year, Enforcement Directorate and Income Tax Department have already probied at least 10 crypto exchanges for allegedly assisting foreign firms launder money via crypto. The probe had unearthed instances of the accused firms approaching the exchanges to buy crypto coins for more than Rs 100 crore and crypto coins being sent to international wallets. In many cases, the KYC details (know your customer) collected by the exchanges were found to be dubious. The government agency estimates the accused firms laundered more than Rs 1,000 crore in the instant loan app case, adding that most of the allegations have a China link.Under Foreign Exchange Management Act, 1999 (FEMA), assets amounting to Rs 289.28 crore have been seized under section 37A of FEMA and one show-cause notice to crypto currency exchange Zanmai Labs Pvt Ltd, known as WazirX and its directors under FEMA for transactions involving cryptocurrencies work Rs 2,790 crore has also been issued.The government notification is expected to aid investigative agencies in carrying out their actions against crypto companies.\"This notification reflects Central Government’s intention to regulate the VDA space rather than an outright ban, which is a welcome step. It will be interesting to see how VDA service providers / businesses streamline their services to accommodate the PMLA obligations without any industry specific governing body overlooking. Overall, this has tightened the governance of VDA service providers/ businesses, which results in more depth in this large ambiguously regulated industry\" said Diviay Chadha, Partner, Singhania & Co. LLP.Last month, Finance Minister Nirmala Sitharaman told Parliament that India was discussing with the G-20 member countries the need to develop a standard operating protocol for regulating crypto assets.She had said crypto assets and Web3 are relatively new and evolving sectors and require significant international collaboration for any specific legislation on these sectors to be fully effective.Crypto assets are by definition borderless and require international collaboration to prevent regulatory arbitrage. Therefore, any legislation for regulation or for banning can be effective only with significant international collaboration on the evaluation of the risks and benefits and evolution of common taxonomy and standards.In April 2022, India introduced a 30 per cent income tax on gains made from cryptocurrencies. In July 2022, rules regarding 1 per cent tax deducted at source on cryptocurrency came into effect.The Reserve Bank of India has so far cautioned people against crypto assets. In January, RBI Governor Shaktikanta Das said investing in crypto was akin to gambling and will even undermine the power of the central bank if allowed to grow unchecked. “If crypto is allowed in India, the RBI will lose control over monitoring transactions,\" Das had said.India, which currently holds the G20 presidency, has been pushing for a collective global effort to regulate VDAs and mitigate its potential risks. During the latest G20 meeting, which ended on Saturday, Sitharaman held a seminar for member states to share their concerns regarding the risks of cryptocurrencies while discussing how to come up with a common framework.17 lakh users Indian VDA users have switched from domestic centralised VDA exchanges to foreign counterparts since the announcement of the tax regime in the Union Budget in February 2022:The current tax structure on VDS in India have impacted trading volumes on local cryptocurrency exchanges.A research study by Esya Centre, a Delhi-based technology policy think tank, shows Indian crypto traders have moved over $3.8 billion in trading volume from local exchanges to international crypto platforms after the country’s controversial tax policy came into effect last year.“This is likely to lead to a large negative impact on tax revenues, as well as a decrease in transaction traceability—which defeats the two central goals of the extant policy architecture. The downside impact of the VDA tax architecture is likely to further accentuate capital outflow and deter international investors. This implies reduced competitiveness of Indian centralised VDA exchanges relative to international counterparts,” the study added.The Esya Centre recommended three steps to stem the offshoring of domestic business and liquidity to foreign exchanges.It says tax deducted at-source (TDS) on VDAs should be at par with securities transaction tax. The government should reconcile tax rates vis-a-vis revenue maximisation by ascertaining the optimal taxation point(s) using economic analysis tools such as the Laffer Curve. And, India should adopt a progressive tax structure with differentiated rates for short-term and long-term gains, in line with international best-practices, it added.\"While this move will undoubtedly bring about greater consumer confidence in a regulated industry, aspects in relation to data security and privacy measures will require strengthening, with increased incidence of collection of user’s sensitive data sets. While banking and financial institutions are required to adhere to sector specific data security norms released by RBI, crypto industry members are still largely regulated under SPDI norms, which will require a re-look,\" said Puhan."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5vb2RhbG9vcC5jb20vb29kYS1vcmlnaW5hbC8yMDIzLzAzLzEwL3RoZS1mdXR1cmUtb2YtYml0Y29pbi1hbmQtdGhlLWV4cG9uZW50aWFsLWdyb3d0aC1vZi1hbmQtcmlza3MtcG9zZWQtYnktb3JkaW5hbC1pbnNjcmlwdGlvbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "The Future of Bitcoin and the Exponential Growth of and Risks Posed by Ordinal Inscriptions - OODA Loop",
        "content": "Bitcoin-based ordinal inscriptions are the “new, new thing” and an opportunity to frame and make more accessible issues surrounding designing, quantifying, and measuring exponential innovation.\n\nTo start: the recent growth metrics of what are being described as the “NFTs of Bitcoin” – Ordinal Inscriptions aka Ordinals – from Jason Nelson at Decrypt: “On Monday, February 13, Inscriptions using Ordinals passed 100,000 as users flooded the network with images, video games, and other content.” (1)\n\nFurther metrics on recent and future exponential growth of ordinal inscriptions in the bitcoin blockchain:\n\nOrdinals are currently being inscribed at a rate of: 212 / hour\n\n5,088 / day\n\n152,640 / month\n\n1,857,120 / year If this rate continues we will cross 100,000 inscriptions on February 24th and 1,000,000 inscriptions on August 20th 🤯 — Leonidas (@LeonidasNFT) February 8, 2023\n\nComparing the number of @CounterpartyXCP (CP) assets to #Ordinals CP: 124k tokens (since Jan 2014), mostly semi-fungibles, few 1/1s Ordinals: 58k (since Dec 2022), all 1/1s pic.twitter.com/rHr3zXTDNt — Doggfather (@DoggfatherCrew) February 11, 2023\n\nToday, Bitcoin reached the #2 position on our Fees & Revenue Dashboard, having accumulated $2,552,183 in gas fees paid by users over the past 24 hours. This is the highest amount since the beginning of 2023 pic.twitter.com/EkxztRZMAI — DefiLlama.com (@DefiLlama) February 3, 2023\n\nWhat are Ordinals?\n\nOur friends over at Ark Invest describe the rise of Ordinal Inscriptions:\n\n“With the launch of the Ordinals protocol, the Bitcoin network can now support non-fungible tokens (NFTs)1 directly on-chain. Users can inscribe images and other data in satoshis, the lowest denomination of bitcoin.\n\nThanks to two Bitcoin software upgrades—Segwit in 2017 and Taproot in 2021—the Bitcoin network can incorporate novel metadata on the blockchain. SegWit expanded Bitcoin’s block size from 1 megabyte to 4 megabytes, and Taproot increased data limits, enabling developers and users to encode various data types.\n\nTo understand Bitcoin Ordinals, consider the analogy to the dollar: just as 100 pennies constitute $1, 100 million satoshis constitute 1 bitcoin. Similarly, just as one might engrave a design onto a penny, bitcoin owners can “etch” satoshis, thanks to BTC Ordinals.\n\nTo date, users have created more than 100,000 Ordinals on the Bitcoin blockchain, some of them commanding large premiums. Ordinal Punks, a spin-off project from the groundbreaking Ethereum-based CryptoPunks NFT collection, sold for 9.5 BTC, or ~$218,000. The Ordinals project has sparked intense debate in the Bitcoin community. Bitcoin “purists” oppose it, claiming not only that ordinal inscriptions are congesting block space at the expense of valid financial transactions but that they also put bitcoin’s fungibility at risk because certain satoshis are worth more than others.\n\nIn contrast, Ordinal supporters maintain that inscriptions are boosting demand for block space and generating fees, compensating miners for securing the network. They also cite libertarian, free market principles, noting that the market should determine the optimal use of block space. In response to concerns about bitcoin’s fungibility, advocates liken Ordinals to “coin collections” and note that the market for collectible coins has not impacted the dollar’s fungibility. (2)\n\nWhat Next? The Exponential Growth of Block Space and Content Liability on the Bitcoin Blockchain\n\nA positive perspective is offered by Yassine Elmandjra at Ark Invest: “In our view, Ordinals have activated a new wave of Bitcoin users and developers—a net positive. Enabling new types of innovation, Ordinals have rejuvenated developer interest in building Bitcoin infrastructure. During the next few months, wallets and marketplaces are likely to support Ordinals, broadening the range of Bitcoin use cases.” (2)\n\nThe OODA Network on Ordinals\n\nLess bullish was a recent conversation during the OODA Network Monthly Meeting, which gave voice to the following concerns re: the exponential growth of ordinals, the storage capacity of bitcoin, and what that means for stakeholders up and down a bitcoin blockchain addled with (and exponentially overwhelmed by) ordinal inscriptions of a dubious (if not downright illegal) nature.\n\nOODA CEO Matt Devost observed that “this is an interesting development in what for me – prior to a week or so ago – was a relatively static technology. I didn’t expect a lot of innovation out of Bitcoin other than to continue to grow as a potential store of value. And now you have this adaptation that takes it in a different direction.”\n\nAdditional perspectives offered by the OODA Network included:\n\nIt has always been possible with Bitcoin – people have been putting texts and links to images with the current version of Bitcoin – but there is now the ability to embed images. It will cause all sorts of complications for the technology because people who are running nodes obviously have a complete copy of the blockchain in their possession.\n\nWhat happens if inscribed images have illegal materials, illegal images, or revenge porn?\n\nWhat is the responsibility of stakeholders up and down the blockchain to these embedded data types?\n\nWhat are the unique identifiers and tracking mechanisms for the inscribed data on the bitcoin blockchain?\n\nWhat is the risk for organizations running nodes that have a complete copy of the blockchain that includes ordinal inscriptions at a growing exponential volume (such as illegal materials, classified documents, and/or illegal images)?\n\nAs a person with a security clearance, am I precluded from running a blockchain node because I am storing classifier documents in a way that is not approved or legal?\n\nSometimes these technologies adapt and develop in ways that are not anticipated. From a bitcoin perspective, what if blockchain moves away from a store of value to a store of information as a priority?\n\nFinally, if you look at storage utilization and bitcoin, it is on an exponential curve, so the blocks of storage are filling up that much more quickly – at potentially exponential speed – which of course is driving up transaction costs and making the miners very happy. But what are the long-term risks and unintended consequences of this need for storage? And, as with all risks and threats, what are the parallel opportunities which will be created by this technology?\n\nDecrypt’s Nelson offered the following:\n\n“The race is on to develop more seamless methods of inscribing on Bitcoin and wallets that make it possible to view the Bitcoin NFT once it is created.\n\nLooking to create a seamless way for collectors to create Ordinal Inscriptions, Gamma, a Bitcoin NFT marketplace on Stacks, began offering a paid service that allows users to inscribe images and text. Other projects providing this service include Oridalsbot from the creators of the Satoshibles NFT collection.\n\nSo you want a Bitcoin ordinal? Start with a Bitcoin full node, then install……no, no. For the past year, we’ve focused on making the best creator tools possible. Today, we’re launching no-code ordinal inscriptions to anyone with a BTC address. 🔗 https://t.co/WQzKZUWMw1 — Gamma.io (@trygamma) February 9, 2023\n\nHiro Systems announced Tuesday it is rolling out support for Odinals on its Hiro Wallet, and on Wednesday, Xverse, a Bitcoin-based web wallet, also launched support for Bitcoin NFTs.” (1)\n\nfrom Metaversal (a Bankless newsletter) offered these insights (pro and con):\n\n“Ordinals has been met with criticism from some hardliner Bitcoiners but is hailed by others as potentially revolutionary for the future of Bitcoin’s NFT scene.\n\nNew NFTs are driving up transaction fee revenues for Bitcoin miners, potentially indicating a future where cultural activity supports the network.\n\nInscriptions are stored entirely on the Bitcoin blockchain, making them forever retrievable and x7 cheaper to mint than on-chain Ethereum NFTs.\n\nOnchain Bitcoin NFTs are becoming more popular in the Bitcoin ecosystem, driven by the need for a teeming block space market to secure the network as the BTC block subsidy decreases.\n\nOrdinals are seen as a step in the direction of a teeming block space market on Bitcoin, despite opposition from some hardliners.\n\nBitcoin’s decreasing block subsidy would eventually pose an existential crisis for Bitcoin if a thriving, organic block space market didn’t take hold on the chain. Funnily enough, the rise of Bitcoin Ordinals NFTs is the first such indication in recent memory that such an organic block space market may actually come to be, and it’s entirely through the newest Bitcoin-native version of NFTs.\n\nThese experimentations because they represent the boldest opportunities yet to break Bitcoin out and evolve it from the grips of the “old guard” hardliner Bitcoin OGs, many of whom think Bitcoin NFTs are spam and have been anti-progress presences in the crypto-economy for years now. (3)\n\nAbout the OODA Loop Exponential Innovation Series"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDMvMTAvYWdncmVzc2l2ZS1zZWxsaW5nLWluLWJpdGNvaW4tcHJpY2UtdHJhZGluZy1hdC0yMGstZG93bmZhbGwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Aggressive Selling in Bitcoin Price, Trading at $20K, Downfall? - Crypto Times",
        "content": "The largest cryptocurrency Bitcoin is underperforming nowadays. In the past several weeks, investors saw a profitable journey as the BTC price reversed from the two-year bottom. But again uncertainty remains in the market as per the price action.\n\nAt the time of writing, the Bitcoin price against USDT trades at $20,000. The market capitalization dramatically plumped by 8.16% in the last 24 hours and was recorded at $386 billion.\n\nBTC Price on 4-Hour Chart\n\nWe can see from the chart that Bitcoin price continuously slipped from the yearly high of $25,250. The bears have barely defended the $25,000 selling zone multiple times. Meanwhile, speculators are following the selling-on-top strategy and this downtrend may rest at $19,000 if BTC moves lower than the $20,000 mark.\n\nIn the recent bounce, the price structure drew an inverted pole and flag pattern. The breakdown of this bearish price structure brought an incredible opportunity for market sellers. Resulting in bears gaining more than 10% gain in the past seven days as per CoinMarketCap.\n\nIt appears buyers have lost dominance on Bitcoin, and this correction phase has turned into a downtrend as per aggressive selling and a 45-day vital support level ($21,500) breakdown.\n\nBTC on Daily Price Chart\n\nOn the daily price chart, bitcoin price is trading below the 20 and 50-day moving averages. Thus, yesterday’s aggressive decline pushed the bitcoin price toward the 200 SMA. The 200 SMA (red) seems to be the last save zone for the buyers. Below this level, BTC could trade down to $18,400 before any significant rally.\n\nNotably, trading volume spiked higher by 64% overnight and reached $36 billion. The trading volume shows intense selling in BTC. Additionally, the daily RSI entered into extremely oversold territory. And any bounceback in RSI could lead to a BTC recovery, so this could be a good buying opportunity."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3doYXQtd291bGQtdGhlLWJpdGNvaW4tc3VwcGx5LWxvb2stbGlrZS1pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "What Would the Bitcoin Supply Look Like in 2023? - Analytics Insight",
        "content": "The supply of bitcoin was strictly constrained In this article, let’s examine the Bitcoin supply in 2023\n\nCompared to other cryptocurrency coins Bitcoin is a highly erratic currency. Nakamoto put a strict limit on the bitcoin supply while creating it. The rate at which the bitcoin supply is increasing along a pre-set path is decreasing. More than 21 million bitcoins will never be in circulation. As a result, one should not be concerned about unforeseen fluctuations in the bitcoin supply. The bitcoin supply is extremely predictable. Let’s explore the Bitcoin supply in 2023. As of writing on March 9, 2023, there are 19.31 million bitcoins in circulation. One block of bitcoin transactions is verified by miners every ten minutes. 6.25 bitcoins are now awarded for validating a single bitcoin block. Thus, every day, about 900 bitcoins are issued into circulation.\n\nBitcoin’s supply is limited. As a result, trading with another person will be the only option to obtain Bitcoin once the supply is reached. There can only ever be 21 million Bitcoins in circulation.\n\nExperts predict that the total amount of Bitcoins issued will almost certainly never surpass this limit. It is so because the Bitcoin code base contains rounding operations. To impose a Bitcoin cap restriction, block rewards are frequently divided over time. There won’t be any more Bitcoin cryptocurrency created after the final 21 million have been mined. So, the only sources of income for Bitcoin miners will be the sale of their coins and transaction fees.\n\nAlthough there are theoretically 21 million bitcoins available, 4 million of them have been irretrievably lost. Bitcoins can be misplaced if the owner misplaces the private key to a paper wallet or other cold storage wallet if the private key is lost, if the wallet is misplaced, or if the owner’s wallet or hard drive is lost. Without a private key, it is impossible to use or trade bitcoins because it is necessary to send them from one wallet to another. As owners were less vigilant when the coins were just worth pennies, many bitcoins were lost in the early years of the cryptocurrency. As they are not maintained on an exchange, which may be exposed to security threats, and are kept offline, cold storage wallets are the most secure way to hold bitcoins.\n\nA sizeable fraction of the available bitcoins are owned by several investors who entered the Bitcoin market early. Whales are investors who own enough bitcoin to influence the market when they buy or sell. 5 million bitcoins, or around 28% of the entire supply, are now held by about 1,600 companies. From Bitcoin’s birth, Satoshi Nakamoto, the alleged creator (or group of founders), has kept 1 million bitcoins in their wallet without ever moving a single one. Even though some whales do sell and spend their bitcoins, most of them choose to keep with them, effectively removing them from the market.\n\nNo new bitcoins will be created after the maximum number of bitcoins has been achieved, even if that number ultimately falls slightly below 21 million. Bitcoin miners will still be compensated, but probably simply with transaction processing fees, for continuing to pool and process bitcoin transactions into blocks.\n\nBitcoin miners will undoubtedly be impacted when Bitcoin reaches its upper supply limit, but how much will depend on how Bitcoin develops as a cryptocurrency. Bitcoin miners might still be able to make money solely from transaction processing fees in 2140 if the Bitcoin blockchain handles a large volume of transactions.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vdGVjaG5leHQyNC5jb20vMjAyMy8wMy8wOS9zZW5lZ2FsLWVtYnJhY2VzLWJpdGNvaW4tYXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Senegal embraces Bitcoin as an alternative to devaluing CFA - Technext",
        "content": "Senegal, a francophone country in West Africa, has turned its attention to Bitcoin as the official currency, the CFA, continues to suffer.\n\nCointelegraph reports that a growing list of merchants and customers have joined the Lightning network and cryptocurrency education, and bitcoin adoption is rising in the country. Recently, Senegal hosted a Bitcoin conference tagged “Darker Bitcoin Days”, initiated by Bourou, to highlight the surging interest in knowing more about Bitcoin in Senegal.\n\nRead Also: Crypto layoffs decreased by 80% in February; is the FTX contagion over?\n\nIn the last few years, residents of Senegal have grown fond of transferring money via mobile phones rather than banks as the nation seeks to bank the unbanked. Cointelegraph discovered Wave, a mobile money provider in business since 2017.\n\nRead Also: Visa and Mastercard to delay crypto partnerships amidst uncertainties\n\nWave has a similar operation mode to Bitcoin. The mobile money provider seeks to bank the unbanked and improve financial conditions for financially underserved populations. With Wave, users can scan a QR code or send money to a number; this is similar to sending money over Bitcoin’s Lightning Network. But there is a transaction fee between 1% and 3%.\n\nTransactions take only a few minutes to go through. Although recognized as a helpful platform, its weakness is that it is expensive for microtransactions.\n\nBitcoin.\n\nTo test the efficiency of Bitcoin as an adequate alternative, the Cointelegraph reporter transfers bitcoin over the Lightning Network to a manager at Wave, who is interested and equally animated by the speed of the Lightning Network.\n\nScores of Senegalese showed interest in receiving, buying, and learning to keep bitcoin. Besides enjoying a fast, easy, and cost-friendly mode of transaction, the monetary chains of its colonial past could spur the faster adoption of Bitcoin in Senegal.\n\nSenegal explores other alternatives for CFA\n\nIn Africa, almost 150 million people use the Franc of the Financial Community of Africa (CFA) for their daily transactions, from Senegal in the extreme west to Gabon in the centre of the continent.\n\nThe CFA franc is used in 14 countries. Its value corresponds with the Euro. Printed in France, its monetary policy is regulated by Western powers. As Fodé Diop, a Bitcoin Lightning developer from Senegal, details, “The IMF and the French government still control the currency.”\n\nRead Also: Want to invest in March? Here are 3 cryptocurrencies to consider\n\nIn 1994, a devastating experience eroded the Senegalese society when the value of the local currency, the CFA, was slashed in half through the merged efforts of France, the World Bank, and the International Monetary Fund. As a result, the fiat savings of Senegalese were decimated. This incident has produced a lack of doubt in the CFA among Senegalese.\n\nRead Also: Notorious crypto scammer Monkey Drainer retires\n\nGloire, the founder of Kiveclair, a Bitcoin Beach-inspired refugee project in the Congo, told Cointelegraph that the CFA “makes whole countries dependent” and “it is usually the poorest who suffer.”\n\n“The most striking example is that of 1994, when France and a privileged few decided to devalue the CFA Franc. There is no guarantee that such a thing will not happen again, especially since the global economy is threatened.\n\nThis is why Senegal is exploring other viable alternatives to replace the CFA."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYml0Y29pbi11c2QtMjE3NDgtZXRoZXItY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktMzg0NTYxM9IBbWh0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYml0Y29pbi11c2QtMjE3NDgtZXRoZXItY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktMzg0NTYxMy9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Slips to Lowest in Weeks, Ether Joins Majority Cryptocurrencies in Seeing Losses - Gadgets 360",
        "content": "Bitcoin sunk to its lowest value in three weeks on Thursday, March 9, as the market shuffle triggered by the Silvergate fiasco only raised more concerns among investors. With a loss of 2.05 percent, the value of Bitcoin slipped to the price point of $21,748 (Roughly Rs. 17.8 lakh) overnight. In the last 24 hours, BTC reduced in value by $407 (roughly Rs. 33,324). BTC's situation remains similar on both national as well as on international exchanges.\n\nEther fell by 1.85 percent to trade at $1,537 (roughly Rs. 1.25 lakh), showed the crypto price tracker by Gadgets 360. The value of ETH dipped by $15 (roughly Rs. 1,228).\n\nThe last ten days have witnessed crucial changes in the trading sentiment around the crypto assets. Both the top two cryptocurrencies, Bitcoin and Ether fell notably from their March 1 values that stood respectively at $23,422 (roughly Rs. 19 lakh) and $1,635 (roughly Rs. 1.35 lakh).\n\n“Investors and traders tried to digest the major negative development from last week around crypto-friendly bank Silvergate Capital. After it failed to submit its 10-K filing, the stock came under tremendous pressure as fears of bankruptcy gained traction. Major US crypto players severed banking relations while their settlement platform SEN was shut down,” Parth Chaturvedi, the Crypto Ecosystem Lead, CoinSwitch told Gadgets 360 explaining the factors that have left the crypto market shook in recent days.\n\nMost cryptocurrencies on Thursday were met with value dips.\n\nThese include stablecoins like Ripple, USD Coin, Tether, as well as Binance USD.\n\nCardano, Polygon, Solana, Polkadot, as well as Litecoin — all recorded minor losses.\n\nMemecoins Dogecoin and Shiba Inu were spotted taking different sides on the crypto price charts. While DOGE settled with losses, SHIB managed to mint peripheral profits.\n\nUnderdog altcoins Qtum and Augur joined SHIB on the green-side of the crypto chart.\n\nThe global crypto market valuation slipped by 1.54 percent over the last 24 hours. The market cap of the crypto sector currently stands at $998 billion (roughly Rs. 81,74,010 crore). At the beginning of the month, the market cap stood at $1.08 trillion (roughly Rs. 89,26,560 crore).\n\nAmid the fluctuating volatility of the crypto sector, India has decided to bring virtual digital assets under its Prevention of Money Laundering Act (PMLA).\n\n.@FinMinIndia's notification to bring VDA transactions under #PMLA is a positive step in recognizing the sector.\n\n\n\nThis will strengthen our collective efforts to prevent VDAs from being misused by bad actors.@CoinSwitch has always prioritized KYC & responsible use of crypto. pic.twitter.com/PENmEMiWHN — Ashish Singhal (@ashish343) March 8, 2023\n\n“Finance Ministry's notification to bring VDA transactions under the PMLA is a positive step in recognising the sector. We took a conscious decision in 2021 to limit crypto movement within our KYC-compliant ecosystem to ensure transparency and compliance with the laws of the land. The new rules are introduced to prevent misuse of crypto, such as money laundering, and they do not stop the regular, KYC-verified conversion of crypto to INR,” Ashish Singhal, the CEO of CoinSwitch told Gadgets 360.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nFrom smartphones with rollable displays or liquid cooling, to compact AR glasses and handsets that can be repaired easily by their owners, we discuss the best devices we've seen at MWC 2023 on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL3d3dy5nYWRnZXRzMzYwLmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL2JpdGNvaW4tcHJpY2UtdG9kYXktdXNkLTE5OTc4LW1hcmNoLTEwLWV0aGVyLXN0YWJsZWNvaW5zLWNyeXB0b2N1cnJlbmN5LXZhbHVlcy1zaWx2ZXJnYXRlLWJhbmstc2h1dGRvd24tMzg0ODY1N9IBogFodHRwczovL3d3dy5nYWRnZXRzMzYwLmNvbS9jcnlwdG9jdXJyZW5jeS9uZXdzL2JpdGNvaW4tcHJpY2UtdG9kYXktdXNkLTE5OTc4LW1hcmNoLTEwLWV0aGVyLXN0YWJsZWNvaW5zLWNyeXB0b2N1cnJlbmN5LXZhbHVlcy1zaWx2ZXJnYXRlLWJhbmstc2h1dGRvd24tMzg0ODY1Ny9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Continues to Lose Steam in Silvergate Shutdown Aftermath, Most Altcoins Record Losses - Gadgets 360",
        "content": "Bitcoin slipped by eight percent to trade at the price point of $19,978 (roughly Rs. 16 lakh) on Friday. On national as well as international exchanges, BTC has recorded a similar overnight market movement trajectory. In the last 24 hours, the value of Bitcoin dropped by $1,770 (roughly Rs. 95 lakh). BTC began losing steam after crypto titan Silvergate Bank scared investors with the possibility of another FTX-like industry debacle last week. Silvergate later confirmed that it will shut operations amid regulatory pressures and the impact from the collapse of FTX..\n\nWith a dip of 7.81 percent, Ether's value saw a substantial fall on Friday. The value of ETH, at the time of writing, stood at $1,414 (roughly Rs. 1.16 lakh), according to the crypto price tracker by Gadgets 360. Overnight, the price of ETH tumbled by $123 (roughly Rs. 10,095).\n\n“Overall, the market is experiencing uncertainties surrounding Silvergate, potential interest rate hikes, and the upcoming US jobs data. The market sentiment may also have prompted traders and investors to sell off due to the potential threat of higher interest rates,” Edul Patel, the CEO and Co-Founder of Mudrex told Gadgets 360.\n\nMost cryptocurrencies followed BTC and ETH and recorded loses on Friday. These include memecoins Dogecoin and Shiba Inu.\n\nSolana, Polkadot, Polygon, as well as Litecoin also saw their values fall amid the ongoing crypto meltdown.\n\nVarious stablecoins showed different movements amid the ongoing volatility. Tether and USD Coin, for instance, rose in value with minor hikes. Ripple on the other hand, settled with dipped pricing.\n\nThe overall crypto sector valuation sunk by 6.73 percent in the last 24 hours. The market cap of the crypto industry on Friday stood at $930.77 billion (roughly Rs. 76,39,468 crore) as per CoinMarketCap.\n\n“Fed Chair Jerome Powell has declared that as inflation remains uncomfortably high, interest rates might continue to be increased and remain elevated for longer,” Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch told Gadgets 360. “With access to US banking routes getting more difficult for crypto players, trading liquidity remains shallow and, in turn stressing overall crypto markets. All eyes on upcoming Macro data next week, as a ‘risk-off' sentiment would hurt crypto prices further. Also worth monitoring is the fallout from Silvergate and any further industry casualties that it brings along,” he added.\n\nCosmos, Dash, and Qtum were among the few cryptocurrencies that saw their values rise on Friday.\n\n“Closer home, CRE8, an Indian Rupee denominated Virtual Digital Asset (crypto) index was down 9.19 percent in the past seven days. The Index value stood at Rs. 672.43 at 8 AM, March 10, 2022,” Chaturvedi noted.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nFrom smartphones with rollable displays or liquid cooling, to compact AR glasses and handsets that can be repaired easily by their owners, we discuss the best devices we've seen at MWC 2023 on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nCryptocurrency is an unregulated digital currency, not a legal tender and subject to market risks. The information provided in the article is not intended to be and does not constitute financial advice, trading advice or any other advice or recommendation of any sort offered or endorsed by NDTV. NDTV shall not be responsible for any loss arising from any investment based on any perceived recommendation, forecast or any other information contained in the article.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tYW5kLWV0aGVyZXVtLWRpcC1idXQtbG9ja3lvdXJjcnlwdG8tY29tLWlzLWhlcmUtdG8tc2F2ZS15b3UtZnJvbS15b3Vyc2VsZi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Dip But Lockyourcrypto.com is Here to Save You From Yourself! - Analytics Insight",
        "content": "Bitcoin and Ethereum Suffer\n\nThe crypto friendly bank Silvergate Bank has recently been struggling due to increased market regulations and has just announced that it will be winding down operations shortly. It’s safe to say that this has negatively affected the crypto market as Bitcoin and Ethereum have both dipped in value as a result.\n\nBitcoin has been on a downward bearish trend for the past week, and dipped under $22,000. BTC currently trades at a low of $21,664.22 and is down around 7.5% in the past 7 days. The bear trend comes in the midst of Silvergate Bank concerns and higher interest rates across the world, which are higher than first anticipated.\n\nEthereum is also in the red, but the decline has not been as severe as Bitcoin’s. Ethereum is down around 6% in the past week and currently trades at $1.535.45.\n\nEthereum’s current price prediction has a mixed outlook. Compared to Bitcoin it could be bullish but the burn rate of ETH tokens has decreased significantly since February. Since the start of March the blockchain has deployed various network upgrades and improvements which could help the coin rally.\n\nEnter Lockyourcrypto.com\n\nLockyourcrypto.com is an innovative platform that is designed to protect you from yourself. If you’re prone to panic selling or buying, this could be the perfect solution for you.\n\nWith Lock You Coin, you can deposit and store your crypto for a chosen amount of time. You will then receive a certificate verifying the amount and length of time. You won’t be able to make any withdrawals or transfers during this time – unless there is an extreme emergency. So no matter how much you’re tempted, your money will be safe with Lockyourcrypto.com.\n\nLockyourcrypto.com is a reliable and secure platform for storing and transferring cryptocurrencies. It uses industry standard security measures including high-level encryption and secure storage practices to ensure safety and privacy of user data and funds.\n\nStorage and security are some of the biggest barriers for crypto users and the potential for hacking or security breaches remains high. Lockyourcrypto.com has taken every measure possible to minimise the risk of security breaches and theft.\n\nLockyourcrypto.com makes the process sleek and easy for you. The platform has a user-friendly interface and will be continually developing to stay up to date and support you in every way.\n\nIf you’re unsure of the crypto market, and don’t want to make any mistakes that could lose your money, Lockyourcrypto.com is here to help you. Follow the link to find out more:\n\nWebsite: https://lockyourcrypto.com/\n\nTwitter: https://twitter.com/_LockYourCrypto\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiKWh0dHBzOi8vY2xlYXJ0YXguaW4vcy9iaXRjb2luLXZzLWV0aGVyZXVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum: How Is Ethereum Different From Bitcoin - ClearTax",
        "content": "Bitcoin and Ethereum are the Xbox and Playstation of the cryptocurrency world. They are two of the most popular cryptocurrencies whose contribution to the sector's growth has been enormous. From price to the premise, their concepts are unique but with a few things in common.\n\nWhat is Bitcoin?\n\nUsers under the pseudonym Satoshi Nakamoto first created the concept of Bitcoin in 2008. Bitcoin allows users to manage a currency not controlled by any financial institution or government.\n\nA set of decentralised networks runs the Bitcoin blockchain software with its own rules to which every participant must agree. These rules determine how every transaction works. It was the first cryptocurrency based on DLT (Decentralized Ledger Technology) blockchain.\n\nThe Bitcoin network processes multiple data sets and converts them into hashes through an algorithm called the SHA-256 hash function. It processes data and converts them into long strings of numbers.\n\nBitcoin's mining and consensus mechanism ensures that users cannot spend their funds twice, enabling it to stand out as a tamper-proof currency. Moreover, Bitcoin also features a store of value, which users can stock as an asset and use over time. Bitcoin's hassle-free mode of transactions has increased its popularity over time.\n\nWhat is Ethereum?\n\nThe Ethereum network was launched in July 2015, and its co-founder, Vitalik Buterin, published its white paper in 2013. Ethereum uses its blockchain to create a decentralised computer, like interacting with applications and making transactions based on the Ethereum network.\n\nThe main goal of Ethereum was to decentralise everything on the internet. This cryptocurrency operates on its programming language and solidity and is surging daily on the ladders of innovation. For instance, Non-Fungible Tokens (NFTs) and decentralised financial service applications are examples of what developers can create using Ethereum-based smart contracts.\n\nUsers must pay a fee for creating smart contracts, paying for transactions, and using decentralised apps in Ether. Today, as this ambitious cryptocurrency's value is increasing, it is also being used to store value.\n\nBitcoin and Ethereum: Overview\n\nQuite often, these two biggies of the crypto world are compared against each other. However, you should know that Bitcoin and Ethereum are merely systems, whilst the cryptocurrencies these two systems use are called bitcoin (small letter b) and Ether. Their respective stock symbols are:\n\nbitcoin: BTC\n\nEther: ETH\n\nMain takeaways: Bitcoin v/s Ethereum\n\nParticulars Bitcoin Ethereum Currency v/s platform A feasible alternative to traditional currency. Acts as a medium of exchange and store of value. A platform that runs programmatic applications and contracts via Ether. Launch date January 2009 July 2015 Price** £23,756 £1,575 Market cap** £478 bn £191 bn Consensus mechanism Proof of work Proof of stake Block time 10 minutes 12 to 14 seconds Max supply 21 million Unlimited\n\n**Please note that the abovementioned data is current as of 27th May 2022 and is subject to change over time.\n\nSpeaking of how similar these two systems are, both use blockchain technology to record and validate all their transactions. However, Ethereum's upcoming change plans differ concerning accessibility, sustainability, and speed.\n\nBefore discussing their major difference in the consensus mechanism, let's understand what a consensus mechanism is.\n\nConsensus Mechanism\n\nA consensus mechanism refers to a computer algorithm which mainly aims at solving the problem of 'double spending' by making any blockchain viable. BTC is a string of codes that can be infinitely copied. In other words, you can become as wealthy as you want to be by simply making multiple copies of your BTC.\n\nHowever, the reality is very different. Every time you spend a bitcoin, its copy gets destroyed, and the recipient on the other side of the transaction receives a new version. A record of all details of transactions is maintained on a distributed ledger, where the world can see that you have spent your BTC.\n\nThe ledger holders' consensus would clearly indicate the fake one if you attempt to spend a copied version. Counterfeiting even one such transaction would be difficult, and then you have to modify each transaction since all of them are correlated.\n\nTo work around this, you either have to control at least 51% of that network's mining hash rate or have massive computing power. Therefore, an attack as such on Bitcoin or Ethereum is probable but still hypothetical. From the very beginning, Bitcoin and Ethereum used distinct consensus mechanisms. Bitcoin uses 'proof of work' while Ethereum aims at using a 'proof of stake' consensus mechanism.\n\nBitcoin: Proof of Work\n\nProof of work (PoW) is the decentralised consensus mechanism, where network members put feasible amounts of effort to deter anyone from gaming the system. It is mainly used in cryptocurrency mining for mining new tokens and validating transactions.\n\nProof of Work: Understanding\n\n'Work' involves estimating a unique 64 characters string that is alphanumeric as accurately as possible. Within a 10-minute window, anyone making the maximum number of guesses per second has the highest chance of being chosen as a validator.\n\nProof of Work: Criticism\n\nEarlier, hobbyists sitting at home used to do this 'work'. However, the processing power required to get it done has increased exponentially. As a result, only those able to afford the necessary power and hardware can get this work done today, like companies and specialist mining organisations.\n\nThe energy required for computer hardware is enormous and is the sole reason behind Bitcoin's criticism. Currently, it uses 19 terawatt hours (TWh) every year, nearly the amount used by an entire country like Norway.\n\nEthereum: Proof of Stake\n\nThis consensus mechanism initiates processing transactions and helps create new blocks in the blockchain based on the total number of validator stakes coins. The PoS structure has less potential for a network attack thanks to its well-designed structure.\n\nUnder Proof of Stake, the next block writer is selected randomly, with nodes having larger stake positions being assigned with higher odds.\n\nProof of Stake: Understanding\n\nUnder proof of stake (PoS), owners themself offer coins as collateral and are given a chance to validate blocks. As a result, coin owners with 'stake coins' are eligible to become 'validators'; however, they should own a specific amount of stake coins. Next, a random validator is selected who gets to do the 'mining' unlike the competition-based mechanism as in the proof of work.\n\nProof of Work v/s Proof of Stake: Main Takeaways"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYml0Y29pbi10YXhlcy1taW5pbmctcG93ZXItdXNlLXNwaWtlLTMwLXBlcmNlbnQtdXMtbWFya2V0LXN1ZmZlcnMtMzg0OTE4MNIBfGh0dHBzOi8vd3d3LmdhZGdldHMzNjAuY29tL2NyeXB0b2N1cnJlbmN5L25ld3MvYml0Y29pbi10YXhlcy1taW5pbmctcG93ZXItdXNlLXNwaWtlLTMwLXBlcmNlbnQtdXMtbWFya2V0LXN1ZmZlcnMtMzg0OTE4MC9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Taxes on Crypto Mining Power Use to Spike Next Year in US, Plan Outlined - Gadgets 360",
        "content": "The US government is considering several ways to balance its destabilised economy by reeling-in more funds into its financial systems. The crypto mining community in the US could face the burn of these tax hikes as the US government has proposed to raise the taxes on the electricity requirement for miners. The idea was part of US President Joe Biden's annual budget speech on March 9. From amending policies around the crypto sector, the Biden administration is reportedly expecting to churn over $24 billion (roughly Rs. 1,96,700 crore) to the US economy.\n\nThe tax imposed on the electricity usage by crypto mining firms could now go as high as 30 percent of total cost of the electricity that was used to facilitate the mining process in the US.\n\nWhile sufficing the US Treasury is among key reasons behind this proposal, the US is also looking to curb the excessive environmental impacts that have been known to be by-products of the energy-intensive crypto mining business.\n\n“Firms engaged in digital asset mining would be required to report the amount and type of electricity used as well as the value of that electricity, if purchased externally. Firms that produce or acquire power off-grid, for example by using the output of a particular electricity generating plant, would be subject to an excise tax equal to 30 percent of estimated electricity costs,” the US Treasury disclosed in an official post.\n\nThe excise tax for digital asset mining firms would be executed gradually, in a decided time frame of three years. It would start at a rate of 10 percent in the first year, 20 percent in the second, and 30 percent thereafter.\n\nOne of the few surprises in the Biden budget. A proposed excise tax on electricity usage from crypto mining. Phasing in at 10% in year one and climbing to 30%. pic.twitter.com/UPgUdr8CeG — John Buhl (@jbuhl35) March 9, 2023\n\nCrypto mining is the process of generating newer crypto tokens. Miners are required to solve complex algorithms to validate transactions happening on the blockchain and generate newer tokens as rewards and by-products.\n\nBefore 2021, China was emerging as the hotspot for crypto miners. After China imposed a blanket ban on all crypto activities in September 2021, miners flocked to other favourable locations including Kazakhstan, Russia, El Salvador, as well as regions in the US like Texas and New York State among others.\n\nThe US was named as the world's largest Bitcoin mining hub last year by Cambridge researchers. The crypto mining activities in the US in around 2021 reportedly made up for around 37 percent of the global hashrate, a metric used to measure the computing power used for mining.\n\nWith the job opportunities that the crypto mining business brings in, US' Kentucky state has begun evaluating cost-effective ways to generate electricity to support the mining industry.\n\n“An excise tax on electricity usage by digital asset miners could reduce mining activity along with its associated environmental impacts and other harms. The increase in energy consumption attributable to the growth of digital asset mining has negative environmental effects as well as increase energy prices for those that share an electricity grid with digital asset miners,” said the US government, justifying the tax hike it plans to levy on the crypto mining business.\n\nThe implementation of this rule has been slated for next year.\n\nGaana, JioSaavn, Google Podcasts, Apple Podcasts,\n\nFrom smartphones with rollable displays or liquid cooling, to compact AR glasses and handsets that can be repaired easily by their owners, we discuss the best devices we've seen at MWC 2023 on Orbital , the Gadgets 360 podcast. Orbital is available on Spotify Amazon Music and wherever you get your podcasts.\n\nAffiliate links may be automatically generated - see our ethics statement for details."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbnMtY29ycmVsYXRpb24td2l0aC1uYXNkYXEtZHJvcHMtdG8tMS15ZWFyLWxvdy1oZXJlcy13aGF0LWl0LW1lYW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin's correlation with Nasdaq drops to 1-year low; Here's what it means - Finbold - Finance in Bold",
        "content": "The relationship between the stock market and the cryptocurrency sector has been a matter of interest for quite some time now, and recently the correlation between Bitcoin (BTC), the largest digital asset by market capitalization, and the Nasdaq 100 index has recorded its lowest levels in a year.\n\nAs it happens, the correlation of daily returns between the Nasdaq 100 and Bitcoin has dropped to the lowest level since the United States Federal Reserve signaled rates hiking at the beginning of 2022, the crypto trading and investment platform CoinShares said on March 8.\n\nNasdaq 100 and Bitcoin correlation. Source: CoinShares\n\nSpecifically, the (de)correlation level between the two at press time stood at 34%, close to that from February 2022, increasing soon after. According to the platform, the current “decorrelation could continue as the Fed rate hikes slow, further anchoring Bitcoin as an interest rate-sensitive asset.”\n\nEssentially, Bitcoin previously had the tendency to move in the same direction as the large companies listed on the Nasdaq 100 index, leading some financial experts to see this as an argument against the digital asset’s role as a diversifier. However, the recent decorrelation might prove them wrong.\n\nBitcoin price analysis\n\nIndeed, as things stand, the representative decentralized finance (DeFi) asset is currently changing hands at the price of $21,701, which demonstrates a decrease of 1.44% on the day, in addition to the losses of 8.18% and 4.76% on its weekly and monthly charts, respectively.\n\nBitcoin 7-day price chart. Source: Finbold\n\nMeanwhile, the crypto market has continued to crash under significant selling pressure and the increasing ‘FUD’ (Fear, Uncertainty, and Doubt) in recent days, which have together managed to pull its market cap to decline below the $1 trillion psychological threshold.\n\nAdding to the FUD, the U.S. government has moved $1 billion worth of Bitcoin it seized from the anonymous darknet marketplace Silk Road in 2021 and 2022, propping up fears of an imminent BTC dump, which could exert even more pressure on the market and see BTC lose more support levels.\n\nHowever, this could also represent a good opportunity to buy the maiden crypto before its price increases again, as Bitcoin has been demonstrating a steady pattern of optimal times for decision-making in crypto trading strategies – buy, hodl, and sell – over the past years.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWNvbW11bml0eS13aXRoLTgxLWhpc3RvcmljYWwtYWNjdXJhY3ktc2V0cy1iaXRjb2luLXByaWNlLWZvci1tYXJjaC0zMS0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Mar 2023 08:00:00 GMT",
        "title": "Crypto community with 81% historical accuracy sets Bitcoin price for March 31, 2023 - Finbold - Finance in Bold",
        "content": "Disclaimer: The CoinMarketCap cryptocurrency community price estimate is based only on the votes of its users. Estimates do not guarantee end-of-month prices.\n\nWhile Bitcoin (BTC) rallied for the first 45 days of the year, its price has been more bearish in recent weeks due to the United States Securities and Exchange Commission’s (SEC) continued crackdown on crypto firms and Silvergate Capital Corporation, the holding company of crypto-focused Silvergate Bank decision to wind down operations.\n\nThe volatility has left many in the cryptocurrency community confused about the future price of the maiden digital asset, with many traders turning to deep learning algorithms to forecast the coin’s price for the end of the month.\n\nBesides the artificial intelligence (AI) price estimation, the thoughts of the crypto community over at CoinMarketCap, which have an 81% historical accuracy of predicting Bitcoin’s price over the last six months, are also worth examining. Notably, the most recent estimation accuracy for the end of February was 89.63%.\n\nBitcoin 6-month estimation accuracy. Source: CoinMarketCap\n\nShould the estimations of 12,377 member votes prove true for March 31, it would mean that the price of Bitcoin by the end of March will trade at $21,192, a decline of -2.43% or -$528 at the time of publication.\n\nBitcoin end of March price estimation. Source: CoinMarketCap\n\nBitcoin technical analysis\n\nBitcoin’s technical analysis (TA) on TradingView’s 1-day gauges remains mixed; its summary aligns with the ‘sell’ sentiment at 11, resulting from oscillators pointing at ‘buy’ at 3 and moving averages (MA) indicating a ‘sell’ at 10.\n\nBitcoin 1-day trading gauges. Source: TradingView\n\nIn the last 24 hours, Bitcoin was trading as high as $22,198 and fell to as low as $21,588. Currently, Bitcoin is trading at $21,733, down 1.12% on the day and a further 6.51% across the previous week, with a total market capitalization of $420 billion, as per the data retrieved by Finbold on March 9.\n\nBitcoin 1-day price chart. Source: Finbold\n\nDue to the fact that it was unable to break through the crucial $22,250 resistance zone, investors’ expectations for a rebound in the price of Bitcoin were disappointed. The price continued to fall, breaking below the $22,000 mark that was acting as support as relentless bears exercised their impact.\n\nThis steep collapse helped prepare the way for even higher losses as the price continued to fall to set a new monthly low. At this time, the price of Bitcoin is consolidating the losses it has sustained over this turbulent period.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]