[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS93aGF0LWlzLWEtYml0Y29pbi1pbXByb3ZlbWVudC1wcm9wb3NhbC1iaXDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "What Is a Bitcoin Improvement Proposal (BIP)? - Ledger",
        "content": "What Is a Bitcoin Improvement Proposal (BIP)?\n\nBy Lipsa Das\n\nRead 5 min Beginner\n\nSHARE\n\nKEY TAKEAWAYS: — Bitcoin Improvement Proposals, or BIPs, propose changes to how the core Bitcoin blockchain or associated communication protocols work.\n\n\n\n— There are three types of BIPs: Standards Track (for network changes), Informational (for general knowledge), and Process BIPs (for procedural changes).\n\n\n\n— BIPs have helped implement some of the most famous Bitcoin upgrades, like Segwit & Taproot.\n\nBitcoin — the world’s largest cryptocurrency — is entirely decentralized and autonomous. The entire network runs on miners and nodes: computers that run Bitcoin software and work to keep the network secure.\n\nThese miners and nodes decide on any upgrades to the network by a vote, completely free of any third party. These upgrades can range from bug fixes or feature changes to even hard forks, where the entire network splits!\n\nHowever, coordinating upgrades and achieving community consensus across a big blockchain network like Bitcoin takes work. That’s where Bitcoin improvement proposals or BIPs come in.\n\nBitcoin Improvement Proposal (BIPs) allow community members to vote on protocol decisions in an organized way, even without centralized leadership.\n\nBut what are Bitcoin improvement proposals, and how do they work? If you want to understand the Bitcoin protocol, understanding the role of BIPs in the Bitcoin community is crucial. Let’s dive in!\n\nWhat Is a Bitcoin Improvement Proposal (BIP)?\n\nA Bitcoin Improvement Proposal, or BIP, is a technical document that proposes changes, ideas, or enhancements to the core Bitcoin blockchain. These BIPs can range from general community guidelines to major changes to the protocol. However, each BIP usually focuses on making one key change to the blockchain. If you want to know how Ethereum processes similar changes, check out our article on what an EIP is.\n\nHow Do Bitcoin Improvement Proposals (BIPs) Work?\n\nBIPs are the driving force behind the continuous evolution of the Bitcoin protocol, shaping the chain’s future. Let’s look at the creation and approval process.\n\nHow are Bitcoin Improvement Proposals Created?\n\nSince Bitcoin is an open-source protocol, anyone can propose a BIP by submitting an informal proposal to the Bitcoin developers’ mailing list.\n\nSo how does that work?\n\nWell, firstly, Bitcoin Improvement Proposal (BIP) authors collect initial community feedback and vet the idea. Then, once the author has reasonable confidence in the idea’s potential, they send a draft BIP to the mailing list.\n\nHere, the community discusses the idea and fleshes out the core points for and against the proposal. Proposal rejections are common at this stage, especially if there are obvious conflicts or duplicate BIPs. However, some proposals can also stay in the discussion stage for years if there is no consensus, for example, the Block size debate.\n\nIf the community agrees that the idea holds merit, the proposal gets a BIP number and becomes a BIP document. Then, BIP editors take up the task of making sure everything is accurate. The BIP moves from the “informal” stage to the “official” proposal at this stage.\n\nIt’s important to note that the BIP is not yet approved for development. Think of this as the filing and pre-trial stage of a lawsuit in court, when all of the details are written up, and the community feels the idea needs to be discussed more.\n\nThe community also publishes it to the Bitcoin Core Github repository of BIPs — a collection of all Bitcoin Proposals proposed so far.\n\nHow Are BIPs Approved?\n\nTo become part of the Bitcoin protocol, the Bitcoin Improvement Proposal (BIP) must achieve consensus among the community. To do that, it undergoes thorough review and analysis by the developers and the broader Bitcoin community. This includes the potential benefits and drawbacks, pros and cons, and the overall time investment.\n\nIf there are any necessary code changes, developers also start testing and implementing the code. This process can be long and complicated.\n\nThe community rejects the BIP if the developers find the code is bad or introduces challenges that can’t be resolved. Or, if everything looks okay, the community will begin implementing and activating it.\n\nTypes of Bitcoin Improvement Proposals (BIPs)\n\nBIP approval process depends majorly on its type. There are three types of BIPs: Standards Track, Informational, or Process BIPs. Let’s look at each of them and what they entail.\n\nStandards Track BIPs\n\nStandards Track BIPs are proposals that change the aspects of the protocol — transaction or block validation or encoding schemes. In the case of hard forks when the chain splits into two, Standard BIPs ensure interoperability between the legacy Bitcoin chains and the new ones. Since these BIPs involve significant code changes, they require community consensus.\n\nInformational BIPs\n\nInformational BIPs share knowledge and insight into Bitcoin’s upcoming plans. These documents provide general guidelines, design issues, or information relevant to the Bitcoin community. Since they are more informational, they do not require community consensus.\n\nProcess BIPs\n\nProcess BIPs, or consensus BIPs, outline procedural aspects, guidelines, or changes to the decision-making process of Bitcoin or consensus mechanism. While they are similar to informational BIPs, they require consensus (a clear miner majority of 90%).\n\nConsensus BIPs are for changes outside the Bitcoin protocol, meaning they don’t affect Bitcoin’s codebase. For example, implementing a soft fork and updating old miner software across the network requires a Process BIP.\n\nFamous Bitcoin Improvement Proposals You Should Know About\n\nBitcoin Improvement Proposals (BIPs) are key to the advancement of Bitcoin. In the last decade, BIPs have shaped the Bitcoin network, addressing critical issues and enhancing block capabilities.\n\nLet’s look at some historic BIPs, their significance in Bitcoin development, and their ripple effect on the community.\n\nBIP 001 and 002\n\nThe first-ever BIP created by Amir Taaki, BIP 001 was essentially a proposal on what a BIP should be. In other words, it explains the process of submitting and discussing a BIP, going into detail about the types of BIPs, workflow, submission formats, and more.\n\nBIP 002, on the other hand, amends some of these guidelines, elaborates on key approval processes, and answers common questions about BIPs. It also adds BIP licensing, comments, and formatting guidelines.\n\nBoth of these BIPs were Process BIPs, which required the community to agree on them. Together, these two BIPs set the stage for the ongoing evolution of Bitcoin.\n\nBIP 8 & 9\n\nBIP 8 and BIP 9 are both consensus (process) BIPs that enable soft forks, backward-compatible changes to the Bitcoin protocol. Every soft fork is a major protocol change that the majority of the network participants agree with, so miners can just upgrade their software to remain in sync with the network.\n\nBIP 8 and 9 provide mechanisms for signaling and activating these soft fork changes.\n\nSegWit\n\nOne of the most popular Bitcoin upgrades, Segwit, was the result of a series of BIPs, namely BIP-91, BIP-141, and BIP-148. BIP-141 introduced the SegWit upgrade, while BIP-148 activated the soft fork to implement it. BIP-91, on the other hand, reduced the consensus threshold to 80%, for Segwit to pass successfully.\n\nSegwit made the Bitcoin network scalable by reducing the size of transaction data. With less metadata, Bitcoin blocks can fit more transactions, increasing overall speed after the Segwit upgrade. Segwit was also key for developing popular Bitcoin Layer 2 networks, such as Lightning.\n\nTaproot\n\nTaproot, the most recent upgrade to the Bitcoin protocol, consisting of three BIPs: BIP 340 (Schnorr signatures), BIP 341 (Taproot), and BIP 342 (Tapscript). With Taproot, the Bitcoin protocol is more privacy-friendly and can also support innovations like Ordinals.\n\nTaproot’s initial idea proposal was in January 2018 by software developer Greg Maxwell. Post that, Bitcoin developers Pieter Wuille, Tim Ruffing, A.J. Townes, and Jonas Nick worked on implementing it. Almost four years after the initial proposal, Taproot was finally integrated in November 2021.\n\nNavigating The Bitcoin Network\n\nWhile the Bitcoin network evolves and changes with BIPs, Ledger has your back. Ledger Live adapts to all major Bitcoin changes quickly. For instance, Ledger Live supports both Segwit and Native Segwit accounts, ensuring inter-compatibility across the ecosystem.\n\nPlus, the Ledger ecosystem also allows you to run a full Bitcoin node yourself. As an advanced crypto user, you can take full advantage of Ledger Live while running your own Bitcoin node via Ledger SatStack. In short, you can become a part of the consensus process, and earn rewards for doing so. To learn more, make sure to check out the support article on how to run a bitcoin node.\n\nInteracting with the Bitcoin network safely is easy, if you take the right precautions that is. To stay safe while exploring the Bitcoin Ecosystem, consider protecting your assets with a hardware wallet. After all, not your keys, not your coins. Ledger devices offer you asset protection, but they also allow you full control over your assets and how you manage them."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjYvYml0Y29pbi1tb3Zlcy1saXR0bGUtb24tdGhlLXdlZWstZGVzcGl0ZS1kZWJ0LWRlYWwtaW5mbGF0aW9uLWNvbmNlcm5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Bitcoin Moves Little on the Week Despite Debt Deal, Inflation Concerns - CoinDesk",
        "content": "Of the 156 individual assets across the base of CMI sectors, only 20 finished the week in positive territory. Another standout, albeit one with a market cap of less than $1 billion, was decentralized computation token ARPA, up 88%. ARPA is trading 167.2% higher on the month, and over 200% higher over the last 12 months."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTI2L2JpdGNvaW4tcy13YWl0LWFuZC1zZWUtbW9kZS1wdXRzLXZvbGF0aWxpdHktYXQtbG93ZXN0LXNpbmNlLTIwMjDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Bitcoin's Volatility Drops to Lowest Since 2020 While AI Tokens Take Off - Bloomberg",
        "content": "The typically hyper-volatile Bitcoin hasn’t been so choppy of late at all.\n\nThe largest digital asset hasn’t posted a daily move of 6% for 70 sessions, the longest streak of calm since October 2020, data compiled by Bloomberg show. And the coin is on pace for a slight loss in May after gaining each of the first four months of the year."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXdlaWdoZWQtZG93bi1kZWJ0LWNlaWxpbmctdW5jZXJ0YWludHkv0gFaaHR0cHM6Ly9mb3JrYXN0Lm5ld3Mvd2Vla2x5LW1hcmtldC13cmFwLWJpdGNvaW4td2VpZ2hlZC1kb3duLWRlYnQtY2VpbGluZy11bmNlcnRhaW50eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin weighed down by debt ceiling uncertainty - Forkast News",
        "content": "Bitcoin fell 1.40% from May 19 to May 26 to trade at US$26,451 at 7:00 p.m. Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading under US$30,000 since April 19. Ether rose 0.34% over the week to US$1,813 recapturing US$1,800 on Thursday.\n\nThe lack of progress in U.S. debt ceiling negotiations continued to erode risk appetite as the June 1 deadline neared. On Wednesday, Fitch Ratings placed the U.S.’ AAA rating on a negative rating watch, saying that debt ceiling negotiations raised the risks of the government missing payments on some of its obligations.\n\n“Bitcoin and Ether have shrugged off the U.S. debt ceiling negotiations and the potential ripple effects for crypto. President Biden has already declared the country will not default on its debt,” Lucas Kiely, the chief investment officer of digital asset platform Yield App, said. “With liquidity tight, the crypto market doesn’t seem to be too concerned over these macro events. It will take something much more substantial to move these markets.”\n\nJohnny Louey, a crypto research analyst at trading platform LiquidityTech Protocol, disagreed, saying that the debt ceiling negotiations are the main factors weighing down Bitcoin price.\n\n“Although the debt ceiling has been raised and revised 78 times since 1960, investors are aware of the default risk if negotiations fail. This is the first time Bitcoin encountered such an economic incident and it’s reasonable to assume a risk-off approach would be appropriate,” said Louey.\n\nThe global crypto market capitalization stood at US$1.11 trillion on Friday at 7:00 p.m. in Hong Kong, down 0.89% from US$1.12 trillion a week ago, according to CoinMarketCap data. With a market cap of US$512 billion, Bitcoin represented 46.1% of the market, while Ether, valued at US$218 billion, accounted for 19.6%.\n\n“The entire market capitalization of cryptocurrencies has essentially remained unchanged for a year,” said Kiely. “Tether’s plan to expand its Bitcoin holdings may temporarily boost prices but is overall not likely to have a large impact. Bitcoin’s 2024 halving could lead to a price boost, however, we’ve yet to start seeing the effects thereof.”\n\nOn May 17, Tether, the company behind the world’s largest stablecoin USDT, revealed its plans to “regularly allocate” as much as 15% of its net operational profits to buy Bitcoin, aiming to boost its reserves portfolio. Tether held approximately US$1.5 billion in Bitcoin reserves, at the time of the announcement.\n\nDormant Bitcoin hits all-time high\n\nThe amount of Bitcoin that has been inactive for at least a year rose to an all-time high of 68.46% on Wednesday, according to data aggregator MacroMicro.\n\n“It could mean short-term selling pressure decreases if the Bitcoin holdings in short-term holdings shift to longer-term holders. However, we will not be able to tell whether the addresses belong to institutional investors or not,” Tom Wan, a research analyst at 21.co, the parent company of 21Shares, an issuer of crypto exchange-traded products, said.\n\nAccording to Yield App’s Kiely, this suggests that increasingly more investors worldwide intend to hold their Bitcoin for the long term.\n\n“This trend is likely to continue and even quicken — even potentially to the point of hyperbitcoinization — given the uncertainty related to an evolving regulatory landscape and growing recognition of Bitcoin as a store of value,” said Kiely.\n\n“Hyperbitcoinization” is a concept speculating on Bitcoin’s eventual rise to become the world’s ubiquitous form of money.\n\nNotable movers: RNDR & KAVA\n\nThe Render Network’s native cryptocurrency was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap, rallying 16.55% to US$2.83. The token started picking up momentum last Saturday, after the announcement of the new Render Foundation website. This is Render’s second consecutive week as the biggest gainer in the top 100 cryptos.\n\nThe Render Network leverages idle graphics processing units for digital rendering purposes, catering to areas such as 3D modeling, gaming imagery, and virtual reality.\n\nKava, the governance token of a layer-1 blockchain of the same name, was this week’s second-biggest gainer, rising 10.70% to US$1.09. The coin started picking up momentum on Monday, following the launch of the Kava mainnet last week.\n\nNext Week: Could a debt ceiling deal break Bitcoin’s crab walk?\n\nU.S. President Joe Biden and House Speaker Kevin McCarthy are reportedly closing in on a deal that would raise the government’s debt ceiling for two years while capping spending on most items. Yet, the June 1 deadline is fast approaching, causing investor concerns about a potential default.\n\nAccording to WuuTrade’s Kenjaev, the uncertainty around the debt ceiling negotiations will keep weighing down the crypto market until a deal is reached.\n\n“The sideways [movement] of Bitcoin is very much related to the current market risks and the fear. Investors’ activity during any economic risk talks is rather cautious. Hence the sideways in US$26,000 – US$30,000,” wrote Kenjaev, adding that positive news surrounding the U.S. economy will break the crab walk.\n\nInvestors are awaiting next week’s release of the U.S. jobs report for May, which includes the crucial nonfarm payrolls data. This information often serves as a barometer for predicting the Federal Reserve’s next steps regarding interest rate adjustments. ING Economics has projected an increase of 195,000 in nonfarm payrolls for May. Additionally, they anticipate a slight uptick in the unemployment rate to 3.5% for May, compared to 3.4% in the preceding month.\n\nIn the crypto space, Optimism, an Ethereum layer-2 network, is planning to increase the circulating supply of its governance token (OP) next Wednesday, a year into the coin’s launch. The expansion is part of Optimism’s strategy to augment the pool of votable tokens within the Token House, its group of OP holders responsible for proposing and voting on governance issues.\n\nSee related article: Big buys fail to lift NFT markets as regulatory uncertainty weighs heavy on crypto"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktaGF2ZS1iaXRjb2luLWFuZC1jcnlwdG8tbG9zdC02MC1vZi10aGVpci1tYXJrZXQtY2FwLXNpbmNlLXRoZWlyLWFsbC10aW1lLWhpZ2hz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Why have Bitcoin and crypto lost 60% of their market cap since their all-time highs? - Cointelegraph",
        "content": "Macro Markets, hosted by crypto analyst Marcel Pechman, airs every Friday on the Cointelegraph Markets & Research YouTube channel and explains complex concepts in layperson’s terms, focusing on the cause and effect of traditional financial events on day-to-day crypto activity.\n\nThe latest Macro Markets show begins by exploring why the crypto market capitalization is some 60% below its all-time high, while the S&P 500 is less than 15% away from its peak. For Pechman, the sector is suffering from a huge problem, as it doesn’t fit a commodity nor does it fit a foreign exchange currency. Moreover, not every mutual fund can hold crypto.\n\nThe lesson? If Bitcoin (BTC) and Ether (ETH) are mostly understood as alternative risk assets, that’s how they’ll trade. Consequently, one should not waste time looking for theories explaining why crypto has been unable to break new highs.\n\nOn to the next topic, according to Pechman, NVidia’s $2.3-billion short seller losses don’t provide the real picture. That’s because a short seller can endure pain if they don’t close the borrowing — so, as long as they have enough collateral deposits, those losses are still open.\n\nThat’s similar to what a buyer who paid a much higher price for their crypto is experiencing. Until this person makes the sale, the losses are not concrete. The difference is that the short seller needs to find someone willing to lend those shares to keep the trade open.\n\nA Bloomberg article mentioned that Nvidia is the fourth-most shorted stock in the United States, behind Apple, Tesla and Microsoft. According to Pechman, the four most shorted stocks also happen to be top 10 S&P 500 components, which leads to an issue: Those short sellers may have been market neutral the whole time, buying index futures and selling individual stocks.\n\nLastly, the show debates China’s 5% growth, disappointing investors, and its consequences for the markets. For Pechman, the most important news is China’s reluctance to issue new stimulus packages, which could be a strategy to further weaken the remaining global economies.\n\nThe Bloomberg article shows how China is a key player in global commodities. If commodity prices and the global trade balance continue to weaken, that means less tax revenue for those other governments. Pechman highlights that Germany has just entered a technical recession, and the U.S. is right behind.\n\nPechman believes the outcome for crypto is initially negative, as it drains liquidity from markets, and investors will further reach for short-term government bonds and cash. But if the U.S. dollar loses strength, that’s positive for crypto in the medium term.\n\nIf you are looking for exclusive and valuable content provided by leading crypto analysts and experts, make sure to subscribe to the Cointelegraph Markets & Research YouTube channel. Join us at Macro Markets every Friday."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8xNDI1NDgvdXNkLWJhY2tlZC1zdGFibGVjb2luLW9uLWJpdGNvaW4tdXNpbmctb3JkaW5hbHMtcHJvdG9jb2zSAVhodHRwczovL2RlY3J5cHQuY28vMTQyNTQ4L3VzZC1iYWNrZWQtc3RhYmxlY29pbi1vbi1iaXRjb2luLXVzaW5nLW9yZGluYWxzLXByb3RvY29sP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "There's Now a Dollar-Backed Stablecoin on Bitcoin Using Ordinals Protocol - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe controversial BRC-20 standard and Ordinals protocol that made it possible keeps growing its footprint in the Bitcoin ecosystem. The latest: Stably USD, which is being billed as the first BRC-20 stablecoin.\n\nAfter all, two of the largest stablecoins—Tether (USDT) and USDCoin (USDC)—originated on the Ethereum network as ERC-20 tokens. Although now both tokens are available on a handful of other networks like Solana, Avalanche, and TRON.\n\nLike ERC-20 tokens, BRC-20s are a lot like NFTs. They allow for arbitrary, non-financial information to be added to the Bitcoin blockchain without the need for a sidechain or additional token. BRC-20 tokens have been at the center of an intense debate within the Bitcoin community, with important figures taking favorable and unfavorable positions.\n\nAD\n\nAD\n\nNow U.S.-based Stably, which calls itself a fiat onramp for crypto trading, has announced its BRC-20 U.S. dollar-backed stablecoin on Twitter. But there are a few red flags.\n\nFor starters, the total supply: $69.420 trillion, according to the company’s website. That’s more than double the U.S. national debt and likely a nod to meme culture. And things seem to be off to a slow start. Their documentation links to a reserve wallet with a $220 balance at the time of writing.\n\nWhile Stably claims its subsidiary, Stably Trading LLC, is a registered money transmitter, the registration number and address on their website don’t match what’s listed on the FinCEN website under “Stably Trading, LLC.”\n\nThe company tweeted that “#USD is backed and redeemable 1-to-1 for USD collateral managed by our regulated custodian” adding that a third party firm will be conducting monthly attestations to ensure the collateral always matches what’s been issued.\n\nStablyUSD isn’t technically a new stablecoin. It’s been around since 2019 and only recently got converted into a BRC-20 token on Bitcoin. The latest attestation report shows it’s got a market capitalization of $7 million across 11 different blockchains, including Ethereum, BNB Chain, and Arbitrum.\n\nAD\n\nAD\n\nScreenshot of Stably USD April attestation report. Source: Stably\n\nThe USDS listing on CoinGecko shows that its price hit an all-time high of $9.89 on November 30, then crashed days later to $0.05 on December 9, 2022. The token has about $5,000 worth of liquidity on decentralized exchange UniSwap split between two trading pairs.\n\nAccording to Stably’s website, its regulated custodian–Prime Trust–holds the reserves for Stably USD. But it seems more likely that Prime Trust doesn’t hold the reserves directly, as it explains on its website that it isn’t FDIC-insured and uses accounts at a handful of banks that are.\n\nThat said, Stably said it will enforce a know your customer (KYC) and anti-money laundering process (AML) for users who want to redeem stablecoins for actual dollars.\n\nNeither Stably nor Prime Trust immediately responded to a request for comment from Decrypt.\n\nAlthough Stably has been quick to claim they were the first USD stablecoin on the Bitcoin network, USDT was initially launched on OMNI, a Bitcoin sidechain, in 2014. There are also several U.S. dollar-backed stablecoins, such as DoC on Rootstock, currently available on the network.\n\nThe new stablecoin, however, appears to be the first of its kind using the BRC-20 standard.\n\nWhether this is another BRC-20 fad to quickly fade away, or a new era of stablecoins ushered in by the contentious Ordinals protocol remains to be seen. As always, do your own research.\n\nEditor's Note: This article was updated to note that USDT and USDC originated on the Ethereum network, but don't both do the majority of their volume on the network.\n\nAD\n\nAD"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1jb3JlLXZlcnNpb24tMjUuMC1yZWxlYXNlZC1icmluZ2luZy1uZXctZmVhdHVyZXMtYW5kLXRyYW5zYWN0aW9uLXVzZS1jYXNlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Bitcoin Core Version 25.0 Released Bringing New Features And Transaction Use Cases - Nasdaq",
        "content": "Bitcoin Core version 25.0 has been released, bringing new features, bug fixes and performance improvements to the software. Users can download the latest version from the official Bitcoin Core website or update their existing installations. The release notes outline the changes and provide instructions on how to upgrade.\n\nOne notable change is the allowance of transactions of non-witness size 65 bytes and above, which opens up new use cases and enhances protections against vulnerabilities like CVE-2017-12842. Another addition is the scanblocks RPC, which allows for fast wallet rescans by returning relevant blockhashes from a set of descriptors.\n\nIn terms of RPC updates, all JSON-RPC methods now accept a new named parameter called \"args\" for passing positional parameter values conveniently. Additionally, the verifychain RPC will now return false if checks couldn't be completed at the desired depth and level, providing more accurate feedback.\n\nThe release also includes changes to the build system, updated settings and new features. For instance, the shutdownnotify option allows users to specify a command to execute before Bitcoin Core begins its shutdown sequence. In the wallet section, new options like minconf and maxconf have been added to various RPCs, providing greater control over UTXO confirmations.\n\nBitcoin Core 25.0 introduces several improvements and optimizations, enhancing the user experience and security of the software. As with any release, users are encouraged to report any bugs they encounter to the official GitHub issue tracker.\n\nBitcoin Core is widely supported and tested on major operating systems such as Linux, macOS, and Windows. However, it is not recommended to use Bitcoin Core on unsupported systems. Users should ensure they are running a compatible operating system before upgrading to the latest version. In addition, users are encouraged to review the release notes for a detailed understanding of the improvements in this version if upgrading.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tc2VlLTE4NTExOTE3MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum See Fourth Flat Week as TRON and Tether Surge - Yahoo Finance",
        "content": "It was the fourth consecutive week of flat prices. A generally slow news cycle meant that market leaders Bitcoin and Ethereum remained where they were last weekend.\n\nBitcoin depreciated a nominal 0.5% and currently trades at $26,815, while Ethereum rose 1% over the seven days and now enters the weekend at $1,829.\n\nOn Monday, an AI-generated photo depicting a fabricated explosion at the Pentagon briefly caused a selloff in stocks and Bitcoin.\n\nMarkets were decidedly flat across the board, with no top thirty cryptocurrency posting significant gains except TRON, which rallied 8% to $0.076778.\n\nTRON’s rally this week appears to have been driven by the climbing market capitalization of the U.S. dollar-pegged stablecoin Tether (USTD), as the latter inches towards overtaking its all-time high of $83.2 billion, set in May last year.\n\nAccording to CoinGecko, Tether may set a new high watermark any day now.\n\nTRON and USDT’s joint rally appears to be linked to the fact that the majority of USDT, approximately $46 billion, is issued on Tron, surpassing the $36 billion on Ethereum. Recent data shows a steep rise in USDT on the TRON network throughout 2023 so far.\n\nThe biggest losses among cryptocurrencies this week were posted by Internet Computer (ICP), which fell 6% to $4.88, and Lido DAO (LDO), which dropped 7.1% to $1.96.\n\nRon DeSantis Banned CBDCs in Florida—These States Could Be Next\n\nCoin politics\n\nCrypto is already a major talking point in Bitcoin-friendly Florida Governor Ron DeSantis’s campaign as he gets ready to run as the GOP’s candidate in next year’s U.S. presidential elections.\n\nDeSantis headlined an otherwise disastrous Twitter Spaces the day he announced his candidacy and told his host, Twitter/Tesla CEO Elon Musk, that Biden’s administration “[has] it out for Bitcoin, and if it continues for another four years, they’ll probably end up killing it.”\n\nOn Tuesday, The International Organization of Securities Commissions (IOSCO) released a report outlining policy recommendations for global crypto regulation as part of the public consultation process.\n\nStory continues\n\nIn a nod to the fall of FTX, the IOSCO recommendations warn regulators about crypto companies \"combining certain functions in a single legal entity or group of affiliated entities,” such as one entity running exchanges, trading firms, and custody businesses under one roof.\n\nOn Thursday, watchdog the European Systemic Risk Board (ESRB) released a report concluding that the industry’s economic impact is minimal, but advising vigilance and policymaking that monitors leveraged trading and the industry’s financial contagion risks.\n\nThat same day, the European Securities and Markets Authority (ESMA) and National Competent Authorities (NCAs) issued a statement saying that cryptocurrencies must be clearly labeled as unregulated and both investors and investment firms should understand the financial risks involved in trading them."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL3RlY2hub2xvZ3kvbmV3cy9zdG9yeS93b3JsZHMtZmlyc3QtYml0Y29pbi10b3dlci1kZXNpZ24tcmV2ZWFsZWQtZ3Vlc3RzLXdpbGwtZ2V0LW1vbmV5LXRvLXN0YXktMzgyOTU0LTIwMjMtMDUtMjbSAZEBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvdGVjaG5vbG9neS9uZXdzL3N0b3J5L3dvcmxkcy1maXJzdC1iaXRjb2luLXRvd2VyLWRlc2lnbi1yZXZlYWxlZC1ndWVzdHMtd2lsbC1nZXQtbW9uZXktdG8tc3RheS0zODI5NTQtMjAyMy0wNS0yNg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "World's first Bitcoin Tower design revealed, guests will get money to stay - Business Today",
        "content": "Cryptocurrencies like Bitcoin may have lost their sheen as investments but that's not impacting the real enthusiasts. Salvatore Liggiero, an Italian developer unveiled the design of the world's first Bitcoin Tower. This 40-story architectural marvel is planned to be constructed in Dubai. And you guessed right, it will be in the shape of the Bitcoin currency symbol.\n\nLiggiero claims that his vision for the hotel does not fall under the traditional idea of hospitality. The developers will incorporate various technologies, and sustainable materials to build the tower. The developers have also offered a commitment to zero CO2 emissions in building the tower.\n\nYou stay you get paid!\n\nWhat sets the Bitcoin Tower apart is its approach to guest experiences. A post on Binance Feed explains the blending of the worlds of hospitality and cryptocurrency, the hotel will offer guests exclusive non-fungible tokens (NFTs) as rewards.\n\nImage by Cointelegraph\n\nThe rental price for a stay at the Bitcoin Tower is not just a payment but also an investment opportunity. Guests will effectively stake cryptocurrency, generating an annual percentage yield (APY) that the guests can claim.\n\nSalvatore Liggiero claimed the hotel will be the first of its kind and will give back the money. This concept aims not only to educate the general public about cryptocurrencies but also to encourage active participation in the digital economy.\n\nAlso read: Binance to celebrate 13 years of 'Bitcoin Pizza Day' with global events\n\nDecentralizing the Development of Bitcoin Tower\n\nThe developer invites artists, architects, creatives, and crypto enthusiasts to contribute their works to the project. These creations will form an exclusive NFT collection dedicated to the Bitcoin Tower's design and interior spaces.\n\nThe Bitcoin Tower aims to pay homage to the cryptocurrency and its mysterious creator, Satoshi Nakamoto. Additionally, a Cointelegraph report claims that Liggiero intends to showcase Dubai's efforts to bridge the gap between digital and physical assets.\n\nLiggiero envisions the project as an open endeavor, considering the creation of a decentralized autonomous organization (DAO) to govern the project. He believes that community input is essential and aligns with the principles espoused by Satoshi Nakamoto.\n\nThe Bitcoin Tower will have both a physical version to be built in Dubai and a virtual version to be launched in the metaverse. The location of the new building is yet to be finalized. However, the designer hopes to secure approval for constructing the tower near Sheikh Zayed Road, a part of the Dubai skyline.\n\nAlso read: Dubai-bound IndiGo flight suffers bird-hit on Mangaluru International Airport, over 160 passengers deplaned"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXJlYWNoZXMtZGVjaXNpb24tcG9pbnQtNC1idGMtcHJpY2UtbWV0cmljcy10by13YXRjaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Bitcoin reaches 'decision point' — 4 BTC price metrics to watch - Cointelegraph",
        "content": "Bitcoin (BTC) has reached a “decision point” for price action, but speculators are in charge, says a new analysis.\n\nIn findings uploaded to Twitter on May 26, Checkmate — lead on-chain analyst at Glassnode — revealed a BTC price showdown in the making.\n\nAnalyst warns Bitcoin bulls “not doing anything”\n\nStruggling near key trend lines, BTC/USD is giving an increasing number of long-time market participants cold feet this month.\n\nAs downside price predictions flow in, on-chain analysts’ attention increasingly focuses on short-term holders (STHs) when it comes to where the price might head next.\n\nAs Cointelegraph reported, various metrics specifically covering STHs — defined as entities hodling coins for 155 days or less — are approaching “reset levels” after a period of exuberance.\n\nFor Checkmate, this could be a healthy retracement required for the continuation of the 2023 bull market; but equally, things could now turn ugly.\n\n“Bitcoin is currently at a decision point, with Short-Term Holders being the primary lens to view this correction,” he summarized.\n\nSeveral metrics covering STH profitability are on the radar.\n\nSTH market value to realized value (STH-MVRV)\n\nSTH-MVRV measures the value of coins moved by STHs compared to those coins’ value as a portion of the overall Bitcoin market cap. When at 1.0, it corresponds to the STH realized price, which is the aggregate price at which STH coins last moved — their breakeven point.\n\nSTH-MVRV is currently at 1.022, making a 1.0 reading equate to a BTC spot price of around $26,500.\n\n“In bull markets, this level ($26.5k) should offer sound psychological support. We can trade below it, but a swift recovery would be necessary to justify upwards continuation,” Checkmate commented.\n\nSTH market value to realized value (STH-MVRV) chart. Source: Checkmate/ Twitter\n\nShort-term holder spent output profit ratio (STH-SOPR)\n\nSTH-SOPR, as Glassnode describes it, is a “price sold versus price paid” metric that gauges the profitability of spent outputs.\n\nCurrently below the 1.0 line, it suggests “loss dominance” among STHs and demands that dip buyers step in next. SOPR does not differentiate between large and small transactions, focusing purely on the number of spent outputs.\n\n“Losses by STH can ONLY be sourced from local top buyers, and counter-intuitively, we want to see top buyers selling the local bottom. This is what creates the FOMO bounce reaction,” Checkmate explains.\n\nLikewise, the short-term holder realized profit/loss ratio — the version of SOPR which takes volume into account — is in danger of flipping bearish. For this to happen, however, it would need to spend a “sustained” amount of time below 1.0.\n\nBitcoin STH-SOPR chart. Source: Checkmate/ Twitter\n\nShort-term holder realized profit/loss ratio momentum\n\nFinally, the trend back to “neutral” territory is also visible in the metric, which alerts observers to sudden changes in trend when it comes to STH profitability.\n\nRelated: Bitcoin holds $20K realized price as analyst eyes ‘big moves coming’\n\nMomentum is retreating from its “green” phase, which has been in place since January 2023, the start of Bitcoin’s price recovery.\n\n“STH Profit/Loss momentum is a tool designed to spot rapid changes in market regime and trend. It is extremely responsive, and has returned to neutral gear,” the post added.\n\n“If this thing starts to go red, that would be an early signal that a deeper correction is in play. It has consistently signalled the reversal of trends, often before the first break even happens.”\n\nBitcoin short-term holder realized profit/loss ratio momentum chart. Source: Checkmate/ Twitter\n\nConcluding, Checkmate called on hodlers — currently dormant and reluctant to spend coins — to step in.\n\n“The bulls need to put in the work if they want higher prices,” he wrote.\n\n“The HODLers certainly do, but they are not doing anything with their coins. We have near ATH coin inactivity.”\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMjYvZmlyc3QtbW92ZXItYW1lcmljYXMtZGlnaXRhbC1jdXJyZW5jeS1ncm91cC1pcy1jbG9zaW5nLWRvd24tdHJhZGVibG9jay_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzI2L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWRpZ2l0YWwtY3VycmVuY3ktZ3JvdXAtaXMtY2xvc2luZy1kb3duLXRyYWRlYmxvY2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "First Mover Americas: Digital Currency Group Is Closing Down TradeBlock - CoinDesk",
        "content": "U.S. Bitcoin Corp. (USBTC) is set to become one of the largest miners in America following a deal to buy mining assets from bankrupt lender Celsius. The company is part of the Farenheit consortium that won a bankruptcy auction for the Celsius assets, which include a lending portfolio, cryptocurrencies and 121,800 mining machines. Once it brings all the mining rigs online, its fleet will total at least 270,000 mining rigs and computing power of 12.2.exahash/second (EH/s), the firm told CoinDesk, putting U.S. Bitcoin Corp. alongside other U.S. mining giants likes Riot Platforms (RIOT), Core Scientific (CORZ) and Marathon Digital Holdings (MARA)."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xNDI2MzUveW91LWNhbi1lYXJuLWJpdGNvaW4tYnktcGxheWluZy1tb2JpbGUtc29saXRhaXJlLWdhbWVzLWhlcmVzLWhvdy1tdWNo0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzE0MjYzNS95b3UtY2FuLWVhcm4tYml0Y29pbi1ieS1wbGF5aW5nLW1vYmlsZS1zb2xpdGFpcmUtZ2FtZXMtaGVyZXMtaG93LW11Y2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "You Can Earn Bitcoin by Playing Mobile Solitaire Games—Here's How Much - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe play-to-earn gaming craze might have faded, but believe it or not, there remains a slew of crypto-infused games out there that let you earn Bitcoin while you play—and you don’t have to buy any NFTs to get started.\n\nSolitaire is one of the most popular games to be injected full of Bitcoin rewards on iOS and Android, with no fewer than three competing takes that let you stack sats (or satoshis, a.k.a. 1/100,000,000 BTC) while stacking digital playing cards: THNDR Games’ Club Bitcoin: Solitaire, Bling Financial’s Bitcoin Solitaire, and Viker’s Solitaire - Card Game 2023.\n\nAll three games are broadly similar, serving up a simple game of digital solitaire that’s chock-full of obnoxious video ads. But all three games also truly do let you earn Bitcoin along the way and then withdraw it to a wallet. Keep your expectations in check, however: we’re talking pennies’ worth of BTC across hours of gameplay.\n\nAD\n\nAD\n\nAnd I’d know, because I played approximately two hours of each game to see how much Bitcoin I could earn from each. Here’s a brief review of each game (played on iPhone), along with a verdict on which Bitcoin solitaire app is most worth your time and attention.\n\nClub Bitcoin: Solitaire\n\nTHNDR Games makes an array of Bitcoin-awarding mobile games, including Tetro Tiles, and its Club Bitcoin: Solitaire (iPhone, Android) is by far the most visually appealing of the bunch. It spruces up this very traditional card game with a little bit of visual panache, and the streamlined interface with one tap to send any card to its rightful pile feels intuitive and responsive.\n\nBut it’s stingy with the sats. You earn tickets while playing, and those are put into prize draws that could earn you large-to-small bundles of satoshis. But after two hours of total gameplay, I’d only earned 59 sats… that’s less than $0.02 worth. Plus, you have to redeem the sats and withdraw them to a wallet within a few days, otherwise they disappear.\n\nClub Bitcoin: Solitaire by THNDR Games. Image: Decrypt\n\nClub Bitcoin was the most enjoyable of the trio in terms of look and feel, but also provided the least amount of rewards. Your mileage may vary, however. No matter how it shakes out, you’ll still have to sit through some truly laborious video ads for scammy-looking mobile games.\n\nBitcoin Solitaire\n\nBling Financial is another publisher with a heap of crypto-tinged mobile games, and Bitcoin Solitaire (iPhone, Android)—created with PlayDay Studios—was by far the most generous game of this trio when it comes to earning satoshis.\n\nAD\n\nAD\n\nGranted, it’s all relative: after two hours of play, I had earned enough “Bling Points” to withdraw 339 satoshis, or about $0.09 worth. That’s still basically nothing, but it’s more than five times the amount of Bitcoin that I earned while playing Club Bitcoin, with a similar amount of obnoxious ads permeating the experience.\n\nBitcoin Solitaire by Bling/PlayDay. Image: Decrypt\n\nBling’s Bitcoin Solitaire has a more spartan design than Club Bitcoin, but the interface is just as responsive and it serves up an enjoyable game of mobile solitaire. I noticed that I won a lot more games in Bitcoin Solitaire than the other two games, though. It feels tuned to go easy on you, but when you’re coasting to victory and racking up sats, it’s tough to complain.\n\nSolitaire - Card Game 2023\n\nThere’s an odd discrepancy between the iPhone and Android versions: the iOS game has the bland title above, while the Android one has “Earn Bitcoin” in the title. But appearances are a bit deceiving here, as both games may ultimately earn you tiny amounts of Bitcoin.\n\nIn this case, Viker’s take on solitaire is solid but not quite as streamlined as the others. A double tap is required on any card to send it to its rightful destination, which makes the flow a bit less speedy than in the other games, and the interface—which includes a banner ad—isn’t nearly as punchy and stylish as in Club Bitcoin.\n\nSolitaire - Card Game 2023 by Viker. Image: Decrypt\n\nAll that said, this is a totally solid game of smartphone solitaire, with just about the same amount of clunky, time-consuming, full-screen video ads as the others. And overall, the payout puts this game right in the middle of the others—I earned 122 satoshis in approximately two hours of gameplay, coming out to just over $0.03 worth of BTC.\n\nWhich should you play?\n\nAfter earning less than $0.15 total for six full hours of gameplay, it’s fair to say that none of these games are likely to grant you any meaningful amount of cryptocurrency. If you care about solitaire gameplay most of all, then you can probably find a mobile rendition with more polish and less-intrusive ads.\n\nBut among games with crypto rewards, Bling’s Bitcoin Solitaire hits the sweet spot. It’s not the most stylish-looking of the bunch, but the gameplay is smooth and enjoyable and I earned the most BTC by far out of any of these games… even if it was barely a dime’s worth."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLWNhbmFhbi1zLW5ldC1sb3NzLXNsaWdodGx5LWltcHJvdmVkLWluLXExLWFtaWQtbWFya2V0LXR1cmJ1bGVuY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Bitcoin miner Canaan's net loss slightly improved in Q1 amid market turbulence - Cointelegraph",
        "content": "Chinese Bitcoin mining company Canaan reported slight improvements in some of its financial metrics in the first quarter of 2023. The progress, however, is still far behind where it was last year in this period.\n\nAccording to an unaudited report posted on its investor relations page, Canaan’s net loss was $84.4 million in Q1, lower than its $91.6 million net loss in the previous quarter. The net loss represents a major reversal compared to the same period in 2022, when the firm reported a net income of $65.1 million.\n\nDiluted net loss per American depositary share (ADS) in the first quarter of 2023 was $0.51, down from $0.55 in the previous quarter, while diluted net earnings per ADS in the same period of 2022 stood at $0.38. According to Investopedia, an ADS is an equity share in a non-U.S. company held by a United States depositary bank and available for purchase by investors.\n\nThe company claims to be expanding operations despite the ongoing bear market and associated drop in earnings.\n\nThe quarterly results were impacted by several factors, including low market demand that hindered product revenue, the ongoing crisis in the banking system and the slow recovery of Bitcoin’s (BTC) price. Revenue in Q1 totaled $55.1 million, against $58.3 million last quarter and $201.8 million in the same period of 2022.\n\n“In the first quarter of 2023, we experienced a further contraction in our sales revenue, due to the industry-wide reduction in selling prices, and unforeseen delays in payment and shipment following a series of U.S. bank failures. In addition, our mining business encountered difficulties that postponed the increase of our installed hash rates,\" said Canaan’s chief financial officer James Cheng in the report, claiming the revenue results “fell short” of expectations.\n\nRelated: Ripe for the squeeze? Bitcoin mining stocks remain under attack from short sellers\n\nA revenue breakdown shows $44.1 million coming from products revenue and $11.1 million from mining activities, as well as $300,000 in other revenues. Income generated from mining activities rose 3.3% from $10.7 million in the fourth quarter of 2022 and represents a 130.2% increase from $4.8 million during the same period of 2022.\n\nCosts linked to mining operations include electricity and hosting, as well as equipment depreciation and amortization.\n\nThe total operating expenses in the first quarter of 2023 were $38.1 million, compared to $60.8 million in the fourth quarter of 2022 and nearly equal to the same period last year, when it stood at $38 million. “We managed to narrow our operating loss by 31.4% from the last quarter,\" noted Cheng.\n\nThe report shows a decrease in investment in research and development. Canaan spent $19.1 million in the first quarter, compared to $33.4 million in the previous period. The decline was due to one-off expenditures of $14.3 million for research and development for the A13 series products. In the same period of 2022, the company committed $15.1 million in R&D.\n\nCryptocurrency assets held by Canaan as of March 31, 2023 totaled 623 BTC, worth $13.4 million, according to the report. Cash and cash equivalents were at $72 million, compared to $101.6 million as of Dec. 31, 2022.\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yZ2ItcHJvdG9jb2wtYWx0ZXJuYXRpdmUtYml0Y29pbi1uZnQtb3JkaW5hbHMtaXNzdWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "RGB protocol may offer solution to Bitcoin's Ordinals jam, proponent claims - Cointelegraph",
        "content": "Gideon Nweze, the founder and CEO of the newly launched Digital Bitcoin Art and Assets (DIBA) nonfungible token (NFT) marketplace, believes there’s an alternative way to bring NFTs to Bitcoin that doesn’t impact block space and transaction fees.\n\nNweze recently put this belief to the test, launching a beta version of his NFT marketplace on May 19. Rather than using Ordinals, it leverages the RGB Smart Contract Protocol to mint NFTs on top of the Bitcoin (BTC) network.\n\nSince the introduction of Ordinals Protocol in January, Bitcoin-based NFTs and tokens have exploded in popularity, with more than 9 million total “inscriptions,” according to data from Dune Analytics. However, the rise of Ordinals has also invited its fair share of controversy, including its purported impact on block space and transaction fees.\n\nThe total number of Ordinals inscriptions since inception. Source: Dune Analytics.\n\nOn the other hand, the RGB Smart Contract Protocol comes from 2016, initially introduced as the “BHB Network” by Bitcoin developer Giacomo Zucco and then relaunched in 2019. It enables encrypted transactions with Lightning Network functionality, allowing users to mint NFTs without taking up huge amounts of space on the network.\n\nNweze told Cointelegraph that it is “extremely complex” but essentially works the same as a layer-2 scaling solution on Ethereum, and claims it could solve Bitcoin’s newfound blockspace problems.\n\nAssets minted by way of the newly-introduced Ordinals Protocol have attracted widespread criticism for being inefficient and “clunky.” Nweze says this is because Ordinals inscribe assets directly “into” the Bitcoin blockchain, whereas RGB layers the transactions on top of the network.\n\n“If I’m building a house, I don’t put all the storage inside the foundation. I build the rooms and the storage in layers on top of it. Ordinals are like trying to cram everything into the foundation, whereas smart contracts put everything in the floors above it.”\n\nIt’s worth noting that the RGB Protocol is only capable of minting NFTs, not BRC-20 tokens.\n\nHowever, there’s another protocol called Trustless Computer, which leverages smart contracts to mint BRC-20 tokens. As reported by Cointelegraph Magazine, the project is not a layer 2, instead, it’s a “protocol within a layer 1” that uses smart contracts to reduce token bandwidth by 80% to 90%.\n\nBitcoin NFT marketplace DIBA’s home page. Source: DIBA\n\nNweze’s statements fall in line with those of Muneeb Ali, the CEO of Trust Machines, who explained in an interview with Cointelegraph how the Ordinals hype could support Bitcoin in attracting more developers and capital to layer-2 solutions.\n\nAli claimed that in the absence of scaling solutions, high fees and a congested network could slow down widespread Bitcoin adoption in the long term.\n\nRelated: 13 years after first Bitcoin purchase, layer-2 solutions struggle to gain traction\n\nWhile a number of major Bitcoin advocates, including Jan3 founder Samson Mow, have claimed that the Ordinals and BRC-20 hype will blow over in “a matter of months.”\n\nHowever, Nweze is convinced of the longevity of protocols and assets being created on the Bitcoin network, due in large part to developers beginning to leverage the full potential of the Taproot upgrade.\n\nFor DIBA's RGB21 UDAs, where contract data is kept off-chain, we think https://t.co/dGSwshhcw5 is a perfect fit for storing not only contracts but also high definition content-addressable media.\n\n\n\nWe expect to solve for data permanence in three ways:\n\n\n\n1) Storage debt markets,… — Hunter ₿eaṩt (@cryptoquick) May 22, 2023\n\n“Everything we [DIBA] do, uses Taproot. Because Taproot was designed to reduce block space, everything we do takes up minimum block space, because the size of a Taproot transaction is far, far smaller than a normal Bitcoin transaction,” he explained.\n\nIt isn’t just pure development and code that has Nweze excited about NFTs on Bitcoin, it also comes down largely to culture and shared human experience. “Art and music is what makes the human heart sing, so if we can use this to introduce more people to Bitcoin, and to Lightning, then we’re winning,” he said.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum — Can we fix it?"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8taGF0ZXItcGV0ZXItc2NoaWZmLXVudmVpbHMtYml0Y29pbi1vcmRpbmFscy1uZnQtcHJvamVjdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Crypto hater Peter Schiff to drop Bitcoin Ordinals NFT art collection - Cointelegraph",
        "content": "In what seems like a parody but isn’t, economist, gold proponent and vocal crypto skeptic Peter Schiff has unveiled a collaborative nonfungible token (NFT) art collection on the Bitcoin network that will soon go up for auction.\n\nThe reaction from the crypto community has been mixed, with people generally baffled, amused or welcoming — especially Ordinals proponents — with some keen to point out the apparent hypocrisy.\n\nits a hack right?\n\n\n\ndid i just teleport to a different timeline?\n\n\n\nim so confused — Deezy (@CryptoDmack) May 26, 2023\n\nFor years, Schiff has actively bashed crypto — especially Bitcoin (BTC) — at any chance, with his arguments revolving around BTC being a Ponzi scheme with no inherent value.\n\nDespite all of that, Schiff unveiled the “Golden Triumph” NFT collection in a May 27 Twitter thread in collaboration with one of his “favorite artists,” who goes by the pseudonym “Market Price.“\n\n“This collaboration features the original painting ‘Golden Triumph’ as well as a series of prints and Ordinals inscribed on the Bitcoin blockchain,” he wrote.\n\nGolden Triumph consists of one physical painting on an oil linen canvas depicting a human hand holding a bar of gold, 50 prints on archival paper depicting the same image, and 50 digital versions inscribed as Ordinal NFTs on Bitcoin.\n\nThe collection will be sold via a two-part auction starting on June 2 and ending on June 9. For the Ordinals, the highest bidder will receive #1 of the collection, with the next 49 highest bidders receiving #2 to #50 in descending order.\n\nIt appears, however, that Schiff hasn’t done a complete turnaround on BTC, but has woken up to a use case for blockchain technology: verifiable ownership of assets such as art via NFTs.\n\nCommenting on Schiff’s tweet, Twitter user LoneStartBitcoin asked: “So... it’s valuable to put your ‘gold’ inscriptions on Bitcoin, but bitcoin [BTC] itself is not valuable?.”\n\n“Correct,” Schiff responded.\n\nRelated: Peter Schiff blames ‘too much gov’t regulation’ for worsening financial crisis\n\nAlongside his disdain for crypto, Schiff has also criticized NFTs on several occasions in the past.\n\nIn a blog post from March 2021, Schiff described NFTs as “fake assets” that offer nothing other than ownership of a digital image that can be “replicated endlessly” online.\n\n“But even as the owner of the image, you won’t be able to control access to it. The file has been copied thousands of times, so anyone with access to the internet can look at it as much as you,” he wrote.\n\nThe sharp change in sentiment follows in a similar vein to former United States President Donald Trump, who has also aggressively slammed crypto on multiple occasions before getting involved with NFTs.\n\nIn December 2022, Trump teased a “major announcement” that supporters thought was politically related before unveiling the Trump Digital Trading Cards collection.\n\nMagazine: NFT Creator: Top 10 crypto artist Trevor Jones on being rich, rekt and rich again"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhvbGRzLTIwMC13ZWVrLWF2ZXJhZ2UtYXMtdHJhZGVyLXNheXMtaW5mbGVjdGlvbi1wb2ludC1pcy1oZXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Bitcoin holds 200-week average as trader says 'inflection point' is here - Cointelegraph",
        "content": "Bitcoin (BTC) held its most recent gains into May 27 as traders called for a change in “bearish” market sentiment.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nTrader awaits “pretty major move” for BTC price\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it entered the weekend at around $26,700.\n\nThe week’s macroeconomic data from the United States had ended with a surprise, as a new Personal Consumption Expenditures (PCE) index print showed the economy weathering tighter financial conditions much better than expected.\n\nMarkets then began to price in a June interest rate hike from the Federal Reserve, which should form a headwind for risk assets but failed to dampen a BTC price rebound.\n\nDespite the price comeback, however, the mood remained overly cautious for some.\n\n“Retail is so extremely bearish on Bitcoin and Crypto, it’s almost insane,” Michaël van de Poppe, founder and CEO of trading firm Eight, argued.\n\n“People are stuck in the 2022 mindset.”\n\nPopular trader Skew noted Bitcoin’s strong reaction at the 200-week moving average (MA) near $26,000, with more key trend line challenges now in the making.\n\n“Price trying to reclaim 100D MA after nice move up from 200W MA. Price is currently pinned between 4H EMAs & 1D EMAs,” analysis of the 4-hour BTC/USD chart stated the day prior.\n\n“Expecting a pretty major move soon, inflection point is here imo.”\n\nBTC/USD 1-day candle chart on Bitstamp with 100-day, 200-week MA. Source: TradingView\n\nAdditional insights concluded that “froth” had cleared from exchanges, along with over $300 million of open interest on the largest-volume exchange, Binance.\n\n$BTC Binance Open Interest\n\nPrice is hovering around previous breakdown & majority of the OI has been cleared out\n\n\n\n-12K BTC ($320.9M)\n\n\n\na lot less froth in the market meaning whichever way spot moves, probably wouldn't fade it pic.twitter.com/dgb9OW2GnB — Skew Δ (@52kskew) May 27, 2023\n\nSkew is not the only well-known voice calling for a pronounced shift in BTC price behavior next. This week, Checkmate, lead on-chain analyst at Glassnode, predicted: “big moves coming.“\n\nA subsequent overview of some key on-chain metrics presented BTC/USD at a “decision point.“\n\nBitcoin price still “consolidating”\n\nFellow trader and analyst Rekt Capital stated that additional strength was still needed to flip the trajectory in the bulls’ favor.\n\nRelated: $160K at next halving? Model counts down to new Bitcoin all-time high\n\n“BTC still in the middle of the red downtrending channel, just consolidating here with the red resistance area above the crucial one to beat if sentiment is to decisively shift in the short-term,” he wrote, referring to a chart of 1-day timeframes.\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nThat chart also showed the bearish head-and-shoulders pattern, something Rekt Capital previously warned could result in a longer-term bearish phase, including a trip toward $20,000.\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9qcG1vcmdhbi1wcmVkaWN0cy1iaXRjb2luLWJ0Yy10by1yZXZpc2l0LTQ1MDAwLWhlcmVzLXdoeS_SAWJodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vanBtb3JnYW4tcHJlZGljdHMtYml0Y29pbi1idGMtdG8tcmV2aXNpdC00NTAwMC1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "JPMorgan Predicts Bitcoin (BTC) To Revisit $45,000, Here’s Why - NewsBTC",
        "content": "In a recent note, JPMorgan strategists have made a prediction, suggesting that Bitcoin (BTC) could soar and revisit its former trading price of $45,000 due to the rising price of gold. This prediction comes amid Bitcoin’s price action of a blend of bulls and bears in the past week.\n\nMeanwhile, over the past 24 hours, BTC has seen a 2.1% gain with a current trading price above $26,000. The current surge comes after Bitcoin previously fall that dropped its price below its previously ranging market price of $28,000.\n\nBitcoin And Gold: A Correlation\n\nBitcoin and gold have often been regarded as alternative investments by investors, and their prices have displayed a tendency to move in tandem.\n\nGiven this, JPMorgan analysts note that the current gold price, hovering near $2,000 per ounce, implies a Bitcoin price of $45,000. This assumption is based on the idea that BTC will reach a similar standing as gold in the portfolios of private investors.\n\nJP Morgan wrote in a note:\n\nWith the gold price rising above $2,000, the value of gold held for investment purposes outside central banks is currently valued at around [$3 trillion]. In turn, this implies a $45,000 price for bitcoin under the assumption that bitcoin equalizes gold in private investors’ portfolios in risk capital or [volume]-adjusted terms.\n\nOne key factor contributing to JPMorgan’s optimistic prediction is the upcoming Bitcoin halving event, scheduled to take place between April and May 2024. The halving mechanism reduces the rate at which new Bitcoins are produced, effectively doubling the production cost.\n\nThe JPMorgan strategists believe this event will push Bitcoin’s production cost to approximately $40,000, acting as a lower bound and potentially driving the price upward.\n\nDrawing from historical data, JPMorgan highlights the bullish trajectory observed during previous halving events in 2016 and 2020. These events were accompanied by significant surges in Bitcoin prices, indicating the potential for a similar outcome following the next halving.\n\nAs a result, JPMorgan sets an upper limit of $45,000 for BTC, indicating limited potential beyond the increase driven by the doubling of production costs.\n\nReflecting On Ethereum (ETH)\n\nWhile Bitcoin takes the spotlight in JPMorgan’s prediction, the bank suggests that Ethereum (ETH) may face some selling pressure in the near term, extending beyond the Shanghai upgrade until mid-year. JPMorgan expects Ethereum to “somewhat underperform” BTC during this period.\n\nHowever, it’s essential to note that Ethereum’s performance is subject to a range of factors, including market dynamics and technological developments.\n\nMeanwhile, regardless of JPMorgan’s prediction, BTC is currently in a bullish trend recording an uptick. Over the past 24 hours, Bitcoin has seen more than a 2% gain, while the past seven days have seen a dip of 1.2%.\n\nAt the time of writing, the top crypto currently trades at $26,823. Bitcoin’s trading volume has, however, ranged around $20 billion in the past 7 days, indicating a possible accumulation. Bitcoin currently has a trading volume of $13.1 billion in the past 24 hours.\n\nFeatured image from Shutterstock, Chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWV4cGVydC1wcmVkaWN0cy1maXJld29ya3MtaWYtYml0Y29pbi1icmVha3Mtb3V0LWF0LXRoaXMtbGV2ZWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Crypto expert predicts 'fireworks' if Bitcoin breaks out at this level - Finbold - Finance in Bold",
        "content": "Traders are meticulously analyzing various indicators, carefully studying technical analysis (TA) patterns, and closely monitoring Bitcoin’s (BTC) price action, all in search of potential signals for an impending surge.\n\nRenowned crypto trading expert Michael van de Poppe took to Twitter on May 26 to share his analysis, shedding light on the current market conditions and potential price movements that could ignite a surge in Bitcoin’s value.\n\nVan de Poppe’s tweet emphasized the significance of the $26,600 level, stating that if this crucial resistance is breached, it could mark a significant deviation from recent support levels. Such a breakthrough, he suggested, could potentially propel Bitcoin towards new range highs, igniting ‘fireworks towards range highs.’\n\nIn terms of specific price levels, van de Poppe pointed out that a sweep of $25,800 would provide a logical consolidation point, offering ample liquidity for a potential reversal. However, the real excitement lies in the acceleration that could occur ‘if’ Bitcoin reclaims the $26,600 level. This development, according to van de Poppe, could set the stage for a swift move toward $27,500.\n\nBitcoin price chart. Source: Michael van de Poppe\n\nThe experienced trading expert further added that once Bitcoin surpasses the $27,450 threshold, ‘the sky is the limit.’\n\nBitcoin chart analysis\n\nAs the crypto community collectively holds its breath, the anticipation builds. The outcome of Bitcoin’s battle with resistance will undoubtedly have far-reaching implications for the market. Whether it will break free from its consolidation phase and soar to new heights or face further resistance remains to be seen.\n\nIt is important to note that Bitcoin’s future remains unpredictable. However, the insightful observations provided by industry experts such as Michael van de Poppe offer valuable guidance to traders navigating the intricate cryptocurrency landscape.\n\nCurrently, Bitcoin is trading at $26,438, reflecting a modest increase of 0.70% within the last 24 hours. However, over the course of the previous week, Bitcoin has seen a decline of 1.49%.\n\nBitcoin 1-day price chart. Source: Finbold\n\nDespite this recent downturn, the overall market capitalization of BTC stands strong at an impressive $512 billion.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiJWh0dHBzOi8vY2xlYXJ0YXguaW4vcy93aGF0LWlzLXRhcHJvb3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "What is Taproot and How Will it Benefit Bitcoin? - CRYPTO - ClearTax",
        "content": "Bitcoin is the world’s first and most popular cryptocurrency. However, like all other cryptos, it has had its ups and downs. Over the years, several issues have hampered the user experience of Bitcoin holders, and an upgrade was the need of the hour.\n\nThus, on 14 November 2021, the Taproot upgrade was implemented on block 709,632 of the Bitcoin network.\n\nHere’s more on the Taproot upgrade.\n\nWhat is Taproot?\n\nTaproot is the most significant Bitcoin upgrade after its 2017 SegWit upgrade. It aims to solve the problems of privacy, slow transaction speed, and security of the Bitcoin network.\n\nAs Bitcoin is a public blockchain, all its transactions are publicly visible. Anyone on this blockchain who knows your Bitcoin address can view your transaction history. While you can try to increase your anonymity on this network by using CoinJoins and coin mixing, it does not make Bitcoin a private currency. Taproot aims to make your transactions anonymous on this ecosystem, thereby increasing your privacy and security.\n\nAnother major issue with this cryptocurrency was its speed. Initially, Bitcoin had the speed to carry out seven transactions per second. But, as its popularity grew, so did its users, and its transaction speed slowed. Transaction fees also increased, with a surge in the value of the digital currency.\n\nWith high fees and low transaction speed degrading the user experience of Bitcoin users, the Segregated Witness (SegWit) upgrade was implemented in 2017. It aimed to fit more transactions in one block and speed up Bitcoin’s transaction process. However, its high transaction fees still prevailed. Taproot aimed to solve these problems by implementing several measures in its upgrade.\n\n\n\nFeatures of Taproot\n\nThe Taproot upgrade implements three major Bitcoin Improvement Proposals (BIPs) that aim to give its users the benefit of lower transaction fees, improved speeds, and higher security.\n\nIts features are:\n\nSchnorr Signatures (BIP340)\n\nSchnorr Signatures increase the speed and security of validating transactions on the Bitcoin network. Primarily known for its simplicity and efficiency in generating short signatures, its key benefit lies in taking multiple keys inside a complex Bitcoin transaction and producing a single unique signature. This means that a single Schnorr signature can aggregate signatures from multiple parties. This will help significantly reduce transaction time on the Bitcoin network.\n\nDue to a unique feature of the Taproot upgrade, it also enables your transactions to stay anonymous to a certain degree.\n\nIf you are using Taproot, you can transact using a Lightning Network channel, a sophisticated smart contract or a peer-to-peer transaction. A person monitoring your transactions will appear to them only as a peer-to-peer transaction.\n\nHowever, the wallet addresses of both the initial sender and the recipient will be visible.\n\nTapscript (BIP342)\n\nTapscript is a coding language upgrade to the Bitcoin script that helps the other BIPs of this upgrade to function. The opcode OP_CHECKSIGADD takes advantage of the aggregation feature of Schnorr Signatures and thus allows more space in the blocks. This coding language will bring more flexibility to this ecosystem. It can add new features like creating and supporting smart contracts on the Bitcoin network.\n\nTaproot (BIP341)\n\nUsing the Merkelized Alternative Script Tree (MAST), the BIP341 increases the amount of transaction data stored on a Bitcoin blockchain.\n\nPreviously, to conduct a transaction, you had to provide a signature. This helped prove that you are the actual owner of your crypto asset. Investors could also use features like timelock releases, multisignature (multisig), and many more.\n\nThese features made transactions complex and hence more difficult to track. However, these processes required multiple inputs and signatures to verify. Hence, a large amount of your transaction information is automatically revealed on the blockchain. This caused a security risk, and the huge amount of data on the blockchain triggered a lag. Hence, transaction speeds dropped as the volume of data increased.\n\nWith MAST, the amount of verification and scripts can be reduced as one MAST transaction would be able to represent multiple scripts. When a complex Bitcoin transaction goes to MAST, it only allows the implementation of the executed conditions on the blockchain. This process reduces the volume of data stored on the blockchain and, as a result, increases transaction speed and enhances users’ privacy.\n\n\n\nHow will Taproot benefit Bitcoin?\n\nThe Taproot upgrade will have the following benefits for Bitcoin users:\n\nLower transaction fees\n\nIncreased transaction speed\n\nLower risk of transaction data exposure\n\nImplementation of Pay-to-Taproot (P2TR)\n\nPossibility of Bitcoin covering Non-fungible tokens (NFTs) and Decentralised Finance (DeFi) markets in the future due to its upgraded script\n\nThe Taproot upgrade can potentially change the course of Bitcoin in future. Whether or not you are an investor of Bitcoin, staying informed of these upgrades can help shape your future crypto investment strategy.\n\n\n\n\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2J1c2luZXNzL2Jsb2NrY2hhaW4tYml0Y29pbi1vcmRpbmFscy1hLWxlYXAtZm9yd2FyZC1mb3ItdGhlLWJpdGNvaW4tbmV0d29ya3MtdXRpbGl0eS0zMTAzOTE1L9IBgwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9ibG9ja2NoYWluLWJpdGNvaW4tb3JkaW5hbHMtYS1sZWFwLWZvcndhcmQtZm9yLXRoZS1iaXRjb2luLW5ldHdvcmtzLXV0aWxpdHktMzEwMzkxNS9saXRlLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals: A leap forward for the Bitcoin network’s utility - The Financial Express",
        "content": "By Rajagopal Menon\n\nBitcoin, the unrivaled titan of cryptocurrencies, has recently witnessed a burst of energy with the introduction of the ordinals protocol. This groundbreaking development has ignited fervent debate within the Bitcoin community, injecting a fresh dimension into the digital currency. So, what exactly are ordinals? Why are they causing such a stir? And what implications could they hold for the future of Bitcoin?\n\nTo fully grasp the significance of ordinals, let’s start with a basic understanding of Bitcoin’s structure. As most Bitcoin enthusiasts are aware, each Bitcoin is composed of 100 million satoshis, or SATs. Ordinals, however, revolutionise this notion by enabling the individual transmission of SATs with the option to attach supplementary data. This data can take various forms, ranging from text and images to videos. This process of associating data with SATs is known as inscription. Impressively, over 100,000 inscriptions have already been created since the inception of ordinals earlier this week.\n\nThe name “ordinals” stems from the protocol’s unique approach to numbering sets based on the order of their mining. Among these 100,000-plus inscriptions, notable examples include ordinal punks and ordinal penguins. Given the Bitcoin and broader crypto communities’ proclivity for embracing and expanding on novel ideas, it is only reasonable to anticipate an influx of innovative and derivative concepts etched onto SATs. Crucially, these advancements have been made possible by the recent major upgrade to Bitcoin known as Taproot, which was implemented in late 2021.\n\nBut are these ordinals akin to NFTs (non-fungible tokens) on the Ethereum platform? The answer is both yes and no. While some distinctions can be drawn between ordinals and the familiar NFTs, the comparison holds merit. It is worth noting, however, that NFTs rely on smart contracts and often have their underlying assets hosted elsewhere, whereas ordinals are directly inscribed onto individual sets within blocks on the Bitcoin blockchain. In the press release accompanying their launch, as cited in Bitcoin magazine, it was emphasised that “ordinals are fully on-chain and do not require a side chain or separate token. Inscriptions inherit the simplicity, immutability, security, and durability of Bitcoin itself.” Furthermore, Casey Rodimore, the creator of ordinals, elucidated in an interview with Decrypt that “the ordinals protocol is just a system for numbering satoshis, giving individual sets a serial number, and then tracking them across transactions.”\n\nEssentially, ordinals have unveiled a new use case for the Bitcoin network, extending its utility beyond the mere transfer of value. Inscribed sets now compete for block space alongside regular BTC transactions, leading to an increase in network fees. While this might not sound ideal, it is crucial to remember that these fees serve as vital incentives for miners to secure the network. As block rewards diminish over time, network fees will inevitably become the primary reason for committing hash power to Bitcoin. In this context, ordinals contribute additional functionality to Bitcoin.\n\nAccording to Glassnode, ordinals have not only propelled the number of non-zero Bitcoin addresses to a record high of 44 million but have also ushered in a novel and unique chapter in Bitcoin’s history. This innovation generates network activity without necessitating the classical transfer of coin volume for monetary purposes. Consequently, the user base has expanded, exerting upward pressure on the fee market beyond the conventional investment and monetary transfer use cases.\n\nHowever, not everyone in the Bitcoin community agrees with this innovation. Adam Back, CEO of Blockstream and about as OG as they come, sees ordinals as a “frivolous waste of block space” and objects to “the sheer waste and stupidity of an encoding” that does not do anything efficient. This disagreement sums up the divide in the Bitcoin community, with some fervent and non-toxic Maxis like Adam and others believing that Bitcoin’s relative simplicity and limitations to storing and transferring value should be preserved at all costs, while more progressive voices argue that Bitcoin needs to adapt in order to thrive and survive.\n\nThis fundamental argument is unlikely to be resolved anytime soon, but one thing is for sure: ordinals are generating a lot of attention and debate within the Bitcoin community. This is a welcome change from the FUD that has been clouding the industry, and we can expect to hear more about ordinals and their impact on Bitcoin in the months and years to come.\n\nThe author is vice-president, WazirX\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1jb3JlLTI1LTAtaXMtbm93LWF2YWlsYWJsZS1vbi1naXRodWIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 May 2023 07:00:00 GMT",
        "title": "Bitcoin Core 25.0 is now available on GitHub - Finbold - Finance in Bold",
        "content": "Bitcoin Core, the reference implementation of the Bitcoin (BTC) protocol, plays a crucial role in the functioning and integrity of the Bitcoin network. Serving as a full node client, it enables users to validate transactions, maintain a copy of the blockchain, and participate in the consensus process.\n\nOn Friday, May 26, the newest version of Bitcoin Core became available on GitHub.\n\nVersion 25.0 brings a myriad of updates, including new features, multiple bug fixes, and various performance improvements. Most notably, the upgrade has enabled transactions of non-witness size 65 bytes, according to the update notes listed on GitHub.\n\n“Transactions of non-witness size 65 bytes and above are now allowed by mempool and relay policy. This is to better reflect the actual afforded protections against CVE-2017-12842 and open up additional use-cases of smaller transaction sizes.” – the update notes on GitHub state.\n\nBitcoin Core 25.0 new remote procedure calls\n\nFurthermore, Bitcoin Core version 25.0 also brings new remote procedure calls (RPCs) – key elements of on-chain applications that enable apps to ‘read and write’ the information while working with blockchains.\n\n“The scanblocks RPC returns the relevant blockhashes from a set of descriptors by scanning all blockfilters in the given range. It can be used in combination with the getblockheader and rescanblockchain RPCs to achieve fast wallet rescans.”\n\nAmong other things, the latest Bitcoin Core update also added new wallet functions such as ‘minconf’ and ‘maxcon,’ graphical user interface (GUI) changes, and new settings.\n\nWhat is Bitcoin Core?\n\nBitcoin Core is an open-source software project that serves as the primary software client for interacting with the Bitcoin network.\n\nIt serves to provide the necessary infrastructure to validate transactions, maintain the blockchain, and participate in the consensus process. In addition, Bitcoin Core also includes a full node implementation, a wallet for storing and sending Bitcoins, and tools for developers to build applications on top of the Bitcoin network.\n\nThis open-source code is highly regarded within the Bitcoin community and is maintained by a team of dedicated developers."
    }
]