[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDEvYml0Y29pbi1oYXMtYmVlbi1tb3JlLXN0YWJsZS10aGFuLWdvbGQtYW5kLXN0b2Nrcy12aW9sZW50LXByaWNlLWFjdGlvbi1jb3VsZC1lbnN1ZS_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8wMS9iaXRjb2luLWhhcy1iZWVuLW1vcmUtc3RhYmxlLXRoYW4tZ29sZC1hbmQtc3RvY2tzLXZpb2xlbnQtcHJpY2UtYWN0aW9uLWNvdWxkLWVuc3VlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Has Been More Stable Than Gold and Stocks; Violent Price Action Could Ensue - CoinDesk",
        "content": "Bitcoin Has Been More Stable Than Gold and Stocks; Violent Price Action Could Ensue\n\nSimilar uneventful periods in the past preceded major eruptions in volatility for BTC’s price, noted a research firm.\n\nBy Krisztian Sandor Aug 1, 2023 at 6:59 p.m. UTC"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTAxL2JpdGNvaW4tdHVybnMtbGVzcy12b2xhdGlsZS10aGFuLXMtcC01MDAtdGVjaC1zdG9ja3MtYW5kLWdvbGTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Turns Less Volatile Than S&P 500, Tech Stocks and Gold - Bloomberg",
        "content": "Bitcoin trading volume tumbled last month amid waning volatility and little notable price swings in a market that speculators traditionally gravitate to for its turbulence.\n\nJuly saw the lowest monthly trade volume for Bitcoin since November 2020, according to data from K33’s Bendik Schei and Vetle Lunde . The drop-off happened as volatility also plummeted, with the digital currency’s five-day volatility sitting below that of the S&P 500, tech stocks and gold, “a rare feat that has previously foreshadowed substantial volatility eruptions in the near term,” they wrote in a Tuesday note."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMDEvY3J5cHRvY3VycmVuY2llcy1mYWxsLXRvLWJlZ2luLWF1Z3VzdC1iaXRjb2luLWRpcHMtdW5kZXItMjkwMDAuaHRtbNIBZ2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA4LzAxL2NyeXB0b2N1cnJlbmNpZXMtZmFsbC10by1iZWdpbi1hdWd1c3QtYml0Y29pbi1kaXBzLXVuZGVyLTI5MDAwLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Cryptocurrencies fall to open August, bitcoin dips under $29,000 - CNBC",
        "content": "The crypto market came under pressure as the new month kicked off, with investors weighing the risks of the latest DeFi hack and another federal court decision on when to treat crypto assets as securities.\n\nOn Tuesday, bitcoin was little changed at $29,271.90, according to Coin Metrics. Earlier in the day it briefly fell to about $28,800. It ended July down 3.93%.\n\nEther , which has joined bitcoin in recent months as a sort of large cap, blue-chip trade in crypto, also cut its Tuesday losses and was last down by 0.5% at $1,850.17, after finishing July lower by 3.35%. It was under extra pressure due to a recent exploit in DeFi giant Curve, however.\n\n\"Ethereum is sort of the king of DeFi and Curve is viewed as one of the most important liquidity providers in DeFi,\" said Josh Gilbert, an analyst at investment firm eToro. \"[Ethereum] is a massive project so it's not going to come under as much pressure as smaller alts but that Curve issue is ultimately the reason we're seeing weakness in Ethereum right now.\"\n\nAltcoins fell after a federal judge said some crypto assets are securities regardless of the context in which they are sold. This opinion contradicted an earlier ruling from the same district court that said Ripple's XRP may not be categorized as a security in all circumstances. XRP was last down 1.5%, having also recovered earlier losses.\n\nOther tokens named in the recent SEC lawsuits against Binance and Coinbase as potential securities inched closer to unchanged after being under pressure earlier, including those tied to the Solana and Cardano networks, which at one point fell more than 2%.\n\nDeFi giant hacked\n\nOther smaller coins, specifically in the DeFi segment of the market, recovered losses, too. CRV, the native token of Curve Finance, a stablecoin-focused decentralized exchange, was up 8% in the past 24 hours, according to CoinGecko. Aave cut its 9% loss in the same period and was little changed, while the tokens tied to Compound and the Synthetix network were down 5% and 4%, respectively.\n\nCurve, a stablecoin exchange built on Ethereum, was exploited Sunday due to a bug in the smart contract programming language called Vyper. The hacker targeted three liquidity pools for tokens paired with ether and CRV as well as several ERC-20 tokens issued on Alchemix (alETH), Metronome Synth (smETH) and JPEG'd (pETH). It drained as much as $100 million worth of cryptocurrency from the platform, including $20 million of CRV and a version of ether, according to CryptoQuant.\n\n\"We've unfortunately had this scenario in crypto a few times over the past 12 to 18 months. Whenever investors hear the word hack ... it puts the whole crypto market on the backfoot and that's what's happening here,\" Gilbert said.\n\nBitcoin volumes have also dropped significantly from their recent highs, despite the price of bitcoin proving so resilient this year. It traded in a tight range throughout July, neither breaking above a key level of $31,500 nor below $25,200, and has soared 76% in 2023.\n\n\"We had a lot of buzz recently around the Blackrock ETF but that can only drive bitcoin for so long and for so far. We got plenty of optimism with it but that initial optimism is fading slightly,\" Gilbert said. \"When bitcoin heads south so do most altcoins ... and they're selling off a little bit further given what we're seeing with Curve.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA3LzMxL2NvaW5iYXNlLWNlby1zZWMtbGF3c3VpdC1zdWUtYml0Y29pbi1wcmljZS1jcnlwdG8td2ludGVyLWRlbGlzdC1jcnlwdG8tYXNzZXRzLXNlY3VyaXRpZXMtYnJpYW4tYXJtc3Ryb25nL9IBkwFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA3LzMxL2NvaW5iYXNlLWNlby1zZWMtbGF3c3VpdC1zdWUtYml0Y29pbi1wcmljZS1jcnlwdG8td2ludGVyLWRlbGlzdC1jcnlwdG8tYXNzZXRzLXNlY3VyaXRpZXMtYnJpYW4tYXJtc3Ryb25nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Coinbase boss Brian Armstrong: SEC suggested change that would have triggered the end of the crypto industry in America - Fortune",
        "content": "Coinbase’s CEO said a demand from U.S. officials to cease trading all assets except Bitcoin would have spelled the end of the cryptocurrency industry as we know it.\n\nIn an interview published Monday by the Financial Times, Brian Armstrong, CEO of cryptocurrency exchange platform Coinbase, revealed the SEC suggested his company make the change while the agency prepared to sue the firm for allegedly operating as an unregistered broker.\n\nHad Coinbase complied with the SEC’s request, it would have delisted every one of the more than 200 tokens it offers, apart from Bitcoin—the world’s most traded cryptocurrency.\n\nThis would have set a precedent that meant most American crypto firms would have been left operating illegally unless they registered with the SEC, according to the FT.\n\n“We really didn’t have a choice at that point. Delisting every asset other than Bitcoin, which by the way is not what the law says, would have essentially meant the end of the crypto industry in the U.S.,” Armstrong told the publication of Coinbase’s decision to reject the SEC’s request.\n\n“It kind of made it an easy choice…let’s go to court and find out what the court says.\n\n“They came back to us, and they said…we believe every asset other than Bitcoin is a security.\n\n“And, we said, well how are you coming to that conclusion, because that’s not our interpretation of the law. And they said, we’re not going to explain it to you, you need to delist every asset other than Bitcoin.”\n\nIt comes following a row over how cryptocurrencies should be classified and as a result, regulated.\n\nSEC Chair Gary Gensler has made it clear he believes most cryptocurrencies should be classified as securities, but he has conceded that Bitcoin is an exception that ought to be classed as a commodity.\n\nThe classification of the assets determines which regulator—the SEC or the Commodity Futures Trading Commission (CFTC)—oversees them.\n\nIn its June lawsuit, the SEC accused Coinbase of failing to register with the agency as a broker, national securities exchange, and clearing agency. It also alleged that some crypto assets offered on Coinbase’s exchange—including popular tokens Solana, Cardano, and Polygon—were unregistered securities.\n\nIt came less than three months after Nasdaq-listed Coinbase revealed it had received a Wells notice—warning that it was facing a legal investigation—from the SEC.\n\nA spokesperson for the SEC was not immediately available for comment when contacted by Fortune.\n\nCrypto troubles\n\nCryptocurrencies like Bitcoin are notoriously volatile, and being prone to wild swings in value has prompted warnings from the likes of Warren Buffett and JPMorgan CEO Jamie Dimon about their worth as investments.\n\nIn the wake of the collapse of crypto exchange FTX last year, regulators have taken steps to crack down on malpractice allegedly being undertaken in the crypto sector, suing Binance and Coinbase in quick succession last month.\n\n“You simply can’t ignore the rules because you don’t like them or because you’d prefer different ones: The consequences for the investing public are far too great,” Gurbir S. Grewal, director of the SEC’s division of enforcement, said in a statement as the agency sued Coinbase.\n\nThree months earlier, the CFTC took its own legal action against Binance and its CEO, Changpeng Zhao, alleging that the company had violated the Commodity Exchange Act and operated an “illegal” exchange and “sham” compliance program.\n\nThe legal action weighed on an already suffering crypto industry, with crypto assets across the board still reeling from 2022’s widespread selloff that became known as the Crypto Winter.\n\nLast year’s downturn saw more than $200 billion wiped off the market in a single day back in June, with some experts predicting the phenomenon—which saw many crypto investors’ life savings wiped out overnight—could last through 2023 and possibly into 2024.\n\nMeanwhile, 2022 also brought the spectacular implosion of crypto exchange FTX, leading to speculation late last year over whether the world was witnessing “the end of crypto,” with some heralding FTX’s collapse as the cryptocurrency market’s “Lehman moment.”\n\nBitcoin has recovered somewhat from last year’s lowest point, but at today’s price of just over $29,000 the digital token is still far from its all-time high of nearly $69,000."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vY3J5cHRvLWNvdXBsZS10by1wbGVhZC1ndWlsdHktaW4tNDUtYmlsbGlvbi1iaXRjb2luLWhlaXN0LTIwMjMtN9IBZGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vY3J5cHRvLWNvdXBsZS10by1wbGVhZC1ndWlsdHktaW4tNDUtYmlsbGlvbi1iaXRjb2luLWhlaXN0LTIwMjMtNz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "'Crypto couple' to plead guilty in $4.5 billion bitcoin heist - Business Insider",
        "content": "The \"crypto couple\" Ilya Lichtenstein and Heather Morgan are due for a plea hearing on Thursday.\n\nThe couple are expected to plead guilty to orchestrating a $4.5 billion bitcoin-laundering scheme.\n\nThey were arrested in 2022 following what the DOJ called its \"largest financial seizure.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe husband and wife ensnared in charges related to a $4.5 billion bitcoin-laundering scheme are due in federal court on Thursday for a hearing and expected to plead guilty to orchestrating an elaborate plot to sell bitcoin that was stolen during the 2016 hack of Bitfinex.\n\nIlya Lichtenstein and Heather Morgan, an eccentric couple known for walking a leashed Bengal cat in Manhattan and for Morgan's rap performances under the name \"Razzlekhan,\" were arrested in February 2022 following what the Department of Justice said was its \"largest financial seizure ever.\" The second largest occurred later that same year, when the feds seized $3.36 billion worth of bitcoin that had been stolen from a dark-web site years earlier.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in ."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMzEvYml0Y29pbi1saW5nZXJzLW5lYXItMjkyay1hcy1pbnZlc3RvcnMtbXVsbC1sYXRlc3QtaW5kdXN0cnktd29lcy1jcnYtc2lua3MtMTI1L9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMzEvYml0Y29pbi1saW5nZXJzLW5lYXItMjkyay1hcy1pbnZlc3RvcnMtbXVsbC1sYXRlc3QtaW5kdXN0cnktd29lcy1jcnYtc2lua3MtMTI1L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Falls 1.2% as Curve Chaos Sparks Systemic Crisis Fears in DeFi - CoinDesk",
        "content": "“In general, we’re in the dog days of summer and in turn seeing relatively low volumes for Bitcoin along with Ethereum,\" Weisberger also wrote, but added that \"larger-size buyers\" seemed to be accumulating bitcoin as the price recently dropped."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDEvbWljcm9zdHJhdGVneS1wbGFucy11cC10by03NTBtLXN0b2NrLXNhbGUtdG8tZnVuZC1iaXRjb2luLXB1cmNoYXNlcy1vdGhlci10aGluZ3Mv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDEvbWljcm9zdHJhdGVneS1wbGFucy11cC10by03NTBtLXN0b2NrLXNhbGUtdG8tZnVuZC1iaXRjb2luLXB1cmNoYXNlcy1vdGhlci10aGluZ3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Whale Michael Saylor Might Buy a Lot More BTC - CoinDesk",
        "content": "“We intend to use the net proceeds from this offering for general corporate purposes, including the acquisition of bitcoin and working capital, and, subject to market conditions,” already issued bonds, according to MicroStrategy’s Tuesday filing."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDcvMzEvZGVzYW50aXMtYWNjdXNlcy1iaWRlbi1vZi1jYXJyeWluZy1vdXQtYS13YXItYWdhaW5zdC1iaXRjb2luLXNheXMtaGVsbC1zdG9wLWl0LWlmLWVsZWN0ZWQtcHJlc2lkZW50L9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDcvMzEvZGVzYW50aXMtYWNjdXNlcy1iaWRlbi1vZi1jYXJyeWluZy1vdXQtYS13YXItYWdhaW5zdC1iaXRjb2luLXNheXMtaGVsbC1zdG9wLWl0LWlmLWVsZWN0ZWQtcHJlc2lkZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "DeSantis Accuses Biden of 'War on Bitcoin,' Vows to Stop It if Elected President - CoinDesk",
        "content": "“Biden's war on bitcoin and cryptocurrency will come to an end when I am president,” he said at a Monday campaign event in New Hampshire. “We are going to allow Americans to invest in things like bitcoin and cryptocurrency. No one is forcing you to do it, if you want to do it, you can do it.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNy8zMS90aW55LWJpdGNvaW4tYXRtLWZpcm0tcGxhbnMtdG8tZmlnaHQtZ2lhbnQtc3dpc3MtcmVndWxhdG9yLWluLWRhdmlkLXZzLWdvbGlhdGgtYmF0dGxlL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNy8zMS90aW55LWJpdGNvaW4tYXRtLWZpcm0tcGxhbnMtdG8tZmlnaHQtZ2lhbnQtc3dpc3MtcmVndWxhdG9yLWluLWRhdmlkLXZzLWdvbGlhdGgtYmF0dGxlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Tiny Bitcoin ATM Firm Plans to Fight Giant Swiss Regulator in David vs Goliath Battle - CoinDesk",
        "content": "“The crypto industry is stronger now and won’t be pushed around as easily as it has been in the past,” Roussel said, “FINMA was able to do this because they were never put in check.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzAxL21pY3Jvc3RyYXRlZ3ktYm9va3MtaW1wYWlybWVudC1jaGFyZ2Utb2YtMjQxbS1vbi1tYXNzaXZlLWJpdGNvaW4taG9sZGluZ3MtaW4tcTIv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA4LzAxL21pY3Jvc3RyYXRlZ3ktYm9va3MtaW1wYWlybWVudC1jaGFyZ2Utb2YtMjQxbS1vbi1tYXNzaXZlLWJpdGNvaW4taG9sZGluZ3MtaW4tcTIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "MicroStrategy Takes $24M Q2 Charge on Multibillion-Dollar Bitcoin Haul - CoinDesk",
        "content": "The company's digital asset impairment reflects the decline in the price of bitcoin versus the price at which the bitcoin was acquired. Under current accounting rules, the value of digital assets such as cryptocurrencies must be recorded at their cost and then only adjusted if their value is impaired, or goes down. But if the price rises, that does not get reported unless an asset is sold."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDgvMDIvY29pbmJhc2UtbG9va3MtdG8tYWRkLWJpdGNvaW4tbGlnaHRuaW5nLWZvci1wYXltZW50cy_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA4LzAyL2NvaW5iYXNlLWxvb2tzLXRvLWFkZC1iaXRjb2luLWxpZ2h0bmluZy1mb3ItcGF5bWVudHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Coinbase Looks to Add Bitcoin Lightning for Payments - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDEvYml0Y29pbi1sb29raW5nLW92ZXJzb2xkLWJ1dC1hbnktYm91bmNlLWNvdWxkLWJlLWRpc2FwcG9pbnRpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Looking Oversold, but Any Bounce Could Be Disappointing - CoinDesk",
        "content": "Unfortunately for bulls, there doesn’t appear to be much on the horizon to change current market dynamics. On a macroeconomic level, there will be plenty of economic reports, but they are unlikely to show anything different than the ongoing story of continued growth and modestly slowing inflation. There is no Federal Reserve meeting in August, but the central bank’s Jackson Hole conference late in the month and Chairman Jerome Powell’s keynote speech might give a clue about the shape of future monetary policy. Few, however, are expecting Powell to deviate very far from the Fed’s recent vigilance against inflation."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOC8wMS9iaXRjb2luLXdvbnQtYmFjay11cy1kb2xsYXItcHJlc2lkZW50aWFsLWhvcGVmdWwtdml2ZWstcmFtYXN3YW15LXNheXMv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA4LzAxL2JpdGNvaW4td29udC1iYWNrLXVzLWRvbGxhci1wcmVzaWRlbnRpYWwtaG9wZWZ1bC12aXZlay1yYW1hc3dhbXktc2F5cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Won’t Back U.S. Dollar, Presidential Hopeful Vivek Ramaswamy Says - CoinDesk",
        "content": "In February, Ramaswamy announced his candidacy for the Republican Party’s nomination for president. According to the election data site FiveThirtyEight, he was polling at 6.9% among declared or presumed Republicans, which puts him in third place behind former president Donald Trump at 53.4% and Florida Governor Ron DeSantis at 15.6% in a crowded field of candidates."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDcvMzEvYmFyYmllLW1hcmdvdC1yb2JiaWUtYml0Y29pbi1iaWcta2VuLWVuZXJneS_SAVZodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA3LzMxL2JhcmJpZS1tYXJnb3Qtcm9iYmllLWJpdGNvaW4tYmlnLWtlbi1lbmVyZ3kvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "‘Barbie’ star Margot Robbie on Bitcoin and ‘big Ken energy’ - Fortune",
        "content": "The hit movie Barbie has become the summer’s pop culture conversation, so it was probably only a matter of time till the crypto world got drawn in, too. That happened during a recent Fandango interview when the host asked the film’s star, Australian actress Margot Robbie, how to “spot a Ken.”\n\nRobbie responded by recounting a conversation she’d had with the film’s director, Greta Gerwig, during taping when two of the film’s producers—including her husband—would chat about crypto.\n\n“When David and Tom would start talking about Bitcoin or something, Greta and I would be like, ‘You’re being such Kens!’” said Robbie, adding she felt the same when the pair chatted about golf.\n\nKen, of course, is Barbie’s longtime boyfriend who historically has offered little depth or personality, and serves primarily as male eye candy. (The new movie also points to Ken as a symbol of the patriarchy, but a cryptocurrency column is probably not an ideal forum for that particular debate.)\n\nIt wasn’t long before Robbie’s comments caught the attention of the crypto crowd. While it’s hard to see her remarks as particularly flattering, the reaction was primarily positive. This included the managing director of investment firm Swan Bitcoin, who tweeted a short excerpt from the pink-hued interview that loops Robbie saying “Bitcoin or something” three times.\n\nMeanwhile, as CoinTelegraph notes, MicroStrategy CEO Michael Saylor—whose cybersecurity firm is now one of the world’s largest Bitcoin holders—and others hailed Robbie’s subsequent comment: “There also can be big Ken energy, and that’s a good thing!”\n\nRobbie never clarifies whether that “big Ken energy” includes men who buy Bitcoin, but many of the cryptocurrency’s social media acolytes were happy to conclude that it does. In the bigger picture, though, it doesn’t really matter. What does matter is that an actor of Robbie’s stature is talking about Bitcoin at all, and that her Hollywood producer husband appears to be dabbling in it. This is free exposure for crypto that would have been unimaginable a decade ago, and so Bitcoin boosters are understandably pleased to get a tiny piece of this summer’s big pop culture moment.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nBinance filed to dismiss the CFTC’s complaint for lack of jurisdiction, writing, “United States law governs domestically but does not rule the world.” (Reuters)\n\nHackers used a software vulnerability to steal at least $42 million from several stablecoin pools on the popular DeFi platform Curve Finance. (CoinDesk)\n\nIn a strange bedfellows moment, the banking industry threw its support behind progressive Sen. Elizabeth Warren (D-Mass.), who is pushing legislation to impose a rash of new KYC and AML rules on crypto firms. (Bloomberg)\n\nAn SEC official warned accounting firms they could be held liable if crypto firms tout any partial reviews they conduct as “audits.” (The Block)\n\nFamed VC firm Sequoia, which lost over $200 million on FTX, announced it cut its crypto fund down to $200 million from $585 million amid a broader downsizing of the firm. (WSJ)\n\nMEME O’ THE MOMENT\n\nMore Bitcoin Ken:"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzAxL2JpdGNvaW4taG92ZXJzLW5lYXItMjkyay1hcy1jcnlwdG8tbWFya2V0cy1yZWdhaW4tZ3JvdW5kLWxvc3QtaW4tY3VydmUtZGVmaS1mYWxsb3V0L9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzAxL2JpdGNvaW4taG92ZXJzLW5lYXItMjkyay1hcy1jcnlwdG8tbWFya2V0cy1yZWdhaW4tZ3JvdW5kLWxvc3QtaW4tY3VydmUtZGVmaS1mYWxsb3V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Dips Below $29K, BNB Slides After Report on DOJ's Binance Concerns - CoinDesk",
        "content": "\"Clearly, there are fears over a liquidation cascade happening within the Ethereum DeFi ecosystem, Richard Mico, the U.S. CEO of payment-and-compliance infrastructure provider Banxa, wrote in an email to CoinDesk. \"I don’t know how likely such a cascade is, but the market seems jittery as a result of these metastasizing issues. What’s ironic is that DeFi had held up so well during the blowups of 2022, and yet it’s an exploit more recently that might be the trigger for a DeFi blowup itself now.\""
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy51c25ld3MuY29tL25ld3MvdG9wLW5ld3MvYXJ0aWNsZXMvMjAyMy0wNy0zMS9zZWMtYXNrZWQtY29pbmJhc2UtdG8tc3RvcC10cmFkaW5nLWluLWNyeXB0b2N1cnJlbmNpZXMtb3RoZXItdGhhbi1iaXRjb2luLXByaW9yLXRvLXN1aW5nLWZ00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "SEC Asked Coinbase to Trade Only in Bitcoin Before Suing Crypto Exchange -FT - U.S. News & World Report",
        "content": "(Reuters) - The U.S. Securities and Exchange Commission (SEC) had asked Coinbase to stop trading in all cryptocurrencies except bitcoin before suing the cryptocurrency platform in June, the Financial Times reported on Monday, citing CEO Brian Armstrong.\n\n\"We really didn't have a choice at that point. Delisting every asset other than bitcoin, which by the way is not what the law says, would have essentially meant the end of the crypto industry in the U.S.,\" Armstrong told the FT.\n\n\"It kind of made it an easy choice ... let's go to court and find out what the court says,\" he added.\n\nThe SEC had accused Coinbase of operating illegally because it failed to register as an exchange. It also alleged that Coinbase traded at least 13 crypto assets that are securities that should have been registered, including tokens such as Solana, Cardano and Polygon.\n\nThe SEC told the FT that its enforcement division did not make formal requests for \"companies to delist crypto assets\".\n\n\"In the course of an investigation, the staff may share its own view as to what conduct may raise questions for the commission under the securities laws,\" FT said, citing the SEC.\n\nIn response to the FT report, a Coinbase spokesperson said the SEC had never shared a position that all assets other than bitcoin were securities, and that staff don't make formal requests such as the one implied by the article without a vote of the full commission.\n\n\"We continue our discussions with the Commission, but believe that transparent and fair rulemaking and Congressional action represent the best path forward for American crypto users and the companies building the cryptoeconomy in the US,\" the spokesperson added.\n\nThe regulator sued Binance in June, with both civil cases part of SEC Chair Gary Gensler's push to assert jurisdiction over the crypto industry.\n\nGensler has labeled the crypto industry a \"Wild West\" that has undermined investor trust in the U.S. capital markets. Crypto companies say the SEC rules are unclear, and that the agency is overreaching by trying to regulate them.\n\nThe SEC did not immediately respond to a Reuters request for comment on the report.\n\n(Reporting by Juby Babu in Bengaluru; additional reporting by Kanjyik Ghosh and Rishabh Jaiswal; Editing by Sonia Cheema, Savio D'Souza and Anil D'Silva)"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNy8zMS9iaXRjb2luLXRhdWdodC1tZS1hLXZhbHVhYmxlLWxlc3Nvbi1hdC1hdXN0aW5zLWFpcnBvcnQv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA3LzMxL2JpdGNvaW4tdGF1Z2h0LW1lLWEtdmFsdWFibGUtbGVzc29uLWF0LWF1c3RpbnMtYWlycG9ydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Taught Me a Valuable Lesson at Austin’s Airport - CoinDesk",
        "content": "Has the hype surpassed those use cases, to the point where it becomes a distraction? Almost certainly, it has. But for those of us who believe the internet is young, and that this ability to transact with minimal information will be an important part, it seems worth working on for the longterm."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDEvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1zdGFydHMtYXVndXN0LWluLXRoZS1yZWQtYWZ0ZXItbG9zaW5nLWdyb3VuZC1pbi1qdWx5L9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzAxL2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWJpdGNvaW4tc3RhcnRzLWF1Z3VzdC1pbi10aGUtcmVkLWFmdGVyLWxvc2luZy1ncm91bmQtaW4tanVseS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Starts August in the Red After Losing Ground in July - CoinDesk",
        "content": "The U.S. Securities and Exchange Commission (SEC) sued internet marketer Richard Schueler, known online as Richard Heart, and his projects Hex, PulseChain and PulseX, alleging he raised over $1 billion across three different unregistered securities offerings. Heart also defrauded his investors, the SEC alleged in its Monday lawsuit, by using investor funds for personal goods. \"Heart continually touted these investments as a pathway to grandiose wealth for investors, claiming that Hex, for example, 'was built to be the highest appreciating asset that has ever existed in the history of man,'\" the lawsuit read. \"Although Heart claimed these investments were for the vague purpose of supporting free speech, he did not disclose that he used millions of dollars of PulseChain investor funds to buy luxury goods for himself.\""
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1vdXRsb29rLXJlY29yZC1oaWdoLWJsYWNrcm9jay1sYXJyeS1maW5rLW1pa2Utbm92b2dyYXR6LTIwMjMtN9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Could Hit New High After BlackRock's Larry Fink Got 'Orange-Pilled' - Markets Insider",
        "content": "Bitcoin could hit a new record high now that Blackrock's Larry Fink is a believer, Mike Novogratz said.\n\n\"The most important thing that happened this year in bitcoin is Larry Fink,\" he said on Bloomberg TV.\n\nBitcoin's current all-time high is $69,000 set in 2021, and it's now hovering below $30,000.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBlackRock CEO Larry Fink's conversion into a bitcoin devotee is this year's headline event for the token and could send it to a new record high, crypto bull billionaire Mike Novogratz said.\n\n\"I think the most important thing that happened this year in bitcoin is Larry Fink,\" the Galaxy CEO said in an interview on Bloomberg TV with David Rubenstein. \"He got 'orange-pilled,' as we say — orange-pilled is when you take a non-believer and you make him a believer in bitcoin — and Larry was a non-believer, now he says, 'hey, this is going to be a global currency.'\"\n\nThe comments follow BlackRock's June application to establish a bitcoin spot ETF; it's among the biggest signals of institutional support for the cryptocurrency.\n\nAdded to that, Fink himself has remarked bullishly on digital tokens, saying they could revolutionize finance. That's after he laughed off bitcoin in 2017 as a measure of demand for money laundering.\n\nAdvertisement\n\nTo Novogratz, such a personal change in a major CEO's viewpoint indicates shifting attitudes towards the digital currency.\n\n\"Value comes from when people believe there's value, and now we have this preponderance of evidence,\" he said. \"180 million people around the world, without a gun to their head, take their hard earned savings and store it in this community of people that run this technology, you know, called bitcoin.\"\n\nThis pivoting sentiment could help bitcoin surpass its $69,000 record set in 2021, Novogratz said, further supported by a future cut in interest rates. The token has shifted around the $30,000 mark for the past few months.\n\nSimilarly, Fundstrat said last week that a bitcoin ETF from BlackRock could drive a boost in daily demand for the crypto token, sending the price to $180,000 by April.\n\nAdvertisement\n\nAnother upside factor Novogratz noted was Ripple's recent court victory against the Securities and Exchange Commission, when a judge ruled its cryptocurrency was not a security for the general public. To him, this showed that the regulatory rules \"are no where close to clear.\"\n\nHe also touched on the new Worldcoin, a cryptocurrency developed by OpenAI co-founder Sam Altman. The token stands out for its use of an eyeball scanner, used to establish unique digital identities per user.\n\nNoting that it would be a bad idea to bet against Altman right now, Novogratz said of Worldcoin: \"I think the price potentially can go a lot higher, because there's an AI-hype cycle.\"\n\nThe currency was trading at $2.33 as of Monday afternoon."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvZXRmLTIwMjQtaGFsdmluZy1jb3VsZC1iZS1lcGljLWNhdGFseXN0cy1mb3ItYml0Y29pbi_SAWJodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2V0Zi0yMDI0LWhhbHZpbmctY291bGQtYmUtZXBpYy1jYXRhbHlzdHMtZm9yLWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "ETF & 2024 Halving Could Be Epic Catalysts for Bitcoin - ETF Trends",
        "content": "A spot bitcoin exchange traded fund in the U.S. is far from a guaranteed proposition. However, there’s no denying the largest digital currency will see another halving in April 2024. Either or both events could be potential upside catalysts.\n\nThat’s the sentiment of research firm Fundstrat. In a note out earlier this week, Fundstrat forecast that bitcoin could surge to $180,000, roughly six times current prices, ahead of the April 2024 halving. Price appreciation anywhere close to that would likely stir significant upside for shares of bitcoin miners, including those residing on the roster of the Invesco Alerian Galaxy Crypto Economy ETF (SATO) .\n\nFundstrat also echoed now-familiar sentiment that should the Securities and Exchange Commission (SEC) approve a spot bitcoin ETF, the ensuing reaction would be overtly bullish for bitcoin prices. That could be a positive for SATO’s roster, which is highly correlated to bitcoin price action.\n\n“This [bitcoin ETF launch] would bring daily demand to $125 million, while daily supply is only $25 million. The implied equilibrium price would need to rise so daily supply matches daily demand. Equilibrium analysis suggests that a clearing price is $140,000 to $180,000, before the April 2024 halvening,” according to Fundstrat.\n\nHalving Alone Could Be Bullish for SATO\n\nWhile the prospects for a U.S.-listed spot bitcoin ETF very much remain up in the air, the halving alone could be a spark for the cryptocurrency and SATO member firms. While halvings cut rewards given to miners, the events aim to keep a lid on supply, which is bullish for bitcoin pricing.\n\nShould the multiplier effect following the halving be in the range of 4x to 5x, that could provide considerable ballast to bitcoin prices.\n\n“This means that $1 of demand can result in a $4 to $5 increase in market cap,” Sean Farrell, Fundstrat’s head of digital asset strategy, noted.\n\nHe put the odds of spot bitcoin ETF approval at 75%, noting that if BlackRock brings the first such fund to market, it’s likely to be one of the biggest ETF launches in industry. Looking further out, Farrell estimated that the spot bitcoin ETF category could eventually eclipse the precious metals ETF space, which currently has approximately $230 billion in combined assets under management.\n\nA spot bitcoin ETF or ETFs would stoke demand for bitcoin because issuers would need to purchase the digital currency, in turn driving prices higher. That could benefit SATO.\n\nVettaFi LLC (“VettaFi”) is the index provider for SATO, for which it receives an index licensing fee. However, SATO is not issued, sponsored, endorsed or sold by VettaFi, and VettaFi has no obligation or liability in connection with the issuance, administration, marketing or trading of SATO."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtdG9sZC1jb2luYmFzZS1zdG9wLXRyYWRpbmctMDQ1NjI3NjY4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "SEC Told Coinbase to Stop Trading in All Cryptos Except Bitcoin Before Suing: FT - Yahoo Finance",
        "content": "The SEC asked Coinbase to delist every cryptocurrency except bitcoin before suing the exchange.\n\nArmstrong told the Financial Times the SEC recommendation left us no choice but to head to court.\n\nThe U.S. Securities and Exchange Commission (SEC) had asked Coinbase (COIN) to stop trading in all cryptocurrencies other than bitcoin (BTC) prior to suing the crypto exchange, according to a Financial Times report, citing Coinbase CEO Brian Armstrong.\n\nThe SEC told the FT its enforcement division did not make formal requests for “companies to delist crypto assets.”\n\n“In the course of an investigation, the staff may share its own view as to what conduct may raise questions for the commission under the securities laws,” it added, according to the FT report.\n\nSEC Chair Gary Gensler, the four SEC commissioners and SEC staff have had different opinions on matters and don't necessarily reflect the institution's position unless expressed as so.\n\n“The interview as published earlier today by the Financial Times omitted critical context regarding our conversations with the SEC in the U.S.,\" a Coinbase spokesperson told CoinDesk in an email. \"Whether deliberately or as a result of an oversight, the author implied that the SEC ordered Coinbase to 'halt all trading of every crypto asset other than Bitcoin.' As stated by the SEC itself further in the article, its “enforcement division did not make formal requests for “companies to delist crypto assets”.\n\nCoinbase further added that, \"the views shared in the FT article may have represented the views of some staff at the time, but did not represent those of the Commission more broadly. We continue our discussions with the Commission..\"\n\nArmstrong told FT that \"the SEC made the recommendation before launching legal action against the Nasdaq-listed company last month for failing to register as a broker,\" the report said.\n\nOn June 6, the SEC charged Coinbase with breaching federal securities law alleging that it was simultaneously operating as a broker, an exchange and a clearinghouse for unregistered securities – namely, 13 different cryptocurrencies but not bitcoin. Coinbase shot back saying the SEC's action violates due process and constitutes an abuse of discretion. Coinbase and the SEC are now embattled in a legal process, even as Ripple scored a partial victory in a case against the SEC, ruling that Ripple's XRP token is not a security.\n\nStory continues\n\n“They came back to us, and they said . . . we believe every asset other than bitcoin is a security,” Armstrong said according to the FT. “And, we said, well how are you coming to that conclusion, because that’s not our interpretation of the law. And they said, we’re not going to explain it to you, you need to delist every asset other than bitcoin.”\n\nArmstrong said the SEC recommendation left us no choice but to head to court.\n\nGensler has previously suggested that all cryptocurrencies other than bitcoin are securities. Armstrong's revelations suggest the SEC viewed Ether, the second-largest cryptocurrency, as a security before suing Coinbase.\n\nThe SEC and FT did not immediately respond to CoinDesk's request for comment.\n\nRead More: Coinbase Goes to Court Against the SEC\n\nUPDATE (July 31, 05:35 UTC): Adds details throughout, updates headline.\n\nUPDATE (July 31, 11:55 UTC): Adds comment from Coinbase's spokesperson.\n\n\n\n"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vc2VjLWFza2VkLWNvaW5iYXNlLWRlbGlzdC1jcnlwdG8tMTU1NDMzMTc3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "SEC asked Coinbase to delist all crypto tokens except bitcoin: Report - Yahoo Finance",
        "content": "Coinbase CEO Brian Armstrong claims that, ahead of its legal action against the company, the SEC requested that the platform delist most crypto tokens, except bitcoin, according to a report from the Financial Times. Yahoo Finance Crypto Reporter David Hollerith breaks down the report.\n\nVideo Transcript\n\n- Well, early this morning we got more color on the clash between the Securities and Exchange Commission and Coinbase before the SEC filed legal action against the major US crypto exchange in June. Here to tell us more, we're joined by our senior reporter David Hollerith. So David, give us some context here.\n\nDAVID HOLLERITH: Yeah, Rochelle. So as you mentioned, the SEC sued Coinbase at the beginning of June for allegedly operating an unregistered Securities Exchange. Now in the SEC's lawsuit, they named 13 different cryptocurrencies, including ADA and Sol, which they identified as crypto security assets.\n\nNow according to this story from the Financial Times from earlier this morning, the Coinbase CEO Brian Armstrong said that ahead of launching the legal action against the crypto exchange, the SEC had asked Coinbase to delist more than 200 of its crypto tokens. And this essentially is everything but Bitcoin is what Armstrong was highlighting. And that is obviously far different from the 13 or so coins that are named in the lawsuit. And the implication here is pretty clear.\n\nArmstrong has argued in his statement is that if Coinbase had agreed with the SEC and hadn't opposed it and this case hadn't gone to court, it would have essentially set a legal precedent for the crypto industry, which would have stilted it as far as how much it could grow in the US.\n\nSo again, this goes back to the legal murkiness between whether or not a cryptocurrency is a commodity or a security in the US. And there's not a clear law decided. There the SEC believes that most everything, except Bitcoin, in the crypto asset class is a security. And this is obviously now playing out a series of lawsuits in the courts. The most-- I guess the latest stage lawsuit of these we would bring up would be the Ripple case against the SEC.\n\nStory continues\n\nSo it's also interesting that owning Coinbase stock at this point has kind of become like a regulatory bet for investors on the crypto industry having sort of a more positive regulatory outlook in the near future. It's particularly interesting if you look at Coinbase's stock compared to Bitcoin.\n\nSo there's also this ETF situation that's been going on. BlackRock and a number of other asset managers have filed for a Bitcoin ETF, naming Coinbase is a major partner in those offerings. And that, of course, needs to be approved by the SEC. But around the time of the lawsuit and the BlackRock filing, Coinbase's stock has significantly outperformed Bitcoin.\n\nAnd that's interesting because for most of its-- since its inception, for most of its trading history, Coinbase's stock has well underperformed Bitcoin. So we're seeing a huge outperformance over the month of July and we're going to continue to watch that obviously on Thursday when the company reports second quarter earnings. And we'll want to hear more about the regulatory side of things. It is interesting, though, that Coinbase, their financials are important as ever but it does seem like the legal clash right now is really defining how the stock performs."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtdG9sZC1jb2luYmFzZS1kZWxpc3QtYWxsLWNyeXB0b2N1cnJlbmNpZXMtYnV0LWJpdGNvaW4tYnJpYW4tYXJtc3Ryb25n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Coinbase denies SEC told it to delist everything but Bitcoin - Cointelegraph",
        "content": "Disclaimer: This article has been updated with comments from Coinbase denying the original Financial Times article.\n\nCoinbase has denied a report saying its CEO Brian Armstrong said it was once told by the United States securities regulator to delist all cryptocurrencies on its platform except for Bitcoin (BTC).\n\nIn a July 31 interview with the Financial Times, Armstrong reportedly claimed the Securities and Exchange Commission wanted Coinbase to delist the nearly 250 tokens on its platform prior to it filing a lawsuit against the exchange.\n\nArmstrong was quoted as saying the SEC believes “every asset other than Bitcoin is a security” and recounted an exchange with SEC staff where they said, “we’re not going to explain it to you; you need to delist every asset other than Bitcoin.”\n\nA Coinbase spokesperson told Cointelegraph, however, that the FT report omits context regarding its conversations with the SEC and was inaccurate.\n\nThe SEC didn't request Coinbase delist any specific assets as that type of request could only be made following a majority vote from the SEC's commissioners, the spokesperson said.\n\n\"The views shared in the FT article may have represented the views of some staff at the time, but did not represent those of the Commission more broadly,\" they added.\n\nThe SEC told the FT its enforcement division does not make formal requests for “companies to delist crypto assets” but that its staff may share its view on what actions could violate securities laws.\n\nSEC Chair Gary Gensler has previously claimed in a February New York Magazine interview that “everything other than Bitcoin” is a security under the agency’s remit.\n\nThere's nothing about the crypto securities markets that suggests that investors & issuers are less deserving of the protections of our securities laws.\n\n\n\nCongress could have said in the 1930s that the securities laws applied only to stocks & bonds.\n\n\n\nFor more, read my remarks: — Gary Gensler (@GaryGensler) June 12, 2023\n\nThe SEC sued Coinbase in early June, alleging it operated as an unregistered exchange and named 13 cryptocurrencies it said Coinbase offered as unregistered securities. Days earlier, the regulator filed a similar complaint against Binance.\n\nRelated: Pro-XRP lawyer claims SEC prioritizes corporate capitalism over investors\n\nCrypto industry oversight in the U.S. hasn’t landed on any one regulator, and the Commodity Futures Trading Commission and the SEC have both taken regulatory action against crypto industry players.\n\nLegislation that would mostly hand crypto jurisdiction to the CFTC and clarify the SEC’s crypto-related role passed the House Agricultural Committee on July 27 after its earlier passage through the House Financial Services Committee.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?\n\nUpdate (Aug. 1, 10:40 pm UTC): This article has been updated to include comments from Coinbase."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi0zLXN1cHBvcnRpbmctdGhlLWVuZXJneS1mdXR1cmUtb2YtdGhlLXBsYW5ldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin 3.0: Supporting the Energy Future of the Planet - Nasdaq",
        "content": "By Sanjay Gupta, Head of Strategy, Auradine Inc.\n\nBitcoin, the first blockchain network and most popular cryptocurrency, has come a long way since its inception in 2009. What started as a niche hobby for cyberpunks and speculators has grown into a global phenomenon with increasing adoption. In order to understand the future trajectory and impact of Bitcoin, it’s important to examine the historical evolution of Bitcoin— both the technology and asset class— its breakthroughs and shortcomings, and what is necessary to reach adoption on a global scale.\n\nIn this blog, we will explore the road to “Bitcoin 3.0”, what we consider to be the near future state of Bitcoin and its potential to support the energy future of the planet. When implemented and deployed responsibly, Bitcoin mining provides capabilities that can support base energy loads, provide stability to mismatched energy demand and supply characteristics, drive the growth of renewable infrastructure, and enable grid modernization. Breakthroughs in hardware and software optimization are the next step in enabling Bitcoin to scale sustainably and achieve optimal impact worldwide.\n\nSustainable and scalable evolution of Bitcoin 3.0\n\nSource: Auradine\n\nBitcoin 1.0: Early days – “The Hobbyist Era”\n\nBitcoin 1.0 refers to the early days of Bitcoin, when it was mainly used by hobbyists and speculators who were fascinated by the allure of Satoshi’s groundbreaking white paper, innovative technology, and its potential to create a decentralized, peer-to-peer, trustless form of money. Bitcoin 1.0 was characterized by trial adoption with primarily speculative use cases. At this time, while the blockchain technology that powered Bitcoin was beginning to be understood as a decentralized, trustless system, it was also exploited for illicit uses that took advantage of its anonymous and global reach as an exchange of value. Bitcoin 1.0 however laid the foundation for the subsequent crypto revolution and proved that it was possible to create a digital currency that operates without intermediaries and central authorities.\n\nBitcoin 2.0: Rapid mining growth “The Industrialized Mining Era”\n\nBitcoin 2.0 refers to the most recent phase of Bitcoin, where the days of mining in dorm rooms and basements were replaced by a rapid rise of industrial-scale miners and global hashing capacity being measured in Exahash/second (1018 hashes/second!). The Bitcoin security protocol uses a ‘proof of work’ (PoW) consensus mechanism and requires participants or ‘miners’ to validate transactions on the block approximately every 10 minutes. Successful miners earn Bitcoin block rewards in addition to any transaction fees.\n\nWhen Bitcoin mining is done at scale, the needed compute speed requires large numbers of specialized ASIC-based computers. These consume significant quantities of energy, which has been an ongoing focus of considerable analysis and debate.\n\nDuring this time, ideas around Bitcoin as a store of value and a legitimate asset gained increasing momentum. For example, Bitcoin was seen as a valuable means for transacting ‘crisis capital’ in situations of natural or man-made calamities, such as aid at the outset of the Ukraine war. Bitcoin is also experiencing increasing use as an exchange of value in payments for goods and services with initial merchant acceptance enablement.\n\nBitcoin 2.0 attracted the attention and participation of institutional investors, corporations, governments, and regulators, who saw its potential to transform the financial system.\n\nBitcoin 3.0: The Next Phase “Responsible Partner of the Energy and Financial Ecosystem”\n\nBitcoin 3.0 refers to the next evolution of Bitcoin, and, where used properly, can make Bitcoin a responsible partner of the energy and financial ecosystems.\n\nIn addition to the use cases of Bitcoin 2.0 as a store of value, the next era of Bitcoin is poised for increasing use as an exchange of value with widespread merchant acceptance. In the recent past, there has been a rise of NFT-like applications called ‘ordinals’ where data can be immutably etched onto a micro-building block of Bitcoin called a Satoshi (100 million Satoshis = 1 Bitcoin) and as a currency hedge in countries facing hyperinflation.\n\nHowever, Bitcoin 3.0’s most important use can be as a store for excess and wasted energy that can support the energy future of the planet. Using large quantities of computational power is necessary to support the security aspect of Bitcoin, something that makes it robust compared to other blockchains. But this computational power can be harnessed productively, as the extent of computational power consumed can be deployed to balance the energy grid using rapid demand response, drive sustainable investment in renewable energy and reduce carbon emissions by reducing gas flaring. This is a massive breakthrough. With systems purpose-built to support Bitcoin 3.0, Bitcoin can become a responsible partner to the energy ecosystem and a strong net positive contributor to the planet in the following ways:\n\nDemand response to balance the energy grid: bitcoin mining computations can be rapidly curtailed for energy demand response and grid balancing when needed. ERCOT, Texas electricity grid operator, estimated in a December 2022 report that bitcoin mining operations were able to curtail their operations and relieve roughly 1.7GW of energy during the Texas winter. On the other hand, in times of excess energy supply without corresponding demand, bitcoin mining can be a sink of energy, providing grid stability and economic value. This is especially useful for renewable energy sources like solar and wind which can have highly variable supply. With systems designed for rapid response, unlike most other industries, the bitcoin mining operations can curtail their energy consumption or increase usage in seconds based on the needs of the energy grid. Driving sustainable investment in renewable energy: Clean, renewable energy requires significant capital investment in large-scale projects. Without a clear return on investment, these projects have been limited to a few geographies only often supported by government subsidies. For instance, Africa owns 40% of the globe’s potential for solar power yet it only inhabits less than 2% of the total global capacity for electricity generation of solar energy (IRENA “Renewable Capacity Statistics”, 2021). Bitcoin mining is already being powered by solar and wind energy in different parts of the world. It provides an economically viable option to invest in solar and other renewable energy sources at an industrial scale with systems that are deployable in rugged conditions and remote locations. Reducing harmful gas flaring and using stranded energy: The Global Gas Flaring Research tracker (GGFR), a leading global and independent indicator of gas flaring, estimated that in 2022 gas flaring released 42 million tons in the form of methane. Methane, the primary component of natural gas, is a potent but short-lived greenhouse gas, with a warming potential much higher than carbon dioxide. Gas flaring is an extraordinary waste of economic value (as much as USD 55 billion per year at a price of USD 10 per MBtu) alongside its negative impacts on climate change and human health. Reducing flaring through Bitcoin mining reduces carbon emissions while capturing the economic value, without any additional energy consumption.\n\nBitcoin 3.0 is not a distant dream or a utopian vision for an idealistic technology. It is already happening in various forms across the world. For this to succeed further, Bitcoin mining silicon, software and system solutions need to be designed from the ground up for rapid energy demand response and be deployable in remote locations and harsh conditions at scale.\n\nAs Bitcoin 3.0 evolves, it will become more integrated and aligned with the energy and financial ecosystems, creating a more efficient, inclusive, and sustainable world.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMipwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzAyL2ZpcnN0LW1vdmVyLWFzaWEtYXNpYS1zdG9ja3Mtb3Blbi1zb2Z0LWJpdGNvaW4tanVtcHMtcGFzdC0zMGstb24tbWljcm9zdHJhdGVneS1maWxpbmctYW5kLWRlc3BpdGUtZml0Y2gtdHJlYXN1cnktZG93bmdyYWRlL9IBqwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzAyL2ZpcnN0LW1vdmVyLWFzaWEtYXNpYS1zdG9ja3Mtb3Blbi1zb2Z0LWJpdGNvaW4tanVtcHMtcGFzdC0zMGstb24tbWljcm9zdHJhdGVneS1maWxpbmctYW5kLWRlc3BpdGUtZml0Y2gtdHJlYXN1cnktZG93bmdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "First Mover Asia: Asia Stocks Open Soft, Bitcoin Jumps Past $30K on MicroStrategy Filing and Despite Fitch Treasury Downgrade - CoinDesk",
        "content": "Groth tied the trend reversal to an absence of the sort of catalysts that drove bitcoin's price dramatically higher in June, and Ripple's partial win last month in an ongoing court case with the Securities and Exchange Commission (SEC) that buoyed altcoin investors. The decision in U.S. federal court found that the sale of Ripple’s XRP tokens on exchanges and through algorithms did not constitute investment contracts and raised hopes that the SEC could not deem other tokens as securities."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZmFsbC1jdXJ2ZS1oYWNrL9IBN2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZmFsbC1jdXJ2ZS1oYWNrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether fall as market digests Curve hack - Forkast News",
        "content": "Bitcoin and Ether prices fell in early Tuesday afternoon trading in Asia, with Bitcoin losing support at US$29,000, amid concern about the hack of the popular decentralized finance platform Curve Finance over the weekend that saw an estimated US$41 million stolen and raised concerns about a DeFi contagion. The hack has been linked to a flaw in a programming language. These concerns increased as reports surfaced on Tuesday of an attack on the LeetSwap exchange running on Coinbase. Solana and Matic led the top 10 losers mid Tuesday. Litecoin also gave up gains ahead of its halving event on Wednesday.\n\nBitcoin, Ether hold steady\n\nBitcoin fell 1.8% in the last 24 hours to US$28,872 as of 12:50 p.m. in Hong Kong, according to data from CoinMarketCap.\n\nThe world’s largest cryptocurrency fell under the US$30,000 support floor in the latter weeks of July and has fluctuated around US$29,000 since then, unable to find buying support for a breakout in the so-called summer doldrums when trading in many capital markets slows.\n\nHowever, drama came over the weekend when decentralized stablecoin exchange Curve Finance reported a security issue in older versions of Vyper, the programming language used for smart contracts.\n\nAccording to data from smart contract auditing firm BlockSec, hackers drained an estimated US$41 million in cryptocurrencies from the platform as a result of the malfunction, raising concerns about possible problems at other DeFi platforms.\n\nCurve Finance is the third largest decentralized financial exchange (DEX) by 7-day trading volume, according to DeFi data tracker DefiLlama.\n\nBitcoin and Ether lost ground as CoinDesk reported that LeetSwap said its working with on-chain security experts to recover 340 Ether after PeckShield tweeted the exchange on Coinbase’s Layer 2 blockchain had been attacked.\n\nIn earlier comments related to the Curve hack, Justin d’Anethan at Hong Kong-based crypto market maker Keyrock said Bitcoin had held up well considering.\n\n“Indeed, after the Vyper hacks that affected a number of pools in Curve and pushed prices of CRV, CVX and FXS along with other yield protocols down, BTC and ETH held steady,” he said before reports of the LeetSwap exploit.\n\nLackluster trading and caution is seen elsewhere in crypto asset investment products, which saw minor outflows of US$21 million last week, 93% of which were from long-Bitcoin investment products, according to an emailed report from European alternative asset manager CoinShares.\n\n“This suggests investors have been taking profits in recent weeks, with the sentiment for the asset overall remaining supportive,” the CoinShares report said.\n\nNigel Green, the CEO and founder of the deVere investment advisory group, said summer typically ushers in reduced market activity, which in turn can create price inefficiencies and increased volatility.\n\n“When used effectively and efficiently, volatility can be an extremely powerful investment tool as you can enhance your portfolios with high quality assets at lower entry points,” Green said in email comments.\n\n“Not only does Bitcoin remain one of the best performing asset classes of the decade, I believe its performance will further strengthen. Both institutional and retail investors are increasingly seeing the value of a digital, global, borderless and tamper-proof currency and store of value.\n\n“This trend will increase as adoption picks up further and as confidence grows again in the global economy.”\n\nEther, the second largest crypto token by market cap, fell 2.10% to US$1,825 early Tuesday afternoon after trading flat in the morning.\n\nAll other top 10 non-stablecoin cryptocurrencies fell Tuesday morning. Solana led the losers, dipping 4.6% to US$23.31, while Matic was close behind with a drop of 4.1% to US$0.67.\n\nLitecoin fell 3.5% to US$89.83, barely holding a gain of 1% for the last week ahead of its halving event on Wednesday.\n\nThe halving is expected to cut the mining reward for each successfully minted Litecoin block from 12.50 LTC to 6.25 LTC, increasing its scarcity and potentially triggering a rise in the token’s price. Litecoin is up about 31% year to date.\n\nThe total crypto market capitalization fell 1.8% in the past 24 hours to US$1.16 trillion, while trading volume rose 17.6% to US$30.83 billion.\n\nNFT 500 ends July in red\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe Forkast 500 NFT index fell 1.19% in the past 24 hours to 2,516.20 as of 7:45 a.m. in Hong Kong, resulting in a drop of 5.37% for the week and 10.70% for the month.\n\nForkast’s Ethereum, Solana and Cardano NFT market indexes all logged losses, while the index measuring the performance of Polygon’s NFT market edged up a slight 0.18%.\n\nTotal NFT trading volume fell 2.93% in the past 24 hours to US$17.65 million, according to data from CryptoSlam. Volume on Ethereum, the largest NFT network, declined 10.17% to US$11.68 million.\n\nTrading volumes on Polygon jumped 87.67% to US$1.14 million to take second spot in Cryptoslam’s rankings. Solana and BNB networks also saw increases in NFT volumes.\n\nNFT trading volume on the Bitcoin network dropped 20.08% to US$479,775. “An ecosystem that many, myself included, had predicted to one day flip Ethereum is showing its limitations,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\n“With no avenues right now for utility, traders are finding few reasons to collect these assets that promise nothing more than small jpegs to collect. We’ll need to see some innovation or more premium art on Bitcoin if we want to see its ecosystem turn around.”\n\nBy NFT collections, Ethereum-based Bored Ape Yacht Club (BAYC) saw the largest 24-hour trading volume, gaining 26.26% to US$1.12 million. DMarket and Gods Unchained Cards, which are both in-game NFT items, ranked second and third.\n\nU.S. equities finish July strong\n\nImage: Getty Images\n\nU.S. stock futures gained as of 10:50 a.m. in Hong Kong, after the three major U.S. stock indexes ended July with strong gains of between 3% to 4%.\n\nIn Asia, the main stock indexes rose on Tuesday morning, with the exception of China’s Shanghai Composite after manufacturing data missed expectations. Private research firm Caixin Insight Group’s China General Manufacturing PMI for July released Tuesday dropped for the first time since April, missing market estimates and hitting its lowest point in six months.\n\n“China’s economic recovery in the first quarter exceeded expectations, but the momentum weakened in the second,” wrote Wang Zhe, senior economist at Caixin. “Although the data for industrial production and investment in June showed some signs of recovery, macroeconomic growth remained sluggish, and considerable downward pressure on the economy persisted.”\n\nZhe added: “guaranteeing employment, stabilizing expectations and increasing household income” should remain the top priorities of Chinese policymakers.\n\nJapan’s Nikkei 225 gained as the country’s unemployment rate edged lower in June as forecasted, marking the country’s lowest jobless rate since January.\n\nIn the U.S., second quarter earnings season continues with reports from Apple, Amazon, Pfizer and others through the week, plus more economic indicators. The S&P Global’s U.S. manufacturing purchasing manager’s index (PMI) will be out Tuesday and the July employment report on Friday.\n\nOn interest rates, the Federal Reserve next meets on Sept. 19 and 20 after raising a quarter of a point in July. Rates are now between 5.25% to 5.50%, the highest since January 2001.\n\nFed Chair Jerome Powell last week reiterated the bank takes a data-driven approach to decide interest rate policy and Fed economists said the likelihood of a recession in the U.S. has diminished, indicating to some analysts the Fed may leave rates unchanged next month.\n\nThe CME FedWatch Tool predicts a 82.5% chance the Fed will keep rates as is in September, and a 17.5% chance for another 25-basis-point increase.\n\n(Updates with equity section)"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1jcnlwdG8tdG9rZW4tc2VjLWNvaW5iYXNlLWRlbGlzdC1nYXJ5LWdlbnNsZXItYnJpYW4tYXJtc3Ryb25nLTIwMjMtN9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Was the One Crypto Token the SEC Asked Coinbase Not to Delist - Markets Insider",
        "content": "The Securities and Exchange Commission asked Coinbase to delist over 200 crypto assets, CEO Brian Armstrong said.\n\nHe told the Financial Times that the only token that wasn't targeted was bitcoin.\n\nArmstrong said that complying would spell the end of the crypto industry in the US.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBefore the US Securities and Exchange Commission took Coinbase to court, the regulator asked the crypto-exchange platform to delist all tokens but bitcoin, CEO Brian Armstrong disclosed to the Financial Times.\n\nIf Coinbase followed through, the recommendation would have halted the trading of over 200 crypto assets. The SEC argued that, aside from bitcoin, each of the cryptocurrencies was an unregistered security.\n\n\"We said, well how are you coming to that conclusion, because that's not our interpretation of the law,\" Armstrong told the FT. \"And they said, we're not going to explain it to you, you need to delist every asset other than bitcoin.\"\n\nAccording to him, delisting virtually all its tokens would have led to the end of the US crypto industry, making the choice of what to do easy, he said: \"Let's go to court and find out what the court says.\"\n\nAdvertisement\n\nWith Coinbase's failure to comply, the SEC sued the platform in early June, accusing it of not registering as an exchange and listing 13 traded cryptocurrencies the regulator deemed as unregistered securities.\n\nA day prior, it also sued crypto competitor Binance, also citing the unauthorized sale of securities.\n\n\"SEC staff does not ask companies to delist crypto assets,\" a spokesperson told Insider. \"In the course of an investigation, the staff may share its own view as to what conduct may raise questions for the Commission under the securities laws.\"\n\nA Coinbase spokesperson said the SEC didn't request that Coinbase delist specific assets, adding that such a request requires a majority vote from the commissioners.\n\nAdvertisement\n\n\"Per the SEC's own assertion, the views shared in the FT article may have represented the views of some staff at the time, but did not represent those of the Commission more broadly,\" the spokesperson said. \"We continue our discussions with the Commission, but believe that transparent and fair rulemaking and Congressional action, such as bills that we saw gain bipartisan support in the US House of Representatives last week, represent the best path forward for American crypto users and the companies building the cryptoeconomy in the US.\"\n\nSEC Chairman Gary Gensler has warned recently that the crypto world is full of \"fraud\" and \"hucksters.\" Speaking with Bloomberg TV last week, he said that \"investors should be aware that it's not only a highly speculative asset class, it's also one that they currently should not assume that they're getting the protections of the securities laws – even though those securities laws apply to many of those tokens.\"\n\nBut in mid-July, the ongoing debate about the nature of crypto assets took a turn against the regulator, when the SEC lost its lawsuit against Ripple's XRP token. Having sued the company in 2020 for failing to register the currency, a US judge said XRP is not a security when sold to the general public but is a security when sold to institutional investors.\n\nAfterwards, shares in XRP skyrocketed 61%, while Coinbase stock rose over 10%."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWludmVzdG9yLXNlbnRpbWVudC1zbHVtcHMtdG8tYS1uZXctbG93LWV2ZW4tYXMtbWFjcm8tYW5kLWVxdWl0aWVzLXNob3ctaW1wcm92ZW1lbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin investor sentiment slumps to a new low, even as macro and equities show improvement - Cointelegraph",
        "content": "Bitcoin surpassed the $30,000 resistance on June 21, or 40 days ago, after a notable 19.5% gain in a week. Since then, it has been moving within a range filled with occasional moderate corrections, and as of Aug. 1, the Bitcoin (BTC) price was trading near $29,300. While these consolidation periods are common in traditional markets, they tend to make crypto investors quite anxious.\n\nAs Bitcoin’s price repeatedly fails to break the $31,000 level, traders are becoming increasingly tense and their sentiment is worsening. This trend could reverse suddenly, regardless of any relevant news or macroeconomic factors that might support an upward move, and crypto traders' emotions can magnify positive and negative price swings, leading to euphoric and fear-led price action.\n\nBitcoin’s low volatility sessions have traders worried\n\nThe increased anxiety among traders is partly due to Bitcoin’s historical volatility, which used to be much higher than its current levels. Presently, the 33% annualized 50-day volatility is the lowest in six months, contrasting sharply with the 60% or higher volatility observed for 245 days throughout 2022. Despite the rationale for this shift, the recent period has been relatively calm for Bitcoin’s price.\n\nTo put it in perspective, consider that auto and electric battery producer Tesla, a top 10 global asset and part of the S&P 500 index, currently experiences a 58% annualized volatility. In comparison, graphics chipmaker Nvidia has consistently demonstrated a 70% or higher volatility for most of 2021.\n\nWhile some analysts use volatility data to predict trends, it’s essential to note that this indicator relies on absolute price changes, yielding the same outcome for both upward and downward price swings. Therefore, volatility only provides information about the magnitude of daily oscillations.\n\nHowever, apart from price changes, there are other metrics that can indicate investors’ excitement or lack of interest in an asset, such as evaluating its market share or market dominance.\n\nBitcoin dominance shows declining interest relative to altcoins\n\nOn July 30, Bitcoin’s market share of total crypto capitalization dropped to 49.5%, the lowest figure since June 16.\n\nBitcoin (BTC) dominance, percentage terms. Source: TradingView\n\nThis decline can be partially attributed to a favorable legal decision for Ripple Labs on July 13, which reduced regulatory risks for altcoins. Industry representatives believe this decision will benefit crypto exchanges Coinbase and Binance in their lawsuits with the Securities and Exchange Commission. The diminishing dominance of Bitcoin marks a trend shift from the gains observed between December 2022 and June 2023, when it increased from 40.2% to 52%.\n\nLackluster network activity is another sign of negative investor sentiment\n\nBitcoin's one-year active supply, representing the sum of unique BTC transacted in the trailing 12 months, reached its lowest level since February 2016 at 6.0 million BTC as of July 26. This data, compared with the 6.2 million BTC activity three months prior, raises concerns, especially with the potential approval of spot exchange-traded funds in the United States.\n\nBitcoin 1-year active supply. Source: Coin Metrics\n\nThe decreasing number of Bitcoin moved on-chain might have been offset by the increased use of the Lightning Network as an alternative solution. However, this layer 2 solution currently holds a mere $138 million in total value locked and shows a nearly unmoving 16,382 nodes in the past 30 days.\n\nRelated: US banking advocacy group supports Sen. Warren’s reintroduced crypto bill\n\nBitcoin options traders are losing confidence\n\nThe main “fear and greed” metric for Bitcoin options, the 25% delta skew, indicates that bulls are becoming less confident over time. Readings above 7% suggest traders anticipate a drop in Bitcoin’s price, while periods of excitement typically yield a -7% skew.\n\nBitcoin 30-day options 25% delta skew. Source: Laevitas\n\nCurrently, the 30-day metric remains flat at 1%, indicating a balanced demand between call (buy) options and protective puts, signaling a neutral market. However, it does show a decreased appetite among bulls compared to the 2% to 14% discount on neutral-to-bearish put (sell) options between June 19 and July 29. This derivatives data strongly supports the notion that traders have become less confident since the $29,500 support level broke.\n\nAs investors’ mood worsens and indicators point to increased tension, the Bitcoin price faces mounting pressure in the near term. Falling dominance, lackluster network activity and concerns in the options markets all contribute to the potential negative impact on the Bitcoin price. On a positive note, if traders remain cautious and anticipate further downward movement, the likelihood of excessive liquidations among leverage traders is reduced.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9iYXJiaWUtc3Rhci1tYXJnb3Qtcm9iYmllLW1ha2VzLWludHJpZ3VpbmctY29tcGFyaXNvbi13aXRoLWJpdGNvaW4tdG8ta2VuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "'Barbie' Star Margot Robbie Makes Intriguing Comparison with Bitcoin to Ken - CCN.com",
        "content": "Key Takeaways\n\nMargot Robbie, the actress in the film Barbie, stated Bitcoin emits “the energy of Ken”\n\nThe whole cryptocurrency community, from influencers to psychologists, weighed in on the actress’ interview\n\nMicrostrategy CEO Michael Saylor and social media personality Layah Heilpern responded differently to Robbie’s assertion that Bitcoin emits “Ken vibes”\n\nAfter making statements on Bitcoin, Australian actress Margot Robbie, aka the Barbie actress, aroused curiosity. Robbie compared the virtual money to Ken, Barbie’s enduring fictional character and well-known sidekick.\n\nRobbie stated that she overheard her husband, Tom Ackerley, and TV producer David Heyman discussing Bitcoin while they were on the set. Ken, Ryan Gosling’s fictitious co-star character in the film Barbie reminded her of these discussions.\n\nIn Robbie’s opinion, the discussions on Bitcoin seemed to reflect Ken’s persona, leading her and her colleague Gretta to refer to them as “being such Kens.”\n\nMichael Saylor, the CEO of MicroStrategy, shared the video on X on Sunday and claimed that “Bitcoin is Big Ken Energy.”\n\nCCN reached out to Michael Saylor for commentary but did not receive a reply at the time of publishing.\n\nWhat’s a Ken Energy?\n\nRyan Gosling retreated when asked about the idea of “Ken Energy” in a Yahoo Entertainment interview. He instead looked to Robbie for help in defining the phrase.\n\nMeanwhile, Robbie explained the concept of “Ken Energy” and admitted how difficult it was to express. She clarified that it’s sort of a play on the abbreviation BDE, in which B is not for Bitcoin but it stands for “big d**k energy.”\n\nCrypto Twitter Community Reacts\n\nWhen Margot Robbie said you’re a Ken if talk #bitcoin She meant you’re weak and pathetic. This was not a good thing 🤣 — Layah Heilpern (@LayahHeilpern) July 29, 2023\n\nTo understand the context of Robbie’s statement, one must be aware of the importance of Barbie and Ken in popular culture. Barbie, a doll made by Mattel, has stood for centuries as a symbol of style and elegance. Barbie frequently depicts Ken, her fictitious companion, as a helpful and fashionable partner.\n\nLea Thompson, a crypto influencer best known by her Twitter handle Girl Gone Crypto and her 225,000 followers, declared that after hearing Robbie discuss Bitcoin, she is “so bullish.”\n\nBitcoiners last week: yah haven't seen the Barbie movie, whatever, looks dumb Bitcoiners today: MARGOT ROBBIE SAID THAT BITCOIN IS BIG KEN ENERGY, SO BULLISH — Girl Gone Crypto (@girlgone_crypto) July 29, 2023\n\nLayah Heilpern, on the other hand, apparently took Robbie’s comments in a different light and saw it as an insult to guys who discuss Bitcoin.\n\nOn July 30, Heilpern informed her 621,400 Twitter followers of Robbie’s suggested characterization of male Bitcoin aficionados as “weak and pathetic.”\n\nWhen Margot Robbie said you’re a Ken if talk #bitcoin She meant you’re weak and pathetic. This was not a good thing 🤣 — Layah Heilpern (@LayahHeilpern) July 29, 2023\n\nAccording to Mark Travers, chief psychologist at Awake Therapy, Ken’s energy could indicate someone who is selfless and versatile.\n\nTravers claimed that Ken breaks conventional gender norms in a Forbes article on July 13.\n\nTravers said, “In a world where Barbie rules, Ken has only a supportive function to perform, and he plays it willingly.\n\n“Barbie is and comes before everything, we see male counterpart Ken relegated to the uni-dimensional and purely aesthetic role that women have often been confined to in the past, in a flippant and parody-like manner,” he said.\n\nSteven Lubka, managing director at Swan Bitcoin, saw Robbie’s remark as a plus for the Barbie and crypto Twitter community with excitement.\n\nOn July 29, Lubka tweeted to his 20,200 followers, “We are so back.”\n\nDid we just get mainstream? — Yugocana (@yugocana) July 29, 2023\n\nOngoing Legal Actions Against Crypto-Endorsing Celebs\n\nRobbie’s remarks on Bitcoin were succinct and un-instigating, coming amid continuous legal efforts against public figures who have recently endorsed cryptocurrency.\n\nMost recently, NBA Miami Heat star Jimmy Butler asked to be dropped from a $1 billion class-action lawsuit alleging cryptocurrency exchange Binance promoted unregistered securities.\n\nButler’s attorneys said in a filing dated July 24 that the tweets that Butler was mentioned did not promote the cited securities and, as a result, could not have assisted in their promotion.\n\nSimilar accusations are disputed in the same lawsuit by YouTube stars Ben Armstrong (BitBoy Crypto), Graham Stephan, and Binance CEO Changpeng “CZ” Zhao."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzMxL3RldGhlci1yZXBvcnRzLTMzYi1pbi1leGNlc3MtcmVzZXJ2ZXMtaW4tcTItdXAtODUwbS1mb3ItdGhlLXF1YXJ0ZXIv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDcvMzEvdGV0aGVyLXJlcG9ydHMtMzNiLWluLWV4Y2Vzcy1yZXNlcnZlcy1pbi1xMi11cC04NTBtLWZvci10aGUtcXVhcnRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Tether Reports $3.3B in Excess Reserves in Q2, Up $850M for the Quarter - CoinDesk",
        "content": "Issuing fiat-backed dollar-pegged stablecoins is a lucrative business due to rising U.S. government bond yields, the primary reserve asset for USDT. Tether's reported profits are close those of asset management giant BlackRock – with more than $9 trillion in assets under management (AUM) – which booked operating income of just over $1.6 billion in Q2."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tdHJhZGVyLXdlaWdocy1pbi1vbi1wb3NzaWJsZS1iaXRjb2luLWV4dGluY3Rpb24tc2NlbmFyaW9z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Crypto trader weighs in on possible Bitcoin extinction scenarios - Cointelegraph",
        "content": "Episode 11 of Cointelegraph’s Crypto Trading Secrets podcast is now live, welcoming crypto trader Mohit Sorout for an interview that took place on July 21. Host Benjamin Pirus asked Sorout several questions, including one regarding Bitcoin’s (BTC) future and what scenario, if any, could lead to its extinction. Sorout suggested two different possibilities.\n\nAccording to the trader, “If somebody figured out a way to crack seed phrases, if they built a supercomputer,” it could potentially lead to vulnerabilities in Bitcoin. “There have been some rumors in the past. People say, ‘Oh, and they could build such a supercomputer that calculates at X amount of speed, then you could crack a seed phrase within a shorter period of time.’”\n\nTechnology has surged forward in recent years. The prevalence of artificial intelligence has become a talking point as people have begun using OpenAI’s chatbot ChatGPT in various ways. Logically, such waves of technological advancement may pose questions about the disruption of the current technological ecosystem. Bitcoin is not immune from that discussion.\n\n“That, or if people figured out a way to attack the chain itself — gain control of the hash power,” he added, continuing from his initial point on supercomputers. “So, that is also one big worry,” he noted. “Neither of those things I think are going to happen, but yeah, those two factors are quite pivotal.”\n\nSorout was adamant that such scenarios are not likely. “The more time Bitcoin spends being alive, the more chances of its survival increase,” he noted, mentioning and referring to the Lindy effect.\n\nThe interview with Sorout also included an array of other talking points, including the trader’s background.\n\nCheck out this and other episodes from Cointelegraph’s Crypto Trading Secrets podcast on Cointelegraph’s podcast page, Apple Podcasts, Spotify, Google Podcasts or TuneIn.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItc2xpcC10b3AtMTAtY3J5cHRvcy1mYWxsLWxlZC10cm9uL9IBSWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItc2xpcC10b3AtMTAtY3J5cHRvcy1mYWxsLWxlZC10cm9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether slip, top 10 cryptos fall led by Tron - Forkast News",
        "content": "Bitcoin and Ether slipped during Monday afternoon trading in Hong Kong along with all other top 10 non-stablecoin cryptocurrencies by market capitalization, except the BNB token, with crypto markets poised for an uneventful month ahead, industry experts told Forkast.\n\nSee related article: Weekly Market Wrap: Bitcoin falls below key US$30,000 support level, as market optimism over ETFs ebbs\n\nBitcoin, Ether remain under key levels, top 10 cryptos fall, Tron leads declines\n\nBitcoin was little changed during afternoon trading in Asia, trading at US$29,363 as of 5:15 p.m. in Hong Kong. The world’s largest cryptocurrency has been trading below US$30,000 since last Monday.\n\nEther slipped 0.21% during afternoon trading in Asia to US$1,866.\n\n“The market is in a consolidation phase at the moment, so I’m not expecting anything massive,” Lachlan Feeney, founder and chief executive officer of blockchain development firm labrys, told Forkast.\n\n“I’m expecting maybe a little bit of a boring market overview. The boring markets price-wise are often the most exciting phase of the market development and technology-wise.”\n\nTron’s TRX token was the day’s biggest loser, falling 4.52% to US$0.07848, followed by Polygon’s Matic token, down 1.41% to US$0.7021.\n\nDespite the price drop, average daily transactions on the Tron network exceeded 9 million in the second quarter of 2023. That daily volume has contributed to an annual rise of 91.24%, according to a report released by Coin98 Analytics on July 19.\n\nThe total crypto market capitalization over the past 24 hours rose 0.08% to US$1.19 trillion while market volume increased 53.92% to US$27.43 billion, according to CoinMarketCap data.\n\nForkast 500 NFT index refreshes all-time low, Bitcoin NFT sales start recovery, Ethereum NFT sales extend declines\n\nThe Forkast 500 NFT index fell 0.86% to 2,551.57 points in the 24 hours to 4:30 p.m. in Hong Kong and fell 4.46% during the week. The index declined to an all-time low of 2,550.09 points earlier today.\n\nBitcoin’s 24-hour non-fungible token sales continued to decline, falling 19.53% to US$537,410 with the network slipping to the seventh largest blockchain by 24-hour NFT sales volume, according to CryptoSlam.\n\nEthereum’s 24-hour NFT sales also continued last week’s decline, falling 13.03% to US$11 million, despite sales for the largest Ethereum-native NFT collection, the Bored Ape Yacht Club, rising 23.63% to over US$1 million. CryptoPunks sales also rose 45.60% to US$139,600.\n\nIn the wider NFT space, Reddit launched its Gen 4 NFT avatar series called Retro Reimagined, with NFTs included from collections like Cool Cats PFP and Micah Johnson’s Aku NFTs.\n\n“Reddit Avatars are quietly drawing in millions of NFT holders and will continue to be a pivotal method of onboarding the masses to Web3,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\nAll Forkast Labs NFT indexes were in the red for the day.\n\nAsian equities, most U.S. stock futures rise, Europe’s DAX 40 hits all-time high as inflation slows\n\nImage: elements.envato\n\nMajor Asian equities strengthened as of 5:15 p.m. in Hong Kong, boosted by a strong session on Wall Street. Japan’s Nikkei 225 Hong Kong’s Hang Seng Index, the Shenzhen Component and the Shanghai Composite all posted gains.\n\nU.S. stock futures strengthened during Monday afternoon trading in Hong Kong, except the tech-heavy Nasdaq-100 futures. The Dow Jones Industrial Average futures and the S&P 500 futures index both increased.\n\nInvestors remained optimistic after Fed Chair Jerome Powell last week hinted at an end to the interest rate hiking cycle after the Fed’s most recent 25-basis-points increase. The Fed’s next meeting on monetary policy is scheduled for September 19-20, where it will decide its next steps on rates, which are now between 5.25% to 5.5%, the highest level since January 2001. The CME FedWatch Tool predicts a 80.5% chance the Fed will keep rates unchanged in September, and a 19.5% chance for another 25-basis-point increase.\n\nThis week in the U.S. includes second-quarter earnings from tech heavyweights such as Amazon and Apple. The S&P Global’s U.S. manufacturing purchasing manager’s index (PMI) is out Tuesday and the July employment report on Friday, with all offering more peeks into the health of the economy.\n\nIn Europe, Frankfurt’s benchmark DAX 40 hit a new all-time high of 16,540 points, while the pan-European STOXX 600 also remained near its highest since February 2022. Investor morale received a boost as inflationary pressures slowed, with headline Eurozone inflation falling to 5.3%, the lowest since January 2022. But core inflation remained at 5.5%, well above the European Central Bank’s target of 2%.\n\nSee related article: Standard Chartered’s great expectations for Bitcoin in 2024\n\nUpdates with equities section"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luYmFzZS1jZW8tc2F5cy1zZWMtd2FudGVkLTEwMDc0NjgwMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Coinbase CEO Says SEC Wanted All Assets Except Bitcoin Delisted: Report - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) reportedly requested Coinbase to stop trading in all cryptocurrencies except Bitcoin (BTC) before suing America’s largest crypto exchange last month, according to a report by the Financial Times citing CEO Brian Armstrong.\n\n“They came back to us, and they said [. . .] we believe every asset other than bitcoin is a security,” said Coinbase CEO. “And, we said, well how are you coming to that conclusion, because that’s not our interpretation of the law. And they said, we’re not going to explain it to you, you need to delist every asset other than Bitcoin.”\n\nA Coinbase spokesperson told Decrypt that the interview \"omitted critical context regarding [Coinbase's] conversations with the SEC in the US,\" adding that \"per the SEC’s own admission, the views shared in the FT article may have represented the views of some staff at the time, but did not represent those of the Commission more broadly.\"\n\nThe SEC didn't immediately respond to Decrypt’s requests for comment.\n\nIn a June lawsuit, the SEC accused Coinbase of operating illegally because it failed to register as an exchange. The regulator also alleged the exchange’s staking service offered at least 13 crypto assets that should have been registered as securities, including tokens such as Solana (SOL), Cardano (ADA), Polygon (MATIC), and The Sandbox (SAND).\n\nIn a separate move, the SEC also sued Binance in June for offering unregistered securities and allowing U.S. investors to access its global website Binance.com. The Wall Street regulator also alleged that Binance CEO Changpeng Zhao and the crypto exchange misused and commingled customers' funds.\n\nAccording to Armstrong, had Coinbase agreed to the request, it would have set a precedent and may have led to the regulator cracking down on the majority of American crypto businesses operating under similar conditions.\n\n“We really didn’t have a choice at that point, delisting every asset other than Bitcoin, which by the way is not what the law says, would have essentially meant the end of the crypto industry in the US,” said Armstrong. “It kind of made it an easy choice [. . .] let’s go to court and find out what the court says.”\n\nStory continues\n\nThe regulator reportedly said its enforcement division did not make formal requests for “companies to delist crypto assets.”\n\nThe Coinbase representative added that the crypto exchange is still in discussions with the SEC and believes \"that transparent and fair rulemaking and Congressional action, such as bills that we saw gain bipartisan support in the U.S. House of Representatives last week, represent the best path forward for American crypto users and the companies building the cryptoeconomy in the U.S.”\n\nGensler on Bitcoin\n\nSEC Chair Gary Gensler has previously suggested that all cryptocurrencies aside from Bitcoin are securities.\n\nHe’s also often been citing the lack of investor protection as a reason for enforcement actions against crypto companies, comparing the sector to “the Wild West.”\n\nSEC Chair Gensler Again Says Bitcoin Is Not a Security. What About Ethereum?\n\nIn the June lawsuit against Coinbase, the SEC, however, didn’t mention Ethereum (ETH), the world’s second-largest cryptocurrency by market cap, among those tokens it asserted to be securities.\n\nOn June 28, the San Francisco-based company filed a motion to dismiss the SEC’s lawsuit, arguing that the agency does not have statutory authority over the exchange and that its position regarding its powers is “untenable as a matter of law.”\n\nEditor's note: This article was updated on July 31, 2023 at 6 am Eastern Standard Time to include comment from Coinbase."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTAxL21pY3Jvc3RyYXRlZ3ktcmV0dXJucy10by1wcm9maXRhYmlsaXR5LXdpdGgtcmVib3VuZC1pbi1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "MicroStrategy (MSTR) Returns to Profitability With Bitcoin (BTC) Rebound - Bloomberg",
        "content": "MicroStrategy Inc., the enterprise-software maker that is the largest publicly-traded holder of Bitcoin, returned to profitability in the second quarter after having to take a large writedown a year earlier because of a plunge in the value of the cryptocurrency.\n\nThe Tysons Corner, Virginia-based company had net income of $22.2 million, or $1.54 a share, compared with a loss of more than $1 billion, or $94 a share, in the year-ago period."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmtldmlubWQuY29tLzIwMjMvMDcvYml0Y29pbi1pbnZlc3RtZW50LWZvci1kb2N0b3JzLXJpc2tzLXJld2FyZHMtYW5kLXRoZS1uZWNlc3NpdHktb2YtZGl2ZXJzaWZpY2F0aW9uLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin investment for doctors: risks, rewards, and the necessity of diversification - Kevin MD",
        "content": "8 Shares Share\n\nAs the world becomes increasingly digitized and economic realities continually shift, there has been a growing conversation among medical professionals regarding investing, particularly in digital assets like Bitcoin. The appeal of Bitcoin is substantial, especially in an era marked by high inflation rates. Bitcoin is the first “programmed” money that relies on math and code. It has an open public and simple code and has never been hacked. This is because it lives simultaneously on millions of computers at the same time. To hack it, one would need all the computing power in the world. Traditional finance players such as BlackRock (575-1 for ETF approval record) and Fidelity have recently applied for ETFs, and institutional money is poised to rush into the digital asset sector, which should have a positive impact on the Bitcoin price. There are trillions of dollars in pension funds and mutual funds, and now they will have the regulatory approval to finally dip their toes in the water on Bitcoin and other digital assets. This is all happening at a time when the number of Bitcoins made per day gets cut in half! This piece aims to shed light on the potential risks and benefits of Bitcoin investment for physicians and to highlight its necessary place in any robust portfolio. First, let’s discuss the upcoming Bitcoin halving event, due to occur in 10 months, and what this signifies for investors.\n\nThe essence of the Bitcoin halving event is to reduce the number of new Bitcoins generated and awarded to miners. Approximately every four years, the reward for mining Bitcoin is halved, which inevitably creates a scarcity of new coins entering circulation. Today, 900 bitcoins are created daily; however, after the next halving event, only 450 will be mined per day. This reduction could potentially increase the value of Bitcoin due to its decreased supply and increased demand. Looking at the long-term Bitcoin chart, we can see the cyclical nature of this “supply-shock” programmed halving event.\n\nHowever, Bitcoin is historically volatile, and its value can fluctuate rapidly. This volatility, although daunting, does not negate Bitcoin’s potential as a robust hedge against inflation and as an appreciating asset. Physicians, who generally have a stable income, might benefit from the addition of Bitcoin to their investment portfolios, as its potential for high returns could offer a useful counterbalance to more traditional, lower-yield investments.\n\nInvesting in Bitcoin also presents an opportunity to participate in the new economic realities that cryptocurrencies are shaping. While these digital assets can be risky, they offer an exciting frontier for those willing to navigate their sometimes turbulent waters. As we approach the end of a bear market and gear up for the next four-year cycle, the stage is set for those with the foresight and courage to seize this opportunity.\n\nMy personal strategy has been to allocate a small (roughly 5 percent) portion of my portfolio to digital assets. This allocation should not dominate your portfolio but instead supplement more traditional investments. Ninety percent of my digital asset allocation is in Bitcoin, and I auto-dollar cost average (“DCA”) every day with the River financial app. I recommend leveraging Bitcoin’s position as the primary and most well-known cryptocurrency. The remaining 10 percent is allocated to more speculative projects such as Verasity (VRA), Blockchain Bets (BCB), Blocksquare Token (BST), TriasLab (TRIAS), and Realio Network (RIO), amongst many others. While these assets carry a higher risk due to their speculative nature, they also provide “lotto ticket” potential for high returns. These “asymmetric bets” should be expected to go to zero, but it’s worth reading up on them to learn more about the space, and I have experienced a small bet that went over 100x, and it’s a thrilling feeling for sure if it happens!\n\nSelf-custody is a critical factor to consider when investing in digital assets. Storing your own cryptocurrencies gives you total control over your assets. For Bitcoin, I recommend the Muun and Green wallets, which have excellent security features and user-friendly interfaces. For altcoins, consider using MetaMask, Uniswap, and download the rapidly growing ethos.io app for news and other market tools.\n\nAs with all investments, it is crucial to do your own research, understand the risks involved, and perhaps seek advice from a digital asset-specific financial advisor. Remember, Bitcoin investment, like any investment, should be approached responsibly and as part of a diversified strategy. Debt is growing faster than ever, and because of this fact, it is more important to be diversified into non-dollar-denominated assets as well. Bitcoin can act as a hedge against future inflation spikes.\n\nIn conclusion, while Bitcoin and other digital currencies carry a certain degree of risk, they offer exciting possibilities for high returns and should be considered a necessary addition to any physician’s investment portfolio. As we stand on the brink of a new Bitcoin cycle and the halving event, it’s a thrilling time to explore the world of digital asset investing. Here’s to harnessing the potentials of this nascent digital asset class and shaping our financial futures with savvy and strategic investment choices. Good luck to us all, and let’s look forward to the upcoming cycle with optimism and excitement!\n\nNoah Kaufman is an emergency physician and financial planner."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzMxL2JhcmJpZXMtbWFyZ290LXJvYmJpZS1oYXMtYS10YWtlLW9uLWJpdGNvaW4tc2F5cy1pdHMtYS1rZW4tdGhpbmcv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDcvMzEvYmFyYmllcy1tYXJnb3Qtcm9iYmllLWhhcy1hLXRha2Utb24tYml0Y29pbi1zYXlzLWl0cy1hLWtlbi10aGluZy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Barbie's Margot Robbie Has a Take on Bitcoin, Says It's a Ken Thing - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXZvbHVtZS1sb3dlc3QtZWFybHktMjAyMS0yNWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin volume hits lowest since early 2021 amid fear $25K may return - Cointelegraph",
        "content": "Bitcoin (BTC) stayed static at the July 31 Wall Street open as analysis warned that the net was closing in for bulls.\n\nBTC/USD 1-hour chart. Source: TradingView\n\n$28,300 the “last line of defense” for BTC price\n\nData from Cointelegraph Markets Pro and TradingView followed BTC price as it greeted the last trading day of July with more sideways behavior.\n\nMuch like the weekend and the week prior, nothing seemed able to effect a major trend change, while a brief spurt above $29,500 after the weekly close provided the most interesting intraday event.\n\n“BTC took out $29.5k last night, but so far bulls haven’t been able to muster enough momentum to advance. All eyes are on the monthly close which could open the door to some volatility,” monitoring resource Material Indicators wrote in part of its latest analysis.\n\nUploading a snapshot of the BTC/USD order book on Binance, Material Indicators warned that $29,500 was becoming an increasingly popular trigger for sellers and that bulls needed to overcome it next.\n\nNearby, the 50-day and 100-day moving averages (MAs) — at $29,450 and $28,460, respectively — formed key trend lines to the upside and downside.\n\nBTC/USD 1-day chart with 50, 100MA. Source: TradingView\n\n“I’ve been saying for months that the market needs to print candles above the 100-Week MA for us to even consider a bull market breakout. We’ve yet to even test it, but bulls have managed to maintain the range for an extended period of time,” Material Indicators continued.\n\n“Today is actually the 8th consecutive day of testing support at the 50-Day MA, and even though the 50-Day has held, resistance at $29.5k is replenishing. If bulls can’t clear it, I expect a run at the lows with $28.3k as the last line of defense. The question for me is whether bitcoin will bounce from the $28s or extend to $25k and beyond. All of these moves are possible, the mystery is in what order and in what timeline they play out.”\n\nBTC/USD order book data on Binance. Source: Material Indicators/Twitter\n\nElsewhere, popular trader and analyst Rekt Capital noted that on weekly timeframes, Bitcoin was channeling its behavior from early 2021, before its current cycle’s all-time highs.\n\nFor the first time since January 2021, #BTC is in the process of turning the black ~$29300 level into support in a new uptrend\n\n\n\nThis is history in the making$BTC #Crypto #Bitcoin pic.twitter.com/gECVTRRURj — Rekt Capital (@rektcapital) July 31, 2023\n\n“BTC is still at the ~$29250 level and acting as support going into the July Monthly Close,” additional analysis read.\n\n“Last month, $BTC broke ~$29250 after months of this level acting as resistance. And this month BTC is in the process of retesting it into new support.”\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nVolumes plummet in flat trading landscape\n\nA further 2021 comparison concerned on-chain transaction volumes.\n\nRelated: BTC price ‘fireworks’ after monthly close? 5 things to know in Bitcoin this week\n\nAs revealed by fellow trader Mikybull Crypto, volumes are at their lowest in over two years — something that, for him, suggests only one outcome will result.\n\nThe 7-day average of #Bitcoin spot trading volume has sunk to levels not seen since the start of 2021.#Bitcoin IV is also at its yearly lowest level.\n\n\n\nThis indicates massive incoming volatility that will skyrocket $BTC to a new level. pic.twitter.com/nmRCbrGbGb — Mikybull Crypto (@MikybullCrypto) July 31, 2023\n\nAs Cointelegraph reported, various market participants expect a volatile breakout on BTC/USD after weeks of barely any movement.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Experts want to give AI human ‘souls’ so they don’t kill us all\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNvdWxkLWhpdC1oaWdoLW5vdy0xNzU3MDgwNTUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin could hit a new high now that BlackRock's Larry Fink got 'orange-pilled' and became a true believer, billionaire ... - Yahoo Finance",
        "content": "BlackRock CEO Larry Fink Spencer Platt/Getty Images\n\nBitcoin could hit a new record high now that Blackrock's Larry Fink is a believer, Mike Novogratz said.\n\n\"The most important thing that happened this year in bitcoin is Larry Fink,\" he said on Bloomberg TV.\n\nBitcoin's current all-time high is $69,000 set in 2021, and it's now hovering below $30,000.\n\nBlackRock CEO Larry Fink's conversion into a bitcoin devotee is this year's headline event for the token and could send it to a new record high, crypto bull billionaire Mike Novogratz said.\n\n\"I think the most important thing that happened this year in bitcoin is Larry Fink,\" the Galaxy CEO said in an interview on Bloomberg TV with David Rubenstein. \"He got 'orange-pilled,' as we say — orange-pilled is when you take a non-believer and you make him a believer in bitcoin — and Larry was a non-believer, now he says, 'hey, this is going to be a global currency.'\"\n\nThe comments follow BlackRock's June application to establish a bitcoin spot ETF; it's among the biggest signals of institutional support for the cryptocurrency.\n\nAdded to that, Fink himself has remarked bullishly on digital tokens, saying they could revolutionize finance. That's after he laughed off bitcoin in 2017 as a measure of demand for money laundering.\n\nTo Novogratz, such a personal change in a major CEO's viewpoint indicates shifting attitudes towards the digital currency.\n\n\"Value comes from when people believe there's value, and now we have this preponderance of evidence,\" he said. \"180 million people around the world, without a gun to their head, take their hard earned savings and store it in this community of people that run this technology, you know, called bitcoin.\"\n\nThis pivoting sentiment could help bitcoin surpass its $69,000 record set in 2021, Novogratz said, further supported by a future cut in interest rates. The token has shifted around the $30,000 mark for the past few months.\n\nStory continues\n\nSimilarly, Fundstrat said last week that a bitcoin ETF from BlackRock could drive a boost in daily demand for the crypto token, sending the price to $180,000 by April.\n\nAnother upside factor Novogratz noted was Ripple's recent court victory against the Securities and Exchange Commission, when a judge ruled its cryptocurrency was not a security for the general public. To him, this showed that the regulatory rules \"are no where close to clear.\"\n\nHe also touched on the new Worldcoin, a cryptocurrency developed by OpenAI co-founder Sam Altman. The token stands out for its use of an eyeball scanner, used to establish unique digital identities per user.\n\nNoting that it would be a bad idea to bet against Altman right now, Novogratz said of Worldcoin: \"I think the price potentially can go a lot higher, because there's an AI-hype cycle.\"\n\nThe currency was trading at $2.33 as of Monday afternoon.\n\nRead the original article on Business Insider"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDEvbWFrZXJkYW9zLW1rci1yaXBwbGVzLXhycC1hbmQtc3RlbGxhcnMteGxtLWxlZC1jcnlwdG8tZ2FpbmVycy1pbi1qdWx5L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMDEvbWFrZXJkYW9zLW1rci1yaXBwbGVzLXhycC1hbmQtc3RlbGxhcnMteGxtLWxlZC1jcnlwdG8tZ2FpbmVycy1pbi1qdWx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "MakerDAO’s MKR, Ripple’s XRP and Stellar’s XLM Led Crypto Gainers in July - CoinDesk",
        "content": "One positive upcoming catalyst might be an SEC decision on any of the numerous spot bitcoin ETF applications. The market is optimistic this will eventually get done,” said LMAX Digital in a morning note. “An approval of an ETF of a well-established and well-respected name like BlackRock could really open the door to a huge wave of demand, ushering in the next major push for institutional adoption.”"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yZXB1YmxpY2FuLWNhbmRpZGF0ZS1lbmQtcHJlc2lkZW50LWJpZGVuLXdhci1vbi1iaXRjb2luLWlmLWVsZWN0ZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Republican candidate wants to end President Biden's supposed 'war on Bitcoin' if elected - Cointelegraph",
        "content": "Florida Gov. Ron DeSantis has pushed a platform based partly on “economic independence” in his 2024 presidential campaign, specifically taking a stance on digital currencies.\n\nSpeaking at a campaign event in New Hampshire on July 31, DeSantis reiterated his plans of banning central bank digital currencies, or CBDCs, should he win the Republican nomination and presidential race and take office in 2025. The Florida governor added he planned to end U.S. President Joe Biden’s “war on Bitcoin and cryptocurrency” should he win the presidency.\n\nRon DeSantis speaking at a campaign event in New Hampshire on July 31. Source: YouTube\n\nIt’s unclear to which specific policies DeSantis was referring, but he suggested they were coming through the Federal Reserve. President Biden signed an executive order establishing plans for a regulatory framework for digital currencies in March 2022. The Securities and Exchange Commission has also filed several lawsuits against crypto firms while Biden has been in office, and the Department of Justice has overseen criminal charges for former FTX CEO Sam Bankman-Fried and former Celsius CEO Alex Mashinsky.\n\nDeSantis went on to compare the United States government’s plans for a CBDC to those in China, where the central bank is currently conducting trials of a digital yuan. He claimed that “unaccountable elites” in the government could not be trusted to handle the potential rollout of a digital dollar.\n\n“[The Fed wants] to go to a cashless society. They want to eliminate cryptocurrency,” claimed DeSantis. “As president, on day one, CBDC goes into the trash can — we’re not going to allow it.”\n\nNew Hampshire is widely considered a suitable testing ground for U.S. presidential candidates due to the state holding the first primary in the national race. DeSantis has had a rocky start to his official campaign since announcing it on Twitter — now X — in May but is still considered the second most viable Republican candidate, according to several different polls.\n\nRelated: Rep. Patrick McHenry blames White House for lack of urgency on stablecoin bill negotiations\n\nNearly all polls show DeSantis trailing well behind twice-impeached former president and federally indicted candidate Donald Trump. Both candidates are expected to face elections in state primaries starting in January, leading to a final vote to determine the party candidate at the Republican National Convention in July 2024.\n\nBoth Democratic and Republican candidates vying for a place in the 2024 presidential election have voiced opinions on cryptocurrencies like Bitcoin (BTC) and CBDCs. Robert F. Kennedy Jr., a Democratic party candidate polling roughly 40-50 points behind Biden, has made several pro-crypto statements in his campaign and revealed several BTC purchases. Miami Mayor Francis Suarez, who accepted a BTC salary for his position and helped launch the \"MiamiCoin\" project, announced his candidacy for the Republican nomination in June.\n\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmluZy11cGRhdGUtc3RvY2tzLWNvb2wtb2ZmLW1pbmVycy1zZW5kLWJ0Yy10by1leGNoYW5nZXMtdG8tcHJlcC1mb3ItaGFsdmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin mining update: Stocks cool off, miners send BTC to exchanges to prep for halving - Cointelegraph",
        "content": "In July, Bitcoin mining stocks continued their positive 2023 run, with the top 10 stocks by market cap gaining 23.10% on the month on average, with a year-to-date return of 277.34%.\n\nIn comparison, the Bitcoin (BTC) price lost 3.59% in July as it failed to build support above $30,000 for the sixth week since June. Despite a difficult July, the BTC price is still up 78.88% in 2023.\n\nBitcoin mining stocks performance. Source: Cointelegraph\n\nThe decline in Bitcoin’s price reduced the profitability of miners. To make conditions more challenging for miners, the mining difficulty reached a new all-time high, reducing miner profitability.\n\nHistorical trends show that the network’s hash rate could continue to rise leading up to the halving on April 26, 2024 as miners increase their hashing power by installing new efficient machines.\n\nBesides adding to their processing power, miners are also adopting other hedging techniques like selling Bitcoin futures to lock in current prices.\n\nAs the network’s hash rate is expected to increase through the year as miners reinvest in new machines and adopt other hedging techniques, miner profitability and stock valuations will continue to face pressure in the lead-up to the event.\n\nBitcoin hash rate projected to grow until halving\n\nWhile the BTC price has increased by around 80% year-to-date, the mining difficulty has also increased by 51%, offsetting the rise in profitability from the price surge.\n\nIn mid-July, Bitcoin’s difficulty set a new all-time high of 53.91 trillion units. The increase in difficulty triggered a capitulation event in the sector, which was already reeling under pressure at the start of the month.\n\nBTC/USD price chart with hash ribbon indicator. Source: TradingView\n\nBitcoin’s hashprice index, a metric used to quantify the average daily miner earnings from 1 TH/s across the industry, dropped from $78.30 per TH/s on July 1 to $72 per TH/s by the end of July, per Hashrate Index data.\n\nHashprice index chart. Source: Hashrate Index\n\nThe network’s hash rate deflated in the second half of July, resulting in a 2% decline in its difficulty in the adjustment on July 26.\n\nThe adjustment will likely ease the pressure on miners, but only slightly. The total hash rate is still ranging above last month’s lows after rising consistently since the start of 2023.\n\nMoreover, historical trends suggest that miners will likely continue adding to their fleet, which could cramp profitability further.\n\nBitcoin daily hash rate. Source: Glassnode\n\nBefore the previous halving, Bitcoin’s hash rate grew consistently for a year, peaking only a month before the halving in May 2020. The current rise in the network’s hash rate is showing a similar trend.\n\nMiners are preparing for the halving\n\nBesides increasing hash power, the miners are adopting various strategies to prepare for the event.\n\nThese strategies involve improving the cash flow and profits of their operations by managing the existing and newly mined BTC before the halving.\n\nIn the previous cycle, Bitcoin miners had started accumulating BTC a year before the event and began unloading only after the rewards were slashed. However, with less than nine months, or three quarters, before the next halving, the trend hasn’t repeated yet. Miners have been seen sending large amounts of BTC to exchanges.\n\nThe one-hop supply of miners, which represents the coins received from mining pools, dipped toward a 2023 low in July.\n\nBitcoin one-hop supply. Source: Coin Metrics\n\nData from Bitfinex also shows that miner inflow to exchanges is part of a de-risking strategy to hedge their BTC on derivatives exchanges. For instance, selling BTC one-year futures allows miners to lock in a selling price of $30,000 for next year.\n\nSome miners could also be selling to improve their cash balances before the halving.\n\nMiners are selling record amounts of newly mined #Bitcoin to cover operational costs. Despite the prolonged bear market, mining firms like @Hut8Mining , @Foundry & @Brains remain confident and bullish on #BTC's future. Many are looking to derisk their operations by hedging in the… pic.twitter.com/xVyAmb8BTE — Son of a Tech (@SonOfATech) July 26, 2023\n\nAccording to data from TheMinerMag, public miners have liquidated nearly all of their newly mined Bitcoin in the last two months.\n\nMeanwhile, Bitcoin mining stocks have continued their impressive positive rally from the start of the year and could be en route to another positive monthly closing in July.\n\nRelated: Buying Bitcoin is preferable to BTC mining in most circumstances — Analysis\n\nNotably, miner stocks were fueled by reports of a $500 million investment by the United States-based investment fund Vanguard, a $7.2 trillion asset management firm. The fund added to its allocations of Riot Platforms (RIOT) and Maraton Digital Holdings (MARA) in certain indices.\n\nThe potential for further upside could be triggered by an ongoing short squeeze, as Marathon Digital Holdings, Riot Platforms and Cipher Mining are heavily shorted, with 20-25% of their float shares, according to Fintel data.\n\nNevertheless, the mining stocks showed the first signs of weakness in the second half of July, as most mining stocks recorded two negative weekly closings.\n\nGiven that the competition in the Bitcoin mining industry is expected to increase throughout the year, miners’ profitability and stock valuations may remain under stress leading up to the halving.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJpc2tzLTI1ay1tYWNyby1uZXctYW5hbHlzaXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price risks $25K dip despite 'macro pivot point' — New analysis - Cointelegraph",
        "content": "Bitcoin (BTC) faces a “breakdown” and distribution despite a new macroeconomic paradigm being around the corner.\n\nThat was one of the conclusions of quantitative Bitcoin and digital asset fund Capriole Investments, which, in its latest update, warned that Bitcoin was “not yet” ready to flip bullish.\n\nCapriole: Bitcoin fundamentals say “not yet”\n\nUnited States equities are booming, and the Federal Reserve may be at the end of its most stringent monetary tightening ever — but Bitcoin has failed to react.\n\nAs traders predict a return to levels closer to $25,000 or lower, Capriole believes that more time is necessary for the new macroeconomic reality to sink in.\n\n“At the same time that Bitcoin has been faltering, the S&P500 has had its longest winning streak in years and the Fed has essentially paused rate hikes at what is now the tightest monetary policy regime on record,” founder Charles Edwards writes.\n\n“In essence we are at a macro pivot point and (all else equal) entering a new monitory policy regime which should be more favorable for Bitcoin over the coming years. This is a positive backdrop for Bitcoin. But today the technicals and fundamentals are telling us ‘not yet.’”\n\nWhile suggesting that the U.S. greenlighting a Bitcoin spot price exchange-traded fund could turn the situation around, Bitcoin remains pinned below resistance on both long and short timeframes, Edwards concludes.\n\n“The next support levels are $28K, $24K and low-$20Ks; with each offering significantly better relative opportunity,” he continued.\n\nAs such, utilizing the Wyckoff method, “distribution” currently characterizes BTC price action.\n\n“Low Timeframe Technicals: Breakdown! Support at $30K failed and a new bearish trend has emerged,” Edwards summarizes.\n\n“This is a low timeframe Wyckoff distribution. If the magnitude of the downswing matches the upswing, the target of this move is circa $25K.”\n\nBTC/USD annotated chart. Source: TradingView\n\nBTC price taps 6-week lows\n\nAs Cointelegraph reported, Capriole is far from the only market participant predicting BTC price conditions to get worse before they get better.\n\nRelated: Bitcoin loses $29K as traders flag key BTC price levels to watch next\n\nOn-chain monitoring resource Material Indicators this week argued that multiple lower levels remain “possible” for Bitcoin after BTC/USD failed to rally on the back of last week’s U.S. macro data.\n\nThis showed inflation slowing faster than predictions, notionally increasing the odds of a pivot in Fed policy sooner rather than later.\n\nIn his recent interview with Cointelegraph, meanwhile, Edwards himself stuck by a previous long-term forecast. Bitcoin, he suggested, would need up to a year before bullish momentum really began.\n\n“That thinking mostly remains today. Bitcoin has steadily grinded up about 30% since February,” he said.\n\n“The difference today is that the relative value opportunity is slightly less as a result, and we are now trading into major price resistance at $32,000, which represents the bottom of the 2021 bull market range and confluence with major weekly and monthly order blocks.”\n\nBTC price action wicked to $28,574 after the Aug. 1 Wall Street open, marking its lowest level since mid-June, per data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-day chart. Source: TradingView\n\nMagazine: Experts want to give AI human ‘souls’ so they don’t kill us all\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iYXJiaWUtc3Rhci1tYXJnb3Qtcm9iYmllLWJpdGNvaW4tMTMyNzM3MjM0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Barbie star Margot Robbie on Bitcoin and 'big Ken energy' - Yahoo Finance",
        "content": "The hit movie Barbie has become the summer's pop culture conversation, so it was probably only a matter of time till the crypto world got drawn in too. That happened during a recent Fandango Bitcoin or something, Gretta and I would be like, you’re being such Kens!\" said Robbie, adding she felt the same when the pair chatted about golf.\n\nKen, of course, is Barbie's longtime boyfriend who historically has offered little depth or personality, and serves primarily as male eye candy. (The new movie also points to Ken as a symbol of the patriarchy, but a cryptocurrency column is probably not an ideal forum for that particular debate.)\n\nIt wasn't long before Robbie's comments caught the attention of the crypto crowd. While it's hard to see her remarks as particularly flattering, the reaction was primarily positive. This included the managing director of investment firm Swan Bitcoin, who tweeted a short excerpt from the pink-hued interview that loops Robbie saying \"Bitcoin or something\" three times.\n\nMeanwhile, as CoinTelegraph notes, Microstrategy CEO Michael Saylor—whose cybersecurity firm is now one of the world's largest Bitcoin holders—and others hailed Robbie's subsequent comment that, \"There also can be big Ken energy and that's a good thing!\"\n\nRobbie never clarifies whether that \"big Ken energy\" includes men who buy Bitcoin, but many of the cryptocurrency's social media acolytes were happy to conclude that it does. In the bigger picture, though, it doesn't really matter. What does matter is that an actor of Robbie's stature is talking about Bitcoin at all, and that her Hollywood producer husband appears to be dabbling in it. This is free exposure for crypto that would have been unimaginable a decade ago, and so Bitcoin boosters are understandably pleased to get a tiny piece of this summer's big pop culture moment.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune:\n\n5 side hustles where you may earn over $20,000 per year—all while working from home\n\nLooking to make extra cash? This CD has a 5.15% APY right now\n\nBuying a house? Here's how much to save\n\nThis is how much money you need to earn annually to comfortably buy a $600,000 home\n\n"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtbW9udGhseS1jbG9zZS01LXRoaW5ncy1iaXRjb2luLXRoaXMtd2Vla9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "BTC price 'fireworks' after monthly close? 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) heads into a new week, with a new monthly close still stuck in one of its narrowest-ever ranges.\n\nActing in an area just below $30,000, BTC price performance has frustrated or simply bored traders over the past week — could a breakout come next?\n\nThis is the question on every market participant’s mind as the week begins with the July monthly close and the chance for associated volatility.\n\nWhile some believe that Bitcoin is, in fact, overdue for a comedown, data suggests that buying pressure is returning at current levels. Add to that a potential long-term bull flag due to confirm on the monthly close, and all might not be so bad for Bitcoin bulls.\n\nAs a quiet macro week shifts the focus to other potential price triggers for crypto, Cointelegraph takes a look at the major topics for moving markets in the coming days and beyond.\n\nSticky BTC price range could shift after July monthly close\n\nBitcoin was infamously stable last week, with not even the United States interest rate hike and accompanying macroeconomic data managing to shift its tiny trading range.\n\nBTC price observers have had to console themselves with a corridor between $29,000 and $29,500 — one which is still in force at the time of writing, as per data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nWhile the weekly close did offer some snap moves up and down, a short-term trend remains conspicuously lacking.\n\nOn the radar next is the monthly close, which is currently due to see BTC/USD lock in monthly losses of 3.5%.\n\n“The market is going to try to shake you out as we move to and thru the Monthly close,” monitoring resource Material Indicators wrote in part of its latest commentary.\n\nAn accompanying chart of the BTC/USD order book on the largest global crypto exchange Binance showed the current trading range clearly defined with bid and ask liquidity.\n\nBTC/USD order book data on Binance. Source: Material Indicators/Twitter\n\nOn the topic of liquidity, popular trader Daan Crypto Trades delineated the significant levels to watch on low timeframes.\n\n“The ~29K and ~29.6K levels correspond nicely with out current low timeframe range so good to keep watching those regions,” he told Twitter followers prior to the weekly close alongside data from CoinGlass.\n\nCoinGlass likewise showed that, historically, July had been a “green” month for Bitcoin for the past six years, with the exception of 6.6% losses in 2019.\n\nBTC/USD monthly returns chart (screenshot). Source: CoinGlass\n\nFellow trader Jelle, meanwhile, predicted that the coming week would form the lull before the storm for markets.\n\n“Expecting this week to be slow, but fireworks to start next week. Preparing accordingly,” he revealed, adding that he was already accumulating BTC.\n\nBTC/USD annotated chart. Source: Jelle/Twitter\n\nMACD signal forms key Bitcoin bull argument\n\nDespite being on course to close July at a loss, Bitcoin is exciting traders on monthly timeframes for another reason.\n\nThe moving average convergence/divergence (MACD) indicator is due to confirm a bullish crossover, which traditionally precedes periods of protracted BTC price upside.\n\nMACD uses exponential moving averages (EMAs) to plot two lines on an asset’s price chart, and their interplay can form useful advance buy and sell signals.\n\nAs various market participants noted over the past week, the monthly close is still due to lock in a bullish EMA cross on the one-month BTC/USD chart.\n\n#Bitcoin is 1.5 days away from locking in a monthly bullish MACD cross pic.twitter.com/aV2vCmWOaJ — Jelle (@CryptoJelleNL) July 30, 2023\n\nAs Cointelegraph reported, trading resource Stockmoney Lizards has already compared the potential impact of the upcoming cross to a similar event in late 2015, when Bitcoin was preparing the ground for its run to old all-time highs two years later.\n\nNow, it is not just monthly but also daily MACD improving prospects for bulls.\n\nOn one-day timeframes, analyst Kevin Svenson described both MACD and relative strength index (RSI) as being “in a peculiar position” due to the lack of momentum.\n\n“We are entering the usual ‘completion zone’ where the market makes a move. Sentiment is extremely neutral right now,” he added in Twitter comments.\n\nBTC/USD chart with MACD and RSI data. Source: Kevin Svenson/Twitter\n\nA weekly MACD cross in August 2021, meanwhile, came as Bitcoin headed to its current all-time high of $69,000, which it saw just three months later.\n\nU.S. jobs data follows hectic macro week\n\nAn altogether calmer week for macroeconomic data means less of a chance that risk assets, including crypto, will find something to react to.\n\nNonetheless, unemployment data will form the focus for the mood in the U.S., this following repeated signals that inflation is both abating and that the labor market has taken the inflationary cycle in its stride.\n\n“A lot of important jobs data this week,” financial commentary resource The Kobeissi Letter summarized.\n\nKobeissi noted that around one quarter of S&P 500 firms was due to report earnings over the week.\n\n“Economic data remains incredibly important as the Fed determines what to do in Sept,” it added, referencing the impact of data on Federal Reserve interest rate decisions.\n\nKey Events This Week:\n\n\n\n1. ISM Manufacturing data - Tuesday\n\n\n\n2. JOLTS Jobs data - Tuesday\n\n\n\n3. ADP Payrolls data - Wednesday\n\n\n\n4. Jobless Claims data - Thursday\n\n\n\n5. July Jobs report - Friday\n\n\n\n6. ~25% of S&P 500 companies reporting earnings\n\n\n\nA lot of important jobs data this week. — The Kobeissi Letter (@KobeissiLetter) July 30, 2023\n\nElsewhere, U.S. dollar strength was tipped to take a fresh downturn, having rebounded as the Fed hiked rates last week after a June pause.\n\nFor investor and trader Miles Johal, 102 formed formidable resistance for the U.S. Dollar Index (DXY), and Bitcoin should benefit as a result.\n\n“Expect HTF bullish action from $BTC and other risk assets while the DXY continues this downtrend,” part of his latest social media analysis read.\n\nDXY at first key resistance of 102.\n\n\n\nRoll over for another lower high here or the trendline above is still unbroken at this time.\n\n\n\nExpect HTF bullish action from $BTC and other risk assets while the DXY continues this downtrend. https://t.co/p45kPYxPvS pic.twitter.com/nMlfPd4gqt — Miles (@JohalMiles) July 30, 2023\n\nStablecoin investors “load up” with Bitcoin under $30,000\n\nLast week was all about the percentage of the BTC supply now in the hand of long-term holders — an all-time high of 75%.\n\nNow, investors appear to be anticipating new volatility by accumulating stablecoins into the monthly close.\n\nAs noted by research firm Santiment, the trend is visible across multiple stablecoins, including the two largest — Tether (USDT) and USD Coin (USDC).\n\n“Key whale & shark stablecoin wallets appear to be loading up during Bitcoin’s visit below $30k here at the end of the month. Tether, USDCoin, BinanceUSD, & Dai are all seeing supply shifting into these key wallets,” it revealed alongside a chart showing the latest flows.\n\nStablecoin accumulation annotated chart. Source: Santiment/Twitter\n\nThe move comes as stablecoin accumulation itself preempts a return to the upside for BTC’s price. Last week, it was crypto exchange Bitfinex in the spotlight.\n\n“Bitfinex Bitcoin to stables ratio blows up in advance of every big bull move. A major leading indicator,” market cyclist and on-chain analyst Cole Garner said at the time.\n\nBitfinex stablecoin ratio annotated chart. Source: Cole Garner/Twitter\n\nWhale wallet numbers hit a four-month low\n\nAt the same time, Cointelegraph has been reporting on interesting shifts in whales’ BTC exposure.\n\nRelated: BlackRock ETF will be ‘big rubber yes stamp’ for Bitcoin — Charles Edwards\n\nThe largest-volume investor cohort has been undergoing what on-chain analytics firm Glassnode called “noteworthy” changes, with net exposure down 255,000 BTC since May 30.\n\nThe number of wallets holding 1,000 BTC ($294 million) or more now bears this out, with Glassnode recording the lowest such wallet numbers in four months.\n\nBitcoin wallets holding at least 1,000 BTC chart. Source: Glassnode/Twitter\n\nAs of July 31, there were 2,006 wallets with a balance of at least 1,000 BTC, down by around 35 since the start of July.\n\nBitcoin wallets holding at least 0.01 BTC chart. Source: Glassnode/Twitter\n\nBy contrast, wallets with at least 0.01 BTC ($294) hit new all-time highs of 12,214,918 on the same day.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Tokenizing music royalties as NFTs could help the next Taylor Swift\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbWFzaC1hbm5vdW5jZXMtbGlnaHRuaW5nLWJpdGNvaW4td2FsbGV0LWFwcC1mb3ItYW5kcm9pZC1pb3Mtbm93LWluLWJldGHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Mash Announces Lightning Bitcoin Wallet App For Android & iOS Now In Beta - Nasdaq",
        "content": "Mash, a Lightning-enabled micropayments project focused on content monetization, has announced their Lightning Bitcoin Wallet is entering Beta and available for download now. In order to bypass potential app store censorship – a precedent set with Apple’s App Store and Nostr client Damus – Mash has enabled download of their progressive web-app straight from your mobile’s browser.\n\nThe web-app itself can be saved right to your Android or iOS home screen simply by visiting their website, enabling Lightning Network interoperability for your smart phone in a single minute. A user can create an account, use a credit card to start a bitcoin bonus account, or deposit satoshis from a multitude of popular lightning wallets. With easy to use send and receive interfaces, the Mash Lightning Bitcoin Wallet generates a Lightning address that operates and displays like an email address, but with support for core functionality for Lightning clients.\n\nThe web-app prominently features a Smart QR code scanner capable of recognizing multiple invoice types of varying payment features. The Lightning Bitcoin Wallet supports Bolt 11 LN invoices, LN-URL send and receive, and has a native mobile share drawer integration to make payments or requests with your phone’s contacts via SMS, WhatsApp, Signal, email and more. Mash also allows for customization of your personal account with profile names and avatars to further personalize your Lightning experience on the web-app.\n\nMash is focused on creating new mediums for content creators to monetize their content, either via direct one-time payments or time-based revenue streams. The choice to avoid centralized app stores such as Google Play was deliberate and carefully made, according to Mash CEO Jared Nusinoff. When asked for comment on the company’s announcement, Nusinoff told Bitcoin Magazine: \"Apple and Google have been controlling us all for too long. You should be able to use your Lightning-enabled bitcoin, anywhere, anytime without Big Tech deciding what you can do. That's why we built a web-app – no app store required.”\n\nMore information and details on Mash and the Beta launch of their Lightning Bitcoin Wallet web-app can be found here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxvc2VzLTI5ay10cmFkZXJzLWJ0Yy1wcmljZS1uZXh00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin loses $29K as traders flag key BTC price levels to watch next - Cointelegraph",
        "content": "Bitcoin (BTC) shed 2% into the start of August as traders’ expectations of further downside slowly came true.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin short-term holder breakeven point in focus\n\nData from Cointelegraph Markets Pro and TradingView showed BTC’s price trajectory leaning lower at the July monthly close.\n\nVolatility was already anticipated, and BTC/USD did not disappoint after a week of barely any movement whatsoever. Bulls, however, were left in the cold.\n\nFor popular trader and analyst Rekt Capital, the close price was significant but demanded that buyers now step in to protect the trend.\n\nCommenting on a chart showing relevant levels and Bitcoin’s potential moves, he flagged $29,250 as the line in the sand.\n\n“Instead of BTC Monthly Closing above the ~$29250 level (black)... BTC printed a Monthly Close marginally below the ~$29250 level. BTC needs to reclaim ~$29250 as support for the blue path to be valid,” he wrote.\n\n“However, there are some initial signs of the ~$29250 acting as resistance this month. If this persists then price could actually reject from here and drop lower via the red path. All about the black ~$29250 now.”\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nLooking to short-term targets, meanwhile, many market participants acknowledged that the area around $28,000 should come in for a test.\n\nIn particular, $28,300 stood out, this being the cost basis of Bitcoin’s speculative investor base, known as short-term holders (STHs). These are defined by on-chain analytics firm Glassnode as entities hodling BTC for a maximum of 155 days.\n\n“Fully expect Bitcoin to test the short-term holder cost basis, which is $28.3K. This would be the third time testing this support level this year,” James Straten, research and data analyst at crypto insights firm CryptoSlate, forecast on the day alongside Glassnode data.\n\nBitcoin long/short-term cost basis data. Source: James Straten/Twitter\n\nAs Cointelegraph reported, the STH cost basis has figured as support throughout recent months, with STH selling intensity likewise on the radar as a hurdle for bulls to overcome above $33,000.\n\nKey BTC price moving average inches closer\n\nContinuing, popular trader Titan of Crypto described $28,300 as the “level to watch” for the coming week.\n\nRelated: BTC price ‘fireworks’ after monthly close? 5 things to know in Bitcoin this week\n\n#Bitcoin Update (Weekly Timeframe) #BTC seems to be following the plan.\n\n$28.3k is the key level to watch this week. https://t.co/ZFCbYOwCb3 pic.twitter.com/CoTl5sywQC — Titan of Crypto (@Washigorira) August 1, 2023\n\nDaan Crypto Trades, meanwhile, eyed the 200-week moving average (MA), a classic bear market support level, as a point of interest should further downside ensue. The 200-week MA stood at $27,235 as of Aug. 1.\n\nBTC/USD 1-day chart with 200-week MA. Source: TradingView\n\n“During this year, the Daily 200MA/EMA have proven to be a strong support for Bitcoin,” he told Twitter followers.\n\n“This area definitely got my interest if price were to visit there at some point. Keep in mind this could take a while and we could re-visit these at a higher price.”\n\nBTC/USD annotated chart. Source: Daan Crypto Trades/Twitter\n\nMagazine: Experts want to give AI human ‘souls’ so they don’t kill us all\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS92aWRlby82MzMyMjQ1ODExMTEy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Find crypto market clarity, certainty on the bitcoin 'path': Natalie Brunell - Fox Business",
        "content": "Log in to comment on videos and join in on the fun."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGVjcnlwdC5jby8xNTA3MTEvcm9uLWRlc2FudGlzLWJpZGVuLXdhci1vbi1iaXRjb2luLWNyeXB0by10cmFzaC1jYmRj0gFTaHR0cHM6Ly9kZWNyeXB0LmNvLzE1MDcxMS9yb24tZGVzYW50aXMtYmlkZW4td2FyLW9uLWJpdGNvaW4tY3J5cHRvLXRyYXNoLWNiZGM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Ron DeSantis Promises to End 'Biden's War on Bitcoin', Toss CBDC 'Into the Trash Can' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFlorida governor and presidential hopeful Ron DeSantis says he would call off the Biden administration’s alleged attack against the crypto industry on his first day in office if elected as commander in chief.\n\n“Biden's war on Bitcoin and cryptocurrency will come to an end when I become president,” said DeSantis during a campaign stop in New Hampshire on Monday.\n\nThe Republican, who has previously expressed support for the right to use Bitcoin, reiterated his impartial attitude toward the technology, while again blasting the current administration’s consideration of a Central Bank Digital Currency (CBDC). “As President, on day one, CBDC goes into the trash can—we’re not going to allow it,” he said.\n\nAD\n\nAD\n\nUnlike private-market cryptocurrencies, a CBDC is issued directly by a country’s central bank and can be programmed to prohibit certain transactions. DeSantis signed state-level legislation in May banning the issuance of a federal CBDC within Florida’s borders, blasting it as a tool for financial surveillance.\n\nAfter announcing his campaign bid, DeSantis joined Elon Musk in a Twitter Spaces to expand upon his position, and insisted that citizens have “every right to do Bitcoin.” While supportive of the technology, he also claimed that the network is doomed if Biden gets re-elected.\n\n“Bitcoin represents a threat to them,” DeSantis said at the time. “They’re trying to regulate it out of existence.”\n\nBetween restrictions on banking access and regulatory clampdowns, major crypto firms from the United States are already migrating overseas, or developing plans to do so. Meanwhile, some industry leaders such as Coinbase and Grayscale are battling the government in court for the freedom to launch their products despite a widely regarded absence of regulatory clarity.\n\nWhile members of Congress are trying to push legislation through to provide more clarity, Rep Patrick McHenry (R-NC) has called out the White House for refusing to negotiate on such matters.\n\nAD\n\nAD\n\nLike DeSantis, other Presidential candidates—including Francis Suarez and Robert Kennedy Jr.—have made their support for Bitcoin widely known. The latter has also proposed partially backing the dollar with Bitcoin and eliminating capital gains taxes from sales of the asset."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZGVjcnlwdC5jby8xNTA2NzAvY29pbmJhc2UtY2VvLXNheXMtc2VjLXdhbnRlZC1hbGwtYXNzZXRzLWV4Y2VwdC1iaXRjb2luLWRlbGlzdGVkLXJlcG9ydNIBZmh0dHBzOi8vZGVjcnlwdC5jby8xNTA2NzAvY29pbmJhc2UtY2VvLXNheXMtc2VjLXdhbnRlZC1hbGwtYXNzZXRzLWV4Y2VwdC1iaXRjb2luLWRlbGlzdGVkLXJlcG9ydD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Coinbase CEO Says SEC Wanted All Assets Except Bitcoin Delisted: Report - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe U.S. Securities and Exchange Commission (SEC) reportedly requested Coinbase to stop trading in all cryptocurrencies except Bitcoin (BTC) before suing America’s largest crypto exchange last month, according to a report by the Financial Times citing CEO Brian Armstrong.\n\n“They came back to us, and they said [. . .] we believe every asset other than bitcoin is a security,” said Coinbase CEO. “And, we said, well how are you coming to that conclusion, because that’s not our interpretation of the law. And they said, we’re not going to explain it to you, you need to delist every asset other than Bitcoin.”\n\nA Coinbase spokesperson told Decrypt that the interview \"omitted critical context regarding [Coinbase's] conversations with the SEC in the US,\" adding that \"per the SEC’s own admission, the views shared in the FT article may have represented the views of some staff at the time, but did not represent those of the Commission more broadly.\"\n\nAD\n\nAD\n\nThe SEC didn't immediately respond to Decrypt’s requests for comment.\n\nIn a June lawsuit, the SEC accused Coinbase of operating illegally because it failed to register as an exchange. The regulator also alleged the exchange’s staking service offered at least 13 crypto assets that should have been registered as securities, including tokens such as Solana (SOL), Cardano (ADA), Polygon (MATIC), and The Sandbox (SAND).\n\nIn a separate move, the SEC also sued Binance in June for offering unregistered securities and allowing U.S. investors to access its global website Binance.com. The Wall Street regulator also alleged that Binance CEO Changpeng Zhao and the crypto exchange misused and commingled customers' funds.\n\nAccording to Armstrong, had Coinbase agreed to the request, it would have set a precedent and may have led to the regulator cracking down on the majority of American crypto businesses operating under similar conditions.\n\n“We really didn’t have a choice at that point, delisting every asset other than Bitcoin, which by the way is not what the law says, would have essentially meant the end of the crypto industry in the US,” said Armstrong. “It kind of made it an easy choice [. . .] let’s go to court and find out what the court says.”\n\nAD\n\nAD\n\nThe regulator reportedly said its enforcement division did not make formal requests for “companies to delist crypto assets.”\n\nThe Coinbase representative added that the crypto exchange is still in discussions with the SEC and believes \"that transparent and fair rulemaking and Congressional action, such as bills that we saw gain bipartisan support in the U.S. House of Representatives last week, represent the best path forward for American crypto users and the companies building the cryptoeconomy in the U.S.”\n\nGensler on Bitcoin\n\nSEC Chair Gary Gensler has previously suggested that all cryptocurrencies aside from Bitcoin are securities.\n\nHe’s also often been citing the lack of investor protection as a reason for enforcement actions against crypto companies, comparing the sector to “the Wild West.”\n\nIn the June lawsuit against Coinbase, the SEC, however, didn’t mention Ethereum (ETH), the world’s second-largest cryptocurrency by market cap, among those tokens it asserted to be securities.\n\nOn June 28, the San Francisco-based company filed a motion to dismiss the SEC’s lawsuit, arguing that the agency does not have statutory authority over the exchange and that its position regarding its powers is “untenable as a matter of law.”\n\nEditor's note: This article was updated on July 31, 2023 at 6 am Eastern Standard Time to include comment from Coinbase."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1wbHVuZ2VzLWJlbG93LTI5MDAwLXNvbGFuYS1wb2x5Z29uLXRhbmstdXAtdG8tNC9hcnRpY2xlc2hvdy8xMDIzMDcyMjIuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXBsdW5nZXMtYmVsb3ctMjkwMDAtc29sYW5hLXBvbHlnb24tdGFuay11cC10by00L2FtcF9hcnRpY2xlc2hvdy8xMDIzMDcyMjIuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin plunges below $29,000; Solana, Polygon tank up to 4% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading lower in Wednesday's trade. Bitcoin (BTC) declined 1.72% to $28,895, whereas Ethereum (ETH) was below the $1,850 level.Meanwhile, the global cryptocurrency market cap was trading lower, around $1.16 trillion, falling 1.74% in the last 24 hours.\"In the past 24 hours, Bitcoin traded below the $29,000 level, mainly due to uncertainties surrounding the Curve exploit and the recent SEC crackdown on exchanges and crypto entities. This has led to bearish sentiment in the market, with the bullish momentum slowing down. As a result, investors have become cautious in the crypto market,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens, XRP, Dogecoin , Solana, Polygon, and Polkadot were also trading lower on Friday.The total volume in DeFi is currently $3.41 billion, 10.7% of the total crypto market 24-hour volume. The volume of all stablecoins is now $29.42 billion, which is 92.31% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $562 billion. Bitcoin's dominance is currently 48.28%, an increase of 0.05% over the day, according to CoinMarketCap. BTC volume stood at approximately $13.27 billion, rising 25.31% in the last 24 hours.\"BTC (-1.7%) continues to make new lows in the daily chart as it traded at its lowest price in 40 days at $28.7k in the early trading hours for the day. From a purely technical analysis lens, not a lot of downside remains in BTC if the bullish trend line were to be respected and we could see a reversal from the trend line support which sits at around $27k for the day,\" Shubham Hudda, Senior Manager at CoinSwitch Markets Desk, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point to a Neutral sentiment. The Relative Strength Index (14) sits at 40, with a neutral outlook. The Stochastic %K (14, 3, 3) at 22 and the Average Directional Index (14) at 18 indicate a Neutral outlook.\"\"The MACD Level (12, 26), at -180, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 11 and William's Percentage too indicates a Neutral sentiment at -86,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 1:21 hours, IST on August 1, 2023)Bitcoin $28,895 -1.72%Ethereum $1,833 -1.73%Tether $0.9998 -0.01% BNB $245 0.88%XRP $0.6905 -2.20%Cardano $0.3055 -2.40%Dogecoin $0.07655 -2.76%Solana $23.51 -4.07%Polygon $0.3.04 -3.05% Litecoin $90.46 -3.06%Polkadot $5.07 -2.29%Tron $0.07823 -1.24%Shiba Inu $0.000008319 -0.39%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDgvMDEvdGhlLW9yZGluYWxzLXRlYW0taXMtY3JlYXRpbmctYS1ub24tcHJvZml0LXRvLXN1cHBvcnQtYml0Y29pbi1uZnQtZGV2ZWxvcGVycy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vd2ViMy8yMDIzLzA4LzAxL3RoZS1vcmRpbmFscy10ZWFtLWlzLWNyZWF0aW5nLWEtbm9uLXByb2ZpdC10by1zdXBwb3J0LWJpdGNvaW4tbmZ0LWRldmVsb3BlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "The Ordinals Team is Creating a Non-Profit to Support Bitcoin NFT Developers - CoinDesk",
        "content": "“Companies across Web3 ecosystems – including Ethereum, Solana, Stacks, and others – are quickly building Ordinals infrastructure after previously believing NFT-functionality ‘wasn't possible’ on native Bitcoin,” said Redwin. “Given Ordinals' unprecedented pace of adoption and real-world implications for various crypto-economies, we believe it is crucial to fund a strong team of non-corporate funded developers to ensure the security and neutrality of this open-source protocol.”"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZGVjcnlwdC5jby8xNTA4MzcvZ2VuZXNpcy1kaWdpdGFsLWFzc2V0cy1leHBhbmRzLWJpdGNvaW4tbWluaW5nLWFjdGl2aXR5LXByby1pbm5vdmF0aW9uLXNvdXRoLWNhcm9saW5h0gF0aHR0cHM6Ly9kZWNyeXB0LmNvLzE1MDgzNy9nZW5lc2lzLWRpZ2l0YWwtYXNzZXRzLWV4cGFuZHMtYml0Y29pbi1taW5pbmctYWN0aXZpdHktcHJvLWlubm92YXRpb24tc291dGgtY2Fyb2xpbmE_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Genesis Digital Assets Expands Bitcoin Mining Activity in ‘Pro-Innovation’ South Carolina - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nGenesis Digital Assets (GDA), is expanding its U.S. operations, having announced the opening of three new Bitcoin mining data centers in South Carolina.\n\nOne of GDA's new data centers is located near Anderson, and another two are found between the towns of Union and Lockhart. The three sites all began operations this year and have a combined total capacity of 33 megawatts (MW).\n\nAdditionally, last year GDA broke ground on a 40-megawatt (mw) mining data center in Texas.\n\nAD\n\nAD\n\nOne of the world's largest Bitcoin miners, GDA operates mines across Europe, Asia, and North America, and reportedly accounts for about 2% of the Bitcoin network's total hash rate.\n\nAsked about GDA's strategic interest in the state, CEO and Founder Andrey Kim told Decrypt, \"Given its abundance of clean electricity from hydro and nuclear energy sources, we consider South Carolina one of the country's most exciting states.\" He added that it's among the most \"pro-innovation states.\"\n\nGDA employed 150 local workers to construct its three new data centers.\n\n“We were impressed to see how these local communities welcomed us so warmly as an opportunity for their economy,” Ankit Joshi, GDA's Head of North America said.\n\nAs opposed to the state's neighbor to the north, where a county-wide Bitcoin moratorium was enacted this year, interest in the sector appears to be growing in South Carolina.\n\nAD\n\nAD\n\nLast year a South Carolina delegation, including State Treasurer Curtis Loftis and members of the South Carolina Emerging Tech Association Inc., took an exploratory trip to El Salvador to learn about the country's adoption of Bitcoin.\n\nOne of GDA's newest mining sites, the Pacolet data center, is located very close to a Lockhart Power hydroelectric plant.\n\nKim told Decrypt that GDA strives \"to place our data centers near sources of clean energy to ensure our operations run on the most environmentally friendly energy possible.\"\n\nHowever, asked about the specific energy mix powering the Pacolet center, he said, \"we currently do not have accurate load flow studies to determine which nodes receive hydropower.\"\n\nBitcoin mining critics argue that due to Bitcoin's proof-of-work consensus mechanism, even renewable-powered data centers amount to further fossil fuel use because additional mining power increases the difficulty of mining across the system.\n\nKim maintains that GDA's goal is to \"show the world that Bitcoin mining can be very ESG-friendly.”"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZGVjcnlwdC5jby8xNTA4NzEvYml0Y29pbi1vcmRpbmFscy10ZWFtLWxhdW5jaGVzLW5vbnByb2ZpdC1pbnNjcmlwdGlvbnMtdG9wLTIxLW1pbGxpb27SAWRodHRwczovL2RlY3J5cHQuY28vMTUwODcxL2JpdGNvaW4tb3JkaW5hbHMtdGVhbS1sYXVuY2hlcy1ub25wcm9maXQtaW5zY3JpcHRpb25zLXRvcC0yMS1taWxsaW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals Team Launches Nonprofit as Inscriptions Top 21 Million - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe team behind Ordinals said on Tuesday that it has created a nonprofit organization to support the development of its protocol for \"inscribing\" NFT-like assets to the Bitcoin blockchain—right as the total topped 21 million inscriptions to date.\n\nLaunched by developer Casey Rodarmor earlier this year, Ordinals quickly established itself as a hotbed for innovation around crypto’s oldest coin. The protocol lets people assign data to an individual satoshi—equal to 1/100,000,000 of a whole Bitcoin—whether that’s art, profile pictures, or even playable games.\n\nThe California-based nonprofit, dubbed the Open Ordinals Institute, will back the protocol’s development by funding its core group of developers, including the project’s pseudonymous lead maintainer, Raph.\n\nAD\n\nAD\n\n“It's very great to scale this up and make a long-term effort,” Raph told Decrypt. “Nonprofits [...] can accept donations and can allocate capital to people contributing in a very neutral way, without there being a profit incentive.”\n\nThe shift toward a nonprofit structure will primarily have tax implications, Raph said. Pending approval from the IRS, Ordinals’ development team—which was funded privately by Rodarmor in the past—will be able to accept tax-deductible donations. Previously, funds given to Rodarmor and Raph were classified for tax purposes as personal gifts.\n\nFour people are expected to serve on the Institute’s board, Raph said: himself, Rodarmor, Hell Money podcast host Erin Redwing, and the pseudonymous Ordinals technical fellow known as Ordinally.\n\nRaph described the move as parallel to other crypto projects that have established foundations, but acknowledged that the initiative is still in its early days.\n\n“At the moment, it's very simple,” he said. “It's the most minimal structure you can imagine.”\n\nAD\n\nAD\n\nAlongside the change, the Ordinals team launched Ordinals.org, where members of the organization will post community updates and provide other resources related to the project’s development.\n\nThe new direction for Ordinals’ team comes after Rodarmor said he’d be taking a step back in May, explaining he couldn’t give Ordinals the attention it deserved. Still, Rodarmor has been active in the project’s GitHub repository where features are refined and developed, making changes as recently as June 19.\n\nRodarmor declined to respond to a request for comment from Decrypt.\n\nOn Tuesday, the total number of Ordinals inscriptions topped 21 million, according to a Dune Analytics dashboard. It could be viewed as a noteworthy milestone, considering Bitcoin’s total supply is forever capped at 21 million Bitcoin.\n\nThe fervor surrounding Ordinals inscriptions—as well as Bitcoin transaction fees—spiked in May as demand for BRC-20 tokens surged. The experimental class of tokens, built on top of Bitcoin using Ordinals, takes inspiration from Ethereum ERC-20 tokens.\n\nElevated Bitcoin transaction costs sparked some concerns, yet the higher fees ultimately delivered miners a significant windfall—something that MicroStrategy co-founder and Executive Chairman Michael Saylor has previously said could benefit Bitcoin in the long run.\n\nAs enthusiasm surrounding Ordinals grew, several crypto exchanges and NFT marketplaces rushed to support art-based inscriptions and BRC-20 tokens. But lately, there’s been a palpable decline in activity and trading volume related to Ordinals inscriptions, Ordinally told Decrypt.\n\n“Many people are talking about Ordinals being dead,” said Ordinally. “But what I see from talking to people who are creating software companies and building in this space—everybody’s saying this is a very welcome period to just take a breath and start focusing again.”\n\nAD\n\nAD\n\nOn June 2, nearly 22,000 transactions involving art-based inscriptions took place on marketplaces that support Ordinals, representing an all-time high, according to another Dune Analytics dashboard. Yesterday, that figure totaled less than 2,000.\n\nOrdinally said they were originally drawn to Bitcoin by the concept of digital scarcity and how something in a “world of digital noise and abundance” could be finite. In terms of Ordinals, they said the project is an extension of Bitcoin’s scarcity that lends itself to art and digital collectibles, with plenty of room to grow.\n\n“I think digital artifacts built on the scarcity of Bitcoin block space will mature over time into something that is quite different than the NFT ecosystems you see today,” he said. “We have made the few first steps, but there's so much more to be done.”"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8xNTA5MDMvbWljcm9zdHJhdGVneS1wcm9maXQtaW1wYWlybWVudC1jaGFyZ2UtYml0Y29pbi1ob2xkaW5nc9IBV2h0dHBzOi8vZGVjcnlwdC5jby8xNTA5MDMvbWljcm9zdHJhdGVneS1wcm9maXQtaW1wYWlybWVudC1jaGFyZ2UtYml0Y29pbi1ob2xkaW5ncz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "MicroStrategy Makes Profit, Reports $24 Million Bitcoin Impairment Charge in Q2 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBusiness intelligence company MicroStrategy—one of the largest institutional holders of Bitcoin in the U.S.—reported a $24.1 million impairment charge on its crypto holdings today but nonetheless returned to profitability this quarter.\n\nMicroStrategy said in its Q2 2023 earnings report that it bought even more Bitcoin in July. The largest publicly traded company with Bitcoin on its balance sheet now says it holds 152,800 coins—worth about $4.4 billion.\n\nAn impairment charge refers to a loss of value in assets—in this case, the digital assets held by the company. The price of Bitcoin is currently down compared to the average price the software company initially paid per coin, resulting in the loss.\n\nAD\n\nAD\n\nThe net income of the company was $22.2 million for the second quarter of the year, however, compared to a loss of nearly $1.1 billion during the same period in 2022.\n\nIn the same quarter last year, Q2 2022, MicroStrategy had posted an impairment charge on its Bitcoin holdings of nearly $1 billion.\n\nIn the company's latest earning statement, MicroStrategy Chief Financial Officer Andrew Kang said the firm continued buying the asset \"against the promising backdrop of increasing institutional interest, progress on accounting transparency, and ongoing regulatory clarity for Bitcoin.\"\n\nIts founder and chairman Michael Saylor started buying the cryptocurrency in August 2020. He claims that the asset is a good hedge against inflation and will get the best returns for shareholders.\n\nSo far, he appears to be right: despite the impairment charge, MicroStrategy stock—MSTR on the Nasdaq—is up 197% since the first Bitcoin buy.\n\nAD\n\nAD\n\nThe price of the biggest cryptocurrency by market cap has risen 156% since then, too, from $11,398 per coin to $29,238 today.\n\nIn July, @MicroStrategy acquired an additional 467 BTC for $14.4 million and now holds 152,800 BTC. Please join us at 5pm ET as we discuss our Q2 2023 financial results and answer questions about the outlook for #BusinessIntelligence and #Bitcoin. $MSTR https://t.co/SCHeBJ80TH — Michael Saylor⚡️ (@saylor) August 1, 2023\n\nSaylor has said that the company's strategy \"is to buy and hold Bitcoin, and the key for us is to be consistent, transparent and responsible in the pursuit of that strategy.\""
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLXJlY292ZXJzLTMway_SAURodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvYml0Y29pbi1wcmljZS1yZWNvdmVycy0zMGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Price Recovers Within Range, Bears Still In Control Below $30K - NewsBTC",
        "content": "Bitcoin price is recovering higher from the $29,000 support. BTC could revisit the key $29,700 resistance zone in the coming sessions.\n\nBitcoin is slowly moving higher above the $29,200 and $29,300 levels.\n\nThe price is trading above $29,300 and the 100 hourly Simple moving average.\n\nThere was a break below a key bearish trend line with resistance near $29,375 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could rise toward the next major resistance at $29,700.\n\nBitcoin Price Faces Many Hurdles\n\nBitcoin price retested the $29,050 support zone where the bulls emerged. BTC remained strong above the $29,000 zone and recently started a fresh increase.\n\nThere was a clear move above the $29,250 and $29,300 levels. The price broke the 50% Fib retracement level of the downward move from the $29,678 swing high to the $29,070 support. Besides, there was a break below a key bearish trend line with resistance near $29,375 on the hourly chart of the BTC/USD pair.\n\nBitcoin is now trading above $29,300 and the 100 hourly Simple moving average. It is now facing resistance near the $29,450 level.\n\nIt seems like the 61.8% Fib retracement level of the downward move from the $29,678 swing high to the $29,070 support is acting as a resistance. The first major resistance is still near the $29,650 level. The next major resistance is near the $29,700 level, above which the price might rise toward the $30,000 resistance zone.\n\nSource: BTCUSD on TradingView.com\n\nA close above the $30,000 resistance zone could start a decent increase. In the stated case, the price may even surpass the $30,400 resistance.\n\nFresh Decline in BTC?\n\nIf Bitcoin fails to clear the $29,700 resistance, it could start a fresh decline. Immediate support on the downside is near the $29,300 level and the 100 hourly Simple moving average.\n\nThe next major support is near the $29,050 level, below which the price could accelerate lower. The next support is near the $28,800 level. Any more losses might call for a move toward the $28,200 level in the near term.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now gaining pace in the bullish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level.\n\nMajor Support Levels – $29,200, followed by $29,050.\n\nMajor Resistance Levels – $29,450, $29,700, and $30,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2xlYXJuL2RvZ2Vjb2luLXZzLWJpdGNvaW4v0gE2aHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbGVhcm4vZG9nZWNvaW4tdnMtYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Dogecoin vs Bitcoin: Key Differences and Similarities - NewsBTC",
        "content": "What is Dogecoin?\n\nDogecoin is an alternative coin — more commonly known as an Altcoin — that was established by co-founders Jackson Palmer and Billy Markus in 2013. It was initially created as a joke — based on the well-known “Doge” meme.\n\nEach coin has its own blockchain infrastructure and operating system. Dogecoin runs on the same blockchain infrastructure and uses similar proof-of-work operating systems — a mathematical security system used to verify transactions and approve task execution — as Litecoin and Ethereum, with small modifications.\n\nHow is Dogecoin different from Bitcoin?\n\nBitcoin and dogecoin are extremely different cryptocurrencies.\n\nBitcoin is a widely-used, reputable coin that acts as legal tender in many countries across the world, as well as in transnational markets and industries. Dogecoin lacks the legitimacy and global infrastructure to reach the heights of Bitcoin.\n\nThey also differ drastically in market share. With Bitcoin, there’s a finite number of coins available, creating a limited supply. Dogecoin has an endless supply of tokens, meaning supply can never outpace demand, leaving it in a permanently deflationary state.\n\nBoth Dogecoin and Bitcoin also run on different blockchain networks — and different advancements in blockchain technologies are one of the determining factors of market fluctuations.\n\nBitcoin runs on its own blockchain network, whereas Dogecoin piggybacks off the Ethereum blockchain, but with its own slight changes to transaction tracking and payment recording.\n\nIs Dogecoin better than Bitcoin?\n\nDeciding which cryptocurrency is better will ultimately come down to what a user is looking for from their coin.\n\nIf users are looking for transaction speeds and lower fees, Dogecoin is superior due to the Ethereum-based blockchain, being designed specifically for rapid, seamless transactions.\n\nHowever, if it’s accessibility, usability and value that users are looking for, Bitcoin outperforms Dogecoin because it’s more widely-used and available — meaning users have more options when it comes to making and receiving payments.\n\nFrom an investment standpoint, Bitcoin stands head and shoulders above Dogecoin. While Dogecoin is struggling to reach 1 cent in value, Bitcoin fluctuates on average between 27-30 thousand dollars per coin.\n\nWhile Bitcoin’s value is based on quantifiable aspects — like its widespread usage, user popularity and limited circulation — Dogecoin doesn’t have too much room for growth given its endless supply and low user uptake.\n\nDogecoin vs Bitcoin price\n\nThe difference between the current and historical price fluctuations of the two coins couldn’t be more different.\n\nAt the height of its reign, Dogecoin peaked at 74 cents, having opened on the market at 0.017 cents per coin — meaning its value went up by over 9000% during the cryptocurrency boom.\n\nIn that same period, Bitcoin had a meteoric rise — peaking at over $61k and opening at $327 — growing at a percentage rate of over nine million percent from opening.\n\nBoth coins have historically reached dizzying heights — allowing those traders who were hot on the trends to see staggering profits.\n\nHowever, the popularity, accessibility and user uptake of Bitcoin means it’s the more valuable coin by a wide margin.\n\nDogecoin mining vs Bitcoin mining\n\n“Crypto mining” is a common way for users to get hold of valuable coins.\n\nThe process of mining involves using powerful computers and high-speed internet connectivity to automatically solve a series of complex puzzles and algorithms to validate transactions and secure small portions of coins.\n\nWith enough portions, miners begin to accrue enough value to make the long process of mining worthwhile.\n\nDespite the popularity of Bitcoin, it’s much more time-consuming to mine than its Dogecoin counterpart.\n\nBitcoin miners typically take around ten minutes to approve transaction blocks, whereas Dogecoin miners can approve them ten times faster, with a block every minute. Because Dogecoin runs on an adaptation of the Ethereum blockchain — which can be mined at a rate of 13 million blocks for every 700,000 Bitcoin blocks — it’s significantly easier to mine.\n\nFrequently Asked Questions (FAQs)\n\nCan Dogecoin grow like Bitcoin?\n\nIt’s extremely unlikely that Dogecoin will ever reach the value of Bitcoin for three key reasons.\n\nThe primary reason is popularity. Because of Bitcoin’s widespread usage and popularity, it’s infinitely more sought-after than Dogecoin.\n\nSecondly, the circulation of Dogecoins doesn’t allow it to grow in the same way Bitcoin did. There is an unlimited number of Dogecoins, meaning the number will always be higher than demand. There is only a finite number of Bitcoins in circulation — meaning that demand will likely always outstrip supply, increasing its value.\n\nComparatively speaking, Dogecoin is an inflationary coin and Bitcoin is a deflationary coin, meaning Dogecoin can never grow in the same way.\n\nLastly, many reputable investors believe that the primary “crypto booms” are over. Only the longstanding, widely used coins like Bitcoin and Ethereum will see substantial gains whereas meme tokens like Dogecoin and Shiba Inu will never see these highs again in the eyes of many reputable traders.\n\nIs Dogecoin still a good investment?\n\nDespite it being a meme coin that is taken less seriously than other big players, many investors still hold Dogecoin in their portfolios.\n\nBecause you can buy a significant number of Dogecoins for incredibly low prices, even minor fluctuations can land quick profits.\n\nHowever, the risk of another cryptocurrency crash — and the volatile nature of crypto in general — means that most investors will only hold a small percentage of the coin in their portfolio to mitigate against risks like the crypto crash of 2018.\n\nWhat is the disadvantage of Dogecoin?\n\nDespite it being a well-known cryptocurrency, Dogecoin has its disadvantages — both as a cryptocurrency and an investment.\n\nSome of the disadvantages to consider when investing in Dogecoin include:\n\nLack of utility — Despite being the tenth-highest cryptocurrency in terms of value, it has almost no real-world utility. Because its value is entirely based on speculation and hype derived almost entirely from its meme background, Dogecoin is inherently unstable. It also lacks the real-world use and user uptake of larger, more practical coins like Bitcoin and Ethereum.\n\n— Despite being the tenth-highest cryptocurrency in terms of value, it has almost no real-world utility. Because its value is entirely based on speculation and hype derived almost entirely from its meme background, Dogecoin is inherently unstable. It also lacks the real-world use and user uptake of larger, more practical coins like Bitcoin and Ethereum. No supply cap – Because the supply of Dogecoin is endless, it can never outpace demand — ultimately limiting its potential for growth.\n\n– Because the supply of Dogecoin is endless, it can never outpace demand — ultimately limiting its potential for growth. Little supporting metrics — It historically has not been a big grower. Despite booming significantly during the crypto boom of 2017, it never exceeded a value of more than 61 cents per coin — making it an incredibly low-value asset, even at the height of its power.\n\nIs Dogecoin a good long-term investment?\n\nUnfortunately, without a significant shift in either how it functions as a cryptocurrency, market shifts or investor interest, it’s unlikely investors will see long-term gains on the asset.\n\nLike all cryptocurrencies, it can act as a strong diversifier for short-term gains — given the volatile nature of the crypto market. However, its potential for long-term gains compared to established coins and tokens like Ethereum, Bitcoin and Solana, is slim.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RoaXMtaXMtd2h5LWJpdGNvaW4tZ29sZC1wcmljZS1pcy11cC1ieS01MC1ldmVuLWFzLWJpdGNvaW4tcHJpY2UtcmVtYWlucy1zdHVjay1iZWxvdy0zMC0wMDAtMjAyMzA4MDEwMDU00gGbAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RoaXMtaXMtd2h5LWJpdGNvaW4tZ29sZC1wcmljZS1pcy11cC1ieS01MC1ldmVuLWFzLWJpdGNvaW4tcHJpY2UtcmVtYWlucy1zdHVjay1iZWxvdy0zMC0wMDAtMjAyMzA4MDEwMDU0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "This is why Bitcoin Gold price is up by 50% even as Bitcoin price remains stuck below $30,000 - FXStreet",
        "content": "Share:\n\nBitcoin Gold price is trading at $20 after rising to an intra-day high of $25, marking a 90% rally.\n\nAccording to Satoshi Talks, the surge in the Bitcoin hard fork could be the result of renewed interest in meme coins.\n\nThis is partially correct, as Bone ShibaSwap (BONE) and Shiba Inu (SHIB) made headlines in the past few days.\n\nBitcoin price has been unable to flip $30,000 into a support floor for a couple of days now, but its namesakes and hard fork tokens seem to be doing pretty well. Recently, Bitcoin Cash was enjoying enormous gains. Over the past 24 hours, another hard fork, Bitcoin Gold price, shot up significantly.\n\nRead more - BTC alternatives mark notable rises on the back of Bitcoin price retaining $30,000 support\n\nBitcoin Gold price rises because of meme coins\n\nBitcoin Gold price shot up by more than 54% in the span of just a day to bring the altcoin to $20.98 at the time of writing. While the rally in itself is pretty huge, during the intra-day trading hours, the cryptocurrency was doing even better. Hitting a high of $25, BTG shot up by nearly 90% in the past day before receding to the current trading price.\n\nThis is the first time in almost ten months that Bitcoin Gold price has registered such stark gains in a single day. The last time this happened was back in October 2022, when the altcoin shot up by more than 161%. At present, while the exact reason for the rally is unknown, speculation points towards meme coins.\n\nBTG/USD 1-day chart\n\nSatoshi Talks, a crypto influencer, tweeted that the renewed interest in small-cap tokens, including meme coins, could be behind the rally. This is partially correct, as the likes of Shiba Inu and Bone ShibaSwap (BONE) observed significant gains in the last few days.\n\nSimilarly, the speculated reason behind the rise sparked bullishness for the likes of Bitcoin Gold. The investors also jumped at the chance of making profits, and this was reflected in the trading volume of the digital asset.\n\nOver the past 24 hours, BTG observed a total transaction volume of $209 million, which represents more than 60% of the total market capitalization of Bitcoin Gold worth $346 million at the moment.\n\nThis surge in trading volume was no less either as compared to the previous week’s average of $1.7 million; $230 million is a 13,430% increase. But this bullishness will likely subside, and the gains will correct since the Relative Strength Index (RSI) suggests that Bitcoin Gold is clearly oversold.\n\nBitcoin Gold trading volume\n\nSince the market is overheated, it will need to cool down, and with it will come some drawdown, making Bitcoin Gold a not-so-necessary asset to add to your portfolio for now.\n\nRead more - Shiba Inu price along with BONE rally as Shibarium-Ethereum bridge testnet kicks off"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL3Byb2R1Y3QvY3J5cHRvd2F0Y2gtdG8tc3Vuc2V0LWtyYWtlbi1wcm8tdG8taW50ZWdyYXRlLWNyeXB0b3dhdGNoLWZlYXR1cmVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 20:16:51 GMT",
        "title": "Cryptowatch to sunset: Kraken Pro to integrate Cryptowatch features - Kraken Blog",
        "content": "We’re looking forward to welcoming Cryptowatch users to experience the advanced trading capabilities of the new Kraken Pro interface. Built to cater to the most discerning traders, Kraken Pro isn’t just a spot trading platform – it enables margin and futures trading, as well as staking options, broadening the scope of your crypto trading strategies.\n\nAt its core, Kraken Pro offers robust and dependable trading infrastructure. Our institutional-grade performance means you can depend on high throughput, low latency, and minimal downtime. With speed and stability that stands out in the crypto space, it’s engineered for optimal execution.\n\nKraken Pro traders can recreate a classic Cryptowatch layout using the Terminal preset"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY2twZ3RvZGF5LmNhLzIwMjMvMDgvMDEvYml0Y29pbi1taW5pbmctZmFjdG9yeS10aHJpdmVzLXF1aWV0bHktb24tcHJpbmNlLWdlb3JnZS1vdXRza2lydHMtZW1wbG95cy1sb2NhbC10YWxlbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 01 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Mining factory thrives quietly on Prince George outskirts, employs local talent - CKPGToday.ca",
        "content": "Glenn Harrison\n\nVP Operations Canada, Iris Energy\n\nBitcoin mining relies on a software protocol. The Prince George facility operates over 16 thousand computers to mine for virtual currency.\n\nAccording to Iris Energy, Prince George was a perfect fit when looking to build a Bitcoin factory.\n\nThis industry didn’t exist five years ago. Iris Energy found that the region has local talent with a diverse skill set to fill positions such as Miner Technicians.\n\n“ I started in construction, logistics and admin, and once we moved into operation, I was offered the operations manager position.”\n\nRoxy Yorke\n\nOperations Manager Prince George, Iris Energy\n\nIris Energy has Bitcoin mine operations in Mackenzie and Canal Flats.\n\nAs the Bitcoin industry continues to grow, there are plans to expand the facility in Prince George.\n\nEmail: Dave.Branco@pattisonmedia.com\n\nTikTok: @DaveBrancoVJ"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2d1bGZuZXdzLmNvbS95b3VyLW1vbmV5L2V4cGVydC1jb2x1bW5zL2ludmVzdG9ycy1jYW4tZXhwZWN0LWFub3RoZXItc2hha2UtdXAtaW4tY3J5cHRvY3VycmVuY3ktcHJpY2VzLXNvb24taGVyZXMtd2h5LTEuMTY5MDgxNDI5Nzg4MdIBkAFodHRwczovL2d1bGZuZXdzLmNvbS9hbXAveW91ci1tb25leS9leHBlcnQtY29sdW1ucy9pbnZlc3RvcnMtY2FuLWV4cGVjdC1hbm90aGVyLXNoYWtlLXVwLWluLWNyeXB0b2N1cnJlbmN5LXByaWNlcy1zb29uLWhlcmVzLXdoeS0xLjE2OTA4MTQyOTc4ODE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Investors can expect another shake-up in cryptocurrency prices soon: Here's why - Gulf News",
        "content": "Dubai: The recent developments in the cryptocurrency industry are quite intriguing and require constant monitoring if you have invested in digital currencies.\n\nIf we examine the changes that have occurred thus far, we can see that technological advancements, regulatory changes, and market sentiments are influencing and propelling the cryptocurrency market, particularly its prices.\n\nThe prices of cryptocurrencies may continue to fluctuate, particularly in light of two significant events that will take place in a few days and over the coming months. Here, I will discuss these two events which will help determine your next crypto investment step.\n\nThe two significant events that investors should keep a watch on are the ‘Halving’ of one of the most popular ‘Altcoins’, Litecoin (LTC), on August 2, 2023, and the ‘Halving’ of Bitcoin, which will occur on April 21, 2024.\n\nGlossary: ‘Altcoins’, ‘Crypto Halving’ An Altcoin is an alternative digital currency to Bitcoin, the first and oldest cryptocurrency. The word Altcoin, which combines words ‘alternative’ and ‘coin’, essentially refers to all the cryptocurrencies other than Bitcoin.\n\n\n\n‘Crypto Halving’, or ‘Halvening’, is an event that reduces the number of new coins or tokens being generated by the network. It happens every four years and is crucial for traders because limiting supply of new coins could potentially raise crypto prices if demand for the coin remains strong.\n\n\n\nThis pre-programmed change to the underlying blockchain technology, primarily affects crypto ‘miners’, who are awarded crypto to solve complex math problems on high-powered computers to validate each crypto transaction. Such ‘block’ rewards are halved every four years to curb inflation.\n\nIt is anticipated that the ‘Halving’ of Litecoin and Bitcoin will influence the entire cryptocurrency market this year.\n\n‘Halving’ events captivate investors, buyers\n\nThe ‘Halving’ of a cryptocurrency reduces the quantity of rewards paid to miners by half. Historically, ‘Halving’ events have captivated investors and buyers, resulting in increased market activity.\n\nIt is anticipated that the ‘Halving’ of Litecoin and Bitcoin will influence the entire cryptocurrency market this year. Any trend impacting these cryptocurrencies can spill over to the prices of other cryptocurrencies, boosting (or hindering) market confidence as a whole.\n\nLitecoin is scheduled to have its third ‘Halving’ event, which occurs every 840,000 blocks, every four years approximately, and reduces its reward per block to 6.25 LTC from 12.5 LTC per block. (‘Blocks’, individual units making up blockchains, are where crypto transactions are stored.)\n\nHow ‘Halving’ events previously affected Litecoin rewards? The last two Litecoin ‘Halving’ events were recorded during 2015 and 2019: The 2015 Litecoin ‘Halving’ reduced the block reward from 50 LTC per block to 25 LTC per block, whereas the 2019 Litecoin ‘Halving’ reduced the block reward from 25 LTC per block to 12.5 LTC per block.\n\nThe halving of Litecoin can significantly affect its price due to the changes it will bring to LTC's supply and demand. As a consequence of the reduction in the block reward, the supply and issuance of new Litecoin in the market will be reduced or constrained.\n\nIf demand remains constant or increases, the scarcity of Litecoin could lead to speculative buying, which would drive the prices up. (‘Speculative buying’ is buying an asset that can earn you gains quickly. However, with ‘speculative buying’, there is an increased chance of big losses as well.)\n\nThis potentially positive trend in Litecoin can also influence the Altcoin market as a whole, increasing interest and investment in all Altcoins.\n\nHow Litecoin ‘Halving’ can affect Altcoin prices\n\nThis potentially positive trend in Litecoin can also influence the Altcoin market as a whole, increasing interest and investment in all Altcoins. Separately, it may also contribute to a positive trend in Bitcoin, given that both currencies share technological similarities, thereby strengthening other cryptocurrencies and the market as a whole.\n\nThe second comparable event is the ‘Halving’ of Bitcoin rewards next year, which will reduce miner rewards from 6.25 BTC to 3.125 BTC.\n\nBitcoin prices fluctuates a lot before ‘Halving’ events If we look at Bitcoin's recent prices, after a significant decline last October to nearly $15,782 (Dh57,968), prices rose to $16,547.91 (Dh60,781.55) in January this year. Since then, Bitcoin prices doubled, bringing the total crypto market back to $1.181 trillion (Dh4.34 trillion, as of July 31, 2023).\n\n\n\nIn particular, Bitcoin rose to $30,000 (Dh110,191) by mid-April this year, fluctuating throughout May and June, and reaching $31,474.72 (Dh115,608) on July 14 - its highest value since the beginning of the year. As of the time of this writing, Bitcoin is worth $29,407.12 (Dh108,014.26).\n\n\n\nBitcoin ‘Halving’ events boosted prices in the past\n\nHowever, the current price trajectory of Bitcoin could see a further positive jump, especially while anticipating the upcoming Bitcoin ‘Halving’. Historically, Bitcoin's ‘Halving’ has had a significant effect on its price.\n\nFor instance, the previous ‘Halving’ of Bitcoin in 2020 triggered a considerable gain, that drove its price to $64,900 (Dh238,381.92) in the following months. Hence, observing past patterns, we can anticipate a looming boom for Bitcoin.\n\nUltimately, whether the impact of ‘Halving’ will bring a surge and new highs or a decline, it will take time to play out.\n\nBottom line?\n\nIn a nutshell, the cryptocurrency market is making a comeback. Many are anticipating how the Litecoin and Bitcoin ‘Halving’ events will shake-up markets, while speculating on the effects they will have on the prices of these currencies and their performance.\n\nUltimately, whether the impact of ‘Halving’ will bring a surge and new highs or a decline, it will take time to play out. So as an investor, you will need to undertake additional analysis and keep an eye on such trends that could affect the cryptocurrency market in the near future."
    }
]