[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3Lm5lcmR3YWxsZXQuY29tL2FydGljbGUvaW52ZXN0aW5nL2hvdy1tYW55LWJpdGNvaW5zLWFyZS10aGVyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "How Many Bitcoins Are There? - NerdWallet",
        "content": "NerdWallet, Inc. is an independent publisher and comparison service, not an investment advisor. Its articles, interactive tools and other content are provided to you for free, as self-help tools and for informational purposes only. They are not intended to provide investment advice. NerdWallet does not and cannot guarantee the accuracy or applicability of any information in regard to your individual circumstances. Examples are hypothetical, and we encourage you to seek personalized advice from qualified professionals regarding specific investment issues. Our estimates are based on past market performance, and past performance is not a guarantee of future performance.\n\nWe believe everyone should be able to make financial decisions with confidence. And while our site doesn’t feature every company or financial product available on the market, we’re proud that the guidance we offer, the information we provide and the tools we create are objective, independent, straightforward — and free.\n\nSo how do we make money? Our partners compensate us. This may influence which products we review and write about (and where those products appear on the site), but it in no way affects our recommendations or advice, which are grounded in thousands of hours of research. Our partners cannot pay us to guarantee favorable reviews of their products or services. Here is a list of our partners."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzA1L2JpdGNvaW4tZmFjZXMtZG93bnNpZGUtcmlza3Mtb24taGVhZC1hbmQtc2hvdWxkZXJzLXBhdHRlcm4tdXMtbm9uZmFybS1wYXlyb2xscy1leWVkL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzA1L2JpdGNvaW4tZmFjZXMtZG93bnNpZGUtcmlza3Mtb24taGVhZC1hbmQtc2hvdWxkZXJzLXBhdHRlcm4tdXMtbm9uZmFybS1wYXlyb2xscy1leWVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin Chalks Out 'Head and Shoulders' Pattern Ahead of U.S. Nonfarm Payrolls: Valkyrie Investments - CoinDesk",
        "content": "While a graphical representation of price action in the form of lines or candlesticks helps illustrate psychology, the patterns are a subjective form of analysis and often do not work as intended. In other words, a breakdown of the head and shoulders may not always lead to a more profound price drop and can trap traders on the wrong side of the market."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLW91dGxvb2stYmFuay1jcmlzaXMtcmVjZXNzaW9uLWhhbHZpbmctZmVkLXJhdGUtY3V0LTIwMjMtNdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Bitcoin Could More Than Double and Hit a New Record High Next Year - Markets Insider",
        "content": "Bitcoin could hit a new record high next year, said Bob Ras, cofounder of blockchain firm Sologenic.\n\nHe cited bitcoin halving, which will reduce mining rewards and supply of the token.\n\nThe banking crisis and expectations that the Fed will start easing may also lift bitcoin, he added.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin has soared more than 74% to start 2023, but the world's most popular token by market cap could more than double by next year, according to Bob Ras, cofounder of blockchain firm Sologenic.\n\nA key catalyst will be the halving process, which is when the reward for miners is cut in half. It's meant to cut the supply of tokens and historically has sparked price increases.\n\n\"When bitcoin's halving kicks in a year from now, we'll likely be well on our way past the previous all-time high,\" Ras told Insider.\n\nThat would mean bitcoin soars past the $67,000 level reached in November 2021, up from about $29,000 on Friday.\n\nAdvertisement\n\nMeanwhile, bitcoin appears to be front-running the belief that looser policy from the Federal Reserve is on the way, Ras explained.\n\nThe Fed on Wednesday hiked rates for the 10th consecutive time, but Wall Street widely expects that to be the last increase of this tightening cycle.\n\nHe thinks the token's rally points to a future that is effectively a return to lower rates and more quantitative easing.\n\nTechnical indicators, such as long-term moving averages, suggest upside and momentum, he said, but it's the broader landscape that will determine its performance the rest of the year. And he wouldn't be surprised if bitcoin hits $40,000 by the end of 2023.\n\nAdvertisement\n\n\"Coupled with signs of slowing [economic] growth, the changing macro picture is pointing towards a Fed that will likely soon have to cut interest rates and inject a lot of liquidity into the market,\" Ras said. \"If the Fed doesn't do this, then we could face a serious contraction, punctuated by a possible credit crunch. Either way, all roads appear to be leading to a loosening of monetary policy sooner rather than later.\"\n\nRas isn't alone in his bullishness. Standard Chartered published a recent note that said bitcoin could soar to $100,000 by the middle of next year, and Matrixport predicted that bitcoin could more than double to about $65,000 by next April.\n\nA hedge against financial turmoil\n\nAs the banking crisis that started with Silicon Valley Bank in March continues to spark contagion fears, more retail and institutional investors have been turning to bitcoin as a hedge, Ras said.\n\nThat turmoil re-emerged over the past week as regulators seized First Republic on Monday and sold the bulk of its assets to JPMorgan, triggered sell-offs at regional banks PacWest Bancorp and Western Alliance.\n\nAdvertisement\n\n\"The banking crisis helped to cement the narrative of bitcoin serving as a key store of value that lacks the sort of counterparty risk of holding funds by way of bank deposits,\" Ras said. \"Bitcoin offers protection by way of decentralization, self-custody and a network that has never been hacked.\"\n\nBut a credit crisis poses the biggest downside risk for bitcoin, he said. In such a scenario, bitcoin as well as gold, another traditional safe-haven investment, could see a sharp decline in value.\n\n\"I'm not sure such a scenario would happen,\" Ras said, \"but it's possible and would unleash a tremendous amount of volatility, not only for bitcoin but all markets.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmV1cm9uZXdzLmNvbS9uZXh0LzIwMjMvMDUvMDUvYmh1dGFuLWhhcy1zZWNyZXRseS1taW5lZC1iaXRjb2luLWluLXRoZS1oaW1hbGF5YXMtZm9yLXllYXJzLWFuZC1pdC1kaWQtc28tc3VzdGFpbmFibHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bhutan has secretly mined Bitcoin in the Himalayas for years - and it did it sustainably - Euronews",
        "content": "The South Asian kingdom hopes to become the second country in the world to run its state-owned crypto mine.\n\nADVERTISEMENT\n\nBhutan, a South Asian kingdom nested in the Himalayan mountains, has recently revealed a secret that stunned the international financial market: the country has been quietly mining crypto for years without telling a soul - including its own citizens.\n\nAn even more stunning revelation was that the country has been able to mine crypto in a sustainable way compared to more commonly used methods which have been widely criticised for the large amounts of electricity required.\n\nBhutan has been able to mine for tokens using its massive stores of hydroelectricity - a renewable source of energy that can be largely considered to be “green”.\n\nBhutan has an abundance of hydroelectricity - a form of renewable energy that uses the power of moving water to generate electricity - thanks to the ancient glaciers feeding the many rivers flowing through the country.\n\nEnergy generated by hydroelectricity is currently fuelling the homes of most of the country’s 777,000-strong population, and it represents 30 per cent of the country’s gross domestic product (GDP).\n\nBut Bhutan’s recently revealed secret shows that the country has also been putting this immense resource to work for another purpose that could boost and sustain its economy in the future: the creation of its own crypto mines.\n\nBhutan is not alone in betting on cryptocurrencies for its future. The Central American state of El Salvador is currently the only country in the world to run state-owned crypto mines.\n\nWith its small size and limited resources, green crypto mining could be the solution to Bhutan’s economic independence, a country that has struggled for years to establish its self-sufficiency.\n\nBhutan has the advantage of its resources and environment making the country an ideal space for digital asset mining operations.\n\nHydroelectricity is cheap, and the country’s mountains, being so tall, provide the perfect environment to cool down heated-producing computers that are busy mining for Bitcoin. The country’s crypto mines could, at least on paper, have little to no carbon footprint at all.\n\nWhy was this a secret - and why has it now been revealed?\n\nThe South Asian kingdom has reportedly been mining “for years,” though it’s not exactly clear for how long, where, or what earnings did it make.\n\nSpeaking to a local newspaper The Bhutanese, a government representative recently said that the country has begun mining “a few years ago as one of the early entrants when the price of Bitcoin was around $5,000 (€4.548)”.\n\nThe price of Bitcoin has since soared to $29,228.12 (€26.591,74) as of Friday.\n\nThe reason why the country has shared its secret crypto-mining operations might be linked to the fact that the kingdom is now looking for partners to further expand its project.\n\nThe country’s investment arm, state-owned holding company Druk Holding & Investments (DHI), and Nasdaq-listed mining company Bitdeer are reportedly seeking investors for $500 million (€454.9 million) to be used to develop green crypto mining in the kingdom.\n\nFundraising to create Bhutan’s carbon-free digital mining will begin at the end of May, as reported by Bloomberg.\n\nMeanwhile, Bhutan’s larger neighbours - India and China - remain wary of crypto.\n\nBoth India’s government and central bank have taken a strong stance against it, while China officially banned crypto trading in 2021."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTA1L2JpdGNvaW4tYnRjLXBlcnBldHVhbHMtc2Vlbi1iZWNvbWluZy1hbi1ldmVuLWJpZ2dlci1kcml2ZXItb2YtcHJpY2Vz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin Perpetuals Seen Becoming an Even Bigger Driver of Prices - Bloomberg",
        "content": "Bitcoin perpetual futures, one of the most popular derivatives contracts in crypto markets, are increasingly driving the largest digital token’s price.\n\nThat’s according to Conor Ryder , research analyst at Kaiko, who points out that the Bitcoin perpetuals-to-spot-volume ratio is at its highest in nearly two years. Perps, as they’re sometimes known in industry parlance, don’t expire and have been hugely popular with traders as the derivatives market is a place where a lot of speculation can occur, according to the researcher."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3doby1icm9rZS1iaXRjb2luLW9yZGluYWxz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Who 'Broke' Bitcoin Ordinals? What Does it Mean? - Blockworks",
        "content": "A pseudonymous Bitcoin and Lightning Network developer going by the name “Supernestnet” was poking around Ordinal Theory — Ordinals for short — on Thursday, when he discovered a bug.\n\nOrdinals are an attempt to make Bitcoin fun again. They allow text, images and code to be “inscribed” on a satoshi — the smallest denomination of bitcoin. Each satoshi has a unique number between 0 and (eventually) 2,100 trillion, assigned in the order in which they are mined. While usually thought of as fungible, the Ordinals protocol makes them non-fungible, like an NFT.\n\nJust as each satoshi is numbered, each Ordinals inscription has a number — there are more than 3.7 million of them to date.\n\nSupernestnet found a way to break inscription numbers, by inscribing a satoshi that he didn’t own. Then, just as he inadvertently riffed on the Bhagavad Gita, thinking it was an homage to the film Oppenheimer, he also asked rhetorically whether he had “broken” Ordinals.\n\nSource: https://github.com/supertestnet/breaker-of-jpegs\n\nNot so much, according to Danny Diekroeger, founder and CEO at Deezy, who works on infrastructure for the Lightning Network.\n\nLoading Tweet..\n\n“Inscription numbers are just a vanity metric putting an order to which inscriptions came first,” he tweeted. “[S]ome collectors like having the 100,000th inscription, for example…these are all messed up now, because [Supertestnet]’s transaction exposed some logic in the software.”\n\nIt was an “edge case” and only provides a new example of a known issue, according to Ordinals advocate, LeonidasNFT. They said on Twitter, “there has been debate about inscription numbers being off by a lot more than one for almost three months now.”\n\nPlus, it may all have been a marketing ploy.\n\nIs it funny? A little. Is it important? Not really.\n\nWhat is notable is that mean-average transaction fees have increased by just shy of 300% in the past two weeks, according to a Galaxy Research note on Friday.\n\nIt currently costs between $5 and $6 to get a transaction through the Bitcoin mempool.\n\nThat’s one of the points of Ordinals, as its originator, Casey Rodarmor, noted right off the bat: “Since Bitcoin requires the development of a robust fee market, this is a strong positive of the proposal.”\n\nBut the recent bump in transaction fees likely has more to do with the “DeFi on Bitcoin” efforts around the BRC-20 token standard, which shares a similar technique with Ordinals but is used differently.\n\nGalaxy Research views this as “a notable development for Bitcoin,” but whether it has any long-term significance remains to be seen. It seems rather like trying to fit a diamond peg in a round hole.\n\nBut fine: Experiments are being run on Bitcoin. Some people think it’s fun and good for Bitcoin. Others are mad.\n\nBitcoin continues, as always, just with slightly higher transaction fees.\n\nIn any case, Supertestnet has now changed their story.\n\nLoading Tweet..\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy93aHktYml0Y29pbi1taXhlcnMtYXJlLWEtZG91YmxlLWVkZ2VkLXN3b3JkLWZvci1hbnRpLW1vbmV5LWxhdW5kZXJpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Why Bitcoin Mixers Are a Double-Edged Sword for Anti-Money Laundering Efforts - Brave New Coin Insights",
        "content": "Why Bitcoin Mixers Are a Double-Edged Sword for Anti-Money Laundering Efforts\n\nAlthough bitcoin mixers are frequently targeted by financial regulators in relation to anti-money laundering efforts, they are also used for a range of legitimate purposes such as protecting financial privacy and avoiding nefarious transaction monitoring.\n\nBitcoin has become one of the world’s most popular forms of payment due to its convenience, speed, and low transaction fees. However, as more and more people use bitcoin for everyday transactions, privacy concerns have arisen. Bitcoin transactions are pseudo-anonymous, meaning that while transactions are recorded on a public blockchain, the identities of the sender and recipient are not necessarily known. This anonymity has made bitcoin a popular choice for those who value their privacy. However, the pseudo-anonymity of bitcoin has also made it attractive to criminals who use it for illegal activities such as money laundering. Since on-chain analytics companies can easily trace any blockchain transaction, more and more crypto users prefer coin-anonymizing services such as bitcoin mixers or bitcoin tumblers.\n\nBitcoin mixers have become a popular tool for those who want to keep their financial transactions private. While the concept of bitcoin mixers may seem innocent enough, they have become a double-edged sword in the fight against money laundering. According to a report by Chainalysis, a blockchain analytics company, the total value of bitcoin transferred through mixers increased from $11 million in 2022 to $67 million in 2023. This represents an increase of 500% in just one year. In this article, we will explore why bitcoin mixers are problematic for anti-money laundering efforts and how they can be used in a positive way.\n\nThe Dark Side of Bitcoin Mixers\n\nBitcoin mixers are online services that allow users to mix their bitcoins with other users’ bitcoins. This process is also known as bitcoin mixing or bitcoin tumbling. The idea behind bitcoin mixing is to make it difficult for anyone to trace a bitcoin transaction back to its original owner.\n\nThis anonymity is a major problem for anti-money laundering efforts. Criminals can use bitcoin mixers to launder money by mixing their illegally obtained bitcoins with legitimate ones. The process of mixing makes it almost impossible to trace the illegal bitcoins back to their original source.\n\nAccording to a report by the Financial Action Task Force (FATF), an intergovernmental organization that develops anti-money laundering guidelines, bitcoin mixers are one of the biggest threats to anti-money laundering efforts in the cryptocurrency space. The report states that mixers are mostly used by criminals to launder money and avoid detection by law enforcement. Although cryptocurrencies are often singled out by politicians and enforcement agencies when discussing money laundering, the reality is that crypto-related money laundering is a drop in the bucket compared to the global money laundering total.\n\nFor example, in 2021 Chainalysis estimated around US$9 billion was laundered using cryptocurrencies. In the same time period, the United Nations office on Drugs and Crime estimated total global money laundering to be at least $800 billion annually – and potentially up to $2 trillion. Even more surprising is the number of respected international banks that were fined in 2021 in relation to breaches of anti-money laundering laws and regulations.\n\nThe Positive Side of Bitcoin Mixers\n\nWhile bitcoin mixers are problematic for anti-money laundering efforts, they are also used for legitimate purposes. Many people use bitcoin mixers to protect their financial privacy and avoid potential transaction monitoring. For example, when someone buys something online using bitcoin, they may not want the seller to know their identity. By using a bitcoin mixer, they can ensure that their transaction is anonymous and cannot be traced back to them. Bitcoin mixing can help protect them from potential fraud or identity theft.\n\nBitcoin mixers are also often used by businesses to protect their financial information from competitors. If a company is making a large transaction, it may not want its competitors to know how much money it is moving. By using a bitcoin mixer, they can ensure that their transaction is private and cannot be traced back to them.\n\nAnother reason for seeking transaction privacy is political persecution. Of 205 countries and territories surveyed by Freedom House recently, in terms of their political rights and civil liberties, the NGO found 125 to be either ‘not free’ or only ‘partly free’. Political movements are costly to organise, and cutting of access to funding is a common tactic of oppressive governments.\n\nIn terms of personal security, bitcoin mixers can be used by law-abiding citizens to protect themselves from hacking and theft. By mixing their bitcoins with others, users can disguise the origin of their funds, making it more difficult for hackers to target them.\n\nTendencies to Regulate the Use of Bitcoin Mixers\n\nAs bitcoin has grown in popularity, there have been attempts by governments and regulators to bring it under their control. This has led to discussions about the regulation of bitcoin mixers, which are seen by some as only a tool for money laundering. In some countries, bitcoin mixers are currently illegal or operate in a legal gray area.\n\nFor example, in the United States, the use of bitcoin mixers is considered a violation of anti-money laundering laws, while in Japan, bitcoin mixers can only operate if they are licensed by the government. Similarly, in the European Union, bitcoin mixers are subject to anti-money laundering regulations and must comply with Know Your Customer (KYC) and Anti-Money Laundering (AML) requirements.\n\nConclusion\n\nBitcoin mixers are a double-edged sword for anti-money laundering efforts. While they can be used for illicit purposes, they also have legitimate uses in protecting financial privacy and preventing hacking and theft. It is important for governments and regulators to strike a balance between preventing illicit activity and protecting the legitimate uses of bitcoin mixers. Furthermore, the positive aspects of bitcoin mixers should not be overlooked. They are an important tool for individuals and businesses seeking to protect their financial privacy and secure their funds. The use of bitcoin mixers can help increase the adoption and mainstream acceptance of cryptocurrencies, which can lead to greater financial inclusion and economic empowerment. To fully realize the benefits of bitcoin mixers, it is important to promote transparency and collaboration between governments, regulators, and the cryptocurrency community. By working together, we can ensure that bitcoin mixers are used in a way that is responsible, legal, and beneficial for everyone. Ultimately, bitcoin mixers are an important tool in the cryptocurrency landscape that can be used for both good and bad. By recognizing their potential and working to mitigate their negative effects, we can create a safer and fairer financial system for all."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcmdlbnRpbmEtYmFucy1wYXltZW50LWFwcHMtb2ZmZXJpbmctMTgwNjU4ODk2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Argentina Bans Payment Apps From Offering Bitcoin to Customers - Yahoo Finance",
        "content": "Argentina’s central bank is clamping down on crypto. In a statement yesterday, the bank said that payment platforms are now banned from offering digital assets like Bitcoin to customers.\n\nThe Central Bank of the Argentine Republic (BCRA) said that the reason was to “mitigate risks.”\n\nA number of popular companies—including fintech giant Ualá and online marketplace Mercado Libre—offer clients crypto trading.\n\n“Payment service providers that offer payment accounts may not carry out or facilitate transactions with digital assets, including cryptoassets, that are not regulated by the competent national authority and authorized by the Central Bank of the Argentine Republic (BCRA) to their customers,” the Thursday statement said.\n\nLos proveedores de servicios de pago no podrán realizar operaciones con criptoactivos ni facilitarlas desde sus aplicaciones o plataformas web.\n\nLas personas interesadas deberán realizar las operaciones por su cuenta.\n\n🔽https://t.co/IKivQUQiMG — BCRA (@BancoCentral_AR) May 4, 2023\n\nThe bank did not expand on why, other than to protect customers, in the announcement.\n\nIt now means that major platforms, including Mercado Libre, Latin America’s answer to Amazon, will no longer be able to offer Argentinians Bitcoin buying services.\n\nArgentina—Latin America’s third largest economy—right now suffers from one of the worst inflation rates in the world: It soared past 100% last month for the first time in three decades.\n\nA number of crypto startups in the country and even one popular presidential candidate have preached the use of Bitcoin as a savior for ordinary Argentinians who cannot save or are being pushed into poverty because of the collapse of the peso.\n\nAlthough cryptocurrencies aren’t regulated in the South American nation, they are becoming popular. Blockchain data firm Chainalysis has said Argentina is one of the fastest-growing cryptocurrency markets; last year it ranked it at number 13 in its 2022 Global Crypto Adoption Index.\n\nBitcoin Traders in Argentina Restricted From Buying Dollars\n\nBuenos Aires, the country’s capital, last year hosted the major LaBitConf event where a number of cryptocurrency bigwigs—including MicroStrategy boss Michael Saylor and Ethereum co-founder Vitalik Buterin—spoke about Argentina’s growing role in the crypto ecosystem."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tZW1lY29pbi1oeXBlLWRyaXZlcy1iaXRjb2luLXRyYW5zYWN0aW9uLWZlZXMtdG8tbXVsdGkteWVhci1oaWdoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Memecoin hype drives Bitcoin transaction fees to multi-year highs - Cointelegraph",
        "content": "The ongoing trading frenzy of memecoins like Pepe Coin (PEPE) has triggered an unwanted consequence for Bitcoin (BTC) — driving its transaction costs to multi-year highs.\n\nBitcoin transaction fees surged in early May, reaching their highest point over the past two years, according to data from Crypto Fees.\n\nOn May 3, the total amount of fees paid on the Bitcoin blockchain reached $3.5 million, jumping about 400% from late April. The average Bitcoin transaction fee reached as much as $7.2, according to YCharts.\n\nTotal Bitcoin transaction fees between May 2021 and May 2023. Source: CryptoFees\n\nThe latest increase in BTC transaction fees is primarily attributed to a surge in Bitcoin activity involving BRC-20 transactions. According to data from Galaxy Research, 50% of all Bitcoin transactions on May 2 were related to BRC-20 transactions.\n\nModeled after Ethereum’s ERC-20 token standard, BRC-20 is an experimental token standard allowing users to issue and transfer fungible tokens on the Bitcoin blockchain. The standard was introduced in March 2023 by a pseudonymous on-chain analyst known as Domo.\n\nThe BRC-20 token standard has quickly become a major trend in the cryptocurrency industry, specifically amid the sharp growth of the PEPE memecoin. The token has rallied more than 600% over the past seven days, reaching its all-time high of $0.00000216 on May 5.\n\nPEPE 30-day price chart. Source: CoinGecko\n\nThe Bitcoin blockchain isn’t the only blockchain affected by the ongoing memecoin hype. Gas fees on the Ethereum blockchain have also been skyrocketing to new multi-month highs recently.\n\nOn May 2, ETH transaction fees hit an aggregate amount of more than $19 million, a level not seen since May 2022, according to Crypto Fees. The Ethereum blockchain remains the most expensive network in terms of transaction fees at the time of writing.\n\nRelated: Bitcoin miners have earned $50B from BTC block rewards, fees since 2010\n\nDespite the latest spike in Bitcoin transaction fees, the current BTC transaction cost is still far from all-time high levels. The highest Bitcoin transaction fees were recorded in April 2021, when the average BTC transaction cost almost reached $70 amid a major decline in the Bitcoin network hash rate. The previous highest point in BTC transaction fees was in 2017, with transaction costs surging above $60.\n\nMagazine: Asia Express: Justin Sun’s SUI-farming sins, PEPE’s wild run, 3AC’s oyster philosophy"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xMzkwNjgvYXJnZW50aW5hcy1jZW50cmFsLWJhbmstY2xhbXBzLWRvd24tb24tYml0Y29pbtIBTmh0dHBzOi8vZGVjcnlwdC5jby8xMzkwNjgvYXJnZW50aW5hcy1jZW50cmFsLWJhbmstY2xhbXBzLWRvd24tb24tYml0Y29pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Argentina Bans Payment Apps From Offering Bitcoin to Customers - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nArgentina’s central bank is clamping down on crypto. In a statement yesterday, the bank said that payment platforms are now banned from offering digital assets like Bitcoin to customers.\n\nThe Central Bank of the Argentine Republic (BCRA) said that the reason was to “mitigate risks.”\n\nA number of popular companies—including fintech giant Ualá and online marketplace Mercado Libre—offer clients crypto trading.\n\nAD\n\nAD\n\n“Payment service providers that offer payment accounts may not carry out or facilitate transactions with digital assets, including cryptoassets, that are not regulated by the competent national authority and authorized by the Central Bank of the Argentine Republic (BCRA) to their customers,” the Thursday statement said.\n\nLos proveedores de servicios de pago no podrán realizar operaciones con criptoactivos ni facilitarlas desde sus aplicaciones o plataformas web.\n\nLas personas interesadas deberán realizar las operaciones por su cuenta.\n\n🔽https://t.co/IKivQUQiMG — BCRA (@BancoCentral_AR) May 4, 2023\n\nThe bank did not expand on why, other than to protect customers, in the announcement.\n\nIt now means that major platforms, including Mercado Libre, Latin America’s answer to Amazon, will no longer be able to offer Argentinians Bitcoin buying services.\n\nArgentina—Latin America’s third largest economy—right now suffers from one of the worst inflation rates in the world: It soared past 100% last month for the first time in three decades.\n\nAD\n\nAD\n\nA number of crypto startups in the country and even one popular presidential candidate have preached the use of Bitcoin as a savior for ordinary Argentinians who cannot save or are being pushed into poverty because of the collapse of the peso.\n\nAlthough cryptocurrencies aren’t regulated in the South American nation, they are becoming popular. Blockchain data firm Chainalysis has said Argentina is one of the fastest-growing cryptocurrency markets; last year it ranked it at number 13 in its 2022 Global Crypto Adoption Index.\n\nBuenos Aires, the country’s capital, last year hosted the major LaBitConf event where a number of cryptocurrency bigwigs—including MicroStrategy boss Michael Saylor and Ethereum co-founder Vitalik Buterin—spoke about Argentina’s growing role in the crypto ecosystem."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LnRvbXNoYXJkd2FyZS5jb20vbmV3cy91cy1iaXRjb2luLW1pbmluZy1jb25zdW1lZC01MC1iaWxsaW9uLWt3aC1vZi1lbmVyZ3ktaW4tMjAyMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "U.S. Bitcoin Mining Consumed 50 Billion kWh of Energy in 2022 - Tom's Hardware",
        "content": "There've been rivers of ink written on all aspects of cryptocurrency ever since that fateful day of the Bitcoin whitepaper publishing. Still, one question that's repeatedly brought to the limelight (and understandably so) surrounds energetic and environmental sustainability. Now, the White House itself is adding fuel to the fire through its DAME Tax proposal, whose aim is, and we quote: \"making cryptominers pay for costs they impose on others.\"\n\nHow, you ask? By phasing in an additional 30% tax penalty for cryptocurrency mining firms on any energy they consume in that process. According to the White House, this is \"an example of the President's commitment to addressing both long-standing national challenges as well as emerging risks – in this case, the economic and environmental costs of current practices for mining crypto assets.\" The idea is simple: Bitcoin mining consumes a lot of power; this consumption drives electricity prices up; which is bad for everyone unfortunate enough to share a grid with a cryptocurrency mining firm.\n\nIt seems that the White House's hand has been forced by their very own report, which estimates total Bitcoin mining energy consumption in 2022 at an eye-watering 50 billion kilowatt-hours (in fact, the estimate places consumption anywhere between the low of 30 billion kWh and a high of 60 billion kWh). That's greater power consumption than all operating computers in the United States put together - and within the margin of error of the countrywide electrical consumption for as basic a necessity as lighting.\n\nIt's also more energy than Americans consume through their TV sets, and it's right here, in a nice graph:\n\n(Image credit: The White House)\n\nLet's get this straight right off the bat: public and private lighting is definitely (and inarguably) more important than Bitcoin mining.\n\nHowever, some arguments favoring the proposal seem to be mired in inconsistencies. Back when Intel announced its \"Bonanza Mine\" cryptocurrency mining chips, we took a relatively detailed look at Bitcoin's global power consumption and the utility that can already be extracted from it: anyone who has taken profits can attest to its utility; anyone who sold anything to someone and got paid in Bitcoin can attest to its utility; so can anyone who crossed an embattled border while invisibly carrying their wealth, or the citizens of El Salvador, where Bitcoin is legal tender. I'd be interested to know which process the White House used to quantitatively analyze cryptocurrency applications' social benefits before concluding that they \"are yet to materialize.\"\n\nThere's also the question of what amount of Bitcoin's energy consumption actually hails from carbon-intensive sources; according to the Bitcoin Mining Council (BMC), a global forum of mining companies that represents 48.4% of the worldwide Bitcoin mining network, it's estimated that in Q4 2022, renewable energy sources accounted for 58.9% of the electricity used to mine bitcoin - against an estimated 36.8% as of Q1 2021.\n\nIt'll be interesting to see what results from this legislative push. For one, a 30% tax for cryptocurrency mining firms would drive most of them out of business, resulting in a concentration of hashing power in the hands of the few firms with strong enough financials to stand above the waterline. That would be terrible for Bitcoin, whose network security assumes that processing power is distributed, not concentrated. We wouldn't go so far as saying that Bitcoin Core devs would be open to changing Bitcoin's security model from Proof of Work (the cause for the monumental energy consumption) to Proof of Stake (Ethereum did this transition through its Merge, basically cutting its energy consumption on transaction validation by over 99%). But Ethereum isn't Bitcoin, and Bitcoin isn't the only Proof of Work cryptocurrency out there."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9sZWFybi9zZWN1cml0aWVzLXZzLWNvbW1vZGl0aWVzLXdoeS1pdC1tYXR0ZXJzLWZvci1jcnlwdG8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Securities vs. Commodities: What's the Difference and Why it Matters For Crypto - CoinDesk",
        "content": "The principal way in which issuers seek to avoid violating securities law is through decentralization. If a cryptocurrency is developed in such a way that a securities regulator could not identify a central, coordinated group responsible for driving up the value of the token, then the asset is less likely to be considered a security. That is one reason why decentralized finance (DeFi) projects take measures to decentralize the development of their projects and split up governance with decentralized autonomous organizations (DAOs), as well as involve mechanisms like proof-of-stake as a consensus mechanism. The argument being that if people are both investors as well as participate in the growth of the project, either by staking the coin and becoming validators, or voting in DAO decisions, they are no longer solely relying on the “third party” to produce returns that the Howey test requires."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlci1leWVzLTYzay1idGMtcHJpY2UtZm9yLW5ldy1ib2xsaW5nZXItYmFuZHMtYnJlYWtvdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Bitcoin trader eyes $63K BTC price for new Bollinger Bands 'breakout' - Cointelegraph",
        "content": "Bitcoin (BTC) could be set for historic gains thanks to a simple trend line breakout, a popular trader hopes.\n\nIn a Twitter discussion on May 5, Titan of Crypto flagged a rare bull signal on the Bollinger Bands indicator for the Bitcoin monthly chart.\n\nBitcoin price may see “inexorable breakout”\n\nBTC price action currently impacts sentiment in different ways across various timeframes. While observers are unsure about short-term moves, the consensus remains that Bitcoin’s upside mainly lies ahead as the block subsidy halving approaches.\n\nWhen tracking what comes next, however, it may be enough to look at past halving cycles, specifically, volatility.\n\nAs Titan of Crypto notes, Bollinger Bands on monthly timeframes are setting up a repeat of a breakout event that has occurred only once in each cycle.\n\nIn the two previous instances shown on an accompanying chart from 2016 and 2019, BTC/USD broke through into the upper section of the Bollinger Band channel to see significant gains.\n\nBollinger Bands are a key volatility indicator across price timeframes. They revolve around a 20-period simple moving average (SMA) functioning as a midline, with two standard deviations above and below representing the channel.\n\nThese bands expand and contract with volatility and certain events: among them, the price coming into contact with the bands or even breaking beyond them is often considered important by traders.\n\nCurrently, the one-month BTC/USD chart shows the price attempting to break above the SMA line, which, if confirmed, would suggest a classic repeat of past bull runs.\n\nCommenting, Titan of Crypto described it as an “inexorable breakout.“\n\n”BTC is about to break its monthly Bollinger Bands base line. And when that happens 1st target will follow inexorably,” he added.\n\n“That would bring Bitcoin to a solid $63,500.”\n\nBTC/USD annotated chart. Source: Titan of Crypto/ Twitter\n\nWhile not quite enough to match its current all-time high, the price target could come around the point of the halving in one year’s time. How long it will need in reality remains to be seen, Titan of Crypto acknowledged.\n\nBTC price bides its time\n\nLast month, John Bollinger, the band’s creator, himself argued that Bitcoin was at a crucial point on daily timeframes.\n\nRelated: Is Bitcoin overbought or oversold? Use Bollinger Bands to find out!\n\nAt the time, the price was retesting the SMA line as support, breaking through to range around it. Now, however, it is heading higher toward the upper band, data from Cointelegraph Markets Pro and TradingView shows.\n\nBTC/USD 1-day candle chart (Bitstamp) with Bollinger bands. Source: TradingView\n\nSubsequently, analyst CryptoCon suggested that low-timeframe Bollinger Bands norms remained intact despite Bitcoin’s comedown from local highs of $31,000.\n\nEven with the last drop in #Bitcoin price, this time is still not different for the Bitcoin 3 Week Bollinger Bands!\n\n\n\nLarge corrections have always taken place after the upper parameter is met AND exceeded, but not a moment before\n\n\n\nThe price of the upper band is still $35,790 pic.twitter.com/kQol55Ovmh — CryptoCon (@CryptoCon_) April 29, 2023\n\nMagazine: Crypto audits and bug bounties are broken: Here’s how to fix them\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMDUvdXMtYWRkcy0yNTNrLWpvYnMtaW4tYXByaWwtdG9wcGluZy1leHBlY3RhdGlvbnMtZm9yLTE4MGsv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNS8wNS91cy1hZGRzLTI1M2stam9icy1pbi1hcHJpbC10b3BwaW5nLWV4cGVjdGF0aW9ucy1mb3ItMTgway9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "U.S. Adds 253K Jobs in April, Topping Expectations for 180K; Bitcoin Falls - CoinDesk",
        "content": "Though slowing modestly in recent months, the employment picture has remained strong, giving the U.S. Federal Reserve reason to continue to hike interest rates to try and bring inflation down to its 2% target. At its meeting earlier this week, the Fed raised the benchmark fed funds for a 10th consecutive time – bringing the targeted range to 5.0%-5.25% – but signaled it might pause rate hikes."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jYXNoLWFwcC1iaXRjb2luLXJldmVudWUtdG9wcy0yLWJpbGxpb24taW4tdGhlLWZpcnN0LXF1YXJ0ZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Cash App Bitcoin revenue tops $2B in the first quarter - Cointelegraph",
        "content": "Fintech firm Block, owned by Twitter founder Jack Dorsey, has reported a staggering $2.16 billion in Bitcoin (BTC) revenue on its bellwether product Cash App in Q1.\n\nAccording to a shareholder letter announcing its Q1 2023 earnings, Block (NYSE:SQ) reported that its Bitcoin revenue — which counts BTC revenue as total sales of the cryptocurrency to customers — was up 18% from $1.83 billion in Q4 and 25% from Q1 2022.\n\nOur Q1 earnings are now available. $SQ https://t.co/oGcnRuzFb3 — Block Investor Relations (@BlockIR) May 4, 2023\n\nCash App’s total profits reached over $931 million in the first quarter of 2023, marking a 49% increase year-over-year. Notably, Cash App’s profit paled compared to the company’s gross profit, which came in at $1.71 billion. Block also owns the popular business payment service Square, which reported a slight (3.8%) decline in profits from the fourth quarter of 2022.\n\nAccording to the shareholder letter, the multi-billion-dollar Bitcoin revenues were driven by “an increase in the quantity of Bitcoin sold to customers,” and were “partially offset” by a decrease in the market price of Bitcoin, compared to the same timeframe in 2022.\n\nThe fintech firm also reported an earning per share of 40 cents, beating analyst expectations of 35 cents per share by 14%, with its first-quarter revenue rising 26% year-on-year.\n\nBlock’s gross profits are up 32% year-on-year. Source: Block shareholder letter\n\nSpeaking to investors in the earnings conference call, Block CEO Jack Dorsey identified both artificial intelligence and “open protocols” as technologies that would aid the company in proactively responding to the “significant shifts” in the global financial system He cited continued United States bank failures and de-dollarization as the primary culprits.\n\nThe equities market took kindly to Block’s earnings filings. The fintech firm’s share price briefly surged 5% to $63.50 in after-hours trading, before settling down to a 2.5% gain at the time of publication.\n\nRelated: Jack Dorsey’s nano Bitcoin mining chip heads to prototype\n\nThis uptick marked the first instance of relief from a steady decline in Block’s share price, which suffered a significant 25% hit following the release of a scathing report penned by famed short sellers Hindenburg Research.\n\nOn March 23, Hindenburg slammed Block for “systematically taking advantage of the demographics it claims to be helping,” and declared that Block’s success with Cash App only hinged on a “willingness to facilitate fraud against consumers and the government.”\n\n“Hindenburg is known for these types of attacks, which are designed solely to allow short sellers to profit from a declined stock price,” wrote Block in response to Hindenburg’s allegations. “We have reviewed the full report in the context of our own data and believe it’s designed to deceive and confuse investors.”\n\nMagazine: Joe Lubin — The truth about ETH founders split and ‘Crypto Google’"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93YXRjaC10aGVzZS1iaXRjb2luLXByaWNlLWxldmVscy1uZXh0LWFzLWJ0Yy1kaXBzLTMtaW4tY2hvcHB5LXdlZWtlbmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Watch these Bitcoin price levels next as BTC dips 3% in choppy weekend - Cointelegraph",
        "content": "Bitcoin (BTC) saw fresh volatility on May 6 as low-liquidity weekend trading tested the mettle of its trading range.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBitcoin “in limbo” despite volatility\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD dropping by over $1,000, or 3%, in a matter of hours on the day.\n\nThe largest cryptocurrency saw volatile conditions typical of weekend trading but could not exit a broader corridor in place for several weeks.\n\nAmid a lack of ammunition to either clear the $30,000 resistance or drop toward key trend lines near $25,000, BTC/USD frustrated market participants.\n\n“Bitcoin really is in limbo right now and doesn’t know what to do .. I am back out of a position and just waiting again for one side of this range to break to re enter,” popular trader Crypto Tony told Twitter followers.\n\nAn accompanying chart showed potential targets in the event of a bearish breakdown.\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nAn additional analysis released earlier in the day repeated previous predictions of $32,000 coming into play should bullish momentum return.\n\n$BTC / $USD - Update\n\n\n\nWhile the attention is all on #Memecoins i am not surprised that we are literally seeing a stagnated #Bitcoin\n\n\n\nThe fun will continue sooner or later as it always does, but for now we plan ahead. A move to the high $32,000 would be perfect pic.twitter.com/m9uI3RmDln — Crypto Tony (@CryptoTony__) May 6, 2023\n\nIn separate coverage, fellow trader CryptoBullet described the day’s losses as “nothing special.”\n\n“Final dip before the breakout,” part of the commentary argued, with a chart presenting BTC/USD in a narrowing wedge with a decision on exit trajectory due.\n\n#Bitcoin $BTC 4h update\n\n\n\nNothing special about the current dump, just (e) in the making\n\n\n\nFinal dip before the breakout https://t.co/pFw8HX8jNq pic.twitter.com/ko4Q0nlkwE — CryptoBullet (@CryptoBullet1) May 6, 2023\n\nBTC price bulls must clear $30,000\n\nAs ever, longer timeframes were a cause for more optimistic views.\n\nRelated: Bitcoin trader eyes $63K BTC price for new Bollinger Bands ‘breakout’\n\nAnalyzing the weekly chart, analyst Gert van Lagen flagged the 200-week simple moving average (SMA) as the resistance line to clear next, with Bitcoin possibly completing a bullish inverse head and shoulders chart pattern.\n\nBTC/USD annotated chart. Source: Gert van Lagen/Twitter\n\nTrader and investor CryptoAce highlighted a large weekly resistance zone for bulls to tackle.\n\n“Stay below and $24k is where price will be trading in some weeks imo,” part of an update on trading activity read on the day.\n\n$BTC\n\nWeekly resistance block $29.7k - $31.5k\n\nStay below and $24k is where price will be trading in some weeks imo\n\n\n\nLast week took short from $29.7k & covered $28k\n\nNow looking to short above $29.5k till $31.5k for $24k https://t.co/uewwZLtMzc pic.twitter.com/BVtGahtLr7 — Cryptoce (@CryptoAceBTC) May 6, 2023\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tcmlzZXMtc29sYW5hLWxlYWRzLWxvc3Nlcy10b3AtMTAtY3J5cHRvcy11LXMtZG9sbGFyLXNsaWRlcy1iYW5raW5nLXNlY3Rvci1jb25jZXJucy_SAXRodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLXJpc2VzLXNvbGFuYS1sZWFkcy1sb3NzZXMtdG9wLTEwLWNyeXB0b3MtdS1zLWRvbGxhci1zbGlkZXMtYmFua2luZy1zZWN0b3ItY29uY2VybnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin rises, Solana leads losses across top 10 cryptos, U.S. dollar slides amid banking sector concerns - Forkast News",
        "content": "Bitcoin rose while Ether fell in Thursday afternoon trade in Asia, with declines across most of the other top 10 non-stablecoin cryptocurrencies by market capitalization. Solana’s SOL token was the biggest loser of the day. Asian equities were mixed, while U.S. stock futures strengthened in anticipation of April’s nonfarm payroll report. The U.S. dollar index fell, as woes at regional U.S. lenders PacWest and Western Alliance fueled market concerns of a banking crisis.\n\nSee related article: Crypto and NFT Market Update – May 4th\n\nCrypto\n\nBitcoin cryptocurrency trader, business person using modern technology electronic to trade with crypto money, stacked coins in the foreground and defocussed businessman in background\n\nBitcoin, the world’s largest cryptocurrency, rose 0.11% to US$29,124 in the 24 hours to 4:30 p.m. in Hong Kong. Ether fell 0.19% to US$1,899.\n\n“Bitcoin needs to close above US$32,000 to confirm an upward trend,” Tom Wan, a research analyst at 21.co, the parent company of 21Shares, an issuer of crypto exchange-traded products, wrote in an email to Forkast.\n\nSolana’s SOL token fell 0.98% to US$21.93 as the day’s biggest loser, followed by Dogecoin that slipped 0.77% to US$0.0787.\n\nThe global crypto market capitalization decreased by 0.07% to US$1.19 trillion, while total crypto market volume fell 20.02% to US$34.25 billion.\n\nNFT\n\nApeCoin, Otherside’s native token, which is also linked to the Bored Ape Yacht Club NFT collection, soared ahead of the Otherdeeds sale but has plunged since.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index fell 0.4% to 3,645.72 points in the 24 hours to 4:30 p.m. in Hong Kong and declined 1.85% during the week.\n\n24-hour NFT sales on the Ethereum network declined for a third consecutive day, falling 23.64% to US$13.9 million, despite a 47.40% surge in 24-hour sales for Azuki, the leading NFT collection on Ethereum. 24-hour sales for the Bored Ape Yacht Club declined 58.7% to US$872,793, according to CryptoSlam data.\n\nEquities\n\nImage: Envato Elements\n\nAsian equities were mixed on Friday. The Shenzhen Component Index fell 0.82%, the Shanghai Composite lost 0.48%, while Japan’s Nikkei 225 inched up 0.12% and Hong Kong’s Hang Seng Index increased 0.5%.\n\nInvestors continued to assess the global monetary policy outlook after the U.S. Federal Reserve and the European Central Bank raised interest rates by 25 basis points this week.\n\nU.S. stock futures strengthened as of 4:30 p.m. in Hong Kong. The tech-heavy Nasdaq-100 futures rose 0.43%, the Dow Jones Industrial Average futures strengthened 0.25% and the S&P 500 futures index gained 0.40%.\n\nU.S. nonfarm payroll data will be released later Friday. The world’s largest economy is expected to have added 180,000 jobs in April, which would be the smallest gain since December 2020, but well above the 70,000-100,000 monthly job gain needed to sustain the growth of the working-age demographic.\n\nThe U.S. dollar fell 0.12% to 101.2 points, weighed down by recession fears and banking woes after shares of Los Angeles-based PacWest fell over 50% yesterday following a Bloomberg report that the lender was exploring a sale or other capital-raising moves in the wake of the recent collapse of other banks.\n\nShares of Western Alliance bank holding company also plummeted over 60% on Thursday after a report alleged that it is exploring a potential sale. The company’s shares started recovering today after Western Alliance denied the report.\n\nSee related article: US response to crypto is like ‘deer caught in headlights,’ says ex-CFTC chair"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8wNS9wdW1wLXRoZS1icmNzLXRoZS1wcm9taXNlLWFuZC1wZXJpbC1vZi1iaXRjb2luLWJhY2tlZC10b2tlbnMv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA1LzA1L3B1bXAtdGhlLWJyY3MtdGhlLXByb21pc2UtYW5kLXBlcmlsLW9mLWJpdGNvaW4tYmFja2VkLXRva2Vucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Pump the BRCs: The Promise and Peril of Bitcoin-backed Tokens - CoinDesk",
        "content": "That’s the main point of the BRC-20 experiment – to see exactly what the new tech can do. When I reached out, Domo generously recommended a few resources for techies who want to dig deeper on BRC-20s. This basic intro for builders explains how to deploy BRC-20s and discusses some of the broader questions yet to be resolved. This is a more in-depth technical rundown by Domo. And this is a video introduction by YouTuber pazNGMI, which includes info on minting and wallets."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vd3d3LmNjbi5jb20vd2hhdC1pcy1jcnlwdG9jdXJyZW5jeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "What is cryptocurrency? Crypto explained simply. - CCN.com",
        "content": "Cryptocurrency, also known as digital or virtual currency, has become a popular form of investment and transaction. However, not all cryptocurrencies are the same.\n\nAt its core, cryptocurrency is a decentralized digital form of currency enabled to process financial transactions on the internet. Bitcoin was the first decentralized cryptocurrency launched in 2008 by Satoshi Nakamoto through the publication of a white paper called “Bitcoin: A Peer to Peer Electronic Cash System”.\n\nIn the crypto world, Bitcoin stands out as the leader of cryptocurrency and is widely recognized and highly regarded in this space as being robust and sound money.\n\nFor the last 14 years, Bitcoin and other digital currencies like Ethereum have emerged as alternatives to traditional government-issued fiat currencies. A fiat currency is a currency that is backed by a country and not a commodity like gold or silver, like the United States Dollar (USD).\n\nAt the start of 2023, the top ten cryptocurrencies by market capitalization include: Bitcoin, Ethereum, Binance Coin, Tether, Cardano, Polkadot, Dogecoin, XRP, Uniswap, and Solana. Market capitalization is the total value of the cryptocurrency asset when taking all the supply in circulation multiplied by the price.\n\nThese rankings of largest cryptocurrency coins fluctuate quickly in the dynamic world of cryptocurrencies and are likely to change throughout the year due to their speculative nature. Bitcoin and Ethereum are the two top competing cryptocurrencies in market capitalisation over the last decade as they have seen their total value grow year on year.\n\nCryptocurrency uses a unique, anonymous, and verifiable approach to making transactions peer-to-peer without using a third party involved, and is not controlled by a central authority.\n\nImagine you have a family member who is abroad and needs money over a weekend when banks are closed. By using crypto you can send money to your family member without the need of a bank. This is what it means to transact peer-to-peer: there is no third party involved.\n\nIt does this through the use of a decentralized open and public ledger, called the blockchain.\n\nA blockchain can be simply defined as a decentralized, digital ledger that records monetary transactions across a network of computers in a secure and transparent manner.\n\nCryptocurrencies will continue to be accepted in society because they address the key characteristics of money:\n\n– Durability of cryptocurrencies is supported by their decentralized and digital nature, which eliminates the risk of physical damage.\n\n– Divisibility allows for the creation of smaller units of the currency to facilitate transactions. Crypto enables micro transactions to be made.\n\n– Portability of cryptocurrencies is greatly enhanced by their digital form, which enables them to be stored and transferred easily through the internet.\n\n– Scarcity is ensured through the design of cryptocurrencies, with a limited supply of coins, preventing inflation.\n\n– Acceptability of cryptocurrencies is increasing as more merchants and individuals recognize and begin to accept them as a form of payment.\n\nHow Does Cryptocurrency Work?\n\nCryptocurrencies, like Bitcoin and Ethereum store transactions on a public ledger known as a blockchain. A blockchain can be thought of as a digital ledger available online for anyone to see and review. You can think of it in a similar fashion to a bank statement sent by the bank outlining all transactions you made at the end of each month.\n\nThe difference is that only authorized personnel and the client of the bank can review the transactions on a personal bank statement. Unlike an open-sourced blockchain which allows anybody to review all transactions. This ensures trust as the blockchain is verified by the whole of the network and can not be corrupted.\n\nEvery ten minutes all the Bitcoin transactions made globally are stamped together and put into an individual block or timestamp.\n\nThis ten minute block is then cryptographically chained to the previous block and cannot be changed or altered at any point in the future after it has been chained to the blockchain.\n\nCryptocurrency is created through a process called mining, which involves the use of computing power to solve complex mathematical problems which once solved miners are rewarded with newly minted coins every ten minutes.\n\nIf you are not a miner you can purchase cryptocurrencies from brokers and store them safely on cryptographic wallets which can be defined as hot or cold wallets.\n\nHistory of Cryptocurrencies\n\nDigital cryptography has been studied for decades and Bitcoin is an improvement on many past attempts at “digital cash” experiments like Hashcash in 1997, which was created by Adam Back who is a developer that is also cited in the Bitcoin white paper.\n\nHashcash was a cryptographic hash-based proof-of-work algorithm, which is a concept adopted by Satoshi in his white paper.\n\nOther cryptographers and pioneers in this space include personalities like David Chaum who was the first person to propose the idea for cryptocurrency in a paper published in 1983, outlining an early form of anonymous cryptographic electronic money.\n\nBitgold, which is often deemed a direct precursor to Bitcoin, was designed in 1998 by Nick Szabo, another cypherpunk and pioneer in the crypto space.\n\nOver the last fourteen years, the crypto space has seen thousands of coins enter the market. Bitcoin and a few others such as Ethereum and Litecoin are withstanding the test of time.\n\nToday the total market cap of the space has grown to $1 trillion USD, hitting highs of $3 trillion in the 2021 bull run. The total market cap has been forecasted by some analysts to touch the market cap of Gold at $8 trillion in mid-long term future and eventually hit $100 trillion once the space matures.\n\nTypes of Cryptocurrencies\n\nThe crypto space has different kinds of coins created for different purposes. Some of these include:\n\nProof-of-work coins that can be used to buy things, store value, or act as a commodity similar to gold and silver. These coins include but are not limited to Bitcoin (BTC), Litecoin (LTC) and Bitcoin Cash (BCH). Stablecoins are designed to maintain a stable value and are often pegged to a fiat currency such as the US dollar or gold. Some of the most popular stablecoins today are Tether (USDT), USD Coin (USDC), and Binance USD (BUSD). Proof-of-stake coins are cryptocurrencies that adopt a digital voting system where instead of miners using computers to solve complex math problems, a group of individuals are chosen to validate transactions based on the amount of digital coins they hold or “stake” in the network. The benefit of this concept is that there are large energy savings compared to the Proof-of-Work system. Ethereum (ETH), Cardano (ADA), and Solana (SOL) are three popular coins that use proof of stake. Defi coins are cryptocurrencies that were born as applications that use public blockchains and crypto assets to disrupt the traditional finance sector. Uniswap (UNI), Chainlink (LINK), and Aave (AAVE) are three popular coins that serve decentralized finance purposes. NFTs are non-fungible tokens that are unique digital assets that represent ownership or authenticity of a specific item or piece of content. NFTs are secured and backed by blockchain technology and cannot be duplicated. Each NFT is unique and cannot be tampered with. Ethereum, Algorand, and Tezos are some names competing in this space to produce NFTs.\n\nAdvantages of Cryptocurrencies\n\nCryptocurrency offers the alternative of better security using decentralization, faster and cheaper cross-border transactions, anonymity in transactions, and reduced dependence on traditional financial institutions.\n\nIt is an attempt at a modern monetary framework, which works in harmony with the internet, is open 24-7, and ensures freedom and empowerment through the use of true digital scarcity.\n\nIt eliminates the need for intermediaries which significantly lowers transaction costs.\n\nCryptocurrencies can pose as monetary lifeboats against resistance to the degradation of fiat versus inflation.\n\nIronically some consider Bitcoin as one of the hardest money known to man yet cannot even be touched or seen physically, due to its intangible nature.\n\nThis is a benefit because it allows its holder to migrate from country to country and all that individual needs to access the holdings is a seed. This cannot be done with cash or gold as an individual runs the risk to have their physical holdings confiscated when crossing borders.\n\nDisadvantages of Cryptocurrencies\n\nCryptocurrency also has several disadvantages. These include a lack of widespread acceptance to date, high price volatility, the risk of hacking or loss of funds, regulatory uncertainty, and limited consumer protections.\n\nIn addition, its complex background and groundbreaking technology can be confusing for the average person. It has also been associated with illegal activities which could slow down a wider acceptance.\n\nFinally, there is an age-old debate in the crypto space about the overuse of energy consumption concerns related to the process of mining the coins.\n\nCryptocurrency Mining\n\nMining is the application of high-performance computing systems using specialized application-specific integrated circuit (ASIC) chips.\n\nMiners receive new bitcoins as a reward for processing transactions through the reward protocol. The reward is distributed at a rate of 6.25 bitcoins every 10 minutes in a random and fair manner among miners who contribute to securing the network.\n\nThink of mining as an analogy to the process of finding physical gold. There is no guarantee that miners will discover gold, but those with the best resources have a higher likelihood of success. However, the outcome remains random.\n\nMining plays a critical role in securing the Bitcoin network and enables stakeholders to engage in transactions without intermediaries, even though the miners themselves are not intermediaries. Participants can freely join or leave the network at any time, thereby preserving their anonymity.\n\nCrypto Regulation\n\nRegulation has been debated over since cryptocurrency began a decade ago.\n\nToday many crypto enthusiasts and institutional investors are working with regulators to bring in regulation to help mature the industry.\n\nRegulatory uncertainty mainly surrounds crypto exchanges, stablecoins, security tokens, DEFI exchanges and yield products.\n\nThere are also questions about Over-the-counter (OTC) trading, margin loans, tax disclosures, and security disclosures still need to be answered, with the US who will likely set the global standard for regulation.\n\nIn America, the SEC and CFTC have unofficially classified Bitcoin as a commodity. This means that when regulation surfaces it will not be regulated as a security unlike other altcoins.\n\nIn Europe, The EU has voted against the banning of proof-of-work in 2022 which was deemed a positive move for crypto acceptance.\n\nCrypto Security\n\nBlockchain uses advanced security features like hashing, digital signatures, and public-key cryptography to secure transactions.\n\nDespite this, blockchain is not completely secure and can have vulnerabilities that affect its security. Each investor should avoid speculating on risky projects and carry out due diligence.\n\nStoring your wealth in Bitcoin and Ethereum is considered a safer option, while other cryptocurrencies pose a higher level of risk. It is important to do your due diligence before speculating on a cryptocurrency.\n\nCryptocurrency Wallets\n\nOnce cryptocurrency is purchased on an exchange it is recommended that you withdraw the crypto asset from that exchange and deposit it onto a digital wallet. A wallet can come in different formats.\n\nA hot wallet is a wallet that is always connected to the internet. This can be found in an app on your mobile phone.\n\nis a wallet that is always connected to the internet. This can be found in an app on your mobile phone. A cold wallet is a physical USB looking type device that remains offline. Keeping your cryptocurrency offline or in a cold wallet, such as a Ledger Nano device, helps to protect it from hacking.\n\nBy holding your cryptocurrency on a digital wallet, you are sovereign which means you own your own private key and access to your cryptocurrency. The private key provides you access to a secure digital wallet, which is protected by a seed phrase consisting of 12 to 24 words.\n\nIf the cold wallet is lost, the seed phrase can be used to recover the cryptocurrency on another device.\n\nFor added security, it’s recommended to keep a smaller amount in a hot wallet, which is connected to the internet, and store the majority of your cryptocurrency in a cold wallet. Some popular cold wallet brands include Ledger and Trezor.\n\nFAQ\n\nWhat is cryptocurrency?\n\nCryptocurrency is a unique, anonymous, and verifiable approach to making transactions peer-to-peer without a third party involved.\n\nWhat are the benefits of cryptocurrency?\n\nCryptocurrency offers financial privacy, lower transaction fees and is decentralized. This means that it is not controlled by any single authority or institution. It also offers the potential for more secure and transparent transactions due to the use of blockchain technology.\n\nHow is a cryptocurrency created?\n\nThere are different ways cryptocurrency can be created. When we refer to Bitcoin, new Bitcoin is created through the act of mining. Miners use this technology to account for the transactions on the network and order them into blocks for which they are rewarded every ten minutes. When a block is found new Bitcoin is mined out of the protocol which increases the money supply incrementally every ten minutes.\n\nWhat are the risks of using cryptocurrencies?\n\nIf you hold cryptocurrency on an exchange you are at risk of the exchange running away with your crypto. It is important to get the crypto off the exchange and into your private wallet."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xMzkwMzYvZGV2ZWxvcGVyLWluc2VydHMtYnVnLWJpdGNvaW4tb3JkaW5hbHMtaG93LWJhZC1pc9IBUWh0dHBzOi8vZGVjcnlwdC5jby8xMzkwMzYvZGV2ZWxvcGVyLWluc2VydHMtYnVnLWJpdGNvaW4tb3JkaW5hbHMtaG93LWJhZC1pcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Developer Inserts 'Bug' in Bitcoin Ordinals—How Bad Is It? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThere’s fresh controversy brewing in the Bitcoin Ordinals community after a developer under the moniker “Supertestnet” initiated a transaction that had no input or output, but is nevertheless seen as valid.\n\nThis resulted in the Ordinals’s inscription numbering system crashing, sparking concerns that the whole protocol may now be broken.\n\nOrdinal inscriptions, also known as \"proof of ownership\" inscriptions, are essentially a way of attaching metadata to a specific Bitcoin transaction.\n\nAD\n\nAD\n\nThis metadata can include information about the digital asset being transferred, such as its title, description, and ownership details. So far, it's also been used for a wide array of on-chain media inscriptions including artwork, profile pictures, playable games, and video-based web apps.\n\nUnlike Ethereum-based NFTs, which require the use of a separate token and smart contract to record ownership and transfer of digital assets, Ordinal inscriptions are recorded directly on the Bitcoin blockchain without the need for a sidechain or separate token.\n\nThe transaction in question, which did not include any satoshis (smallest unit of BTC), was found in block 788200.\n\n“[The Ordinals protocol] validated the inscription (3492721) attached to the input, which sounds like a bug,” Ludo Galabru, staff engineer at Hiro Systems commented on the issue on GitHub. “Philosophically, the satoshi inscribed was transferred to the miner as a transaction fee, but was nevertheless inscribed by its previous owner.”\n\nThe Ordinals creator Casey Rodarmor agreed that “it shouldn't be possible to inscribe sats that you don't own,” suggesting the transaction is indeed a bug.\n\nAD\n\nAD\n\n“However, fixing the bug by making [the Ordinals protocol] ignore this inscription would change inscription numbers after the curious transaction. I'm honestly not sure what to do!” added Rodarmor soon after the issue was found.\n\nBut is there an actual danger for the Ordinals protocol?\n\nBitcoin Ordinals under scrutiny\n\nAccording to Danny Diekroeger, founder of Bitcoin Lightning platform Deezy, the bug doesn’t pose any risk to the Ordinals protocol itself.\n\n“Personally, I think this is totally fine. In fact, I think inscription numbers were broken already early on anyway,” Diekroeger tweeted on Friday.\n\npersonally, i think this is totally fine. in fact, i think inscription numbers were broken already early on anywayhttps://t.co/sGrldlh8FT — danny ⚡️ deezy (@dannydiekroeger) May 4, 2023\n\nSupertestnet agreed that there’s no immediate danger to the protocol itself, although he is “not sure not sure what long-term consequences will be.”\n\n“The short-term consequence was that the guys who were running indexing software had to fix the bug,” Supertestnet told Decrypt.\n\nWhat actually happened and what prompted the Austin-based developer to run such an experiment, which Diekroeger described as “the first valiant attack on ordinal inscriptions?”\n\nAD\n\nAD\n\nAccording to Supertestnet, it all started during a recent conference in Austin, where a hackathon was held and people were supposed to be coming up with projects, and the idea was born to try to make “some weird thing in Bitcoin and create a transaction that sends somebody zero Satoshis.”\n\n“No one at the conference wanted to do that project, so I did something else. But afterward, I tried it and created one of these weird transactions and broadcasted it to a miner who mined it for me,” Supertestnet told Decrypt.\n\nCalling himself the “breaker of jpegs,” Supertestnet not only inserted this bug into Ordinal explorers but also created a tool that lets other users increase the attack.\n\nWait did I just break ordinals? https://t.co/V41NQt9aQz — Super Testnet (@super_testnet) May 4, 2023\n\nYet, he also admitted that “it’s not entirely clear to me exactly what's happening right now.”\n\n“Normally, when you create an inscription, you have to create a Bitcoin address that has some satoshis in it. And then you create an image that the software assigns to one of the satoshis in your Bitcoin address. But my Bitcoin address had zero satoshis in it. So it seems that it assigned it a negative number, which is weird by itself,” explained Supertestnet.\n\nDespite that, when the software encountered this negative number it appears to have tried to give this inscription a number.\n\n“It took that and then either made it the first satoshi in the block, which then belongs to the miner, or it put it in the previous transaction’s transaction fee, which then went to the miner. Either way, it definitely went to the miner like that's the inscription,\" Supertestnet said. \"But that's not supposed to happen. You're not supposed to be able to inscribe somebody else's satoshis without their consent. So that's like a bug.\"\n\nAD\n\nAD\n\nThings are “a little more complicated” for Ordinals explorers, according to the developer, because all the numbers after his inscription are off by one.\n\n“If they decide to fix that, they will have to undo all the numbers that have been issued since then, like decrementing them all by one or by however many they're off by one now. But they might not fix it, or they may fix it for the future but all the previous ones are going to remain like they are.”\n\n“I don't know what they'll do, maybe they’ll decide that it’s not important anymore and that it’s not the bug but a feature,” added Supertestnet."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXNldHMtbmV3LW1heS1oaWdoLWFib3ZlLTI5LTVrLWFzLXRyYWRlcnMtZXllLWJyZWFrb3V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin price sets new May high above $29.5K as traders eye breakout - Cointelegraph",
        "content": "Bitcoin (BTC) eyed a reclaim of further lost ground on May 5 as $30,000 remained in play.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBTC price action rebounds from stocks slump\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it spiked to $29,529 on Bitstamp — a new May high.\n\nThe pair had dipped with United States equities at the Wall Street open the day prior, but the weakness was short-lived as $29,000 support returned.\n\nOngoing market jitters from the U.S. banking crisis, now impacting several regional banks, continued to shape observer sentiment.\n\nWhat are we drinking this weekend, left or right bank? pic.twitter.com/Mp2yXcI2Fa — Arthur Hayes (@CryptoHayes) May 4, 2023\n\n“100% of all regional banks in the United States have their stocks in the red today, for the first time ever,” crypto media account Whalewire noted on Twitter.\n\n“This comes a day after Federal Reserve Chair Jerome Powell said the US banking system was stronger than ever.”\n\nFinancial commentary resource, The Kobeissi Letter, considered the potential for the fallout to continue to ripple outward.\n\n“Today is the first day since March that markets are taking the banking crisis seriously,” it argued as stocks and crypto fell.\n\n“S&P 500 is down over 100 points from its high this week while regional banks are at fresh lows. At first, it appeared the crisis was isolated. Perhaps this isn’t as isolated as it seemed.“\n\nAfter the Federal Reserve raised interest rates this week, market expectations nonetheless pivoted to predicting an end to the hiking cycle. According to CME Group’s FedWatch Tool, the next rate decision, due in mid-June, will not result in another shift higher.\n\nFed target rate probabilities chart. Source: CME Group\n\nTrader: $32,000 “best case” for Bitcoin\n\nWhen it came to BTC price action, traders eyed the potential for a closer rematch with $30,000 and higher.\n\nRelated: BTC price may need a $24.4K dip as Bitcoin speculators stay in profit\n\n$BTC / $USD - Update\n\n\n\nPlaying around with ideas at the moment on #Bitcoin .. Now i do not use these sort of trend lines often, but i cannot ignore this one as coincides nicely with the range high i am looking for us to hold\n\n\n\nBest case we tap range $32,000 and dump pic.twitter.com/1J7JfGzCvg — Crypto Tony (@CryptoTony__) May 5, 2023\n\nPopular trader Alan, known as Trader Tardigrade, was optimistic about upside continuation, which could mimic its breakout from late 2020.\n\n“Bitcoin has entered the phase of ‘Storing of power,’” he told Twitter followers alongside a comparative chart.\n\n“This is for the preparation of the incoming Bull Run.”\n\nBTC/USD chart fractal comparison. Source: Trader Tardigrade/Twitter\n\nOn shorter timeframes, fellow trader Ninja set more conservative levels to return as support.\n\n“Bulls should hold above $28.9-$29k...the quicker they reclaim above $29.2k the better,” he wrote in part of a fresh analysis.\n\nBTC/USD annotated chart. Source: Ninja/Twitter\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNjbi5jb20vYml0Y29pbi1wcmljZS13aHktdGhlLW5hc2RhcS1kb3Rjb20tYnViYmxlLXN1Z2dlc3RzLWJ0Yy13aWxsLXN1cmdlLTIwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin Price: Why the Nasdaq Bubble Suggests BTC Will Surge 200% - CCN.com",
        "content": "The Nasdaq, which plunged in value following both the dotcom bubble and financial crisis, more than doubled in value in the following five years of post-bubble recovery. Like the Nasdaq, bitcoin could recover rapidly in the medium-term, analysis suggests.\n\nWith the 200-day moving average of bitcoin reversing its trend for the first time in 16 months and various technical indicators demonstrating a positive near-term trend for the asset, many industry executives and investment firms like Pantera Capital believe bitcoin has bottomed out.\n\nIf $3,122 Was the Bottom, Bitcoin is En Route to a Strong Recovery\n\nAs suggested by Bloomberg’s emerging markets analyst Michael Patterson, if bitcoin found its bottom at $3,122 in December 2018, the dominant cryptocurrency may be en route to a strong upside price movement in the years to come.\n\n“If Bitcoin has in fact bottomed out, history suggests there could be further upside. The Nasdaq more than doubled in the five years after its post-bubble low and has since reached record highs that are well above its peak during dot-com mania,” Patterson wrote .”\n\nSince hitting its 12-month low, the bitcoin price has rebounded to $5,000, recording a staggering 60 percent increase in value within less than four months.\n\nPreviously, former International Monetary Fund (IMF) economist Mark Dow said that bitcoin investors should head for the exits if the asset fails to recover to the $5,000 to $6,000 region, as it would lead the asset vulnerable to a potentially large downside movement.\n\nWhat Makes Analysts Confident Bitcoin Found its Bottom?\n\nEarlier this week, economist and global markets analyst Alex Krüger said that whether bitcoin has reached its bottom at $3,122 or not is not up for debate.\n\nPurely based on technical indicators and data, Krüger emphasized that when the bitcoin price crossed $4,200, it broke out of its 16-month bear trend.\n\nHe said:\n\n“The crypto bear market has been over for three months now. BTC breaking above $4,200 will mark the end of the bear trend that started in January 2018. Going to miss this big fellow.” “This is not a call. Not a matter of aging well or not. A break above 4200 technically ends the bear trend that started Jan 2018. Facts don’t care about opinions. If strong selling resumes later on, that would represent a different trend.”\n\nMoreover, fundamental analysts have said that there exist billions of dollars waiting on the sidelines in the cryptocurrency market to be allocated to crypto assets in the future.\n\nNearly $3 billion ready to flow into BTC and alts. https://t.co/kWTNCtbyZM — Mati Greenspan (@MatiGreenspan) April 5, 2019\n\nThe caution of strategists in the financial sector is that in the 1990s when Japan’s Nikkei plunged during an intense correction, it struggled to recover until 2009.\n\nHowever, it is difficult to compare the price trend of bitcoin and major stock markets because of contrasting environments.\n\nAs seen in previous bull runs of the cryptocurrency market, cryptocurrencies tend to move in cycles. When the market is on an upside trend, parabolic movements are often spotted. When the market initiates a downward movement, it often suffers intensified volatility.\n\nBitcoin Moves in Short Time Frames\n\nThomas Lee, the head of research at Fundstrat Global Advisors, said that bitcoin tends to record its biggest gains in a 10-day time frame of every year.\n\n2/ Reminder that BTC generally generates all of its performance within 10D of any year.\n\n–ex the top 10 days, BTC is down 25% annually since 2013 pic.twitter.com/zoEocEEZvu — Thomas (Tom) Lee (not the drummer) FSInsight (@fundstrat) April 2, 2019\n\nAs such, the way bitcoin and the rest of the cryptocurrency market behave in terms of short-term price movement is drastically different than how major markets such as the stock market of Japan moves.\n\nIndustry executives remain confident that bitcoin has established its bottom because of the level of activity in the cryptocurrency and blockchain industry across all leading markets including the U.S., Japan, and South Korea."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTA1L2JpdGNvaW4tYnRjLXJlZ2FpbnMtbW9tZW50dW0tdG93YXJkLTMwLTAwMC1tZW1lY29pbnMtcGVwZS1ib2xzdGVyLWV0aGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Regains Momentum Toward $30,000; Memecoins (PEPE) Bolster Ether - Bloomberg",
        "content": "Bitcoin is mounting another attempt to surpass the closely-watched $30,000 level and memecoins extended their recent rally as risk appetite increases across global asset markets.\n\nThe largest cryptocurrency by market value rose as much as 2.8% to around $29,690 in New York trading hours. That has Bitcoin, which as been trading on either side of $30,000 for about a month, on pace for a second consecutive weekly increase. Ether, the second largest token, jumped by as much as 6.5%, fueled in part by renewed interest in some of the most speculative tokens, which often trade on the Ethereum blockchain."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1hYm92ZS0yOWstc29sYW5hLWRvZ2Vjb2luLXNoZWQtdXAtdG8tMi9hcnRpY2xlc2hvdy8xMDAwMDc3NDkuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWhvbGRzLWFib3ZlLTI5ay1zb2xhbmEtZG9nZWNvaW4tc2hlZC11cC10by0yL2FtcF9hcnRpY2xlc2hvdy8xMDAwMDc3NDkuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $29k; Solana, Dogecoin shed up to 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading flat in Friday's trade. Bitcoin (BTC), Ethereum (ETH) and XRP were trading with gains, while BNB Dogecoin and Solana were trading with cuts.BTC rose 0.29% to $29,230, while ETH was above the $1,900 level. BTC volume in the last 24 hours stood at approximately $16.57 billion, falling 14.90% in the last 24 hours.\"BTC is holding strong above the $29,000 mark while Ether is almost touching the $1900 level. The crypto market is witnessing restricted growth due to high inflation and other macroeconomic factors and the Jobs data on Friday will act as a key stimulant for the market momentum,\" Shivam Thakral, CEO of BuyUcoin, said.The global cryptocurrency market cap was trading flat at around $1.20 trillion, falling 0.02% in the last 24 hours.The total volume in DeFi stood at 2.21 billion, 6.52% of the total crypto market 24-hour volume. The volume of all stablecoins stood at $30.49 billion, which is 89.89% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $565 billion. Bitcoin’s dominance was at 47.25%, an increase of 0.12% over the day, according to CoinMarketCap.\"BTC continues to hover around $29k, up 0.9% from yesterday. However, BTC’s dominance rate in the broader markets has risen to a 22-month high of 49 percent. Experts believe this to be a result of the ongoing banking woes in the US,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 55, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 68 and 20, respectively, further indicating a Neutral market.\"\"The MACD Level (12, 26) at 186 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 74 with a Neutral indicator, while the Williams Percent Range (14) at −24 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.27 hours, IST on May 05, 2023)Bitcoin $29,230 0.29%Ethereum $1,902 0.02%Tether $1.00 0.03%BNB $325 -0.46%XRP $0.4637 0.27%Cardano $0.3908 -0.98%Dogecoin $0.07869 -0.96%Polygon $0.9881 -1.03%Solana $21.76 -2.17%Polkadot $5.73 -0.33%Shiba Inu $0.000009947 -1.05% Litecoin $88.07 -0.60%Tron $0.06967 0.54%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL2NhbmFkYS9uZXctYnJ1bnN3aWNrL3NlY29uZC1jcnlwdG8tbWluZS1wcm9jZWVkaW5nLW5iLTEuNjgzMzg4ONIBIGh0dHBzOi8vd3d3LmNiYy5jYS9hbXAvMS42ODMzODg4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Second crypto mine 'proceeding' despite N.B. Power freeze, company says - CBC.ca",
        "content": "The proponent of a second cryptocurrency mine in New Brunswick says the project is still alive, despite concerns from both the government and N.B. Power that the industry would put a strain on the provincial power grid.\n\nChief Fuels said in a press release Thursday that its plans are \"proceeding on schedule\" and the facility will open in Grand Falls in early 2024.\n\nThe company said it has hired a contractor to develop the mine's electrical substation to draw energy from N.B. Power's grid, which the utility worries could be overburdened if more cryptocurrency mines were also on the system.\n\nIn March 2022, Premier Blaine Higgs signed a cabinet order endorsing the utility's refusal to service new crypto mines.\n\n\"The benefit you get back from that versus the consumption of energy — it was just not a project that made sense for the province,\" Higgs said Friday.\n\nPremier Higgs signed a cabinet order last year endorsing the N.B. Power's refusal to service new crypto mines. (Radio-Canada)\n\nBut it appears the utility signed an agreement to power the second Grand Falls plant before the freeze was put in place.\n\nSpokesperson Dominique Couture wouldn't comment on the Chief Fuels proposal by name, but said \"prior to the pause coming into effect in 2021, two customers completed their interconnection agreements.\"\n\nChief Fuels president Michael Scully turned down an interview request from CBC News and did not respond to follow-up questions sent by email.\n\nSuch \"mines\" run thousands of computers around the clock to conduct millions of transactions and earn cryptocurrency, consuming large amounts of electricity.\n\nDemand on the grid is a concern for N.B. Power because several of its generating stations face uncertain futures or reliability issues.\n\nThe utility came close to not being able to meet an all-time peak demand for electricity during a cold snap in February.\n\nOne bitcoin mine owned by Hive Blockchain Technologies is already operating in Grand Falls. It uses 70 megawatts of power a year.\n\nHive Blockchain Technologies in St. André has several warehouses of bitcoin miners in operation. (Shane Fowler/CBC News)\n\nChief Fuels said in its release it has scaled back its original plan for a 50-megawatt mine to 26 megawatts \"due to various commercial considerations.\"\n\nIt said it has \"informed\" N.B. Power of that change.\n\nNo comment from Grand Falls\n\nThe mine was announced in November 2021 when Taal Distributed Information Technologies Inc.said it would buy Chief Fuels and set up the mine in a former McCain Foods fertilizer plant in Grand Falls.\n\nThe combined annual electricity consumption of the Hive and Taal mines, 96 megawatts, is close to the yearly generation of the small modular nuclear reactor model being developed by Arc Clean Energy of Saint John.\n\nA Grand Falls town official said last week she was not sure why the Taal-Chief Fuels mine had not opened yet.\n\nEconomic development director France LeMoignan said the town received the Chief Fuels press release on Thursday.\n\n\"We cannot comment on the situation until a permit has been issued by the municipality's planning department,\" she said in an email.\n\nShe said \"discussions\" have taken place with the town \"but no official documentation has yet been issued.\"\n\nChief Fuels describes itself as a majority Indigenous-owned fuel and lubricant company \"affiliated\" with Michaud Petroleum, a Grand Falls company.\n\nOn its website, Chief Fuels lists its address on Waasis Road at Oromocto First Nation.\n\nTaal said in a November 2021 press release it was acquiring all the shares in Chief Fuels, allowing it to open its crypto mine in a 5,600-square-metre warehouse in Grand Falls."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vYW1iY3J5cHRvLmNvbS9kZWNvZGluZy10aGUtbm90LXNvLW9idmlvdXMtcmVhc29uLWJlaGluZC1iaXRjb2luLWJ0Yy1sb2dnaW5nLWhlYXZ5LW5ldHdvcmstdHJhZmZpYy_SAW5odHRwczovL2FtYmNyeXB0by5jb20vZGVjb2RpbmctdGhlLW5vdC1zby1vYnZpb3VzLXJlYXNvbi1iZWhpbmQtYml0Y29pbi1idGMtbG9nZ2luZy1oZWF2eS1uZXR3b3JrLXRyYWZmaWMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Decoding the not so obvious reason behind Bitcoin [BTC] logging heavy network traffic - AMBCrypto News",
        "content": "On 1 May, 60% of all transactions on Bitcoin used Taproot, hitting an all-time high.\n\nBitcoin network also recorded $3.5 million in transaction fees, reaching a 2-year high.\n\nThe bull market of 2o23 has led to a sharp spike in network activity on the Bitcoin [BTC] chain. The number of daily transactions and unique active addresses have grown steadily over the last four months.\n\nRead Bitcoin (BTC) Price Prediction 2023-24\n\nBlockchain analytics firm CryptoQuant devised a Bitcoin Network Activity Index to capture the burgeoning activity on the chain. The index takes into consideration key indicators like transactions, addresses and demand for block space.\n\nInterestingly, the primary reason behind the rise in network traffic was transactions driven by Taproot addresses, as underlined by CryptoQuant CEO Ki Young Ju.\n\nSource: CryptoQuant\n\nBitcoin reinvents itself\n\nUp until 2023, Bitcoin’s reputation was restricted to being a peer-to-peer (P2P) payments network with not much real-world utility apart from settling transactions on the chain.\n\nHowever, with the Taproot upgrade, Bitcoin started to position itself like other conventional layer-1 blockchains, enabling deployment of smart contracts on the chain and minting of Ordinals NFTs.\n\nAccording to a data scientist from analytics firm Glassnode, Taproot transactions accounted for over 37% of spent outputs on the Bitcoin network. The demand for Taproot was also reflected through the adoption and utilization metrics.\n\nThe data showed that on 1 May, 60% of all transactions on Bitcoin used Taproot, hitting an all-time high.\n\nAnother notable trend which was worthy of attention was the growing dominance of text inscriptions over image inscriptions when it came to Taproot transactions. In fact, text inscriptions propelled more than 50% of all transactions on the Bitcoin network.\n\nTaproot was an upgrade to improve the privacy, scalability, and security of Bitcoin. It introduced new signature schemes and a flexible transaction structure, to make transactions more efficient and cheaper.\n\nMiners rake in the moolah\n\nDue to the rise in network traffic, miners managed to collect huge transaction fees. Users were willing to shell out more to get their transactions validated quickly. On 3 May, Bitcoin network recorded $3.5 million in transaction fees, hitting a 2-year high.\n\nOn expected lines, Ordinals accounted for a significant chunk of the total fees paid to miners, averaging nearly 21% over the past week, data from a Dune dashboard showed.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nThe crypto community has a divided stance on Ordinals, and in general the idea of smart contracts on Bitcoin. The naysayers object to its non-financial use case which would congest the network and drive up fees on the chain.\n\nAt the time of writing, BTC exchanged hands at $29,240, marking a marginal increase of 0.37% in the last 24 hours, as per CoinMarketCap."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9leHBlcnRzLXByZWRpY3QtYml0Y29pbi1idGMtdG8tcGFzcy0zNWstaW4tYXByaWwtdmVjaGFpbi12ZXQtYW5kLWNvbGxhdGVyYWwtbmV0d29yay1jb2x0LXRvLXJhbGx5LWFsb25nL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Experts Predict Bitcoin (BTC) To Pass $35k In April, VeChain (VET) and Collateral Network (COLT) to Rally Along - Analytics Insight",
        "content": "Bitcoin (BTC) has shown very bullish trends lately, and investors are super excited as many altcoins, including VeChain (VET) and Collateral Network (COLT), will likely rise in value in alignment with Bitcoin (BTC).\n\n>>BUY COLT TOKENS NOW<<\n\nBitcoin (BTC)\n\nAccording to a report by The Crypto Basic, daily Bitcoin trading volume has increased since March 4. This has convinced many market analysts to believe that Bitcoin (BTC) could pass $35,000 in April. If this happens, then the crypto market may kiss the bears goodbye because a major increase in Bitcoin will stir other cryptocurrencies in a positive direction.\n\nBut as of press time, Bitcoin seems to be repressing. Bitcoin (BTC) has dropped by 11% since trading at over $30k last week. The price of Bitcoin, at the time of writing, is $27,506.52.\n\n>>BUY COLT TOKENS NOW<<\n\nVeChain (VET)\n\nVeChain is a Layer-1 smart contract platform aimed at decentralizing the luxury goods industry. With an efficient team and many big names as partners, VeChain continues to gain popularity in the space. VeChain enables businesses to build dApps and conduct secure and transparent transactions.\n\nBased on an analysis report by Changelly, VeChain has been in an upward trend, increasing by 6.33% in the past seven days. Also, the price of VeChain has increased by 22.04% over the last month, adding a colossal average amount of $0.0049 to its current value — $0.0224. This presents VeChain as a solid asset if it continues to grow. Collateral Network (COLT)\n\nLike VeChain, Collateral Network (COLT) is also designed to help businesses and individuals by easily unlocking liquidity from their physical assets. In other words, existing businesses or start-ups can pledge their assets as collateral to obtain loans. Physical assets currently accepted by the platform include fine wines, art, collectibles, vintage cars, real estate, and watches, among others.\n\nWhen borrowers send their physical assets to the platform, the team at Collateral Network authenticates, values, and stores the assets in its vault for the loan duration. Then, it mints NFTs to represent the value of the assets.\n\nThese NFTs are then fractionalized, allowing multiple lenders to contribute to the loan when they purchase the NFTs. Therefore, individuals or businesses needing loans receive them instantly, while lenders earn significant returns from fixed interest rates.\n\nInterFi Network and SolidProof have both audited Collateral Network, and a 33-year liquidity lock after presale will be performed after the presale ends, cementing Collateral Network as one of the best investment options on the market!\n\nDue to its unique model, experts have identified the Collateral Network (COLT) as the next big thing in crypto, with a 3500% growth prediction. Interested investors can join the ongoing presale to buy the Collateral Network (COLT) token at a discounted price.\n\nIf you wish to purchase the $COLT token for only $0.014, follow the links below and take advantage of this unique opportunity to earn an extra 40% purchase bonus on your investment!\n\nFind out more about the Collateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2Rhc2gtZGFzaC1iaXRjb2luLWNhc2gtYmNoLXNwYXJrbG8tc3Byay13aGljaC1vbmUtaXMtYS1iZXR0ZXItYnV5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 May 2023 07:00:00 GMT",
        "title": "Dash (DASH), Bitcoin Cash (BCH) & Sparklo (SPRK) - Which One Is A Better Buy? - Analytics Insight",
        "content": "In the fast-paced world of cryptocurrency investing, staying ahead of the game can mean the difference between making a fortune and missing out on the next big thing.\n\nToday, numerous cryptocurrencies are vying for investors’ attention, but among the top contenders are Dash (DASH), Bitcoin Cash (BCH), and Sparklo (SPRK). Knowing where to place your bets can be challenging with so many options.\n\nHowever, after careful analysis, experts agree that Sparklo (SPRK) is the clear winner regarding potential return on investment. With potential growth up to 4,000 times, it’s no wonder investors are flocking to Sparklo.\n\nSparklo Presale Momentum On The Rise As Bulls Take Control\n\nIt’s hard not to be intrigued by Sparklo (SPRK)’s incredible momentum. Though still in its presale, demand for this cryptocurrency is going through the roof. And it’s easy to see why. On May 4th, the price of Sparklo (SPRK) increased by two cents with a current price of $0.019.\n\nThat’s a significant jump! No wonder investors are rushing in before the second stage of the Sparklo (SPRK) presale. But what’s so special about Sparklo (SPRK)? Well, its use case is simply fascinating.\n\nThrough its clever fractionalization of ownership, Sparklo (SPRK) lets you own a piece of valuable metals like gold, platinum, and silver. And transparency? Sparklo (SPRK) has that in spades.\n\nWith Sparklo’s (SPRK) smart contract being audited by InterFi and locked in a 100-year liquidity lock, you can trust Sparklo’s (SPRK) transparency practices. If Sparklo (SPRK)’s momentum keeps up, some analysts predict it could do 4,000x.\n\nThat’s something worth watching and perfect to include in a portfolio that includes both Dash (DASH) and Bitcoin Cash (BCH).\n\n>>>> BUY SPARKLO TOKENS <<<\n\nDash Coin (DASH) Bearish As Investors Seek Better Returns Elsewhere\n\nDash (DASH) has been making waves in the crypto world due to its impressive use cases and widespread adoption. Its ability to facilitate private transactions at low fees has made it a highly sought-after crypto for everyday use.\n\nAdopted heavily in South America, Dash (DASH) has a strong foundation that has allowed it to remain in the upper echelon of cryptos. However, with its market cap already being substantial, analysts predict it may underperform the market.\n\nAs new crypto options emerge, analysts are looking towards up-and-coming options like Sparklo (SPRK) to outperform Dash (DASH) soon.\n\nNevertheless, Dash (DASH) remains a powerhouse in the world of cryptocurrencies, with its many benefits making it a top choice for crypto enthusiasts. Dash (DASH) adoption rate means it will remain one of the safest cryptos.\n\nBitcoin Cash (BCH) Growth Prospects As An Investment Weak\n\nBitcoin Cash (BCH) is one of the most used cryptos today for business transactions. Many retailers and businesses that accept crypto do accept Bitcoin Cash (BCH). This gives Bitcoin Cash (BCH) an edge over many other cryptos.\n\nThat being said, analysts are not bullish on Bitcoin Cash (BCH), giving investors a return that they can’t get from any other crypto.\n\nOn the bright side, Bitcoin Cash (BCH) can diversify. While Bitcoin Cash (BCH)’s large market cap suggests a limited potential for exponential growth, plenty of smaller cryptocurrencies – like Sparklo (SPRK) – offer an opportunity for significant gains.\n\nA crypto like Sparklo (SPRK) is in so high demand that some analysts expect it to do 4,000X. That’s something you can’t get from Bitcoin Cash (BCH).\n\nBuy Presale: https://invest.sparklo.finance\n\nWebsite: https://sparklo.finance\n\nTwitter: https://twitter.com/sparklo_finance\n\nTelegram: https://t.me/sparklofinance\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5uZXdzMjQuY29tL2ZpbjI0L2NvbXBhbmllcy9zYXJzLXNlaXplcy1yMTBtLXdvcnRoLW9mLWJpdGNvaW4tbWluaW5nLWVxdWlwbWVudC1pbGxlZ2FsbHktaGl0Y2hlZC10by1wb3dlci1ncmlkLTIwMjMwNTA10gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "SARS seizes R10m worth of bitcoin mining equipment illegally hitched to power grid | Business - News24",
        "content": "For more financial news, go to the News24 Business front page.\n\nMembers of the SA Revenue Service (SARS) and police have confiscated around R10 million worth of bitcoin mining equipment that had been illegally connected to the electricity grid of Vryburg in the North West.\n\n\n\nMining the cryptocurrency is known to be extremely energy intensive. According to the Cambridge Centre for Alternative Finance, globally, bitcoin uses as much energy as a small country.\n\nThe operation also netted 14 617 bottles of duty-free liquor valued at R3.8 million.\n\nSARS said the counterfeit liquor and modern computer equipment were seized during a raid on an unauthorised warehouse on Thursday.\n\nNewsletter Daily SA Money Daily The biggest business, economic and market news of the day.\n\n\"The warehouse was well equipped with state-of-the-art equipment to enable those involved to carry out their criminal activities. One foreign national was arrested. An investigation is under way, and more arrests are expected.\"\n\nSARS commissioner Edward Kieswetter welcomed the raid in a statement, saying \"the abuse of duty-free labels to circumvent payable duties and other criminal undertakings found at this warehouse undermines our economy and will be confronted and met with the full might of the law.\""
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3Lml0d2ViLmNvLnphL2FydGljbGUvYml0Y29pbi1taW5pbmctZXF1aXBtZW50LXdvcnRoLXIxMG0tc2VpemVkLWluLXNhcnMtcmFpZC9tUXdrb3E2WUJsOU0zcjlB0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Bitcoin mining equipment worth R10m seized in SARS raid - ITWeb",
        "content": "Members of the South African Revenue Service (SARS), jointly with the South African Police Service (SAPS), on Thursday conducted a raid on an unauthorised warehouse in Vryburg, North West, and confiscated millions of rands worth of illegally manufactured alcohol and Bitcoin mining equipment.\n\nThe warehouse was used to illegally connect the crypto-currency mining equipment to the town’s electrical power supply.\n\nAccording to SARS, the Bitcoin mining equipment is valued at around R10 million, while the alcohol is estimated at R3.8 million.\n\nIt adds that the warehouse was well-equipped with state-of-the-art equipment to enable those involved to carry out their criminal activities. One foreign national was arrested. An investigation is under way and more arrests are expected.\n\nSARS commissioner Edward Kieswetter praised the ongoing cooperation between SARS and SAPS in apprehending those who are bent on perpetrating criminality.\n\nHe said the raid formed part of SARS’s decision to act more vigilantly against unregistered taxpayers conducting business and to protect legitimate businesses.\n\n“The abuse of duty-free labels to circumvent payable duties and other criminal undertakings found at this warehouse undermines our economy and will be confronted and met with the full might of the law,” Kieswetter said."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnNhbmV3cy5nb3YuemEvc291dGgtYWZyaWNhL2lsbGVnYWxseS1tYW51ZmFjdHVyZWQtYWxjb2hvbC1iaXRjb2luLW1pbmluZy1lcXVpcG1lbnQtY29uZmlzY2F0ZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Illegally manufactured alcohol, bitcoin mining equipment confiscated - South African Government News Agency",
        "content": "Friday, May 5, 2023\n\nMembers of the South African Revenue Service (SARS), jointly with the South African Police Service (SAPS), on Thursday conducted a raid on an unauthorised warehouse in Vryburg, North West and confiscated millions of rands worth of illegally manufactured alcohol and bitcoin mining equipment.\n\nThe warehouse was used to illegally connect the crypto currency mining equipment to the town’s electrical power supply. It was also used to manufacture 14 617 bottles of duty-free liquor and popular local brands.\n\nThe bitcoin mining equipment is valued at around R10 million while the alcohol is estimated at R3.8 million.\n\nThe warehouse was well equipped with state-of-the-art equipment to enable those involved to carry out their criminal activities. One foreign national was arrested. An investigation is underway and more arrests are expected.\n\nSARS Commissioner, Edward Kieswetter, praised the ongoing cooperation between SARS and SAPS in apprehending those who are bent on perpetrating criminality.\n\nHe said the raid formed part of SARS’ decision to act more vigilantly against unregistered taxpayers conducting business and to protect legitimate businesses.\n\n“The abuse of duty-free labels to circumvent payable duties and other criminal undertakings found at this warehouse undermines our economy and will be confronted and met with the full might of the law,” Kieswetter said. - SAnews.gov.za"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMDUvcmVsYXRpb25zaGlwLWJldHdlZW4tYml0Y29pbi1uZnRzLW1pbmluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 May 2023 07:00:00 GMT",
        "title": "Relationship Between Bitcoin NFTs and Mining - The Cryptonomist",
        "content": "These days, the fashion for NFTs on the Ordinals protocol and fungible BRC-20 tokens is exploding, and together they are boosting Bitcoin mining activity and making the business more profitable.\n\nWhat does this mean for the Bitcoin network and what are the advantages/disadvantages for the end-user?\n\nLet us analyse the situation in detail.\n\nWhat are Ordinal NFTs and why could they boost bitcoin mining?\n\nThe Taproot update to the Bitcoin protocol, which went live in November 2021, was a complete game-changer for Satoshi Nakamoto‘s network, increasing transaction privacy for users and improving scalability and security.\n\nProgress has been made since this implementation two years ago, thanks in part to the introduction of Ordinals, a protocol that allows NFTs and native tokens to be issued directly on the bitcoin blockchain.\n\nAlthough these functionalities are generally feasible through the use of smart contracts, as is the case on the Ethereum network, in this case the conditions are very different.\n\nThe basic idea behind Ordinals, a protocol devised by Casey Rodarmor, the developer of Bitcoin Core, is to allow data such as images, videos and text to be ‘’inscribed’’ on individual satoshi, making each sat to which this information is added ‘unique’.\n\nIn this way, the problem of the lack of smart contracts on the Bitcoin network was overcome, prompting many users to create NFT-style digital artefacts and fungible tokens.\n\nThe result was astonishing: millions of pieces of data were transcribed into individual minimum units of BTC (the satoshi), increasing the fees paid to use Bitcoin’s infrastructure and increasing the average block size published on the chain.\n\nMiners are grateful to Casey Rodarmor, as the percentage of income from transaction fees now represents around 12% of the total income earned by those in this business: this is 8 times more than on 23 April, the day the Ordinals trend broke out.\n\nLet us remember that bitcoin mining earns money in two ways: firstly, from block rewards, which are fixed but vary according to predefined mechanisms such as halving or difficulty adjustment, and secondly, from the fees paid by users to have priority in the execution of transactions and to include additional data on each block generated.\n\nWe do not know if the ordinals craze is a passing fad or if the crypto community will continue to modify satoshi by adding data of any kind.\n\nHowever, if this trend continues, it would create a huge incentive for miners to continue their activities and ensure the security of the network by increasing the overall hashrate of the blockchain.\n\nChart showing the percentage of miners’ income from royalties\n\nA look at bitcoin mining revenues: is the advent of NFTs and BRC-20 tokens really a game changer?\n\nLet’s take a closer look at the mining side effects of the advent of Ordinals and the fungible BRC-20 NFTs and tokens that have been created on the Bitcoin blockchain so far.\n\nThe increase in average transaction fees has been a fortuitous event for miners, who need support now more than ever, given the threat of new threats from the US.\n\nTim Frost, CEO of Yield App, said that bitcoin miners could be taxed by the US government because of the energy impact and CO2 emissions generated by the hardware used in the activity.\n\n“Bitcoin miners are facing new threats in the US in the form of a new White House proposal to tax the equivalent of 30% of their energy costs to cover the “damage they inflict on society”.\n\nWhat’s more, with bitcoin’s next halving expected on 27 April 2024 (or rather at the peak of the 840,000 block), miners will soon be earning half the coins currently mined every 10 minutes or so.\n\nThe explosion of the Ordinals trend and the increase in the Fess to enter Satoshi data, which costs around $50 per million bytes added, has been a boon to the mining industry and could greatly increase the earnings of those working in it, if only this craze continues in the coming months.\n\nConsider that since the Ordinals protocol went live, some $9 million in fees have been paid just to create NFTs and BRC-20 tokens, a truly remarkable surplus.\n\nTotale fees paid on Ordinals protocol\n\nThe sheer profitability of the companies in this business has, until recently, depended heavily on the price of bitcoin and the amount of coins issued for each block added to the chain, with transaction fees having little impact on the overall revenue of the miners.\n\nIf registrations continue at this pace, and the price of BTC does not drop significantly, we may finally see a reversal in the coming months of a trend that has seen miners’ revenues remain more or less stable, in the range of 600 to 1200 coins per day.\n\nThe level to watch to see if the advent of NFTs and BRC-20 tokens on the Bitcoin blockchain really is a game changer is the 1200 BTC level: if it is broken, a new era of heavier blocks and richer miners could begin.\n\n​​Chart of Bitcoin miners’ profits in BTC\n\nFrom a user experience perspective, however, this trend could be viewed negatively: although miners are making money from this situation, users are seeing their transactions costing more and more and sometimes getting stuck in the mempool as the rest of the world competes to pay higher fees and get priority for execution.\n\nThere are currently around 220,000 transactions stuck in the mempool, waiting to be added to a block and executed once and for all.\n\nWho knows if in the future some other digital artefact will manage to solve this problem, using the philosophy of zkrollups and the scalability achievable with off-chain transaction processing.\n\nFor now, users are really angry at Ordinals and those who speculate on this trend.\n\nBitcoin Mempool Parameters\n\nHow is the price of bitcoin reacting to the Ordinals trend: buying opportunities?\n\nBitcoin does not seem to have reacted particularly well to the explosion in the Ordinals NFT trend and the increase in mining profitability.\n\nThe cryptocurrency is currently trading at around $29,000 on the chart, with a market cap of $563 billion and volume of $16.7 billion over the last 24 hours.\n\nThe bullish price phase started well before the NFT and BRC-20 token craze broke out, in early January 2023, and in recent days we have seen small price gains.\n\nThe result is quite obvious when we consider that only one satoshi, or one hundred millionth of a BITcoin, is used for each token, so the markets are not deprived of large quantities of coins.\n\nThe positive effects on the price could be seen in the future, thanks to the increase in requests to use the network and, more generally, thanks to the increase in the usefulness of the infrastructure.\n\nIndeed, if the blockchain becomes more like Ethereum, as a “global computer for the world”, bitcoin will certainly start to benefit from the increased functionality that exists.\n\nFor now, speculative activity is focused elsewhere, mainly on the new BRC-20 fungible tokens, whose market capitalization has exceeded $125 million.\n\nThe buying opportunity here could be in this niche market or, in a more traditional financial view, in the shares of listed companies involved in industrial mining."
    }
]