[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL2VuZ2xpc2guZWxwYWlzLmNvbS9pbnRlcm5hdGlvbmFsLzIwMjMtMDktMDIvdHdvLXllYXJzLW9mLWJpdGNvaW4taW4tYnVrZWxlcy1lbC1zYWx2YWRvci1hbi1vcGFxdWUtZXhwZXJpbWVudC13aXRoLWEtbGl0dGxlLXVzZWQtY3VycmVuY3kuaHRtbNIBpAFodHRwczovL2VuZ2xpc2guZWxwYWlzLmNvbS9pbnRlcm5hdGlvbmFsLzIwMjMtMDktMDIvdHdvLXllYXJzLW9mLWJpdGNvaW4taW4tYnVrZWxlcy1lbC1zYWx2YWRvci1hbi1vcGFxdWUtZXhwZXJpbWVudC13aXRoLWEtbGl0dGxlLXVzZWQtY3VycmVuY3kuaHRtbD9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Two years of bitcoin in Bukele’s El Salvador: An opaque experiment with a little-used currency - EL PAÍS USA",
        "content": "Two years ago, El Salvador stunned the world by becoming the first country to make bitcoin an official currency. Journalists from around the world traveled to the Central American nation of 6.3 million people, known for its beaches and its diaspora in the United States, to document the new monetary reality. September 7, 2021, when the new cryptocurrency law came into effect, was an atypical moment in which a small country briefly held the attention of the entire world.\n\nInterest has waned, but the experiment continues. It is tempting to classify the Bitcoin Law — the name for the legislative project that made the digital asset legal tender — as a success or a failure. But nothing is so simple in President Nayib Bukele’s El Salvador. The country’s decision to make bitcoin an official currency is difficult to analyze because it is an opaque experiment with several different objectives: financial inclusion, revenue for the public treasury and building the reputation of the president.\n\nThe experiment began with several bitcoin purchases by the Bukele government. The exact amount of bitcoin that El Salvador has in its international reserves is not known, since the government does not keep a public record. The closest thing that exists to a purchase announcement are Bukele’s brief posts on social media. The website nayibtracker.com maintains its own account and estimates that El Salvador has lost 37% of the value of its investments in bitcoin, since the cryptocurrency began to fall in 2021. That’s the equivalent of $45 million. It is estimated that El Salvador currently has $76.5 million worth of bitcoin. As often happens in the crypto world, the website does not include information about the bitcoin owners or who manages the assets.\n\nA protest against bitcoin in El Salvador on June 1. Alex Peña (Getty Images)\n\nWhen introducing the currency to the population, the idea was that it be used in all types of transactions: from buying street food to a property. With this goal in mind, the government opened a digital wallet called Chivo, and gave every citizen the equivalent of $30 in bitcoin. But hundreds of the Chivo accounts were hacked, and the money was stolen along with the account owner’s identity.\n\nThis perhaps scared many in El Salvador. One of the benefits of cryptocurrencies is the speed with which remittances can be sent from abroad — an advantage that was promoted by the Salvadoran government. But so far this year, only 1.3% of remittances have been transferred using digital wallets that use cryptocurrencies, according to the most recent data from the central bank. In comparison, 4% of remittances sent to Mexico are made through cryptocurrencies, according to the specialized firm Chainalysis.\n\nLast week, an investment research firm called Ark Invest made waves on social media when it published a report claiming that bitcoin adoption in Argentina surpasses that of El Salvador. “Understandably, the citizens of El Salvador prefer to transact in USD, which became legal tender in El Salvador in 2001 and has protected purchasing power from the inflation and devaluations that have ravaged other countries in the region,” stated the report signed by analyst David Puell. “In contrast, the price of bitcoin has been quite volatile in the face of growing pains as it endeavors to evolve into a monetary system with increased liquidity and global adoption.”\n\n“This news makes a lot of sense,” said Mónica Taher, vice president at RocketFuel, a global cryptocurrency payment processing company. Until October, Taher was the director of technology and innovation for the Bukele government’s business promotion agency, InvestSV. In addition to the size difference between Argentina and El Salvador, a cluster of technology companies has been growing organically in Argentina for at least two decades, and today are industry leaders, explains Taher.\n\nDuring her time in the government, she was in charge of attracting and guiding companies interested in operating in El Salvador. “An avalanche of companies came — we didn’t know what to do with them all,” recalls the former official. “Everyone was excited, especially the first year, and it was very nice to see a kind of reverse migration: it wasn’t the Salvadorans who were migrating to the United States, now it was foreigners from every country in the world there were who decided to move.”\n\nSeeing the interest of companies in El Salvador, the Central African Republic announced in April 2022 that it would make bitcoin and other cryptocurrencies legal tender. But their experiment failed, and less than a year later Congress reversed the legislation.\n\n“The goal, for me, of using bitcoin in El Salvador is to increase people’s economic freedom so that there are no intermediaries and, within that, to empower women to control their own finances,” said Taher. But “if there is no coherent educational process, mass adoption will take a long time in the country,” she warned.\n\nA few months ago, the Bukele government granted Bitfinix — a company founded in Hong Kong in 2012 — the country’s first license for digital assets, such as equities and bonds. Bitfinix and its sister company, Thether, had to stop operating in New York in February 2021, when the New York Attorney General’s Office declared that they “recklessly and unlawfully covered-up” losses of $850 million. A few months later, U.S. regulators fined Tether Holdings $41 million for making untrue or misleading statements by claiming that its token was a stablecoin, with its value pegged to a fiat currency.\n\nThe move to bitcoin has been an undeniable success for El Salvador, says Andrés Engler, a journalist specialized in cryptocurrencies and former editor for Latin America of the crypto website Coindesk. “In terms of press, it put Bukele in the headlines,” he said. “That is indisputable. With respect to the crypto industry, El Salvador today is a strong figure. If you ask anyone in the industry about El Salvador, they will recognize it and will probably name Bukele straight away. From that point of view, it seems to have been effective.”\n\nSign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDkvMDEvc2VjLWRlbGF5cy1kZWNpc2lvbi1zcG90LWJpdGNvaW4tZXRmcy1ibGFja3JvY2stZmlkZWxpdHktY3J5cHRvLXdvcmxkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "SEC delays decision on spot bitcoin ETFs from BlackRock, WisdomTree and more - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nSEC delays decision on spot bitcoin ETFs from BlackRock, WisdomTree and more: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Paul Brody, global blockchain leader at EY, discusses his new book on how companies can implement Ethereum's blockchain."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzhjODQ0NGI4LTAwMjAtNDA2NC04N2U3LTM4NTkxNTk0NGNjMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price slides after SEC pushes back ETF approvals - Financial Times",
        "content": "Print this page\n\nThe price of bitcoin sank 5 per cent after regulators deferred approvals of the first US exchange traded funds that invest directly in the cryptocurrency, damping investors hopes for a speedy route to the world’s largest capital market.\n\nThe US Securities and Exchange Commission said late on Thursday in a series of filings that it needed more time to consider seven bitcoin ETF applications, including one from BlackRock, the world’s largest asset manager.\n\nThe fall in the price of bitcoin meant the token had unwound most of the gains it had made after a Washington court this week ruled the agency had been wrong to reject an application by asset manager Grayscale to turn its flagship vehicle, Grayscale Bitcoin Trust, into an ETF.\n\nThe court ruling has put pressure on the SEC to relent from a decade-long policy of refusing ETFs based directly on the controversial token. Crypto advocates have long called for a spot bitcoin ETF, arguing it offers consumers a cheap and safe way to trade the coin, instead of buying it directly from unregulated crypto exchanges.\n\nDemand for a spot bitcoin ETF has grown this year and more traditional players have attempted to break into the sector. Fidelity, WisdomTree, Invesco Galaxy, VanEck, Bitwise and Valkyrie Digital Assets also had their applications for a spot bitcoin ETF delayed on Thursday.\n\nBut the regulator has argued that it cannot offer investors reassurance that the bitcoin market is not prone to being manipulated. Gary Gensler, chair of the SEC, in July called the crypto market “rife with fraud, rife with hucksters”. Even so, the SEC has approved bitcoin futures ETFs, which track the price of futures linked to the cryptocurrency.\n\nThe Washington court has forced the SEC to review its approach to bitcoin ETFs. It has 45 days to decide whether to abide by the court decision, ask a court to review it or make a direct appeal. The SEC said it was “reviewing the court’s decision to determine next steps”. The regulator is expected to make its decisions on spot bitcoin ETFs in mid-October.\n\n“We believe it is quite feasible that the SEC will craft alternative arguments to justify continued rejections of spot bitcoin ETF applications based on concerns specific to the spot bitcoin market,” said Mark Palmer, an analyst at Berenberg Capital Markets.\n\nHe pointed out that the involvement of Coinbase in the ETF filings further complicated the issue. Coinbase has proposed surveillance-sharing agreements with the regulated exchanges hosting the potential ETF listings, CBOE Global Markets and Nasdaq. Earlier this year the regulator sued Coinbase for allegedly violating US securities laws.\n\n“We would not be surprised if [Coinbase’s] potential involvement in those ETFs were to serve as part of the SEC’s reconfigured arguments for rejecting the applications,” added Palmer.\n\nHowever, lawyers suggest a fresh round of rejections citing new concerns will be a challenge for the SEC, which has long justified its opposition to these products on market manipulation grounds.\n\n“In theory, they could try to oppose these applications on other grounds but for years they’ve put all their eggs in the basket of there not being a sufficiently regulated market to trade cryptocurrencies, and the court resoundingly rejected the SEC’s argument for that,” said Jeremy Senderowicz of law firm Vedder Price."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZ2ZtYWcuY29tL3RlY2hub2xvZ3kvZXVyb3BlLW1ha2VzLWZpcnN0LXNwb3QtYml0Y29pbi1ldGYtYXZhaWxhYmxlLXRvLXRyYWRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Europe Makes First Spot Bitcoin ETF Available To Trade - Global Finance",
        "content": "The Euronext Amsterdam stock exchange listed Europe’s first-ever spot bitcoin exchange-traded fund (ETF) in mid-August.\n\n\n\n\n\nThe Euronext Amsterdam stock exchange listed Europe’s first-ever spot bitcoin exchange-traded fund (ETF) in mid-August. This development exposes the differing attitudes of regulators in Europe versus the US toward cryptocurrencies. A spot bitcoin ETF lets investors invest in bitcoin without buying or holding the cryptocurrency directly.\n\nAnnounced last year, the Jacobi FT Wilshire Bitcoin ETF (ticker: BCOIN) might entice institutional investors with its green credentials. The digital asset fund is compliant with the European Union’s sustainability guidelines. The ETF is the “first digital asset fund compliant with SFDR [Sustainable Finance Disclosure Regulation] Article 8 through its decarbonization strategy,” the firm said in a prepared statement.\n\nThe fund uses external data to measure the bitcoin ETF’s energy usage and buys and subsequently retires verifiable built-in real energy certificates, an accepted convention for carbon offsetting. With negative sentiment surrounding the adverse environmental impact of bitcoin mining, Jacobi’s apparent “greenness” will be music to the ears of investors seeking ESG-compliant digital assets.\n\nThe new ETF’s impact will be as political as well as economic. The US Securities and Exchange Commission (SEC) has refused to approve spot bitcoin ETF applications, citing concerns over potential market manipulation.\n\nThe SEC’s skeptical approach to cryptocurrencies has divided opinions, and some business leaders say the regulator’s heavy-handed attitude risks marginalizing innovation and driving business abroad. Under SEC guidelines, the regulator can delay ETF applications for up to 240 days, suggesting it may not rule on some spot ETF requests until next year.\n\nWith the Euronext launch, BlackRock and others may contend that Europe has moved ahead of the US, which will increase pressure on the SEC and stoke the frustration of some legislators.\n\n“Approval by Europe will likely exert pressure on the SEC to rethink its decisions on BlackRock’s application for a bitcoin spot ETF, which has significantly influenced the entire narrative around both bitcoin and cryptocurrencies,” says Vijay Valecha, chief investment officer at Dubai-based Century Financial. Recent changes by the UK’s Financial Conduct Authority have also fueled hopes of a pathway to an ETF, but many analysts remain doubtful."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMDEvZmlyc3QtbW92ZXItYW1lcmljYXMtc2VjLWRlbGF5cy1zcG90LWJpdGNvaW4tZXRmLWRlY2lzaW9uLWZvci1hbGwtYXBwbGljYW50cy_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzAxL2ZpcnN0LW1vdmVyLWFtZXJpY2FzLXNlYy1kZWxheXMtc3BvdC1iaXRjb2luLWV0Zi1kZWNpc2lvbi1mb3ItYWxsLWFwcGxpY2FudHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "First Mover Americas: SEC Delays Spot Bitcoin ETF Decision for All Applicants - CoinDesk",
        "content": "A New York court classified popular cryptocurrencies ether and bitcoin as \"commodities\" while dismissing a proposed class action lawsuit against leading decentralized crypto exchange Uniswap in a Wednesday filing. The lawsuit – filed in April 2022 by a group of investors against Uniswap and its creator Hayden Adams – alleged the DeFi platform violated U.S. securities laws by failing to register as an exchange or broker-dealer, offering and soliciting securities on an unregistered exchange. The suit sought to hold Uniswap accountable for investors losing money to “scam tokens” issued and traded on the protocol. The tokens cited in the suit include Ethereum (ERC-20) tokens EthereumMax (EMAX), Bezoge (BEZOGE) and Alphawolf Finance (AWF). But Wednesday's ruling to scrap the suit before it goes to trial stated the true defendants of the case were the issuers of the tokens in question, not Uniswap. While SEC Chief Gary Gensler has so far shied away from calling ETH a security, Judge Katherine Polk Failla of the Southern District of New York directly called it a commodity and declined to \"stretch the federal securities laws to cover the conduct alleged,\" in the case against Uniswap."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZGVhdGgtY3Jvc3MtdXMtam9icy1yZXBvcnQv0gFCaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1ldGhlci1kZWF0aC1jcm9zcy11cy1qb2JzLXJlcG9ydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin falls back to US$26,000, Ether nears ‘death cross' - Forkast News",
        "content": "Bitcoin, Ether and most top ten non-stablecoin cryptocurrencies dropped Friday morning in Asia. At a touch above US$26,000, Bitcoin has traced back most of the gains triggered by Tuesday’s favorable U.S. court ruling for Grayscale Investments in its Bitcoin ETF case against the SEC. Equity futures in the U.S. were little changed following a mixed session Thursday. The personal consumption expenditures (PCE) index moved higher as consumers continue to spend. Investors expect today’s U.S. payroll report for August to shed more light on coming interest rate policy.\n\nCryptos down as SEC delays more ETF decisions\n\nBitcoin dropped 4.42% over the last 24 hours to US$26,042.84 as of 07:00 a.m. in Hong Kong. The token is down 0.26% for the week, according to CoinMarketCap data.\n\nBitcoin’s value fell along with other cryptocurrencies after the U.S. Securities and Exchange Commission announced Thursday it will delay seven spot Bitcoin exchange traded fund applications until October. Some of the world’s largest asset managers including BlackRock, WisdomTree, and VanEck are among those waiting on the SEC for ETF approval.\n\n“The move is very clear; the pump we had from Grayscale-SEC news is now faded,” Benjamin Stani, director of business development at Hong Kong-based digital asset broker Matrixport, said in a text message.\n\nThe market, Stani added, “was hoping that after Grayscale, there [would be] a path forward and had some analysts up the probability of a spot ETF approval before the year-end — but it looks like not so soon.”\n\nEther dipped 3.15% to US$1,648.76 over the past 24 hours for a weekly loss of 0.33%.\n\n“The current technical signals for Ethereum appear to be undergoing a period of mixed trends across different time frames,” Rachael Lucas, crypto technical analyst at BTC Markets, told Forkast via text message.\n\nEther market data shows the token is on track to form a so-called “death cross” — “a development often viewed with caution by market participants,” Lucas said. The cross, which occurs when the short-term average falls below the long-term trend, is generally a sign of further losses ahead. Currently, the short-term 50-day average stands at 1808.3, while the 200-day average is at 1802.9, according to TradingView.\n\nLucas said that Ether has stepped into a negative territory in a weekly timeframe, which may lead to a short-term pullback. “It’s essential to consider these movements in the context of broader market dynamics, as the cryptocurrency space can be characterized by rapid price shifts,” Lucas explained.\n\nMost other top ten non-stablecoin cryptos posted losses, with Solana’s SOL leading the losers. It dipped 5.07% to US$19.81, its lowest level in over six weeks. On Monday, Clockwork — a Solana-based automation network for smart contracts — shut down. Its founder Nick Garfield said he saw “limited commercial upside” in the project.\n\nUltimately the reason we are stepping away now is simple opportunity cost.\n\n\n\nWe admittedly see limited commercial upside in continuing to develop the protocol, and have a growing personal interest to explore new opportunities.\n\n\n\n5/ — Nick (@time_composer) August 27, 2023\n\nMeanwhile, a U.S. court has dismissed a class action lawsuit filed against a group of five companies including decentralized trading platform Uniswap Labs. Plaintiffs claimed they were victims of a rugpull involving scam tokens on the Uniswap cryptocurrency exchange and are entitled to compensation.\n\nThe court ruled that the defendants are not responsible for those losses. Presiding Judge Katherine Polk Failla said “due to the Protocol’s decentralized nature, the identities of the scam token issuers are basically unknown and unknowable.”\n\nCrypto commentators interpret the ruling as a victory for decentralized finance with wide reaching implications for the industry.\n\n“I believe that what happened in the case against Uniswap Labs could be the first steps in clarifying the legal and regulatory environment for DeFi applications and could make investors’ concerns about sudden lawsuits and actions by regulators less and make them more predictable,” wrote Samer Hasn, market analyst for online brokerage XS.com.\n\n“On the other hand, this measure, and other similar possible measures, if taken in the future, may restrict investors’ confidence in these applications due to the inability to regulate them and enforce the law on them,” Hasn added.\n\nThe total crypto market capitalization fell 3.46% to US$1.05 trillion, while trading volume gained 16.61% to US$37.31 billion.\n\nU.S. futures trade flat ahead of jobs data\n\nImage: Envato Elements\n\nU.S. stock futures were little changed as of 10:15 a.m. in Hong Kong after a mixed regular session for the three major indexes during Thursday’s regular trading hours.\n\nThursday’s release of the Personal Consumption Expenditures Price Index for July showed that U.S. consumer spending grew by the biggest margin in six months. However, other economic indicators point to a slowing of the economy, with experts predicting a halt to interest rate hikes by the U.S. Federal Reserve in September.\n\n“The PCE is being keenly watched as investors were cheered earlier in the week by the weaker-than-expected payrolls data and annual gross domestic product growth forecast – both of which strongly make the case that the Federal Reserve must now stop its most aggressive tightening campaign in decades,” said Nigel Green, founder and chief executive officer of financial management group deVere, in an email statement.\n\nThe Fed raised its interest rate to between 5.25% and 5.50% in July, the highest level in 22 years. The CME FedWatch Tool predicts an 88.0% chance that the central bank will maintain the current rate at the next meeting in September, up from 81.0% a week ago.\n\nInvestors now look to Friday’s release of the U.S. jobs report for August released later on Friday, adding to last month’s labor market slowdown.\n\n“Job openings are falling, and American workers are more reluctant to leave their positions right now,” Andrew Challenger, senior vice president of Chicago-based outplacement firm Challenger, Gray & Christmas, told CNN. He added that the market is seeing a reset after a post-coronavirus hiring frenzy.\n\nMeanwhile, the main Asia equity indexes were mixed. China’s SSE Composite, Japan’s Nikkei 225 and South Korea’s Kospi moved up while Hong Kong’s Hang Seng Index fell.\n\nOn Thursday, China lowered the minimum down payment for homebuyers in its largest cities in an effort to boost the country’s slowing housing market. The nationwide minimum downpayment will be set at 20% for first-time buyers and 30% for second-timers, effective Sep. 25.\n\nChina is facing a crisis in its real estate sector following the downfall of the Evergrande Group. The nation’s non-manufacturing purchasing managers’ index released Thursday hit a yearly low. The news has led to more caution in global equities as traders assess a slowdown in the world’s second largest economy.\n\n“The conventional wisdom seems to be flipping from a concern with the unstoppable rise of Chinese power to a worry about the irrevocable decline of China’s economy and population,” Richard Fontaine, CEO of Washington-based Center for a New American Security, told Bloomberg.\n\n(Updates to add quotes from Rachael Lucas)"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtZGVsYXlzLXZlcmRpY3QtYmxhY2tyb2NrLWV0Zi0xMjAwMDA0MzguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "SEC delays verdict on BlackRock's ETF application; Will Bitcoin ETFs see light of day? - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) on Thursday postponed its decisions on seven Bitcoin exchange-traded fund (ETF) proposals, including one submitted by BlackRock, the world’s largest asset manager.\n\nSeven firms — BlackRock, WisdomTree, Invesco Galaxy, Wise Origin, VanEck, Bitwise and Valkyrie Digital Assets — published ETF applications in the Federal Register on July 19. The SEC was scheduled to rule on all seven applications by Sept. 4. However, the regulator postponed by 45 days meaning the seven firms will now have to wait until mid-October for a decision.\n\n“We fully expected delays on this round of spot Bitcoin ETF filings. Would have been a shock if they were approved this week,” James Seyffart, research analyst at Bloomberg Intelligence, tweeted on Friday.\n\nTo the frustration of those in the crypto industry, the SEC can delay its verdict on ETF proposals for a maximum of 240 days, or about six months. The federal agency had already delayed its deadline on the proposal from Cathie Wood’s Ark Investment Management on Aug 11.\n\nThe SEC’s latest decision comes days after the District of Columbia Court of Appeals sided with Grayscale Investments, the manager of the world’s largest Bitcoin fund, the Grayscale Bitcoin Trust (GBTC). The court overturned an earlier SEC decision preventing GBTC’s conversion into a spot Bitcoin ETF.\n\nDistrict Court Judge Neomi Rao called the SEC’s denial of Grayscale’s proposal “arbitrary” and “capricious” in the review of the petition because the agency failed to clearly explain what distinguishes spot Bitcoin ETFs from already-listed futures ETFs.\n\nGrayscale argued in an October 2022 legal update posted on its website that the SEC did not provide clear explanations for the rejection, violating the Administrative Procedure Act. The company also stated that the SEC decision was inconsistent with its approvals of Bitcoin futures ETFs.\n\nDespite the SEC postponing the latest series of applications, Nigel Green, founder of financial management group deVere, said in a statement that Grayscale’s victory now makes spot Bitcoin ETFs in the U.S. an “inevitability.”\n\nStory continues\n\n“The court’s decision destroys the SEC’s central argument for rejecting every spot Bitcoin ETF over the last few years. This win paves the way for Bitcoin ETFs,” Green said.\n\nGeorgetown University’s McDonough School of Business professor James Angel said before the court’s decision that the SEC may even want to lose the Grayscale case, forcing them to allow all the ETF applications currently pending.\n\n“This would take the blame away from the SEC if and when Bitcoin has another crash or another crypto ice age,” Angel said.\n\nBitcoin’s price rollercoaster pause\n\nThe news of Grayscale’s win triggered a surge in crypto prices. Bitcoin grew 7% shortly after the news to above US$28,000 on Tuesday. But the SEC’s subsequent delay in the seven other cases Thursday poured cold water on the sector, triggering a downturn to below US$26,000. Bitcoin fell 4.62% in the past 24 hours to US$25,988 at 3:45 p.m. on Friday in Hong Kong.\n\nThe sharp price swings reflect the industry’s interest in Bitcoin ETFs. Ric Edelman, founder of the U.S.-based think tank Digital Assets Council of Financial Professionals, said that a green light from the SEC, if given, would cause an even greater upswing in crypto prices.\n\n“Around half of the nation’s financial advisors in the United States personally own Bitcoin, but only 12% are recommending Bitcoin to their clients,” said Edelman. “And the primary reason that advisors are not recommending Bitcoin is because there isn’t an ETF.”\n\n“Those advisors manage about US$8 trillion in investor assets,” he added.\n\nHowever, Georgetown’s James Angel said that a spot Bitcoin ETF win will not be a long-term growth factor for the crypto market.\n\n“Investors already have an almost identical product with the futures-backed ETF, so I don’t see a big long-term impact,” said Angel. “There will clearly be an emotional short-term rally when the approval comes out, but that will get lost in the noise in the long-term.”\n\nSean Stein Smith, professor of economics at the City University of New York and founder of the Institute for Blockchain & Cryptoasset Research, said that the approval of spot Bitcoin ETFs will have a positive impact on the wider crypto industry.\n\n“[Spot Bitcoin ETFs] will open the proverbial door for more product approvals and launches, including those that are related to Bitcoin as well as other crypto assets,” Smith added.\n\nSo when will investors have access to spot Bitcoin ETFs from investment giants like BlackRock, Fidelity and Invesco?\n\nTaking account of different possibilities and factors, it is more likely we’ll see a batch of ETFs approved in the early half of next year, said Julian Klymochko, founder and CEO of Calgary-based investment solutions firm Accelerate.\n\n“I think a spot Bitcoin ETF in the U.S. is a 2024 story. When in 2024 they’ll launch, it’s to be seen, but I wouldn’t be surprised to see it in the first or second quarter,” said Klymochko. “I think that things are going to be moving quickly. There are many, many companies that have applied for a spot Bitcoin ETF, so it’s certainly going to be a battle.”\n\nCrypto wild west: SEC sheriff’s rules\n\nThe series of spot Bitcoin ETF applications from major U.S. firms was submitted in the midst of an ongoing crypto crackdown. Increased scrutiny over the industry by the SEC is based on the regulator’s claim that most cryptocurrencies other than Bitcoin are securities. The federal agency sued Coinbase and Binance.US in July on the basis that the two exchanges offer unregistered securities in the form of cryptocurrencies.\n\nMore recently, the SEC made its first enforcement action against non-fungible tokens (NFTs), charging media company Impact Theory with offering unregistered securities in the form of NFTs on Monday.\n\nSEC Chair Gary Gensler, who has emerged as the crypto industry’s main bogeyman, said at a Senate Appropriations Financial Services subcommittee hearing in Washington D.C. in July that the “Wild West” of crypto is “rife with noncompliance.”\n\nGustavo Schwenkler, professor of finance at Santa Clara University, said that Gensler and the SEC have reason to be concerned.\n\n“The existing ETFs track derivatives that are traded on strictly regulated derivatives exchanges. There are not that many derivatives exchanges that are closely monitored by the regulator,” said Schwenkler. “A spot Bitcoin ETF would track the Bitcoin price that is available across global crypto exchanges. There are a lot of them and many are not well regulated.”\n\nHowever, Megan Enright, spokesperson for Swiss digital asset manager 21Shares, said that “material changes” in the market over the past year or so mean that it is now better prepared for ETFs than it was in the past.\n\n“The market has matured, there is additional data supporting the efficiency of these markets and there are new surveillance sharing agreements that are being established between major crypto markets and traditional exchanges,” Enright added.\n\nIn April, 21Shares refiled its application for a spot Bitcoin ETF in the U.S. with its partner, Ark Invest."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd3d3LnlvdWhvZGxlci5jb20vYmxvZy9iaXRjb2luLWJ1YmJsZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Why Bitcoin is Not a Bubble - YouHodler.com",
        "content": "Bitcoin is no stranger to volatility and doubt, but does that signify the cryptocurrency is in a bubble? There’s a lot of evidence that points to the contrary. It’s understandable that investors may have concerns and debates about a potential Bitcoin bubble. If it bursts, the crypto’s value becomes insignificant. Traders may lose their investments entirely.\n\nBefore you decide to begin (or continue) using Bitcoin, you should make sure you understand what’s in its future. In this article, we’ll explore the substantial evidence that differs Bitcoin from other bubbles. The information discussed below provides traders with a well-reasoned and balanced argument against the Bitcoin bubble.\n\nWhy Bitcoin is not a Bubble: Historical Resilience\n\nBitcoin was first introduced in 2009. The Cryptocurrency experienced market volatility throughout its history. However, Bitcoin has always bounced back from any significant price drops. This includes long periods of bear market behavior, with some price declines lasting over nine months. Bitcoin has even gone through severe price crashes, including its latest crash in November 2022. However, its price has always evened out afterward and even climbed to new heights once again.\n\nWhen it launched, it had a value of $0, which climbed to $1 by April 2011. Just three months after that, the crypto’s price shot up by 2,960% to $29.60. By November of the same year, its price declined to a mere $2.05. In 2013, Bitcoin experienced some strong gains, trading at $123 by October.\n\n\n\nThis is just a snapshot of the many price fluctuations and recoveries Bitcoin has experienced. Currently, Bitcoin is trading at around $25,000. Bitcoin’s resilience in overcoming a wide range of challenging market conditions is clear. It survived the 2020 pandemic and the 2022 crash of FTX, a major crypto exchange. BTC continued to gain in value even after major downturns; it doesn’t have the fragility of a crypto bubble.\n\nIncreasing Adoption and Recognition\n\nBitcoin has come a long way since its launch. It went from an obscure digital currency to mainstream crypto. Globally, 219 million people use Bitcoin as a payment method. Even more encouraging, Bitcoin is seen and treated as a legitimate asset by institutional investors, corporations, and governments. In the US, BTC and other cryptocurrencies are taxed - just like any other income.\n\nMajor companies like Shopify, Ralph Lauren, Microsoft, and even Starbucks use Bitcoin in their financial strategies. These organisations are crucial in gaining wider recognition of Bitcoin’s usefulness. Bitcoin is the most popular crypto, with the total number of crypto users currently at 420 million. With the crypto market, in general, growing at around 4%, we can only expect more people to join its user base.\n\nDecentralization and Scarcity\n\nBitcoin’s key attributes, including its decentralized nature and fixed supply, make it an especially attractive asset. Only 21 million coins can exist, and miners have already set 19 million of that supply in circulation. Bitcoin’s expensive mining fees, which currently back its inherent value, will disappear once it reaches its cap.\n\nThe market price will then reflect the market’s new supply and demand. Demand will increase for Bitcoin, as it remains the most popular crypto and gains more users. Its supply, however, will remain at a maximum of 21 million. Bitcoin’s mining system is also different from other cryptos. The number of new Bitcoins minted per block mined is halved around every four years. The next halving will occur in 2024.\n\nIt’s also important to remember that users have already lost around 4 million Bitcoins due to losing their private keys. This makes the supply that more scarce. Bitcoin’s core features lay a strong foundation for inherent value and scarcity in the face of significant demand. These features differentiate it from other popular cryptocurrencies. They’re also not seen in traditional speculative bubbles.\n\nSupportive Technological Advancements\n\nLightning Network Capacity Chart via BitcoinVisuals\n\nSome investors have concerns about Bitcoin’s scalability. At the time of its launch, its creators were more focused on Bitcoin’s usability as a peer-to-peer payment system. It has no intermediaries, allowing for incredibly secure and easy transactions. As it grew, Bitcoin became users became more aware of the crypto trilemma. It’s difficult to develop a system that balances scalability, decentralization, and security.\n\nHowever, Bitcoin is facing the challenge head-on with solutions like the Lightning Network. As Bitcoin’s blockchain grows in nodes, it carries more transaction data. To validate transactions, every node has to execute a computational task. The more nodes, the harder this becomes. The Lighting Network is a second layer of the blockchain.\n\nThe network forges channels between two parties, allowing them to send unlimited transactions. This occurs independently, instead of on the main blockchain. Payment channels are then linked together, lightening the load on the main blockchain’s nodes. Other supportive technological solutions for scalability are also being explored.\n\nSharding is one of them. This process involves splitting the data into smaller sets, or shards. The blockchain can process these more manageable datasets parallel to each other. With many shards processed simultaneously, the validation process is made faster without compromising Bitcoin’s decentralization.\n\nInstitutional Backing and Regulation\n\nMajor financial institutions, from JP Morgan to Goldman Sachs, are adopting Bitcoin into their strategies. Interest has spread even to venture capital firms, who want to explore tokenization. This is when real-world assets, like gold or precious gems, are minted on the blockchain. These digital tokens represent ownership of assets, which third parties can look after in secure locations. While still cautious, they want to increase involvement and investments in Bitcoin. Even the US government owns Bitcoin - 241,000 of them!\n\nBitcoin is also well-regulated, especially in the US. On a state level, it’s regulated by local parties. On a federal level, it’s regulated by the SEC, FinCEN, and the CTFC. Bitcoin and other digital assets fall under their jurisdiction, though global regulations are also pertinent. Countries like Switzerland and the UK implement the FATF Travel Rule. This prevents money laundering and other criminal activities around the globe by sharing data on institutions engaging in virtual assets.\n\nGlobal Economic Uncertainty\n\nAmidst global economic challenges, including high inflation rates and subpar growth, Bitcoin acts as a hedge against financial stress. While the cryptocurrency has experienced its fair share of volatility, hedging is a long game. Bitcoin’s overall historical data points to its value increasing with time.\n\nBTC/USDT chart by TradingView\n\nMany use Bitcoin as a store of value - opening a new digital world of opportunity. Most stores of value are physical assets, like gold, bonds, or land. The Bitcoin in your secure digital wallet is available from any place with an Internet connection, at any time. With its influence only growing, Bitcoin makes for a great potential hedge against economic uncertainty. If it were a bubble, investors would avoid using it to store their money or to back their other assets.\n\n\n\nSuggested reading: What is a Store of Value? The Ultimate Guide\n\n‍Conclusion: Why Bitcoin is not a bubble\n\nBitcoin has many attributes that solidify its value, usefulness, and potential for future growth. The information provided in this article showcases how different Bitcoin is from traditional bubbles. Its decentralized nature, secure transactions, and scalability are backed by its millions of users. Bitcoin’s ability to overcome major financial events and challenges proves its tenacity in the market. The digital asset is also growing as a global mainstream payment method, supported by entire governments and major institutions.\n\nTraders can easily stack this evidence, creating a strong argument against the Bitcoin bubble. It’s important to still consider Bitcoin’s inherent risks, such as its market volatility. Before coming to a definite conclusion, conduct your own research and consider others’ perspectives on the topic."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2ZlZC1iaXRjb2luLWV0Zi1zZWMtZGVsYXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Analysts predict tough September as bitcoin falters after ETF delay - Blockworks",
        "content": "Bitcoin could be headed for a historically low month — particularly given some volatile macroeconomic factors.\n\nAugust’s final trading day saw bitcoin give up its gains Thursday on news that the US Securities and Exchange Commission once again delayed decisions on a bitcoin spot ETF.\n\nMore broadly, September has been a red month for bitcoin for the past six years. The S&P 500 similarly struggles at the end of the summer, averaging a 3.2% loss in September for the past five years.\n\n“Even in 2021, during the final upward leg of the last bull cycle, [bitcoin] (BTC) lost 7% in September only to gain 40% the following month,” Noelle Acheson, author of Crypto is Macro Now and former head of market insights at Genesis, wrote in a newsletter Friday.\n\n“Times are different now, however. In September 2021, bond yields were around 1.1%, the S&P 500 was up a whopping 40% year-to-date, risk sentiment was high and BTC had already gained over 60% since early January,” Acheson added.\n\nThe Federal Reserve is scheduled to release its next interest rate decision on Sept. 20, along with the central bank’s summary of economic projections. Markets are currently pricing in 93% probability that the Fed will opt for another pause and keep interest rates where they are, around 5.25%.\n\nLast month, Fed Chairman Jerome Powell reiterated that the economy is proving more resilient than central bankers originally anticipated. He suggested more aggressive rate increases might be necessary down the line.\n\n“Since inflation exploded last year, the Fed has been more closely focused on the so-called ‘super-core’ inflation rate, which is Core Services PCE less Housing,” said Tom Essaye, founder of Sevens Report Research. “That figure jumped considerably to 3.9% from 3.2% in June.”\n\nThe Fed will lean hawkish, Essaye predicted, which markets and cryptos have not yet priced in.\n\nCrypto investors should also keep an eye on the growing US budget deficit, Acheson advised. An increased deficit means more debt issuances, but with lower global demand for American government debt and a central bank that’s trying to cut its balance sheet holdings, buyers could be in short supply.\n\n“True, the Fed could be encouraged to change its strategy in case of urgent need, in which case we would be back to the money-printing days of 2020-21,” Acheson said. “This should lead to a scenario where yet again BTC outperforms stocks given its sensitivity to liquidity, its inverse relationship to the dollar and its detachment from the economic doldrums affecting the world’s large economies.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMDEvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1zcG90LWJpdGNvaW4tZXhjaGFuZ2UtdHJhZGVkLWZ1bmRzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wMS9zZWMtZGVsYXlzLWRlY2lzaW9uLW9uLXNwb3QtYml0Y29pbi1leGNoYW5nZS10cmFkZWQtZnVuZHMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "SEC delays decision on spot bitcoin exchange-traded funds. What that means for investors - CNBC",
        "content": "Even as the U.S. Securities and Exchange Commission delays a decision on several applications for the first spot bitcoin exchange-traded fund, many in the crypto industry are still feeling optimistic for a future blessing from the agency.\n\nSEC filings dated Aug. 31 indicated the agency would give itself until mid-October to make decisions on several applications. But another extension could be possible, experts say.\n\nThe update came two days after a federal appeals court sided with Grayscale in a lawsuit against the SEC for denying its application to convert the Grayscale Bitcoin Trust to an ETF.\n\n\"It is clear that bitcoin is something that retail investors want access to,\" former SEC chair Jay Clayton said on CNBC's \"Squawk Box\" on Friday, noting that \"an approval is inevitable.\"\n\nMore from Personal Finance:\n\nStudent loan interest resumes — what that means for borrowers\n\n63% of workers unable to pay a $500 emergency expense, survey finds\n\nThe job market is 'normalizing,' economist says — what that means for workers\n\nThe Grayscale ruling isn't necessarily a green light for a spot bitcoin ETF, said Bryan Armour, director of passive strategies research at Morningstar. But pending applications from Blackrock , Fidelity and others \"have increased the probability overall.\"\n\nU.S. investors currently have access to bitcoin futures ETFs, which invest in bitcoin futures contracts, or agreements to buy or sell the asset later for an agreed-upon price. The long-awaited bitcoin spot ETF, however, would invest in the digital currency directly."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMDEvYml0Y29pbi1zbGlkZXMtdW5kZXItMjZrLW1ham9ycy1zb2wteHJwLWRvZ2UtZXJhc2UtYWxsLXdlZWtseS1nYWlucy_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzAxL2JpdGNvaW4tc2xpZGVzLXVuZGVyLTI2ay1tYWpvcnMtc29sLXhycC1kb2dlLWVyYXNlLWFsbC13ZWVrbHktZ2FpbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Slides Under $26K, Majors SOL, XRP, DOGE Erase All Weekly Gains - CoinDesk",
        "content": "GBTC is a publicly traded bitcoin fund offered by Grayscale (Grayscale and CoinDesk share the same parent company, Digital Currency Group), which could potentially open the door for a spot bitcoin ETF in the U.S - even as the SEC has disapproved every such ETF application it's reviewed to date."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzVhOTBiMWFiLWU5ZmMtNDYyMC1hZWI3LTZkMDA5NWVmY2E4ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Grayscale faces ETF war after winning bitcoin battle - Financial Times",
        "content": "Print this page\n\nHello and welcome to the latest edition of the FT Cryptofinance newsletter. This week, we’re taking a look at Grayscale’s victory in the US courts.\n\nMany previous editions of this newsletter have covered regulators punching at every corner of the crypto industry, from the largest crypto exchange to obscure lines of code.\n\nThis week, the tables turned.\n\nAsset management firm Grayscale, which holds roughly $17bn in bitcoin, won a landmark case against the Securities and Exchange Commission when a Washington DC court ruled that the regulator was wrong to reject the company’s application to convert its flagship product into a bitcoin-backed exchange traded fund.\n\nA spot bitcoin ETF has become something of a crypto holy grail — a way to trade bitcoin that is cheap, safe and wrapped in a well-understood regulatory wrapper. To say the crypto market was delighted is an understatement.\n\n“An SEC-regulated bitcoin ETF would unlock the next generation of crypto adoption, allowing trillions in institutional capital to come off the sidelines,” said Diogo Mónica, co-founder and president of Anchorage Digital.\n\nBitcoin leapt roughly 7 per cent after the ruling. I’d say such excitement over the prospect of a spot bitcoin exchange traded fund potentially happening at some point in the future, is a reflection of the failings of that global financial revolution bitcoin’s founder promised 14 years ago.\n\nStill, the victory is a rare oasis of optimism for a space so often set back by scandals. Potentially great for the industry, but at what cost to Grayscale?\n\nEven before the hard-charging Gary Gensler became chair of the SEC, the agency had a consistent record of punting applications to launch a bitcoin spot ETF.\n\nSome have had specific reasons but the SEC has long argued the asset that underlies it all — bitcoin — trades on largely unregulated exchanges that may be susceptible to market manipulation.\n\nGrayscale won because it focused on the SEC’s weak spot — that the regulator had given the green light to bitcoin ETFs that track futures on the token, traded on the CME.\n\nFutures and their underlying assets are closely linked. While the CME can attest to the orderliness of its own market and the way prices are formed and fed into it, the underlying market can still be manipulated. Market makers arbitraging prices just help close the gap.\n\nThe judge, Neomi Rao, agreed that this stance was odd and called the denial of Grayscale’s application “arbitrary and capricious”. The ruling didn’t permit a spot bitcoin ETF, and only told the SEC to go away and rethink its justifications for its denial.\n\nBut while Grayscale has been fighting it out in court, others have been banging on the SEC’s door this summer with their own bitcoin ETF applications. They include BlackRock — the largest money manager in the world — and other household names such as WisdomTree and Fidelity.\n\nShould the ruling finally open the door to spot bitcoin ETFs, Grayscale is likely to be up against a host of household ETF names in the battle for customers. None of them come associated with the crypto crash of 2022.\n\n“Retail investors and institutions alike may be attached to bigger names. If so, Grayscale made the legal investments to win this case, but having knocked the door down their competitors may walk right through it, marching on Grayscale’s back in the process,” Peter Fox, partner at Scoolidge, Peters, Russotti & Fox, told me over the phone.\n\nMore importantly, these rivals are all very accustomed to serious price competition. Grayscale earns a 2 per cent management fee on the bitcoin it holds — at present worth about $17bn. BlackRock, Invesco, etc are used to charging fractions of that total.\n\nOthers, such as Jeremy Senderowicz of law firm Vedder Price, are more optimistic. “Grayscale has a pretty established name for bitcoin products and they’re staring off with an asset base in their fund that nobody else has,” he told me, referring to the fact that Grayscale is one of the largest holders of bitcoin on the planet.\n\nBut it’s not hard to imagine the likes of BlackRock quickly scooping up their own stash of coins, either. It’s also important to remember the court’s decision does not by any stretch compel the SEC to approve Grayscale’s application: however unlikely, the regulator could revert with an entirely new rationale to reject the company’s ETF ambitions all over again.\n\nOvernight the SEC again deferred all the main spot bitcoin ETF applications filed this summer.\n\nStill, the expectation is growing that spot bitcoin ETFs will make landfall in the US at some point.\n\nIf and when the day comes, the SEC will probably approve several ETFs at once, rather than granting one player a potentially unassailable first-mover advantage.\n\n“That means this becomes a market share game. So on percentage share and take-rate, Grayscale revenues should decline significantly,” Ram Ahluwalia, chief executive of investment adviser Lumida Wealth Management, told me.\n\nWhat’s your take on Grayscale’s court victory over the SEC? As always, email me at scott.chipolina@ft.com.\n\nWeekly highlights\n\nDespite a setback in ETF land, the SEC’s push against all crypto-related activity continues unabated. On Monday it charged media and entertainment company Impact Theory LLC with conducting an unregistered offering of crypto asset securities in the form of non-fungible tokens. The company agreed to a cease-and-desist order without admitting or denying the SEC’s findings.\n\nOn Thursday industry giant Binance said it would “gradually” cease support for BUSD products, advising users to convert into other stablecoins before February 2024. The news doesn’t come as a surprise after New York regulators halted further issuance of the coin in February this year, but it serves as a reminder of the impact of regulatory action: Binance’s share of the crypto trading market has fallen from roughly 57 per cent to 38 per cent following the New York Department of Financial Services aiming its crosshairs on BUSD.\n\nSoundbite of the week: Crypto gets its latest cheerleader\n\nCrypto has a new high-profile political supporter: Vivek Ramaswamy. The biotech entrepreneur turned Republican presidential candidate has made waves for describing the climate “agenda” as a “lie”, and outlandish promises to fire 75 per cent of all US federal government employees.\n\nRamaswamy took to social media platform X this week to celebrate Grayscale’s victory in court over the SEC, suggesting the federal courts (presumably he’d like to keep those running) as the only defence against overreaching agencies such as the SEC.\n\n“The shadow government in D.C. is out of control & the federal courts are our *only* remaining line of defence against the unlawful rogue behaviours of 3-letter government agencies. This decision is strong and clears a path to keep Bitcoin & blockchain innovation in the US instead of overseas.”\n\nData mining: Grayscale added over $1bn in AUM after court victory\n\nGrayscale’s flagship vehicle, Grayscale Bitcoin Trust, added nearly $1.2bn in assets under management on August 29 and 30 following the asset manager’s victory in the courts. That added 7 per cent to its total, bringing it to $17.4bn in assets under management, according to figures from provider CCData.\n\nStill, that was only a minor ray of sunshine in a poor August. The digital asset market had a 12 per cent decline in assets under management last month, to $29.7bn. Grayscale itself was managing more than $18bn only two weeks ago.\n\n\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1wcmljZXMtZGlwLXNlYy1kZWxheXMtMTk1OTIzNTIwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin prices dip after SEC delays decision on spot bitcoin ETF filings - Yahoo Finance",
        "content": "The price of bitcoin and other cryptocurrencies are under pressure after the SEC's decision to delay applications for bitcoin spot ETFs for another 45 days. Bitcoin has fallen back below $26,000 after rallying earlier this week on Grayscale's (GBTC) victory in a federal appeals court. Yahoo Finance Markets Reporter Jared Blikre breaks down the story.\n\nVideo Transcript\n\nAKIKO FUJITA: Well, Bitcoin and other crypto assets under pressure today after the Securities and Exchange Commission delayed its decision on spot Bitcoin ETF applications.\n\nJared Blikre is on the floor of the New York Stock Exchange tracking that for us and much more. Jared.\n\nJARED BLIKRE: This just shows you how much we have to do on a summer Friday afternoon before Labor Day. These are filings that were largely expected. The SEC decided to postpone or deny the application that rolls them over into another day, it's mid-October for the next decision. But this regard a spot Bitcoin ETF, kind of the Holy Grail right now for Bitcoin lovers and Bitcoin bulls.\n\nIt was only a couple of days ago that we had that surprise, we had that decision. I don't know that it was a surprise, but it was a decision in the Grayscale versus SEC case, where they were suing to allow GBTC, that's a Grayscale Bitcoin Trust to convert to a spot Bitcoin ETF. That was approved. And so that could eventually go through, but that's going through in a different way because that has to do with the court system.\n\nNow, all of this actually started a few months ago in the middle of June. June 15 was the day that BlackRock originally filed its application for its spot Bitcoin ETF. There was so much enthusiasm based on that, that we actually saw a huge multi-day rise in Bitcoin. There are a couple other things going on at the same time.\n\nBut everybody else who was going to file a spot Bitcoin ETF, they jumped on the bandwagon within the next couple of days. And we saw Bitcoin go from $25,000 to $30,000 and just above.\n\nStory continues\n\nBut given some of the disappointments that we've seen recently, we've seen that fall off quite a bit. I said earlier in the week right before the big Grayscale decision came out. We probably don't have another big catalyst until something changes materially with the Federal Reserve or we get to the halvening next year. And that has to do with the finite money supply of Bitcoin. So another story indeed.\n\nGetting back to the main point, we're at about 25,000. 25,000 gives, there's not a lot of weight or there's not a lot of support under that until you get to about 20,000, 21,000, so we could definitely go lower.\n\nBut none of this really means that much in terms of price action between $20,000 and $30,000, $33,000 anyways. It's not until we push materially above, let's say 35,000, 40,000 that we can say we are out of the woods and probably emerging from the Bitcoin spring into the Bitcoin summer.\n\nNotice that I believe we have already emerged from the Bitcoin winter. So enough on crypto there. I don't know if we're going to get any big decisions or anything else that will move the market next week, not maybe CPI. But that kind of brings me back to today. I said the Federal Reserve, if it change interest rate policy, that's going to affect all risk assets, not just Bitcoin.\n\nAnd what we saw this morning was a rise in yields. I don't think this morning's report changes the game for the Federal Reserve. If anything, it takes some pressure off of them. But with regard to risk assets, summer is over. We know that we're entering September, October, that's when portfolio managers finally rejigger their portfolios from over the summer when they're dealing with that low liquidity.\n\nSo any number of things can happen over the coming weeks and months. Finally, I would add. I'd just remind everybody, September worst month of the year going back to 1950. Yes. However, when you filter for a couple other variables like the market being strong through July and falling off in August, we actually have pretty good results throughout the end of the year.\n\nSo I think a little bit of caution is warranted. Not too much of expectations is warranted with regard to Bitcoin and ceteris paribus for everything else.\n\nAKIKO FUJITA: Yeah. Important for a lot of investors to take a deep breath going into the long weekend and bracing for September. Jared, thanks so much for that."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMDEvbGFyZ2UtYml0Y29pbi1ob2xkZXJzLWFjY3VtdWxhdGUtMTViLXdvcnRoLW9mLWJ0Yy1hcy1wcmljZS13YXZlcnMv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOS8wMS9sYXJnZS1iaXRjb2luLWhvbGRlcnMtYWNjdW11bGF0ZS0xNWItd29ydGgtb2YtYnRjLWFzLXByaWNlLXdhdmVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Large Bitcoin Holders Accumulate $1.5B Worth of BTC as Price Wavers - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vbW9uZXkudXNuZXdzLmNvbS9pbnZlc3RpbmcvY3J5cHRvY3VycmVuY3kvc2xpZGVzaG93cy9iZXN0LWNyeXB0b2N1cnJlbmN5LW1pbmluZy1zdG9ja3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "7 Best Cryptocurrency Mining Stocks | Investing | U.S. News - U.S News & World Report Money",
        "content": "The \"crypto winter\" that weighed on the entire industry in 2022 has now thawed, and investors are hoping the roughly 60% year-to-date gain by Bitcoin (BTC) in 2023 is just the beginning of the next cryptocurrency boom cycle.\n\nMost top cryptocurrencies have performed extremely well so far this year, and rising crypto prices mean rising margins for crypto miners. In fact, some crypto mining stocks have been among the best-performing investments in the entire market this year.\n\n\n\nCryptocurrency miners remain extremely volatile and risky investments, but speculators are hoping these seven top crypto mining stocks can maintain their bullish momentum:\n\nStock Year-to-date performance as of Aug. 31 Riot Platforms Inc. (ticker: RIOT) 234.8% Marathon Digital Holdings Inc. (MARA) 267.5% Cipher Mining Inc. (CIFR) 469.6% Hut 8 Mining Corp. (HUT) 185.9% TeraWulf Inc. (WULF) 211.9% Canaan Inc. (CAN) -2.4% Bitfarms Ltd. (BITF) 209%\n\nRiot Platforms Inc. (RIOT)\n\nRiot Platforms is a U.S. Bitcoin mining company focused on growing its hash rate and infrastructure capacity. The company's mining operations are located in central Texas, and the company's Rockdale facility's 700 megawatts (MW) in developed capacity make it the single largest Bitcoin mining and hosting facility in North America. In August, Riot reported a record $76.7 million in quarterly revenue and a record hash rate capacity of 10.7 exahashes per second (EH/s). Riot mined 1,775 BTC in the second quarter and has lowered its average production cost to just $8,389 per Bitcoin. RIOT shares have jumped by 234.8% in 2023, and they closed at $11.35 on Aug. 31.\n\nMarathon Digital Holdings Inc. (MARA)\n\nMarathon Digital is a U.S. Bitcoin mining company that operates its own mining pool, invests in mining hardware, builds custom firmware and designs mining infrastructure. The company aims to improve mining efficiency by integrating its own technology to streamline operations. In the second quarter, Marathon reported $81.8 million in revenue and a 314% year-over-year increase in Bitcoin production. Marathon sold 63% of the Bitcoin it produced during the quarter to fund operating costs. Marathon also reported an \"energized\" hash rate of 17.7 EH/s, and the company holds about 12,538 BTC on its balance sheet. MARA stock is up 267.5% this year, closing at $12.57 on Aug. 31.\n\nCipher Mining Inc. (CIFR)\n\nCipher Mining is a technology company focused on developing and operating Bitcoin mining data centers in the U.S. In August, Cipher reported a record self-mining hash rate capacity of 6.8 EH/s in the second quarter and said the company is on track to bump that number to 7.2 EH/s in the third quarter. The company also plans to complete the buildout of its Odessa facility in Texas in the near future and is exploring a list of potential additional expansion opportunities. Cipher touts its \"best-in-class unit economics\" and has 10,536 BTC on its balance sheet. CIFR is the best-performing stock on this list so far in 2023, gaining a whopping 469.6%. CIFR shares were trading at $3.19 as of Aug. 31.\n\nHut 8 Mining Corp. (HUT)\n\nHut 8 Mining is a Canadian digital asset mining company that operates two mining facilities in southern Alberta. The company has 36,000 square feet of geo-diverse data center and cloud computing capacity and uses emission-free energy sources to run its operations. In August, the company opened up a shareholder vote on its plan to merge with U.S. Bitcoin Corp. to create New Hut, a company that will have 7.5 EH/s of installed self-mining capacity, 825 MW of total power under management and 253 MW of total energy at six different mining sites. HUT shares are up 185.9% so far this year, closing at $2.43 on Aug. 31.\n\n\n\nTeraWulf Inc. (WULF)\n\nTeraWulf is a U.S. Bitcoin miner focused on clean crypto mining. The company says its current Bitcoin production is powered by more than 91% zero-carbon energy, and its goal is to bump that number to 100% in the near future. In the second quarter, TeraWulf reported its hash rate capacity grew 67% over the prior quarter to 5.5 EH/s. The company mined 908 Bitcoin in the quarter, an impressive 70% quarter-over-quarter increase. Revenue per Bitcoin produced increased 21% in the quarter, while power cost per Bitcoin dropped 15%. TeraWulf is also expanding its Lake Mariner facility in New York by adding 18,500 mining machines. WULF stock has gained 211.9% in 2023, closing at $2.09 on Aug. 31.\n\nCanaan Inc. (CAN)\n\nCanaan is a somewhat unconventional cryptocurrency mining stock. The company produces high-performance application-specific integrated circuits cryptocurrency miners use to mine crypto. Canaan also researches and develops other technologies tied to supercomputing. Canaan is essentially akin to the retailers who sell picks and shovels to gold miners during gold rushes. However, it also runs its own Bitcoin mining operation. Canaan reported $11.1 million in mining revenue in the first quarter and said it is holding 623 BTC. The company also sold 4.2 million terahashes per second of total computing power in the quarter. CAN shares are slightly down so far in 2023, losing 2.4% year to date and closing at $2.01 on Aug. 31.\n\nBitfarms Ltd. (BITF)"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRvd24tc2VwdGVtYmVyLWV0Zi1hcHByb3ZhbHMtb2N0b2Jlci1hbmFseXN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin heads for red September, but analysts tip October as 'days to watch' - Cointelegraph",
        "content": "Bitcoin investors may be in for a rollercoaster ride. While history shows September is typically a bumpy month for Bitcoin, two ETF analysts have suggested investors turn their gaze to mid-October as the next “major days to watch.”\n\nAccording to historical data, Bitcoin’s monthly returns have closed in the red at the end of September nine times over the course of the last 13 years.\n\nPopular crypto analyst Will Clemente informed his 689,000 X followers that September has had the “least number of positive-returning months” and is on a six-year negative-returning streak.\n\nBitcoin's returns broken down by months\n\n\n\nSeptember has had the least number of positive-returning months at just two and is on a 6-year negative-returning streak. pic.twitter.com/4VqZkMubm3 — Will Clemente (@WClementeIII) August 31, 2023\n\nThere are a number of other factors that point to a bumpy road ahead in September as well, with monitoring resource Material Indicators warning that a “full retrace” of gains made the wake of Grayscale’s victory over the SEC was a likely course of action for the largest cryptocurrency moving forward.\n\nTLDR: Trend Precognition signals ⬇️ on the D chart Prepare to round trip the range\n\nBTC >$27,760 invalidates the signal\n\nBTC #Bearadise\n\n\n\nTo expand on what @TradingParrot shared earlier, on the #Bitcoin D candle Close/Open, Trend Precognition presented a… pic.twitter.com/sX3Bqj3v57 — Material Indicators (@MI_Algos) August 31, 2023\n\nLooking ahead, however, Bloomberg ETF analyst James Seyffart has urged investors to look to mid-October, which is the second decision deadline for the SEC for seven pending spot Bitcoin ETFs — specifically ones from BlackRock, Bitwise, Valkyrie, WisdomTree, VanEck, iShares and Invesco.\n\nNEXT DATES TO WATCH:\n\n\n\nMiddle of October are the next major days to watch. Namely October 16th. (& @GlobalXETFs' Oct 7)\n\n\n\nAlso, reminder that we fully expected delays on this round of spot #Bitcoin ETF filings. Would have been a shock if they were approved this week. pic.twitter.com/i14fg8FWun — James Seyffart (@JSeyff) August 31, 2023\n\nRelated: BlackRock's Bitcoin ETF the 7th application delayed by SEC on Aug. 31\n\nOn Aug. 30, Seyffart and fellow Bloomberg ETF analyst Eric Balchunas pinned the chances of a spot Bitcoin ETF approval by the end of this year at 75%. The mid-October dates would be the last deadline for the SEC, at least in 2023.\n\nAdditionally, Seyffart noted that delays on the most recent round of spot Bitcoin ETF filings were widely expected and that he would’ve been shocked if they were approved in the first round of deadlines this past week.\n\nAfter surging briefly on the Grayscale news, the price of Bitcoin has since fallen 4.5% over 24 hours and, at time of writing, was changing hands for $26,066, according to data from CoinGecko.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9pbmR1c3RyeS1uZXdzL25ld3MvYml0Y29pbi1ldGYtYXBwcm92YWwtd2lsbC1zcGFyay1hLWJhdHRsZS1mb3ItbG93ZXN0LWZlZXMtMjQxNjc30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin ETF approval will spark a battle for lowest fees - InvestmentNews",
        "content": "Fresh off a pivotal win in court this week, Grayscale Investments may soon find itself in another fight: the $7.5 trillion U.S. exchange-traded industry’s never-ending contest over fees.\n\nA ruling Tuesday overturned the Securities and Exchange Commission’s decision to block Grayscale’s bid to convert its $17 billion bitcoin trust into a physically backed ETF. While the action potentially paves the way for the firm to attract a fresh wave of investors, there’s just one thing: The product carries a 2% fee in its current form. That compares to an average of 0.54% across U.S.-listed ETFs, and 1.48% for crypto exchange-traded products globally, Bloomberg Intelligence data show.\n\nThat disconnect means that Grayscale’s bitcoin trust, known as GBTC, faces a dilemma over fees should the SEC finally give its blessing to spot-bitcoin ETFs. Asset-management titans including BlackRock Inc., Invesco and Fidelity Investment — known for their low-cost lineups — all have similar applications filed with the SEC, which the regulator is expected to respond to in the coming days. Fees aren’t yet listed for their proposed products, though history suggests it’ll be a fraction of what GBTC charges.\n\n“Grayscale is up against issuers such as BlackRock and Invesco who are highly accustomed to bludgeoning each other on fees,” said Nate Geraci, president of The ETF Store, an advisory firm. “Spot-bitcoin ETFs will all generally look the same – they simply hold bitcoin — which makes fees a key differentiator.”\n\nGrayscale’s Chief Executive Michael Sonnenshein reiterated on Bloomberg Television Wednesday that the firm is “committed to lowering fees when GBTC converts to an ETF,” but declined to specify by how much. On Thursday, a Grayscale spokesperson said the company’s legal team “is focused on actively and expeditiously pursuing next steps to convert GBTC to an ETF, and we will share next steps and additional information as soon as possible.”\n\nFee wars are a familiar phenomenon in the increasingly crowded ETF arena — both in new categories as well as established asset classes. In the nascent market for ETFs that track collateralized loan obligations, for example, BlackRock undercut rival issuers by debuting the cheapest such offering in January, only to be one-upped by PGIM in July. Meanwhile, just this month, State Street Global Advisors put BlackRock and Vanguard Group Inc. on notice by slashing the fee on its S&P 500 fund to just 2 basis points, or 0.02%. The ETF Store’s Geraci says another good gauge of what’s likely to come can be found within applications for Ether-futures ETF filings, where issuer Roundhill has indicated that it would like to launch a product that charges just 0.19%. For bitcoin ETFs, contestants could come in asking for 0.4%, he projects.\n\n“Grayscale needs to enter the ETF Terrordome with the mindset that they might have to go from 200 basis points to 20 basis points on fees,” Geraci said. “It seriously might take that to be successful in this space. This is a high-stakes battle with significant asset potential and firm revenue on the line.”\n\nAt current asset levels, GBTC rakes in roughly $339 million per year for its parent company from fees alone, a Bloomberg calculation shows. Any reduction in the fee could also impact its parent company Digital Currency Group, where Grayscale and its suite of products are seen to be a crown jewel subsidiary.\n\nThough Tuesday’s ruling is being seen as a step forward in the race for a bitcoin ETF, such a product is by no means guaranteed for U.S. investors. The SEC has said it is reviewing the decision.\n\nAnother key question remains: Which, if any, of the numerous issuers trying for a spot-bitcoin ETF might get to launch a product first? Cathie Wood, whose firm has an application pending, told Bloomberg Television that she expects the SEC to “approve more than one at once.”\n\nDave Nadig, financial futurist at VettaFi, says that should any one company get to debut its product before anyone else, it would have a huge advantage, regardless of the fee it charges. But if several get to launch on the same day, “there will be some combination of who’s got a great capital markets desk and can get folks trading this at the institutional level and price.”\n\n“I think it would be an instantaneous race to the bottom,” he said on Bloomberg Television, adding that he wouldn’t be surprised to see fees settle in the 50-to-75 basis-point range. “I certainly don’t think we’re going to see products over 1%.”"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL2hvdy1iaXRjb2luLW1pbmVycy1jYW4tYWNjZWxlcmF0ZS10aGUtZW5lcmd5LXRyYW5zaXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "How Bitcoin miners can accelerate the energy transition - CCN.com",
        "content": "Key Takeaways\n\nBitcoin miners can play a role in the energy transition by using excess renewable energy to power their operations, reducing waste.\n\nEmbracing energy-efficient mining hardware minimizes carbon footprints and enhances long-term sustainability.\n\nPartnerships with local communities and governments foster responsible mining, boost local economies, and address environmental concerns.\n\nBy aligning with clean energy initiatives and sustainability goals, Bitcoin miners can accelerate the transition to a more environmentally friendly energy landscape.\n\nUnderstanding Bitcoin Mining And Energy Consumption\n\nThe process through which new Bitcoins are created and recorded on the blockchain is known as Bitcoin mining. It also acts as the system for validating and confirming network transactions. To complete the process, miners compete to answer challenging mathematical riddles. The miner who solves the puzzle correctly earns the opportunity to add the following block of transactions to the blockchain, as well as freshly created Bitcoins and transaction fees.\n\nBitcoin mining’s dependency on computing power is what makes it unique. ASIC (application-specific integrated circuit) machines are frequently used by miners to conduct the difficult calculations necessary to crack cryptographic riddles. These calculations need a lot of resources and computer power.\n\nAs of May 2023, Bitcoin’s energy consumption was estimated at 95.58 Terawatt-hour (TWh) per year, according to Statista.com. To put it in perspective, 1 trillion watt-hours (or TWh) make up 1 terawatt-hour (TWh). An hour of use of one watt of power is equal to one watt-hour of energy.\n\nThe total energy used by the Bitcoin network is 95.58 TWh each year, which indicates that during the course of a year, the network as a whole uses around 95.58 TWh of electricity.\n\nRenewable Energy Integration In Mining Operations\n\nDue to their high energy needs, Bitcoin miners have the potential to accelerate the use of renewable energy sources. Both parties may profit from this relationship: miners get access to affordable, ecologically good electricity, and renewable energy projects obtain a steady market for their spare capacity.\n\nMiners can assist these initiatives in obtaining funding and growing their operations by supplying a steady supply of renewable energy. This interplay can hasten the switch to greener energy sources and lessen the environmental hazards of bitcoin mining.\n\nTo take advantage of their energy output, bitcoin mining companies can be strategically placed close to renewable energy plants. Solar, wind, hydropower, and geothermal renewable energy sources all produce varying amounts of energy depending on the time of day and the weather.\n\nMining activities can help reduce waste and absorb extra energy during moments of high production. Demand response is a theory that uses excess energy that would otherwise go unused to help balance the energy system.\n\nSuccessful Cases Of Bitcoin Mining Powered By Renewable Energy\n\nEl Salvador’s Volcano-Powered Mining\n\nEl Salvador powers its bitcoin mining using geothermal energy. Volcanic activity in the nation generates geothermal energy, which is utilized to produce electricity for mining operations. With this strategy, carbon emissions are decreased and a sustainable energy source is used.\n\nHydroelectric-Powered Mining in Canada\n\nMiners in Canada utilize an abundance of hydroelectric power (which is a reliable renewable energy source) to mine Bitcoin.\n\nSolar-Powered Mining\n\nMining operations are incorporating solar energy especially in areas with strong sun irradiation. It is possible to install solar panels close to mining operations to supply some of the necessary energy. Also, some mining operations use solar energy only during the day.\n\nWind-Powered Mining In The Netherlands\n\nThe miners in the Netherlands have used wind energy for Bitcoin mining. During strong winds, excess energy is produced by wind turbines, and mining operations can use this extra energy.\n\nHow Bitcoin Miners Can Contribute To Energy Storage And Grid Stabilization\n\nOne creative idea for energy storage and grid stabilization entails using extra energy produced by renewable sources for Bitcoin mining during non-peak times. By utilizing the inherent flexibility of Bitcoin mining operations, this strategy addresses the intermittent nature of renewable energy sources as well as the requirement for grid stabilization.\n\nMaking Use Of Extra Renewable Energy\n\nEnergy offset : On windy or sunny days, when renewable energy output is high, there is frequently an excess of electricity produced that the grid is unable to adequately handle. This extra energy can be used by bitcoin miners, preventing it from being wasted.\n\nOff-peak mining: Cryptocurrency mining is best done during off-peak times, generally when energy consumption is low. This is in line with periods when local demand for renewable energy may outstrip supply, providing a remedy for intermittent problems.\n\nBenefits of Providing Consistent Energy Demand:\n\nGrid stability: Mining Bitcoins can operate as a steady, manageable load on the grid, absorbing extra energy during times of peak generation and reducing demand during times of high demand. By lowering fluctuations, this stabilizes the grid.\n\nEnergy storage: By transforming surplus energy into a priceless digital asset (Bitcoin), miners can indirectly support energy storage. When energy demand is strong, these assets can be sold, potentially raising money for additional grid infrastructure upgrades, such as energy storage options.\n\nReduced energy waste: By utilizing surplus renewable energy, the idea reduces energy waste, which helps to use clean energy sources more effectively and lessen the need for curtailment.\n\nEconomic incentives: Miners can provide financial incentives to producers of renewable energy, making it feasible for them to generate excess clean energy and follow sustainable energy practices.\n\nHow Collaboration With Local Communities Help Reduce Mining Concerns?\n\nTo allay worries about mining activity, local populations’ cooperation can be extremely important. Here are some advantages of such cooperation:\n\nCommunity engagement: Involving locals in the decision-making process promotes openness and confidence. Public meetings can be held by miners to address issues, solicit input, and make sure the community’s perspectives are heard.\n\nEnvironmental impact mitigation: Through joint efforts, responsible mining techniques that limit environmental harm can be developed. Communities can help identify locations to protect and can offer useful insights into local ecosystems.\n\nEconomic opportunities: Mining operations frequently result in job creation and regional economic expansion. Partnerships with local businesses and local hiring priorities can strengthen the local economy and ease concerns about unemployment.\n\nInfrastructure development: Mining activities can aid in the development of infrastructure. Investments in roads, schools, and healthcare facilities could result from cooperation, which would be advantageous to both miners and locals.\n\nResource sharing: Collaborative agreements can specify the procedures for sharing resources, making sure that communities get a fair share of the advantages brought about by mining activity.\n\nEnvironmental stewardship: To leave a positive legacy for the community, cooperative efforts can concentrate on post-mining environmental rehabilitation and land reclamation.\n\nSocial responsibility: Miners can participate in social responsibility projects, such as helping with healthcare and education, to strengthen their ties with the local communities.\n\nEnvironmental Accountability For Using Renewable Energy\n\nMaking use of renewable energy sources is a big step in the direction of environmental responsibility. Carbon credits, which encourage the reduction of emissions, are frequently available to businesses that use renewable energy. The exchange or sale of these credits can result in financial gains while advancing a greener cause. It is critical to provide transparent reporting on energy use and carbon emissions.\n\nBy enabling stakeholders to evaluate the actual environmental impact, it promotes accountability. This kind of reporting not only makes sure that laws are followed, but it also shows that a company is committed to sustainability, which can draw in investors and environmentally aware customers. Overall, adopting renewable energy is a potent strategy for business accountability and environmental care, reinforced by carbon credits and open reporting.\n\nTransitioning To Sustainable Bitcoin Mining: Challenges And Future Outlook\n\nWhile there are many obstacles to overcome, switching to environmentally friendly Bitcoin mining offers an optimistic future. Addressing the industry’s high energy use and carbon footprint is one of the challenges. To lessen their influence on the environment, miners are increasingly using renewable energy sources and cutting-edge cooling techniques.\n\nTo come up with acceptable solutions, miners, governments, and communities must work together. Sustainability is anticipated to be fueled by developments in energy-efficient mining equipment, strengthened regulatory frameworks, and the use of renewable energy sources. Bitcoin mining can become more ecologically benign and in line with global sustainability standards as the sector develops.\n\nConclusion\n\nBy adopting sustainable methods, Bitcoin miners have the ability to hasten the world’s energy transformation. Miners may lessen their carbon footprint and help create a cleaner energy ecosystem by using extra renewable energy, implementing energy-efficient equipment, and working with communities and governments.\n\nThis change improves the environment as well as the mining industry’s long-term sustainability, bringing it into line with the overarching objectives of a greener and more sustainable energy future.\n\nFAQs:\n\nWhy is Bitcoin mining seen as energy-intensive?\n\nBitcoin mining involves solving complex mathematical puzzles, which requires substantial computational power. This process, known as proof-of-work, consumes significant electricity.\n\n\n\nHow can miners use excess renewable energy for mining?\n\nMiners can harness surplus renewable energy, often generated during off-peak hours, to power their operations. This helps maximize clean energy utilization.\n\nWhat are the benefits of energy-efficient mining hardware?\n\nEnergy-efficient mining hardware reduces power consumption, making mining operations more environmentally friendly and economically viable.\n\n\n\nHow can mining collaboration with communities promote sustainability?\n\nCollaboration with local communities ensures responsible mining practices, fosters economic growth, and mitigates environmental concerns, promoting a sustainable approach.\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYS1iaXRjb2luLW1heGltYWxpc3RzLW9kZS10by1vcmRpbmFsc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "A Bitcoin Maximalist's Ode To Ordinals - Nasdaq",
        "content": "This is an opinion editorial by L. Asher Corson, a partner at UTXO Management.\n\nAs a Bitcoin Maximalist, I love Ordinals. Other Maximalists should also consider loving Ordinals, as they demonstrate Bitcoin's superiority in ways not previously possible. Ordinals enable functionalities that undermine the need for other blockchains to even exist. The use cases that were demonstrated on other blockchains are now possible natively on Bitcoin. Despite Bitcoin’s strengthening position, some self-proclaimed Maximalists on X (formerly Twitter) bizarrely celebrated decreased network fees and declared Ordinals to have failed. This seemingly implies that Bitcoin might somehow benefit from a failure of the Ordinals protocol and lower miner earnings. But Ordinals haven’t failed and the interest isn’t nearly over. To the contrary, trading volume across digital artifacts, unique satoshis and BRC-20 tokens has been historic. According to cryptoslam which tracks on-chain NFT volume, Ordinals have done over $500 million of trading volume since they were launched at the beginning of 2023. Despite volume and prices being down currently, investors in the ecosystem are writing big checks to Ordinals companies. Xverse, an Ordinals wallet, just raised 5 million dollars on a 50 million dollar valuation from some of the most sophisticated investors in the ecosystem. It’s far more likely we are at the beginning of this phenomenon than the end.\n\nWhat are Ordinals? It is a protocol developed by Casey Rodarmor (@rodarmor) that enables any data to be included in a Bitcoin transaction. It uses Ordinal Theory to associate that data with a specific satoshi (the smallest unit of Bitcoin) which can be owned and traded. This innovation enables the creation and trading of digital assets directly on the Bitcoin blockchain without a peg or a bridge.\n\nBitcoin Maximalists understand that there have never been serious contenders to replace bitcoin as digital money, and it’s unlikely any will ever emerge. Viable altcoin use cases have never been based on having better monetary properties than bitcoin because that really isn’t possible. Absolute digital scarcity is unlikely to be discovered again because the circumstances surrounding Bitcoin’s creation were so unique, in part, because today’s government understands the risks of letting a decentralized network grow too large and they won’t let it happen again.\n\nOn the other hand, viable altcoin use cases are related to features that Bitcoin couldn’t previously support. Some of those use cases that the market has indisputably embraced include: decentralized trading, non-fungible tokens (NFTs), stablecoins, capital formation, borrowing/lending and on-chain leverage. Uniswap, a decentralized exchange, has done almost $500 billion in trading volume since it was launched in 2018. Additionally, Ethereum has done $43.6 billion in NFT trading volume, according to CryptoSlam!. Source: CryptoSlam! NFT data, rankings, prices, sales volume charts, market cap\n\nAlthough many don’t like it, these use cases will exist somewhere because the market has an appetite for them. My strong preference is that they exist primarily on Bitcoin and not on other chains. It would certainly be better for Bitcoin and the effort to separate money and state, if there were not so many competing chains soaking up market share. Ordinals have the potential to not only enable these use cases to be built natively on Bitcoin, but also to surpass their altcoin versions in terms of implementation. These would be better built on Bitcoin because the protocol itself is more decentralized and secure than altcoins. Bitcoin has the largest market capitalization compared to all the other chains that can support the development of these use cases. But also better because these use cases will be tailored to the Bitcoin community and will therefore embody Bitcoin ideals of decentralization, immutability and permissionlessness.\n\nAlthough the protocol itself can’t stop scams, Rodarmor purposefully built Ordinals with Bitcoin ideals at the forefront of his design decisions. For example, the Ordinals implementation of digital artifacts is objectively superior to the way almost all NFTs were implemented on Ethereum and other chains. Danny Huuep describes the properties of a digital artifact, all of which Ordinals meet, extremely well:\n\nSource: X\n\nImagine a piece of digital art worth $1 million, or imagine politically sensitive information like classified documents that detail government atrocities. Should these valuable or sensitive assets be distributed using technology that can easily disappear or that can be easily changed? The answer is obviously no. It’s also somewhat obvious that over time, the best artists, developers , activists, and investors will gravitate towards technology with stronger immutability that is capable of protecting their creation, information, or investment for hundreds or even thousands of years. In the case of digital art specifically, they will migrate to digital artifacts on Bitcoin that store the actual artwork, instead of NFTs that just point to where it’s stored on an off-chain server that could go down at any time.\n\nBitcoin stands alone atop the world of digital money, and the rise of Ordinals only cements that standing. This is not just about the idea of Bitcoin dominance in market capitalization terms, but the sheer dominance of Bitcoin's principles and the vast potential of its immutable blockchain. With Ordinals unlocking unprecedented opportunities within the Bitcoin ecosystem, I see a seismic shift on the horizon. This shift should make Maximalists smile.\n\nThis is a guest post by L. Asher Corson. Opinions expressed are entirely their own and do not necessarily reflect those of BTC Inc or Bitcoin Magazine.\n\nDisclosure: L. Asher Corson is a partner at UTXO Management, subsidiary of BTC Inc., the parent company of Bitcoin Magazine\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mb3JtZXItc2VjLWNoYWlyLXNwb3QtYml0Y29pbi1ldGYtYXBwcm92YWwtaW5ldml0YWJsZS1kZXNwaXRlLWRlbGF5c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Former SEC chair says spot Bitcoin ETF approval is 'inevitable' despite delays - Cointelegraph",
        "content": "Following the United States Securities and Exchange Commission (SEC) delaying decisions on several spot Bitcoin exchange-traded funds, former commission chair Jay Clayton said he believed approval was still going to happen at some point.\n\nIn a Sept. 1 interview with CNBC, Clayton said major financial institutions backing spot Bitcoin (BTC) investment vehicles represented a shift in how retail investors could get exposure to crypto. On Aug. 31, the SEC designated a longer period in which it could review spot BTC exchange-traded fund (ETF) applications from BlackRock, WisdomTree, VanEck, Invesco Galaxy, Bitwise, Valkyrie and Fidelity.\n\nThe commission has another 45 days upon publication of the notice in the Federal Register to approve, deny or again delay the ETF applications from these seven major firms. Clayton said he expects to see “progress on this going forward.” The SEC can continue to push the deadlines on the applications until March 2024.\n\n“An approval is inevitable,” said Clayton. “The dichotomy between a futures product and cash product can’t go on forever.”\n\nRelated: Bitwise withdraws Bitcoin and Ether Market Cap ETF application\n\nClayton’s argument echoed that of U.S. Court of Appeals Circuit Judge Neomi Rao, who, along with two other judges, ordered the SEC to review asset manager Grayscale’s application to convert its Bitcoin Trust (GBTC) into a spot Bitcoin ETF. Rao said that the SEC had already approved BTC futures ETFs and suggested Grayscale’s offering was “materially similar.”\n\nThe ETF application delays came in quick succession on Aug. 31, before the Labor Day holiday weekend in the United States. The next deadline for major spot BTC applications under review falls on Oct. 7, when the commission is expected to make an announcement about the offering from fund manager Global X.\n\nMagazine: SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMDEvdXMtYXVndXN0LWpvYi1hZGRzLW9mLTE4N2stdnMtZXN0aW1hdGVzLWZvci0xNzBrLXVuZW1wbG95bWVudC1yYXRlLXJpc2VzLXRvLTM4L9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMDEvdXMtYXVndXN0LWpvYi1hZGRzLW9mLTE4N2stdnMtZXN0aW1hdGVzLWZvci0xNzBrLXVuZW1wbG95bWVudC1yYXRlLXJpc2VzLXRvLTM4L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "U.S. August Job Adds of 187K Vs Estimates for 170K; Unemployment Rate Rises to 3.8% - CoinDesk",
        "content": "Checking other report details, average hourly earnings were higher by 0.2% in August against forecasts for 0.3% and down from 0.4% in July. On a year-over-year basis, average hourly earnings were up 4.3% in August versus forecasts for 4.4% and down from 4.4% in July."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNvbnRpbnVlcy10by1vdXRwZXJmb3JtLXdhcnJlbi1idWZmZXR0LXMtcG9ydGZvbGlvLWFuZC10aGUtZ2FwLWlzLXNldC10by13aWRlbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin continues to outperform Warren Buffett's portfolio, and the gap is set to widen - Cointelegraph",
        "content": "Warren Buffett, the renowned investor and chairman of Berkshire Hathaway, celebrated his 93rd birthday on Aug. 30. Throughout his lengthy career, he has adhered steadfastly to a value investing strategy that bears some resemblance to the “buy and hold” approach often associated with cryptocurrencies.\n\nHowever, Buffett’s focus is on assets with strong earnings potential and investing in companies and sectors where he and his team possess a deep understanding of the associated risks, competition and advantages.\n\nThe question is whether such a laser-eyed strategy can outperform Bitcoin (BTC) in the long run. Moreover, investors should question why one of the greatest stock pickers of all time currently holds cash and short-term bonds as the second-largest position in his portfolio.\n\nAn interesting example of his approach is Berkshire Hathaway’s largest holding, Apple (AAPL) shares. Berkshire initially acquired these shares in early 2016 when Apple was already valued at over $500 billion, so the firm was far from being an early investor. Notably, Berkshire Hathaway continued to add to its AAPL investment in 2022, even though the stock had rallied over 500% since its initial purchase. This illustrates Buffett’s commitment to long-term investment strategies, regardless of recent price movements.\n\nBuffet downplays nonproductive commodities as a store of value\n\nIn a February 2012 shareholder letter, Berkshire Hathaway expressed concerns about the devaluation of paper currency and discussed the limitations of gold as a store of value. It argued that gold lacks practical utility, with demand for industrial and jewelry purposes falling short of production, and its price is largely driven by fear-based sentiment, which leads to only temporary price increases. In contrast, investments in productive companies generate substantial dividends and returns.\n\nBerkshire Hathaway also noted that regardless of whether the future currency is based on gold, seashells or paper, people will always be willing to exchange a portion of their income for goods and services.\n\nRegrettably for Buffett, Bitcoin’s price surged by 683% in the 12 months following his critical comments on the viability of nonproductive commodities as a store of value. Moreover, on a four-year horizon, Bitcoin’s gains amounted to a staggering 9,014%.\n\nTo compare the performance of Berkshire Hathaway’s stock holdings to Bitcoin, considering Buffett’s focus on earnings and yield, which is fundamentally different from the characteristics of commodities like gold or Bitcoin, this analysis calculated Berkshire Hathaway’s stock performance using a factor of three to simulate a leveraged position.\n\nBerkshire (BBRK.B) by a factor of 3 vs. Bitcoin/USD index (orange). Source: TradingView\n\nIf an individual had invested $1,000 in Bitcoin (spot) and initiated a leveraged long position in Berkshire Hathaway shares in early 2019, the investor would have observed a return of $7,020 in BTC compared with $5,623 in Buffett’s holding company.\n\nBerkshire (BBRK.B) by a factor of 3 vs. Bitcoin/USD index (orange). Source: TradingView\n\nSimilarly, for an investment starting in 2017, it would have resulted in $3,798 in BTC, as opposed to $1,998 using the leveraged long strategy in Berkshire Hathaway’s shares.\n\nThe apparent inconsistency in Buffett’s strategy is bullish for Bitcoin\n\nIt’s important to note a potential loophole in Buffett’s investment thesis: Berkshire Hathaway is currently maintaining a record-high $147 billion in cash equivalents and short-term investments, representing 18.5% of the company’s total market capitalization. This raises questions about whether it is waiting for better entry points into selected stocks or if it deems the 5.25% returns on fixed-income investments to be satisfactory.\n\nThis scenario highlights that even the most accomplished stock market investors may have reservations about deploying their cash. It also prompts questions about whether some of the funds currently on the sidelines, including the $5.6 trillion in money market funds, might seek alternative forms of protection if inflation makes a resurgence.\n\nBitcoin may not be a perfect store of value, and its volatility has been a subject of concern. Additionally, it’s essential to acknowledge that Bitcoin has yet to face a global economic recession, making it premature to pass definitive judgment.\n\nHowever, the consistent outperformance of Bitcoin’s price compared to Berkshire Hathaway shares suggests that investors are increasingly viewing it as a viable alternative store of value.\n\nIn light of this, Berkshire Hathaway’s substantial cash position serves as a potential cautionary note for those skeptical about Bitcoin. With Bitcoin’s total market capitalization currently standing at $500 billion, it signals significant and untapped potential for it to play a larger role in the financial landscape.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1jcnlwdG8tdG9rZW4tYXVndXN0LXN0b2Nrcy1ib25kcy1lcXVpdGllcy1tYXJrZXRzLWludmVzdG9ycy0yMDIzLTnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Notches 2nd-Straight Losing Month in Tough August for Markets - Markets Insider",
        "content": "Bitcoin finished August about 10% lower, its second consecutive losing month.\n\nCrypto was caught up in a tough sell-off that hit stocks and bonds throughout the month.\n\nBitcoin extended losses into September, down more than 2.5% on Friday to trade at $25,660.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin just capped off its second-straight losing month, shedding more than 10% over the last four weeks.\n\nThe decline happened alongside a sell-off in stocks and bonds, and on Friday the world's largest cryptocurrency traded around $25,800, lower by more than 2.5% to extend losses into the new month.\n\nEven as investors cheered Grayscale's court win over the Securities and Exchange Commission—which many see as helping to pave the way for a spot bitcoin ETF—bitcoin couldn't eke out a gain in August.\n\nGrayscale sued the SEC in 2022 after the agency rejected its application to turn its bitcoin trust into an ETF. Analysts speculate that the ruling out of the District of Columbia Court of Appeals could mean the SEC will ultimately approve the numerous applications for spot bitcoin ETFs currently in limbo.\n\nAdvertisement\n\nBitcoin hasn't been able to find solid footing this summer after soaring about 80% in the first half of the year. Still, even with July and August's losses, the token has gained more the 54% year-to-date.\n\nIt wasn't just bitcoin feeling the pain of the August sell-off. Other tokens, including ether, solana, and dogecoin all slumped, with each of the tokens sliding further Friday. The end-of-week dip comes after the SEC announced late Thursday that it would delay deciding on all of its spot bitcoin ETF applications until October. Applicants included BlackRock, WisdomTree, Invesco Galaxy, and other firms.\n\nStill, with bitcoin's halving event set to happen in April 2024, many executives and strategists remain bullish in their long-term outlook. Joe Kelly, the cofounder of financial services firm Unchained, said the token could breach the six-figure mark a year after halving.\n\n\"Taking a conservative view, if bitcoin stays around $30K until the halving, even a 12-month post-halving increase of 250% — which, again, is conservative relative to previous halvings — would price bitcoin at $105K,\" Kelly wrote in an August note."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYXJrZXRzLWVyYXNlLXdlZWtseS1nYWlucy1zZWMtMTUyMDA1NzI2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Markets Erase Weekly Gains After SEC Delays Bitcoin ETF Decisions - Yahoo Finance",
        "content": "Crypto markets posted a “Bart Simpson” pattern for the week, with yesterday’s sell-off erasing all of Tuesday’s $60B digital asset rally.\n\nThe reversal was triggered on Thursday by the U.S. Securities and Exchange Commission postponing decision-making on Bitcoin ETFs proposed by BlackRock, the world’s largest asset manager, and Valkyrie, WisdomTree, and Invesco.\n\nThe combined cryptocurrency capitalization slumped 3.7% in 24 hours, sliding $40B from roughly $1.08T to a low of $1.04T. BTC shed nearly 5% and is trading for $25,960, while ETH is down 3.6% at $1,644.\n\nThe result? Market action that resembles the popular spiky-haired character from The Simpsons.\n\nMarkets Erase Weekly Gains After SEC Delays Bitcoin ETF Decisions\n\nJust 19 of the top 100 digital assets are up more than 1% in the past seven days, while 46 cryptocurrencies shed more than 1% over the same period. The top gainers were Toncoin (TON), Maker (MKR), and Mantle (MNT) with gains of 21.4%, 14.9%, and 8.7% respectively.\n\nKuCoin (KCS) suffered the heaviest loss with 21.2%, followed by Hedera (HBAR) with 14.3%, and Kaspa (KASO with 9.4%.\n\nThe market cap of DeFi assets also finished the week where it started with $42.8M after pushing up to $44.5M.\n\nDespite the late-week retracement, four DeFi assets rallied more than 40% for the week among eight double-digit gainers, with Unifi Protocol (UNFI), Tellor Tributes (TRV), and Joe (JOE) topping the list. InSure (SURE) was the week’s worst-performing DeFi asset with a 14.5% loss, followed by Redacted (BTRFLY) with 12.7%, and Gains Network (GNS) with 11.2%.\n\nMarkets Erase Weekly Gains After SEC Delays Bitcoin ETF Decisions\n\nYesterday’s bearish momentum put a dampener on celebrations after a U.S. judge ruled against the SEC in Grayscale’s challenge to the SEC’s decision to reject its application for a Bitcoin ETF on Tuesday.\n\nGrayscale, a top crypto asset manager, argued that its proposed exchange-traded fund was “materially similar” to exchange-traded products tracking Bitcoin futures that the SEC approved last year.\n\nThe judge shared Grayscale’s assessment, describing the SEC’s decision to deny the ETF as “arbitrary and capricious because the Commission failed to explain its different treatment of similar products.”\n\nStory continues\n\nzkSync Challenges Ethereum’s Throughput Dominance\n\nMany of Ethereum’s top Layer 2s witnessed impressive growth over the week.\n\nzkSync Era is giving the Ethereum mainnet a run for its money, processing 28.5M transactions over the past 30 days, compared to Ethereum’s 30.9M, according to L2beat. Era also posted a record daily throughput of 15.2 transactions per second (TPS) on Aug. 26.\n\nStarknet’s throughput pushed to a daily record high of 8.5 TPS on Aug. 31 to rank second, a 53.5% gain compared to seven days ago.\n\nMarkets Erase Weekly Gains After SEC Delays Bitcoin ETF Decisions\n\nThe recent frenzy of activity on Base, Coinbase’s recently launched L2, appears to have subsided. The network processed 5.6 TPS over the past 24 hours, down from a high of 15.9 TPS on Aug. 21. However, when coupled with Optimism — its Superchain sister network, the pair drove 10.5 TPS yesterday.\n\nCombined L2 throughput tagged 53.5 TPS on Aug. 31, just shy of last week’s all-time high of 54 TPS, despite the decline in activity on Base.\n\nL2 TVL Consolidates Below $10B\n\nThe total value locked in Ethereum L2s is at $9.6B, down from a record high of $10.7B at the start of the month.\n\nBase was the week’s top gainer with $359M, a 47.6% increase. The spike was driven by the launch of liquidity mining rewards from the Aerodrome DEX, overtaking its Optimism-based predecessor, Velodrome, within two days. Aerodrome is now Base’s top protocol by TVL with $203.8M, according to DeFi Llama.\n\nHowever, combined DeFi TVL trended sideways near $38B this week.\n\nEthereum’s burn rate also remained steady over the past seven days, with only 417.4 Ether ($690,000) removed from supply, according to Ultra Sound Money. Around 4,840 ETH were burned in the past week ($8M).\n\nRead the original post on The Defiant"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXJpc2tzLTIzay1kaXZlLWJ0Yy1wcmljZS1sb3Nlcy0xMS1hdWd1c3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin risks 'swift' $23K dive after BTC price loses 11% in August - Cointelegraph",
        "content": "Bitcoin (BTC) is headed for a long-term support retest, data suggests, after BTC price action fell into the August monthly close.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price: Roads point to $23,000\n\nReversing gains seen last week, BTC/USD is back below $26,000 as of Sep. 1, data from Cointelegraph Markets Pro and TradingView shows.\n\nMarket participants had seen cause for bullishness into the close, with Bitcoin holding a key long-term trendline and preserving $27,000.\n\nA decision by the United States Securities and Exchange Commission (SEC) to delay a slew of Bitcoin spot price exchange-traded fund (ETF) applications forced a rethink, with Bitcoin shedding $1,000 over just two hourly candles.\n\nNow, observers are concerned that even current levels may fail to hold the market up for long.\n\n“On-chain data suggests that $BTC lacks strong support below the $25,400 mark,” popular trader Ali told X (formerly Twitter) subscribers.\n\n“If BTC breaks below this threshold, it could swiftly correct down to $23,340.”\n\nUTXO realized price distribution (URPD) annotated chart. Source: Ali/X\n\nAli uploaded a chart of the UTXO realized price distribution (URPD) metric from on-chain analytics firm Glassnode.\n\nThis tracks the price at which the current set of transaction outputs was created and functions as a roadmap for likely price support and resistance levels.\n\nA breakdown to $23,000 would not come as a surprise to some, with that target already on the radar for various traders and analysts.\n\nBitcoin inches toward key support battleground\n\nContinuing, on-chain monitoring resource Material Indicators delivered a similarly grim picture for BTC/USD on daily (D), weekly (W) and even monthly (M) timeframes.\n\nRelated: Bitcoin metric with ‘100% long hit rate’ predicts $23K BTC price floor\n\nUsing signals from one of its proprietary trading tools, Trend Precognition, Material Indicators advised that $24,750 needed to hold for bulls to have a chance at clinching a rebound.\n\n“If price moves and holds below $25,350 the W signal will invalidate, however, if support holds above the LL at $24,750 there will be a good foundation to rally from and retest resistance,” part of X commentary explained.\n\n“We will look to the Monthly candle open for a signal from the Trend Precognition algos to gain insight to whether we can expect an extension of the downtrend or a monthly momentum shift to the upside.”\n\nBTC/USD 1-month chart with Trend Precognition signals. Source: Material Indicators/X\n\nData from CoinGlass meanwhile showed Aug. 31 sparking the largest volume of BTC long liquidations since Bitcoin’s 10% dive earlier in the month.\n\nThese came in at $41 million, with the cross-crypto total at $108 million — still far below the daily tally from two weeks prior.\n\nCrypto liquidations chart (screenshot). Source: CoinGlass\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXR3aXNlLXdpdGhkcmF3cy1iaXRjb2luLWFuZC1ldGhlcmV1bS1tYXJrZXQtY2FwLWV0Zi1hcHBsaWNhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitwise withdraws Bitcoin and Ether Market Cap ETF application - Cointelegraph",
        "content": "In an unexpected turn of events, Bitwise submitted a request to retract its application for its Bitcoin and Ether Market Cap Weight Strategy exchange-traded fund (ETF), initially filed with the United States Securities and Exchange Commission (SEC) on Aug. 3.\n\nWhile market sentiment turned bullish following Grayscale’s SEC victory, Bitwise appears to be reassessing its strategy. The withdrawal of the ETF application was unexpected; however, in the filing, a statement read, “The fund seeks to provide investors with capital appreciation. There can be no assurance that the fund will achieve its investment objective.”\n\nBitwise chief investment officer Matt Hougan advocated for SEC approval of all ETFs in a recent Bloomberg interview. The ETF intended to invest in either Bitcoin (BTC) futures contracts or Ether (ETH) futures contracts, determined by market capitalization. Bitwise also collaborated with ProShares to launch another ETF around the same time.\n\nIn the withdrawal statement, Bitwise said:\n\n“The Trust no longer intends to seek effectiveness of the Fund and no securities of the Fund were sold, or will be sold, pursuant to the above-mentioned Post-Effective Amendment to the Trust’s Registration Statement.”\n\nThe SEC has delayed its decision on Bitcoin ETF applications from WisdomTree, Invesco Galaxy, Valkyrie, VanEck, BlackRock, Bitwise and Fidelity. According to a SEC filing dated Aug. 31, the commission has designated a longer period in which it may review spot Bitcoin ETF applications from WisdomTree, VanEck, Invesco Galaxy, Bitwise and Valkyrie, Wise Origin Bitcoin Trust proposed by Fidelity, as well as BlackRock’s Bitcoin ETF. The next set of deadlines for the SEC is in mid-October, but these may also be delayed to the SEC’s third batch of deadlines in January or to the final possible decision dates in March, April and May of next year.\n\nBitwise was among the early asset management firms that lodged applications with the SEC for Bitcoin ETF products. Its January 2019 application with the U.S. securities regulator proposed a BTC-backed ETF tracking the Bitwise Bitcoin Total Return Index, which is calculated based on the value of Bitcoin derived from BTC transactions taking place on exchanges.\n\nRelated: SEC delays decision on 6 spot Bitcoin ETF applications\n\nThe company’s proposed Bitcoin ETF was touted to draw market data from a number of cryptocurrency exchanges in an effort to provide a trusted representation of the wider cryptocurrency markets. The firm would also require third-party custodians to physically hold Bitcoin.\n\nBitwise’s recent withdrawal isn’t its first. Earlier this year, it submitted an application for an Ethereum Strategy ETF designed to invest in both front-time and back-time Ethereum futures. However, the asset manager withdrew its application just one week later.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXJzaS1zaG93ZG93bi1idGMtcHJpY2UtbmV3LTItd2Vlay1sb3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin lines up RSI showdown as BTC price slips toward new 2-week low - Cointelegraph",
        "content": "Bitcoin (BTC) fell further after the Sept. 1 Wall Street open as monthly close losses continued to play out.\n\nBTC/USD 1-day chart. Source: TradingView\n\nBTC price “Grayscale hype” disappears\n\nData from Cointelegraph Markets Pro and TradingView followed weakening BTC price performance, which hit its lowest since Aug. 22.\n\nBitcoin bears took full advantage of the August monthly close, with downside volatility characterizing Bitcoin and crypto markets overnight.\n\nOverall, BTC/USD lost 11.2% in August, and looking ahead into September, there was little optimism regarding a rebound among market observers.\n\nIn his latest YouTube update, popular trader and analyst Rekt Capital delineated Bitcoin’s potential next steps.\n\nBTC price had failed to hold on to gains coming courtesy of “Grayscale hype,” he said, with selling pressure strong and weekly relative strength index (RSI) values dropping toward a key rising trendline.\n\nA cluster of exponential moving averages (EMAs), previously acting as support, were also now flipping to resistance.\n\n“We’ve seen for a very long time, multiple months — over a year now, actually — that this trendline is holding, and if we lose this RSI trendline, we’ll probably see further downside,” Rekt Capital explained.\n\nBTC/USD annotated chart with RSI data. Source: Rekt Capital/YouTube\n\nTargets for a fresh drop lay at various points on the way to $23,000, now a favorite among traders.\n\n“Somewhere between 7% and 13% should be reasonable” for September losses based on historical norms, he added, referencing data from on-chain monitoring resource CoinGlass.\n\nBTC/USD monthly returns chart (screenshot). Source: CoinGlass\n\nShould a relief rally occur, Rekt Capital continued, this could top out at $27,200 — a line in the sand that used to act as support.\n\nU.S. dollar strength retests June highs\n\nBitcoin’s performance was not helped by a second day of solid upside for U.S. dollar strength.\n\nRelated: Why is the crypto market down today?\n\nThe U.S. Dollar Index (DXY) was above 104 at the time of writing, having made up for recent losses and apt to continue an uptrend that began in mid-July.\n\nA previous local high in June acted as resistance upon a retest in August, with this now the level of interest.\n\nMarket participants are split over the current role of the DXY’s strength in suppressing BTC price, with an inverse correlation between them repeatedly challenged over the past year.\n\nU.S. dollar index (DXY) 1-day chart. Source: TradingView\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8xNTQ1NjUvYml0Y29pbi1ldGhlcmV1bS1kcm9wLXNlYy1kZWxheXMtZXRmLWRlY2lzaW9u0gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzE1NDU2NS9iaXRjb2luLWV0aGVyZXVtLWRyb3Atc2VjLWRlbGF5cy1ldGYtZGVjaXNpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum Drop After SEC Delays ETF Decision - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin briefly dropped below $26,000 early this morning as optimism around the approval of a Bitcoin ETF application was again delayed.\n\nYesterday, the SEC extended the deadline to approve or deny six ETF decisions by 45 days, citing the need for additional time to evaluate the applications.\n\nAD\n\nAD\n\nThe negative price movement over the past day reversed the bullish gains in BTC following the Grayscale court decision earlier this week.\n\nOn August 29, the U.S. Court of Appeals for the D.C. Circuit overturned the SEC’s decision to block Grayscale from converting its Bitcoin Trust (GBTC) to a spot Bitcoin ETF, ordering the Commission to review the application again.\n\nThe ruling raised hopes of imminent approval, pushing Bitcoin’s price surged to a peak near $28,000, per CoinGecko, on Wednesday after the court’s verdict came out.\n\nAnother delay from the securities regulator crushed the market’s optimism, however, sending Bitcoin prices back towards $26,000.\n\nEthereum (ETH) followed the top cryptocurrency with a 3.5% dip since yesterday.\n\nThe crypto market cap declined by 3.5%, losing $11.2 billion overnight.\n\nAD\n\nAD\n\nNotably, Maker (MKR) and Toncoin (TON) resisted the bearish move, standing above the rest of the market with positive gains. MKR was up 5% and TON 3% over the last 24 hours.\n\nMaker’s governance token has likely benefited from accumulation by wealthy investors.\n\nOn-chain analysis outlet Santiment reported that addresses holding between 100 and 10,000 MKR coins bought around 61,500 MKR tokens since mid-July, worth $70.9 million at current prices, per CoinGecko.\n\nToncoin’s bullish momentum can be attributed to ecosystem development by the TON Foundation, the team managing and developing atop the Ton blockchain.\n\nThe Foundation released a Telegram-centric Web3 app store and also launched a community-driven initiative, Believers.ton, for promoting ecosystem development.\n\nMacro signals mean uncertainty for crypto\n\nThe global macroeconomic landscape also sent mixed signals yesterday, jarring all financial markets, including crypto.\n\nThe US Bureau of Economic Analysis (BEA) released key economic data that reduced the market's expectations regarding a potential interest rate hike.\n\nA higher benchmark interest rate eats into corporate profits while making low-risk instruments such as government bonds more lucrative, diminishing the future values of stocks and other risk assets.\n\nAD\n\nAD\n\nThe U.S. Personal Consumption Expenditures (PCE) price index for July stood at 3.3%, 0.3% higher from June.\n\nThe PCE index is the Federal Reserve's preferred measure of inflation, tracking the prices of goods and services that consumers purchase.\n\nWhile the inflation levels were higher than the previous month, PCE readings for July aligned with the market’s expectations raising hopes that the Fed might pause on interest rate hikes.\n\nThe S&P 500 index traded slightly lower on Thursday, closing 0.16% lower at 4,507.67 points. While the dollar index (DXY) against other global reserve currencies gained 0.44% Thursday, last trading at 103.56 points.\n\nInvestors are now eagerly awaiting the August U.S. employment data scheduled for release today, which will provide more clarity about the potential rate hike decision."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wOS0wMS9iaXRjb2luLWJ0Yy1mYWl0aGZ1bC1yZXN1bWUtZXRmLWFwcHJvdmFsLWd1ZXNzaW5nLWdhbWUtYWZ0ZXItbGF0ZXN0LXJlamVjdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Faithful Resume ETFs Approval Guessing-Game After Latest Round of Rejections - Bloomberg",
        "content": "After a summer-time surge of exchange-traded-fund-inspired exuberance, Bitcoin advocates are back to speculating whether the SEC will ever allow asset managers to offer US funds that invest directly in the largest cryptocurrency.\n\nAfter this week’s deferral of applications from the likes of Fidelity and Invesco by the main US securities regulator, Bitcoin has essentially erased all of the gains registered since fund powerhouse BlackRock Inc. joined in on the race in June to try to be the first to win approval. The turnaround comes even with a favorable court decision this week that appeared to clean the path for Grayscale to convert the biggest crypto trust into an ETF."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWdyYXlzY2FsZS1nYWlucy13aXBlZC13aXRoLXNlYy1zcG90LWV0Zi1kZWxheXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin traders wipe Grayscale gains after SEC delays spot ETF decisions - Cointelegraph",
        "content": "In less than a day, Bitcoin (BTC) has shed nearly all the gains it made from Grayscale Investment's court victory against the United States Securities regulator.\n\nOn Aug. 29, Bitcoin popped to a two-week high after a judge ruled that the Securities and Exchange Commission was “arbitrary and capricious” when it rejected Grayscale’s spot Bitcoin ETF application.\n\nHowever, the SEC’s Aug. 31 decision to delay seven pending spot Bitcoin ETF applications sent Bitcoin’s price downward — falling nearly 5% in the 24 hours to 12 am UTC Sep. 1.\n\nCointelegraph Markets Pro data showed Bitcoin’s price at around $26,000, falling steeply from around the $27,300 level it had been sustaining since the Grayscale win.\n\nBTC's seven-day price chart shows its gains erased. Source: Cointelegraph Markets Pro\n\nSpot Bitcoin ETF applications from BlackRock, WisdomTree, VanEck, Bitwise, Valkyrie and Fidelity, along with a joint fund application by Invesco and Galaxy, were all delayed by the SEC.\n\nThe price decline came even though some experts, including Bloomberg ETF analysts Eric Balchunas and James Seyffart, had expected the delays to take place, .\n\nWe’ve now fully retraced back to pre SEC Grayscale Lawsuit Bitcoin price.\n\n\n\nPretty much sums up where the markets at right now. pic.twitter.com/PS4T12uHFh — Ben Simpson (@bensimpsonau) August 31, 2023\n\nThe SEC’s delay gives it another 45 days to approve, deny or again delay the applications.\n\nRelated: When will it be too late to invest in Bitcoin?\n\nThe next decision deadlines for the ETF applications are between Oct. 16 and Oct. 19, though the SEC could choose to delay the decision again, up to around mid-March of next year, when it will be forced to make a decision.\n\nHowever, Balchunas said on Aug. 30 that the probability of the SEC approving a spot Bitcoin ETF this year was 75% — up from an earlier prediction of 65%.\n\nHe pinned the probability hike on Grayscale’s court win saying the judge's unanimous rejection of the SEC’s arguments means it “will struggle to justify further denials as it faces deadlines.”\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZGVjcnlwdC5jby8xNTQ1OTMvY2FtYnJpZGdlLXVwZGF0ZXMtYml0Y29pbi1taW5pbmctaW5kZXgtcmV2ZWFsLXRydWUtcG93ZXItY29uc3VtcHRpb27SAWRodHRwczovL2RlY3J5cHQuY28vMTU0NTkzL2NhbWJyaWRnZS11cGRhdGVzLWJpdGNvaW4tbWluaW5nLWluZGV4LXJldmVhbC10cnVlLXBvd2VyLWNvbnN1bXB0aW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Cambridge Updates Bitcoin Mining Index to Reveal True Power Consumption - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nYour Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter three years, the University of Cambridge has implemented a major update to its Bitcoin Electricity Consumption Index (CBECI) to more accurately assess the global energy footprint of Bitcoin miners.\n\nThe conclusion?\n\nThe previous power estimates were greatly overestimated.\n\nAD\n\nAD\n\n“The first and most noticeable discrepancy appears in 2021, where our previous CBECI model estimated an electricity consumption of 104 terawatt-hours (TWh), 15.0 TWh higher than the revised model estimate (89.0 TWh),” the report read.\n\nA terawatt-hour (TWh) is a unit of energy equivalent to outputting one trillion watts for one hour. For context, if used for one hour per day, an average incandescent lightbulb consumes 21,900 watthours in a year.\n\nThe university’s 2022 power estimate was also adjusted down by 9.8 TWh, from 105.3 TWh to 95.5 TWh, putting Bitcoin’s electricity consumption that year in roughly the same league as U.S. tumble dryers (108TWh).\n\nThe need for revision arose from the university’s former methodology that every “profitable” hardware model released within the past five years “equally fueled the network hashrate.”\n\nThough effective for most of Bitcoin’s lifespan, the methodology started exhibiting shortcomings in 2021 after China’s mining ban.\n\nAD\n\nAD\n\n“This led to overestimating the number of older hardware and underestimating the proportion of newer hardware,” the report’s author Alexander Neumueller told Decrypt.\n\nASIC hardware devices have become “considerably more efficient” and powerful over time. ASICs are “Application Specific Integrated Circuits,\" machines specially designed to mine Bitcoin as efficiently as possible.\n\nGiven that the ban created a shortage in data center capacity, Cambridge said it is “reasonable to infer that mining operators would have already replaced all old machines with newer models.”\n\nCambridge model good, but not perfect\n\nShortcomings also emerged during “exceptionally profitable mining periods,” when the old hardware distribution estimates presented a “disproportionally large number of older devices.”\n\nWith its new methodology, Cambridge incorporated recent hardware mining deliveries, though many “assumptions and simplifications” still applied.\n\nNevertheless, the report’s findings reinforce those from a Coin Metrics study in June, which used the blockchain-based fingerprints left behind by mining machines to determine which hardware was dominating the network.\n\nThough the report’s findings were not incorporated into Cambridge’s new methodology, Neumueller said that he holds the Coin Metrics authors’ work in “high regard.”\n\nKarim Helmy—lead author of the Coin Metrics report—told Decrypt that he was glad to see Cambridge’s updated figures taking public company hardware data into account.\n\nAD\n\nAD\n\nHowever, he believes its figures are still inaccurate.\n\n“The new methodology continues to overestimate energy consumption in bull markets,” he said.\n\nFor example, Cambridge estimated a “considerable increase in energy consumption per terahash” between 2020 and 2021 which “is unlikely to have actually occurred in practice.”\n\nCambridge’s findings were also supported by CH4 Capital founder Daniel Batten, whose fund invests in companies using Bitcoin mining to clean up the environment.\n\nHis model estimates Bitcoin’s current power demand to be 13.095 GW, versus Cambridge’s 12.89 GW estimate. This figure presents the power it takes for all active mining devices to function.\n\nIn 2023, Cambridge estimates that the Bitcoin network has consumed 70.4 TWh of energy–so far."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3Lm1vcm5pbmdzdGFyLmNvLnVrL3VrL25ld3MvMjM4ODQ3L3doYXQtYXJlLXRoZS1jaGFuY2VzLW9mLWJlY29taW5nLWEtYml0Y29pbi1iaWxsaW9uYWlyZS1iYWNrLXRvLXNjaG9vbCEuYXNweNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "What Are the Chances of Becoming a Bitcoin Billionaire? Back to School! - Morningstar",
        "content": "You can watch the entire series here.\n\nMagnus Zhong: Hello, I'm Magnus Zhong, and this is Ian Tam. Over the past couple of years, we have heard of many cryptocurrencies like Bitcoin, Ethereum, or Dogecoin. Should you buy some? Today, we are talking about cryptocurrencies.\n\nIan, is it easy to invest in Bitcoin?\n\nIan Tam: Hey, Magnus. Yeah. So, it is actually pretty easy to invest in Bitcoin. What you need to do is open an account on a Bitcoin exchange, which will allow you to buy, sell and hold Bitcoin. So, in terms of doing it, it's quite easy mechanically. But in terms of succeeding, it's actually quite difficult. Bitcoin is a very volatile investment. So, it will require some pretty detailed skill and expertise to be able to invest successfully.\n\nZhong: How risky is it? Can I become a Bitcoin billionaire?\n\nTam: It's a great question. And you know what? We hear a lot of stories about people becoming billionaires through Bitcoin. But I understand you're into football or soccer, so you know, like, Ronaldo and David Beckham. These are soccer superstars. But for every David Beckham, there's thousands and thousands of soccer players that don't quite make it to the big leagues, right? So, you think about Bitcoin in the same way. There are very few investors that can do very well with Bitcoin. Everyone else tends to actually lose money with Bitcoin. So, it's quite a challenging investment.\n\nZhong: How should investors consider things like cryptocurrencies?\n\nTam: Yeah. It's a great question. At Morningstar, we think about Bitcoin as a type of thematic investment. So, another example would be like investing in Big Data or investing in a specific kind of technology. These are all kind of thematic investments. And what my colleague Ben Johnson says about thematic investments is that you're really making three bets when you're investing. The first is that you pick the right theme. So, maybe Bitcoin will be the next big thing and make everyone rich. Maybe. We're not sure.\n\nThe second is that, that theme is not already over value, not overpaying for investing in that theme. And the third is that you pick the right person to help you manage your investment within that theme. So, those are three very specific bets. So, the probability of being successful at all three is actually very small. But if you do win out on all three, it ends up being quite lucrative for you. But again, the probability is quite small.\n\nZhong: Okay. Thank you, Ian. For Morningstar, Magnus Zhong."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNTQ2OTUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tdG9uY29pbi10b24tcG9seWdvbi1tYXRpY9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNTQ2OTUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tdG9uY29pbi10b24tcG9seWdvbi1tYXRpYz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Unmoved in Slow Market Week - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nMost of the top thirty cryptocurrencies by market capitalization posted negligible losses or gains over the last seven days.\n\nBitcoin (BTC) starts the weekend at $26,051, pretty much the same level it was at last week.\n\nAD\n\nAD\n\nThe world’s most popular cryptocurrency briefly surged on Tuesday after a judge representing the U.S. Court of Appeals for the D.C. Circuit ordered a review of the Securities and Exchange Commission’s (SEC) denial of crypto asset manager Grayscale’s spot Bitcoin ETF application. The Court said the SEC had failed to provide a “coherent explanation” for the denial.\n\nEthereum (ETH) took inconsequential seven-day losses of 0.4% and now changes hands at $1,646.\n\nVirtually every other leading cryptocurrency is approximately the same price it was last weekend except Toncoin (TON), which blew up 22% to trade at $1.75, and Bitcoin Cash (BCH), which rose 8.6% to $206.87.\n\nToncoin’s bullish momentum can be attributed to the development of the TON ecosystem.\n\nThe TON Foundation, which spun out from Telegram to develop TON, recently released a Telegram-centric Web3 app store and launched a community-driven initiative, Believers.ton, to promote ecosystem development.\n\nBitcoin Cash was one of the fastest risers when the Grayscale/SEC news broke on Tuesday and appears to have sustained the rally into the weekend. Similarly, Coinbase stock soared 15% in the hours following the news.\n\nAD\n\nAD\n\nAny intraweek gains that Bitcoin and Ethereum made were wiped out early on Friday as the industry reacted to news that the SEC needed more time to approve or reject 6 Bitcoin ETF applications.\n\nAll told, it was another excruciatingly slow news cycle this week for those looking to see some sign of growing global crypto adoption. On Thursday, airline Giant Lufthansa launched an NFT-based loyalty program on Polygon. Polygon’s MATIC token didn’t particularly react to the news, though—it ended the week 1.2% higher at a price of around $0.55."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tcHJpY2UtdGVzdHMtc3VwcG9ydC1hdC0yNi0wMDAtd2l0aC1hdWd1c3RzLXVzLW5mcC1kYXRhLWV4Y2VlZGluZy1tYXJrZXQtZXhwZWN0YXRpb25zLTIwMjMwOTAxMTI1MNIBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9iaXRjb2luLXByaWNlLXRlc3RzLXN1cHBvcnQtYXQtMjYtMDAwLXdpdGgtYXVndXN0cy11cy1uZnAtZGF0YS1leGNlZWRpbmctbWFya2V0LWV4cGVjdGF0aW9ucy0yMDIzMDkwMTEyNTA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price tests support at $26,000 with August’s US NFP data exceeding market expectations - FXStreet",
        "content": "Share:\n\nUS Nonfarm Payrolls increased by 187,000 in August, above the market expectations of 170,000.\n\nBitcoin and altcoin traders can expect a sell-off in BTC in the short- term, in response to the hot employment figures.\n\nThe Federal Reserve’s double mandate requires keeping employment and inflation in check, the NFP data could therefore influence the upcoming interest rate hike decision.\n\nThe Nonfarm Payrolls data is closely scrutinized by the US Federal Reserve to assess the impact of its monetary policy. The US Central Bank is focused on keeping employment and inflation in check, the heating job market is therefore likely to influence the Fed’s decision to hike interest rates in September.\n\nBitcoin traders’ reaction to the release of NFP data is likely to be short-lived, market participants can expect volatility in the American trading session.\n\nAlso read: Could US Nonfarm Payrolls provide directional cues Bitcoin needs?\n\nBitcoin price experiences downside volatility, knee-jerk reaction to NFP data\n\nBitcoin price tested support at $26,000 as market participants displayed a knee-jerk reaction to the release of Nonfarm Payrolls data for August. 187,000 Nonfarm Payrolls were added in the month of August, against the market’s expectations of 170,000.\n\nA heated job market is likely to factor in, when the Federal Reserve assesses the impact of its monetary policy. To promote effectively the goals of maximum employment and stable prices, there is a likelihood of an interest rate hike in September.\n\nMoreover, the impact of the data release on Bitcoin is likely to be short-lived, as noted in previous instances. Participants can expect higher volatility in the American trading session in BTC price.\n\nAt the time of writing, Bitcoin price is $26,023 on Binance. A short-term sell-off, or BTC sweeping lows below $26,000 is likely, as traders digest the employment numbers for August 2023.\n\nBTC/USDT five-minute price chart on Binance"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLWJlYXJpc2gtMjY3NTAv0gFFaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvYnRjL2JpdGNvaW4tcHJpY2UtYmVhcmlzaC0yNjc1MC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Price Back To Square One, Why This Could Be A Bearish Signal - NewsBTC",
        "content": "Bitcoin price trimmed all gains and tested the $25,650 zone. BTC is now at risk of a fresh decline toward the $24,500 level in the near term.\n\nBitcoin started a fresh decline below the $26,500 and $26,200 levels.\n\nThe price is trading below $26,600 and the 100 hourly Simple moving average.\n\nThere is a key bearish trend line forming with resistance near $26,750 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could extend its decline toward $24,500 in the coming sessions.\n\nBitcoin Price Starts Fresh Decline\n\nBitcoin price failed to climb again above the $27,000 resistance zone. BTC started a fresh decline and gained bearish momentum below the $26,500 level.\n\nThere was a clear move below the $26,200 level. The price even spiked below the $26,000 level. A low is formed near $25,663 and the price is now consolidating losses. Bitcoin is now trading below $26,600 and the 100 hourly Simple moving average.\n\nBesides, there is a key bearish trend line forming with resistance near $26,750 on the hourly chart of the BTC/USD pair. Immediate resistance on the upside is near the $26,250 level. It is close to the 23.6% Fib retracement level of the recent decline from the $28,150 swing high to the $25,663 low.\n\nThe first major resistance is near the $26,650 level or the trend line region. The trend line is also close to the 50% Fib retracement level of the recent decline from the $28,150 swing high to the $25,663 low. The main resistance is now forming near the $27,000 level.\n\nSource: BTCUSD on TradingView.com\n\nA clear move above the $27,000 level might send the price toward $27,400. The next major resistance is near $28,000, above which there could be a sustained increase. In the stated case, the price could test the $29,200 level.\n\nMore Losses In BTC?\n\nIf Bitcoin fails to clear the $26,750 resistance, it could continue to move down. Immediate support on the downside is near the $25,800 level.\n\nThe next major support is near the $25,650 level. A downside break below the $25,650 level might put a lot of pressure on the bulls. In the stated case, the price could drop toward $24,500.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level.\n\nMajor Support Levels – $25,800, followed by $25,650.\n\nMajor Resistance Levels – $26,250, $26,750, and $27,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi9sZXMtcmVzZXJ2ZXMtZGUtYml0Y29pbi1idGMtZW4tYmFpc3NlLXN1ci1sZXMtZXhjaGFuZ2VzLWNyeXB0by0yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) reserves down on crypto exchanges - Cointribune EN",
        "content": "Fri 01 Sep 2023 ▪ 3 min of reading ▪ by Eddy S.\n\nA recent data analysis reveals that bitcoin reserves held by several exchanges are falling sharply. This trend could have major implications for the crypto market. In particular, exchanges could soon run out of liquidity and see their trading volumes plummet.\n\nIn brief:\n\nHuobi, one of the largest cryptocurrency exchanges, holds less than 15,000 bitcoin.\n\nCrypto exchanges holding 20,000 bitcoin are at risk of depletion.\n\nDwindling bitcoin (BTC) reserves could lead to increased price volatility.\n\nA worrying situation for crypto exchanges\n\nAccording to Glassnode data, there are currently around 2.257 million bitcoin on all crypto exchanges. As such, exchanges with 20,000 or fewer coins present a heightened risk of depletion.\n\nHuobi, one of the world’s largest crypto exchanges, currently holds close to 15,000 bitcoin. Other exchanges, such as Poloneix, Kucoin, Bithumb, Bitstamp, Gate.IO and Luno, collectively hold around 70,000 BTC. This is a more than alarming situation, as these platforms could very quickly find themselves in difficulty.\n\nWhat’s more, it’s clear that the dwindling bitcoin reserves on these exchanges are a bad sign for crypto. It could have a negative impact on market liquidity. Low liquidity means it will be more difficult to buy or sell bitcoin (BTC). This could lead to increased price volatility.\n\nWhat’s more, the drop in transaction volume could adversely affect exchange revenues. Platforms generally charge transaction fees to users, so their profitability depends on transaction volume.\n\nBitcoin users turn to private wallets\n\nThere are many reasons for the downward trend in bitcoin reserves. In fact, it’s possible that users are withdrawing their coins from crypto exchange platforms and keeping them in private wallets. This trend would be explained by the recent rise in the price of BTC, which makes cryptocurrencies more attractive to investors.\n\nIt’s also possible that exchanges will be forced to sell bitcoin to cover their losses. This, due to the falling market for digital assets.\n\nAll in all, the decline in bitcoin (BTC) reserves on crypto exchanges is a warning signal worth keeping an eye on. This trend could have significant implications for the cryptocurrency market in terms of liquidity. It would also affect trading volumes, as well as the profitability of exchanges.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXByaWNlLXByZWRpY3Rpb24tZm9yLXNlcHRlbWJlci0yMDIzL9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXByaWNlLXByZWRpY3Rpb24tZm9yLXNlcHRlbWJlci0yMDIzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Price Prediction For September 2023: What To Expect - NewsBTC",
        "content": "After a short-lived rally above $28,000 this week following Grayscale’s landmark court case victory against the US Securities and Exchange Commission (SEC) over the conversion of GBTC into a spot ETF, the price of BTC has once again settled around the $26,000 mark. This comes after yesterdays’ SEC’s decision to postpone all Bitcoin spot ETF decisions for 45 days.\n\nRenowned crypto analyst, Rekt Capital, has weighed in on the situation with a series of tweets that provide insight into Bitcoin’s potential trajectory for the upcoming month. As the analyst remarks, Bitcoin has registered a bearish monthly candle close for the month of August due to yesterdays’ price plunge.\n\nBitcoin Price Prediction For September 2023\n\nIn a series of tweets, Rekt Capital explained, “BTC closed below ~$27,150, confirming it as lost support. It’s possible BTC could rebound into ~$27,150, maybe even upside wick beyond it this September. But that would likely be a relief rally to confirm ~$27,150 as new resistance before dropping into the $23,000 region.\n\nHistorically, September has not been particularly kind to Bitcoin, with the month recording the least number of positive-returning months at just two, and currently being on a 6-year negative-returning streak.\n\nRekt Capital delves deeper into this trend, stating, “A frequently recurring downside amount for BTC in the month September is -7%. If BTC were to drop -7% from current price levels this month, price would retrace to ~$24,000.”\n\nHowever, according to the analysis by the analyst, the next major monthly level is sitting at ~$23,400. This suggests that price maybe does not stop at -7% if BTC can’t gain new momentum. Instead, BTC could potentially downside wick -10% in total to reach that next major monthly level.\n\nThe analyst further elaborated on the historical performance of Bitcoin in September, noting, “September – positive or negative month? Typically, we tend to see a negative month for BTC in September. However, for the most part BTC sees single-digit drawdown in Septembers. 8 out of 10 of the past Septembers have experienced downside. Only 2 months saw small, single-digit gains in the month of September (+2% in 2015 and +6% in 2016).”\n\nWorst Case Scenario\n\nDrawing parallels with previous years, Rekt Capital highlighted that the most recurring drawdown in September has been a -7% dip, as observed in 2017, 2020, and 2021. However, he also pointed out that Bitcoin only saw double-digit retracement in 2019 (-13%) and in 2014 (-19%). The latter, being a bear market year, might not be the best comparison for 2023, which is shaping up to be a bottoming out year, akin to 2019 or 2015.\n\nAddressing the looming question of another potential crash in September, the analyst opined, “In 2019 BTC saw a -13% retrace but we also need to keep in mind that BTC just saw one of its worst-ever August drawdowns at -16%. It’s unlikely that Bitcoin would experience severe back-to-back drawdown both in August and now in September as well.”\n\nConcluding his analysis, Rekt Capital shared his personal forecast, “I think a drawdown of around -7% to -10% September could reasonably occur from current levels. This would see price drop to ~$24,000 – $23,000.”\n\nRemarkably, there is unlikely to be a Bitcoin spot ETF decision in September, which may be the biggest catalyst for the market at the moment. The next deadlines for filings by Bitwise, BlackRock, Fidelity and the others is October 16 and 17. Only an action by the SEC after the lost lawsuit against Grayscale could provide a surprise event. However, there are currently no deadlines or statements from the SEC if and when they will carry out the ruling.\n\nAt press time, BTC traded at $26,104.\n\nFeatured image from Finextra Research, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9icmF6aWxpYW4tY3J5cHRvLXN0cmVhbWVyLWxvc2VzLTUway1ieS1leHBvc2luZy1wcml2YXRlLWtledIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Brazilian crypto streamer loses money by accidentally exposing private key - Cointelegraph",
        "content": "Brazilian cryptocurrency streamer Fraternidade Crypto is one of the latest victims of unsafe self-custody practices, reportedly losing thousands of dollars due to a private key accident.\n\nDuring a live stream on YouTube on Aug. 29, the owner of the Fraternidade Crypto channel, Ivan Bianco, unwittingly exposed his private key to a self-custodial cryptocurrency wallet.\n\nIn the middle of the livestream related to Bitcoin (BTC) and blockchain games, Bianco apparently tried to access his passwords for the blockchain games platform Gala Games through a text file on his computer.\n\nUnfortunately for the streamer, his Gala Games passwords were stored in the same text file as the seed phrase for his MetaMask wallet, which had a significant amount of Polygon’s MATIC (MATIC).\n\nShortly after accidentally opening the text file, which exposed two private keys for his cryptocurrency wallets, Bianco closed the livestream, but apparently, it was already too late to recover the funds for the streamer.\n\nFraternidade Crypto subsequently started a new livestream, claiming that one of his viewers managed to access his MetaMask wallet through the private key and stole his entire Polygon stash of 86,000 MATIC. At the time of the accident, the amount was worth around $50,000.\n\n“I accidentally showed my private key live, and the person had really quickly sent it to another address. I tried to close the broadcast and send crypto to another address, but I was too late,” Bianco said in the emotional video that followed the accident.\n\nIn the video, the streamer provided a link to the Polygon address of the unknown perpetrator. The 86,000-MATIC stash then started to be transferred across different addresses.\n\nBianco claimed that he lost his entire life savings to the accident, pleading with the stream viewer to return the money for a reward. The YouTuber also said that he was planning to file a complaint with the local police, noting that about 70 people were watching his unfortunate livestream.\n\nAccording to some online sources, Fraternidade Crypto might have managed to retrieve at least some of his funds so far. Local crypto executive Guilherme Rennó took to X (formerly Twitter) on Aug. 30 to report that there have been rumors that Bianco eventually managed to recover a “good part of the money.”\n\nRelated: 7 ways to safely store your private keys\n\n“Self-custody is something that demands extreme care,” the executive noted, adding that crypto users should never store their seeds and passwords on their computers or in an easily accessible place.\n\nContacted by Cointelegraph, Bianco said that he has somehow managed to recover 86,000 MATIC, but still has to recover his non-fungible tokens (NFTs). \"I recovered 50k dollars, approximately 86000 MATIC. Everything else is still lost, incalculable value as they are NFTs, estimated value of approximately 15k dollars still lost,\" Bianco noted, adding that he also lost some Ether (ETH) on the ARB network.\n\nOnline reports suggest that “Fraternidade Crypto” recovered a part of the stolen assets. Source: X\n\nThere is nothing more important than the security of a private key when it comes to the self-custody of crypto. It’s crucial to be very careful with handling a private key or a seed phrase, and for some, it might be a better idea to opt for custodial solutions, such as exchanges, instead. Cryptocurrency enthusiasts recommend investors diversify the types of cryptocurrency storage in order to prevent losses of their entire life savings as well.\n\nWhile self-custody allows users to essentially “be their own bank,” such a method of holding crypto is still prone to many risks, such as theft, destruction or loss. “Not your keys, not your coins” is a popular expression in the cryptocurrency community that warns users about such risks. Once a user of a self-custody wallet exposes their private keys to someone else, the former is no longer the owner of the funds, according to the rules of crypto.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in\n\nDisclaimer: This article was updated to show that \"Fraternidade Crypto\" recovere his 86,000 MATIC stash soon after the private key accident."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMi0wFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLXNlcGV0ZW1iZXItMi1jaGVjay1tYXJrZXQtY2FwLWJpdGNvaW4tZXRoZXJldW0tbWVyZ2UtZG9nZWNvaW4tc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtYmluYW5jZS10b2tlbi1xbnQtcHJpY2VzLWdhaW5lci1sb3Nlci0xNjI3MDM00gHXAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS9idXNpbmVzcy9jcnlwdG8vY3J5cHRvY3VycmVuY3ktcHJpY2UtdG9kYXktaW4taW5kaWEtc2VwZXRlbWJlci0yLWNoZWNrLW1hcmtldC1jYXAtYml0Y29pbi1ldGhlcmV1bS1tZXJnZS1kb2dlY29pbi1zb2xhbmEtbGl0ZWNvaW4tcmlwcGxlLXhycC1iaW5hbmNlLXRva2VuLXFudC1wcmljZXMtZ2FpbmVyLWxvc2VyLTE2MjcwMzQvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Dips Below $26,000, Altcoins See Red Across Board. Toncoin Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH) — two of the most valued crypto coins — were trading around the $25,700 and $1,600 marks, respectively, on Saturday morning. Other popular altcoins — including the likes of Dogecoin (DOGE), Solana (SOL), Ripple (XRP), and Litecoin (LTC) — landed in the greens as overall prices saw losses across the board. The Toncoin (TON) token emerged to be the biggest gainer, seeing a 24-hour jump of over 11.68 percent. KuCoin Token (KCS), on the other hand, turned out to be the biggest loser.\n\nAt the time of writing, the global crypto market cap stood at $1.04 Trillion, registering a 24-hour decline of 0.67 percent.\n\nBitcoin (BTC) Price Today\n\nBitcoin price stood at $25,797.29, registering a 24-hour loss of 0.85 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 22.72 lakh.\n\nEthereum (ETH) Price Today\n\nETH price stood at $1,631.59 marking a 24-hour dip of 1.00 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.44 lakh.\n\nDogecoin (DOGE) Price Today\n\nDOGE registered a 24-hour loss of 0.07 percent, as per CoinMarketCap data, currently priced at $0.06364. As per WazirX, Dogecoin price in India stood at Rs 5.5674.\n\nLitecoin (LTC) Price Today\n\nLitecoin saw a 24-hour dip of 0.92 percent. At the time of writing, it was trading at $63.32. LTC price in India stood at Rs 5,526.00.\n\nRipple (XRP) Price Today\n\nXRP price stood at $0.4961, seeing a 24-hour loss of 1.89 percent. As per WazirX, Ripple price stood at Rs 43.5000.\n\nSolana (SOL) Price Today\n\nSolana price stood at $19.54, marking a 24-hour dip of 1.64 percent. As per WazirX, SOL price in India stood at Rs 1,730.56.\n\nTop Crypto Gainers Today (September 2)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nToncoin (TON)\n\nPrice: $1.92\n\n24-hour gain: 11.68 percent\n\nIOTA (MIOTA)\n\nPrice: $0.1613\n\n24-hour gain: 3.44 percent\n\nFlare (FLR)\n\nPrice: $0.01374\n\n24-hour gain: 3.12 percent\n\nFantom (FTM)\n\nPrice: $0.2038\n\n24-hour gain: 1.80 percent\n\nSafePal (SFP)\n\nPrice: $0.5403\n\n24-hour gain: 1.74 percent\n\nTop Crypto Losers Today (September 2)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nKuCoin Token (KCS)\n\nPrice: $3.83\n\n24-hour loss: 5.99 percent\n\nStacks (STX)\n\nPrice: $0.4654\n\n24-hour loss: 5.60 percent\n\nMultiversX (EGLD)\n\nPrice: $24.70\n\n24-hour loss: 5.38 percent\n\ndYdX (DYDX)\n\nPrice: $2.10\n\n24-hour loss: 4.42 percent\n\nOptimism (OP)\n\nPrice: $1.33\n\n24-hour loss: 3.83 percent\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    }
]