[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vYXJ0aWNsZXMvcGVvcGxlLzA4MzAxNi93aG8tYXJlLXRvcC01LWJpdGNvaW4tbWlsbGlvbmFpcmVzLmFzcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Who Are the Top Bitcoin Millionaires? - Cryptocurrency - Investopedia",
        "content": "Bitcoin is a digital asset and payment system with a market capitalization of around $452.1 billion as of Feb 4, 2023. It is considered by many to be one of the most successful digital currencies ever created. The first-ever bitcoin exchange-traded fund (ETF) was launched in October 2021, pushing the cryptocurrency to new all-time highs.\n\nBitcoin's stratospheric rise since 2009 has created a surprising and diverse set of millionaires (and billionaires). But who owns the most bitcoin? It is tough to say for sure who owns the most bitcoin, as wallet addresses are anonymous in that they are not associated with the account owner's name. The only way to tell is if the owner has publicized their holdings.\n\nMany bitcoin holders have made their wealth by creating products to grow Bitcoin's still-nascent ecosystem. For example, some have created exchanges for trading cryptocurrency and the derivatives that have emerged from it.\n\n\n\nOf course, Bitcoin was—and still is—a risky asset class. The absence of regulatory guardrails and the cryptocurrency's price volatility have attracted criminals and investors alike. But those drawbacks only serve to highlight the achievements of Bitcoin millionaires because they not only were early adopters but also predicted its economic opportunity.\n\nKey Takeaways Launched in 2009, Bitcoin is the first and remains the most successful blockchain-based cryptocurrency in the world.\n\nThe price of Bitcoin is volatile, ranging from under $10 in 2010 to $65,000 in November 2021 and back down to less than $16,000 in November 2022.\n\nMost top Bitcoin billionaires became rich by creating products and services to grow the cryptocurrency ecosystem.\n\nThis overall price increase has also created millions for people that bought and held their bitcoins. These early adopters hoped for a lucrative opportunity, started accumulating or mining in the early days, and held on.\n\nChangpeng Zhao (CZ)\n\nHoracia Villaobos / Getty Images\n\nChangpeng Zhao is the founder of Binance, the world's biggest cryptocurrency exchange by trading volume. According to Forbes, Zhao's net worth was $4.5 billion in February 2023.\n\nZhao, who immigrated to Canada at the age of 13 from China, came to Bitcoin via a poker game with friends. He went all-in on cryptocurrencies thereafter and even sold his apartment for Bitcoin in 2014. Binance, which was started in 2017, handles transactions that run into billions of dollars on a daily basis. While it may not be as well-known as Coinbase to U.S. customers, Binance is bigger and offers more coins and derivatives to customers than its main competitor.\n\nThe exchange's nimble ascent has taken a toll on its regulatory standing. It is under regulatory scrutiny in some financial jurisdictions and has been forced to operate without a headquarters.\n\n\n\nSong Chi-hyung\n\nSong Chi-hyung is the founder of Dunamu, the parent company of the leading cryptocurrency exchange Upbit in South Korea. Chi-hyung launched Upbit in 2017—within three months it was South Korea's top crypto exchange. According to its third-quarter report, the exchange netted ₩219.3 billion (won), or $175 million in income. In 2021, it had a total comprehensive income of ₩2.15 trillion (won), or $1.73 trillion.\n\nAccording to the Forbes Real-Time Billionaire list, Chi-hyung is worth more than $3.7 billion.\n\nBrian Armstrong\n\nSteven Ferdman / Getty Images\n\nBrian Armstrong is the founder of Coinbase, North America's biggest cryptocurrency exchange by trading volume. He co-founded the exchange in 2012 after quitting his job as a software engineer at Airbnb. Armstrong has a 19% stake in Coinbase and is estimated to be worth $2.7 billion by Forbes in February 2023.\n\nDue to its easy-to-use interface and credibility, Coinbase is considered the gateway for retail investors to join the crypto ecosystem. The exchange has suffered many hiccups, such as halts in trading while attempting to scale operations amid crypto volatility. The exchange went public in April 2021 and had a total market capitalization of $17.08 billion at the close of trading on Feb. 17, 2023. Armstrong said he started Coinbase because he wanted the world to have a \"global, open financial system that drove innovation and freedom.\"\n\nJed McCaleb\n\nJed McCaleb is a well-known figure in cryptocurrency, as he was the founder of the notorious exchange Mt. Gox. He sold the exchange in 2013, one year before hackers stole nearly $460 million worth of cryptocurrency.\n\nMcCaleb went on to assist in launching the cryptocurrencies and blockchains Ripple and Stellar. He still holds about 3.4 billion XRP, which at February 2023 prices, sets him at close to $2.4 billion in total worth.\n\nAfter launching Stellar in 2014, McCaleb founded the Astera Institute, a 503(c)(3) non-profit for developing technology for human advancement, and Vast, a company reportedly working on artificial gravity technology.\n\nChris Larsen\n\nCris Larsen is another well-known figure in the cryptocurrency arena, having co-founded Ripple alongside Jed McCaleb. He is still the executive chairman of the company. Before cryptocurrency emerged, Larsen co-founded the online mortgage lender e-Loan, which was later sold to Yahoo.\n\nLarsen, referring to cryptocurrency and blockchain, told Forbes, \"The internet of value is more than just laying out a new way of doing finance. I think, fundamentally, this represents the final step in globalization.\"\n\nForbes placed Larsen's worth at $2.2 billion in February 2023.\n\n\n\nTyler and Cameron Winklevoss\n\nTyler and Cameron Winklevoss parlayed the millions they earned from their lawsuit against Facebook into cryptocurrencies. They became the first billionaires in the crypto ecosystem after the late 2017 surge in Bitcoin prices. Forbes estimates their net worth at $1.1 billion each.\n\nWhile most of their estimated wealth comes from investments in cryptocurrencies, the Winklevoss twins are also entrepreneurs who started the Gemini cryptocurrency exchange. The exchange was valued at $7.1 billion after its $400 million fundraising in November 2021. They also own Nifty Gateway, a platform to buy and sell non-fungible tokens (NFTs).\n\nMichael Saylor\n\nJoe Raedle / Getty Images\n\nBitcoin has attracted numerous unconventional investors over the years. None, however, has the zeal and enthusiasm of Michael Saylor, CEO of software firm MicroStrategy Inc. (MSTR). The firm began acquiring the cryptocurrency in August 2020 by snapping up $250 million of bitcoin. At that time, the firm said it was buying the cryptocurrency to better use the cash holdings on its balance sheet.\n\nOver time, Saylor has become a fierce supporter of Bitcoin and appeared at news and cryptocurrency conferences to evangelize its benefits and use cases. By December 2021, MicroStrategy had increased its holdings in Bitcoin to $3.5 billion, swooping in to buy the cryptocurrency during price dips.\n\nMicroStrategy's stock price skyrocketed by more than 337% (as of December 2021) after it announced the Bitcoin acquisition. Meanwhile, Forbes estimates Saylor's net worth to be $1.6 billion as a result of his bet on Bitcoin. In December 2022, Microstrategy again made a bitcoin purchase, adding 2,500 more to its holdings. As of February 2023, Microstrategy holds about 132,500 bitcoin—close to $3.2 billion.\n\nWho Is the Wealthiest Person in Cryptocurrency? According to the Forbes Real-Time Billionaires List, Changpeng Zhao, founder of cryptocurrency exchange Binance—is estimated to be worth $4.5 billion, making him the wealthiest person in cryptocurrencies.\n\nWho Owns the Most Bitcoins? The anonymous developer of Bitcoin Satoshi Nakamoto is rumored to hold more than 1 million bitcoins. However, due to the nature of cryptocurrency, this cannot be proven. The address that holds the most bitcoin is 34xp4vRoCGJym3xR7yCVPFHoCNxv4Twseo, with more than 248,597 BTC. At February 2023 prices, that's close to $6.1 billion.\n\n\n\nHow Many Crypto Billionaires Are There in the Forbes Billionaires Index? There are eight cryptocurrency billionaires in Forbes' ranking of billionaires, subtracting Sam Bankman-Fried, who was the ninth.\n\nHow Can You Earn Billions From Cryptocurrencies? Contrary to the popular perception of cryptocurrencies, the wealthiest people in its ecosystem have not generated their wealth through bitcoin investments. Instead, they have minted profits by identifying existing gaps in the crypto ecosystem and starting products or services to plug that gap.\n\nThe Bottom Line\n\nAs cryptocurrencies became popular, the number of people making billions off the new asset class increased. Crypto billionaires are a motley bunch—some have made their billions by providing products and services to the emerging ecosystem, while others have generated profits by taking advantage of crypto volatility.\n\n\n\nInvesting in cryptocurrencies and other initial coin offerings (ICOs) is highly risky and speculative, and this article is not a recommendation by Investopedia or the writer to invest in cryptocurrencies or other ICOs. Since each individual’s situation is unique, a qualified professional should always be consulted before making any financial decisions. Investopedia makes no representations or warranties as to the accuracy or timeliness of the information contained herein. As of the date this article was written, the author does not own cryptocurrency."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMTcvYml0Y29pbi1uZnRzLWNoYWxsZW5nZS10aGUtYmxvY2tjaGFpbnMtbGFyZ2VzdC11c2UtY2FzZS1tb25leS_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAyLzE3L2JpdGNvaW4tbmZ0cy1jaGFsbGVuZ2UtdGhlLWJsb2NrY2hhaW5zLWxhcmdlc3QtdXNlLWNhc2UtbW9uZXkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin NFTs Challenge the Blockchain’s Largest Use Case: Money - CoinDesk",
        "content": "While it might seem scary, I doubt Ordinals will create that much friction and division within Bitcoin. Even if it did, one could be passive and simply let the market forces play out. Being an open, permissionless protocol allows for moments like this to occur, and that’s healthy in the long term."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LndpcmVkLmNvbS9zdG9yeS9iaXRjb2luLW1pbmluZy1oYWx2aW5nLWNyeXB0by13aW50ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miners Are Playing a High-Stakes Game of Chicken - WIRED",
        "content": "“It’s kind of a last-man-standing situation,” says Fred Thiel, CEO of US-based Marathon Digital Holdings. His crypto-mining company, among the largest in the world, has found itself—like the rest of the industry—in the path of a perfect storm.\n\nOver the past year, the sector has been battered by a slump in the price of bitcoin, combined with a spike in the cost of energy and an increase in mining difficulty—a reflection of the amount of computing power directed at the bitcoin network, which dictates the proportion of coins miners are able to win.\n\nAt the height of the 2021 boom, profit margins in the mining business rose as high as 90 percent, says Thiel. But now, they have “totally collapsed.” If the price of bitcoin does not rally, he says, there will be “a lot more pain,” and firms that are only marginally profitable today will find themselves “very underwater.”\n\nAs they scramble to cut costs, miners are playing a high-stakes game of chicken. In spring 2024, the halving, a mechanism baked into the bitcoin system that periodically cuts the number of coins awarded in half, will slash mining profits. The goal for miners is to ensure they are in a strong enough financial position to survive the fall in profits longer than anyone else; as miners give in and drop from the network, the share of coins won by the rest will increase.\n\n“Any miners that are struggling now will not be able to survive the halving,” says Jeff Burkey, VP of business development at Foundry, which operates its own mining facilities, a large-scale mining pool, and a marketplace for mining hardware. The dynamic will create a rush among miners to get their houses in order, he explains.\n\nMiners will look to eke out additional profit margin wherever they can, whether by deploying superior hardware and cooling techniques, developing software to closely monitor the performance of machines, relocating to territories with cheaper power, or renegotiating the terms of their loans.\n\nOthers, like Geosyn Mining, are aiming at vertical integration—all the way down to the energy powering the facilities. The company, says CEO Caleb Ward, wants to construct its own solar farm to power its machines, thereby eliminating a major cost. “We need to be more thoughtful as an industry about how we protect against risk,” he says. “It’s not all about shooting for the moon.”\n\nMeanwhile, the miners whose financial predicaments prevent them from fine-tuning their operations are playing a dangerous waiting game, gambling on an increase in the price of bitcoin that may never come.\n\n“The beauty of halving cycles is that the industry [is forced] to become more efficient—a lot of weaker players will have to exit the business,” says Jeff Lucas, CFO of mining company Bitfarms, which has worked to restructure its finances in the downturn. “The devil is in the details.”\n\nAlready on the back foot, mining companies are beginning to fold. Compute North, which owned multiple large-scale mining facilities, filed for bankruptcy in September, and Core Scientific, a publicly traded miner, did the same in December. Others are having to maneuver. Argo Blockchain, also a public company, was forced to sell off mining equipment and its state-of-the-art mining center, while Stronghold Digital Mining has negotiated a debt repayment holiday. Neither company responded to interview requests."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXJpc2VzLXVzMjMwMDAtZmlyc3Qtd2Vla2x5LWRlYXRoLWNyb3NzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin rises above US$23,000 after its first weekly 'death cross' - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, rose 8.86% in the week from Feb. 10 to Feb. 17, trading at US$23,764 at 7 p.m. on Friday in Hong Kong. Ether strengthened 7.86% in the same period to change hands at US$1,665.\n\nBitcoin saw this week’s second-biggest gains among the 10 largest non-stablecoin cryptocurrencies, followed by Polygon’s Matic that rose 13.33% to US$1.44.\n\n“I am expecting a slightly sideways move. The market has to calm a little before any further impulses,” wrote Aziz Kenjaev, head of partnerships at decentralized crypto derivatives exchange GammaX, in a LinkedIn response to Forkast.\n\n“There is massive support and a strong buy orders wall which might push Bitcoin further towards US$29,000-30,000 in early March. However, there also is a strong support zone at US$22,250. If that support withholds, we might see another impulse toward US$25,300,” wrote Kenjaev, adding that “there will be more speculations over the SEC and Paxos, so keep your newsfeed open.”\n\nKenjaev sees less correlation between traditional and crypto markets, as prices are mainly driven by industry developments.\n\n“The cryptocurrency market is more focused on developments inside its own ecosystem and the connectivity of this decentralized ecosystem to the centralized one. Hence, every development related to the regulators vs crypto companies, especially U.S. regulators, does and will affect the crypto market,” wrote Kenjaev.\n\n“Be mindful of the release, testing, deployment and adoption of central bank digital currencies (CBDCs). The major macroeconomic data I would like to see is the national debt. There has been a lot of money spent in recent years and governments will be looking to recover it,” wrote Kanjaev, adding that “the government knows that there is a good portion of funds floating in Web3.”\n\nThe global crypto market cap stood at US$1.09 trillion on Friday at 7 p.m. in Hong Kong, up 6.86% from US$1.02 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$458 billion market cap represented 42.2% of the market, while Ether accounted for 18.7%.\n\nSee related article: JPMorgan report shows institutional trader interest shifting to AI from blockchain after crypto slump\n\nBiggest gainers\n\nAstar Network’s Astr token was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. Astar Network is a multi-chain smart contract network focused on Web3 innovation.\n\nAstr rallied 51.72% this past week to change hands at US$0.1099 after the announcement of its partnership with Sony to launch a Web3 incubation program to support developers building Web3 projects.\n\nDecentralized gaming developer Treasure’s Magic token was the second biggest gainer, up 44.94% to trade at US$2.18. The token started its rally on Feb. 13, after the company launched a new Game Builders Program supported by Arbitrum to incentivize high-potential games building on Treasure, by offering developers access to open-source code as well as advisory and marketing support.\n\nSee related article: Be careful what you wish for? Regulators pick up pace in the crypto industry crackdown\n\nNext week?\n\nFor the first time in Bitcoin’s history, a “death cross” appeared on its weekly chart. This meant that the 50-week small moving average (SMA), a key technical indicator, stood below the 200-week SMA for the first time.\n\nKasper Vandeloock, chief executive officer of quantitative trading firm Musca Capital, said that the death cross “gives very little input,” since it only shows that Bitcoin price performed better in the last 50 weeks compared to the last 200 weeks.\n\nBitcoin prices charted another significant formation, with its first “golden cross” on the daily timeframe since the beginning of the crypto bear market in November 2021. A golden cross means that the 50-day SMA is above the 200-day SMA. Historically, Bitcoin has charted multiple golden crosses in previous cycles before a sustained rally.\n\n“A record high 66.9% of circulating BTC has not moved in over a year,” tweeted Joe Burnett, head analyst at Blockware Solutions, adding that “Bitcoin bear markets end when there are no sellers remaining, the price slowly starts drifting up due to (any) marginal buyer, and the next wave of adopters learn BTC is the least uncertain money.”\n\nAccording to Kenjaev, this suggests that Bitcoin holders were more conservative. “They are waiting for the right time to sell and are hedging over the upcoming recession. The state of the global economic conditions now leads to more uncertainty than during the Covid-19 pandemic. The reason why the situation is not changing with current global developments is that investors do not see the same scenario happening. Current market conditions look risk-attractive and favorable, although it’s very early to call it the next bull run. We shall at the very least wait for improvements from regulatory bodies globally.”\n\n“Some patterns suggest that an ideal scenario for Bitcoin would be to drop near US$19,500-19,300,” he added, hoping for “a decline to US$19,500 and a jump to US$30,000.”\n\nOn Feb. 12, Blockstream chief executive officer Adam Back predicted that Bitcoin would exceed US$200 million in market cap, bringing BTC prices to US$10 million by 2032.\n\nSee related article: Go ahead and ban staking. Crypto investors will just go elsewhere"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LndqaGwuY29tL25ld3MvbG9jYWwvYml0Y29pbi1taW5lLWxhd3N1aXQtc2V0LWZvci1mZWJydWFyeS0yMDI0L9IBT2h0dHBzOi8vd3d3LndqaGwuY29tL25ld3MvbG9jYWwvYml0Y29pbi1taW5lLWxhd3N1aXQtc2V0LWZvci1mZWJydWFyeS0yMDI0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin mine lawsuit set for February 2024 - WJHL-TV News Channel 11",
        "content": "JONESBOROUGH, Tenn. (WJHL) — Washington County’s legal effort to shut down a Bitcoin mine that has been a source of controversy in Limestone since May 2021 won’t go to trial for another year.\n\nCounty commissioners rejected a final settlement proposal from defendants BrightRidge and Red Dog Technologies in November. County Attorney Allyson Wilkinson told them last month she expected the case to go to trial before the fall.\n\nInstead, Chancellor John Rambo has set a trial for Feb. 5-7, 2024. Pre-trial briefs from each side are due by Jan. 4, 2024.\n\n“I know we’re all disappointed that this isn’t moving at a faster pace,” Commission Chairman Greg Matherly said Friday. “We anticipated it would be much sooner, possibly summer. We all want resolution.”\n\nThe trial date is nearly three years after neighbors began complaining about noise at the facility, where high-powered computers solve complex algorithms to “mine” the cryptocurrency Bitcoin. Fans used to cool the computers are the source of the noise.\n\nCommissioners learned in September 2021 that Planning Director Angie Charles and Wilkinson had determined the mine violated zoning regulations and ordered BrightRidge — which had successfully sought a rezoning in 2020 for a “blockchain data center” — to shut it down.\n\nBrightRidge leases land adjacent to the Bailey Bridge Road substation and sells Red Dog massive amounts of power for its operation.\n\nBrightRidge responded by saying the county’s issue was with Red Dog, even though Bitcoin mining had never been mentioned prior to startup. (Technically, a Bitcoin mine is a type of blockchain data center).\n\nThe county sued BrightRidge in November 2021 and Red Dog was quickly added as a defendant. Rambo set a trial for July 2022 but then the sides nearly settled with a deal that would have allowed Red Dog to replace the Limestone facility with one in the Washington County Industrial Park.\n\nCommissioners ultimately rejected that settlement three months ago in a 13-2 vote.\n\nLike Matherly, Freddie Malone voted against the settlement.\n\nHe said he fears another delay could come before the currently set date arrives.\n\n“I don’t think it’s fair for us to assume that this matter will be heard in court on that date. I think there’s a good chance it will be delayed and extended far past that date.”\n\nMalone said he was frustrated at the time, legal expense and effort spent since county commissioners first ordered the site shut down in October 2021.\n\n“I don’t think any of the commissioners then or now expected that it would take this long,” Malone said.\n\nHe said the continued delays work in Red Dog and BrightRidge’s favor, allowing the company to continue operating and making money while BrightRidge continues to sell electricity to what CEO Jeff Dykes confirmed is its largest customer.\n\n“They would prefer there never had been any conflict, but in light of the conflict I think their position has likely been delay, stall, drag it out – run out the clock essentially,” Malone said.\n\n“And we have to remember that is not just Red Dog and GRIID (Red Dog’s parent company), that is our community partner BrightRidge.”"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wMi0xNy9jcnlwdG8tZnVnaXRpdmUtZG8ta3dvbi10YXBwZWQtaG9hcmQtb2YtMTAtMDAwLWJpdGNvaW4tdmlhLXN3aXNzLWJhbmstc2VjLXNheXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Crypto Fugitive Do Kwon Tapped Hoard of 10000 Bitcoin Via Swiss Bank, SEC Says - Bloomberg",
        "content": "Crypto fugitive Do Kwon and the firm he founded transferred over 10,000 Bitcoin out of their doomed project and turned some of the tokens into cash via a Swiss bank, the Securities & Exchange Commission said.\n\nThe allegations are in an SEC lawsuit accusing Kwon and the company, Terraform Labs Pte, of fraud over the wipeout of digital currencies he created. The SEC said the scheme led to losses of at least $40 billion."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9leHBsYWluZWQtYml0Y29pbi1vcmRpbmFscy1hbmQtaG93LXRoZXktY29tcGFyZS10by10cmFkaXRpb25hbC1uZnRzLTE1OTYxMjgxLmh0bdIBfGh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9leHBsYWluZWQtYml0Y29pbi1vcmRpbmFscy1hbmQtaG93LXRoZXktY29tcGFyZS10by10cmFkaXRpb25hbC1uZnRzLTE1OTYxMjgxLmh0bS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Explained: Bitcoin Ordinals and how they compare to traditional NFTs - CNBCTV18",
        "content": "For the longest time, the utility of Bitcoin was limited to storing and transferring value. As such, developer activity on the world’s oldest blockchain network was minimal, to say the least. Fortunately, this began to change with the emergence of Bitcoin DeFi protocols such as Wrapped Bitcoin (WBTC), Stacks (STX), Rootstock (RBTC), etc.\n\nThese platforms brought the world of crypto borrowing and lending to the Bitcoin network and created new use cases for the big daddy of cryptocurrencies.\n\nAnd now, the utility of the Bitcoin network has been expanded even further, thanks to the arrival of the Ordinals Protocol. This latest innovation allows developers and artists to create and store digital artefacts directly on the Bitcoin blockchain. The protocol has been a massive hit, with more than 100,000 ordinals minted so far.\n\nThe introduction of this technology has also sent Bitcoin metrics skyrocketing. For instance, the number of non-zero Bitcoin addresses hit a record of 44 million following the introduction of ordinals. In addition, Bitcoin’s block sizes have also increased after ordinals were launched, even touching an all-time high of 2.5MB on Feb 12.\n\nBut what are Bitcoin Ordinals, why are they causing such a stir, and how do they compare to traditional NFTs? Tag along to find out.\n\nBitcoin Ordinals: What are they?\n\nAs you may know, the smallest denomination of BTC is known as a satoshi or a Sat - one BTC is equal to 100,000,0000 sats. The Ordinals Protocol allows users to send and receive sats that carry optional extra data. This data can be text, JPEGs, audio or videos.\n\nAdding such kinds of data to a satoshi is known as inscription and the end result can be considered as a Bitcoin NFT or an ordinal. Since the launch of the Ordinals Protocol on Jan 21, nearly 100,000 inscribed satoshis have been minted, including a collection of Ordinal Punks and Ordinal Penguins. For the unacquainted, these are Bitcoin offshoots of popular NFT collections.\n\nIt is important to note that ordinals are only possible thanks to the “witness section” of Bitcoin transactions that was introduced after the Taproot soft fork in 2021. This is where the JPEGs, audio files or videos are inscribed into the individual sats. These digital artefacts are also made possible through the 2017 Segwit update, a soft fork that increased block sizes from 1MB to 4MB.\n\nAre ordinals NFTs?\n\nBitcoin Ordinals can be considered NFTs, but they have a few differences. To begin with, most NFTs are created and tracked through a smart contract. However, the assets that these smart contracts represent are often hosted elsewhere.\n\nFor example, some NFT platforms make use of the decentralised storage system, IPFS, to store the NFT artworks/audio files/videos. However, ordinals are inscribed into the satoshi and therefore, these Bitcoin-NFTs are stored on-chain. They are validated in blocks along with other transactions and stored in the network’s distributed ledger.\n\nMoreover, traditional NFTs usually have metadata that allows creators to change the appearance and characteristics of an NFT. For instance, some NFT projects will ask users to refresh their metadata to update their NFTs with higher-resolution images.\n\nHowever, since ordinals are stored on-chain, their data is immutable and cannot be changed. Also, unlike NFTs, ordinals do not provide creators with the option to receive royalties on subsequent sales.\n\nIn a nutshell, ordinals are immutable and complete digital artefacts. Unlike traditional NFTs, they cannot be tampered with and they reside completely on-chain. For these reasons, the creator of the Ordinals Protocol, Casey Rodarmor, believes that these digital artefacts are “intended to reflect what NFTs should be.”\n\nOrdinals break records but also receive flak\n\nSince their introduction, Ordinals have been a huge hit. They have brought thousands of new users to the Bitcoin blockchain. Evidence of this is in the fact that non-zero Bitcoin addresses touched a record 44 million on Feb 14.\n\nMoreover, since these satoshis carry extra on-chain data, Bitcoin block sizes have also increased over the last couple of weeks. Recently, Bitcoin registered its largest-ever block, coming in at a massive 2.52MB. In comparison, the average Bitcoin block size before the introduction of ordinals was around 0.7 MB to 1.5 MB.\n\nPreviously, miners only received network fees for monetary transactions. However, with the introduction of ordinals, the network will be used for non-monetary purposes for the first time in its history. This will increase the transaction volumes and bring more revenue for miners.\n\nAs such, data from Glassnode indicates that miners have collected nearly $600,000 in transaction fees from ordinals in the last two months alone. Such an additional revenue stream could be extremely important when block rewards dwindle or no longer exist in the future.\n\nHowever, not everyone is on board with these digital artefacts. For instance, in a recent tweet, Adam Black, the CEO of Blockstream, referred to ordinals as a frivolous waster of block space. Others highlighted the increase in transaction fees thanks to ordinals.\n\n“Marginalized peoples in developing countries will have to pay more to run their Bitcoin nodes and send transactions because privileged wealthy whites want to put JPEG drawings on the blockchain as status symbols,” read a tweet from the popular crypto Twitter handle, Bitcoin is Saving.\n\nThen there’s also the issue of power consumption. Bitcoin is known for its astronomical energy usage and the influx of ordinals is not helping this in any way.\n\n“The carbon footprint of NFTs on Ethereum wasn’t looking great before The Merge, but it was nothing compared to the latest hype: on-chain Bitcoin NFTs,” said Alex de Vries, a prominent data scientist, in a LinkedIn post.\n\nConclusion\n\nLove it or hate it, ordinals are transforming the Bitcoin blockchain. They bring added utility and could expand the user base of the world’s largest cryptocurrency. Moreover, they could lead to further innovation and more practical use cases in the future. As such, most Bitcoiners are welcoming these digital artefacts with open arms.\n\nAlso read: Crypto market reacts to BUSD shutdown and experts predict the fate of stablecoins"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vaW52ZXN0aW5nLWJpdGNvaW4tY3J5cHRvLXJhbGx5LXByaWNlLXByZWRpY3Rpb24tYWx0Y29pbnMtdG8tYnV5LWV0aGVyZXVtLTIwMjMtMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Price Prediction, 4 Altcoins to Buy Now: Crypto Chartmaster - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nBitcoin can continue its impressive rally, but will eventually retest its lows and could potentially lose half its value, according to a self-described cryptocurrency evangelist.\n\nThe price of the world's biggest crypto has risen 48% year-to-date to an eight-month-high of $25,000 during a broader rebound for cryptos and other risk assets. Ether, the second-largest digital asset, has also roared back to life and is up 44% in 2023 to its highest level since mid-September.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nBut while both tokens appear to have upside ahead, ether currently looks like a better bet from a risk-reward standpoint, said Forrest Przybysz, the founder and CEO of crypto-focused firm Sistine Research, in a recent interview with Insider.\n\nWhat's next for bitcoin and ether?\n\nBitcoin is approaching a key technical resistance range of $28,000 to $32,000, according to Przybysz's charts. While the token could climb another 28% if investors continue to embrace risk during a wider market rally, Przybysz told Insider that bitcoin is likely to give up its gains.\n\nAdvertisement\n\nBitcoin will run into technical resistance in the high $20,000s and low $30,000s, which could send it back under $20,000. Forrest Przybysz, Sistine Research\n\nIf bitcoin's rally stalls, Przybysz's charts show that it would likely fall up to 24% to its nearest support level of $19,000, though a 50% decline to $12,700 is possible if the token can't hold that crucial mark. And in a worst-case scenario, bitcoin could slide to levels last seen in late 2020.\n\nMeanwhile, ether has solid support in the mid-$1,300s and could reach $2,000 or even $2,700 by the late first quarter or early second quarter, Przybysz said. In other words, while Przybysz's charts also indicate that ether could fall 20%, the token's potential upside of 57% is double that of bitcoin.\n\nEther is trading above technical support but could rise substantially. Forrest Przybysz, Sistine Research\n\nDespite their strong showings so far this year, bitcoin and ether are still about 64% below their all-time highs. And although Przybysz doesn't see bitcoin or ether breaking their price records before late 2024, he said what has broken is the bear market's structure, which is a solid start.\n\n\"I do think that there's potentially another leg up in crypto and then probably followed by a return to some of the lows that we've seen,\" Przybysz told Insider. \"And then once we get closer to the end of 2023 — maybe it's 2024 — we could start to see some buying behavior come in.\"\n\nAdvertisement\n\n4 tokens to target instead of bitcoin\n\nWhile bitcoin looks like a risky bet at current levels, Przybysz said that four smaller cryptos look attractive: ether (ETH), polygon (MATIC), quant (QNT), and chainlink (LINK). These altcoins have upside despite the brutal crypto winter of this past year, he said.\n\n\"There will be a lot of lower-cap cryptocurrencies — altcoins — that probably do put in all-time highs, just one-offs that decide to deviate and decouple,\" Przybysz said. \"We've already had some that are performing decently, potentially putting in new highs already. But those are pretty sparse — far and few between.\"\n\nBelow are the four cryptocurrencies that the chartmaster and research firm head is most bullish about right now, along with the symbol, market capitalization, and thesis for each."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmtzYXQuY29tL25ld3MvbG9jYWwvMjAyMy8wMi8xNy9zYW4tYW50b25pby1raW5kZXJnYXJ0ZW4tdGVhY2hlci1sb3Nlcy02NTAwLWluLWRhdGluZy1hcHAtYml0Y29pbi1zY2FtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "San Antonio kindergarten teacher loses $6500 in dating app bitcoin scam - KSAT San Antonio",
        "content": "SAN ANTONIO – When kindergarten teacher Beth Hutchinson met “Robert” on the Bumble dating app, he seemed like a potential match.\n\n“He was saying that he was adopted, grew up in Switzerland, moved to the U.S. about three or four years ago,” she recalled.\n\nHe suggested they move their conversations off the platform and to the private messaging app, WhatsApp.\n\nAfter a couple of weeks of messaging, including heart emojis, she said he offered to teach her about trading and investing.\n\n“He showed me how to take money from my account, turn it into Bitcoin and then be able to start using it to trade and whatnot on the New York Stock Exchange,” Hutchinson said.\n\nShe started with $1,000. Within a few weeks, she’d turned $6,500 into cryptocurrency and invested it on a website “Robert” said was the New York Stock Exchange. It looked promising.\n\n“Every time I did it, I was always gaining money up to a point where it was a couple hundred at a time,” she said. “I thought I was putting my money in the New York Stock Exchange.”\n\nBut when “Robert” became aggressive and threatening, she felt something was wrong and called the real New York Stock Exchange.\n\n“I gave them the web address, and they said, ‘That’s not one of ours,’” Hutchinson said. “My heart just dropped into my stomach.”\n\nThe website was bogus, but the money she’d invested was real. It was also gone.\n\nIt’s hardly the first time an online flirt turned out to be a fake. Last year, crypto romance scammers duped people out of some $139 million dollars, according to the Federal Trade Commission.\n\nIt’s a highly lucrative scam they preys on emotions and human nature.\n\n“There’s a genuine fear of missing out of missing out on the next best investing opportunity,” said Jason Meza with the Better Business Bureau.\n\nWarning signs that Romeo or Juliet may be a scammer include moving the conversation off the original platform and to a private messaging app that’s encrypted.\n\nOther red flags are turning the conversation to money and never being able to actually meet in person.\n\nHutchinson said the fact that he never actually asked for her accounts probably gave her a false sense of security. “Robert” also said he lived in Chicago, and when he called to video chat, it was always while she was at work and couldn’t answer.\n\nShe knows she’s highly unlikely to get recover her money. She has filed reports with the FBI and BBB. Now, she wants to warn others about sweet talkers who are out to steal hearts and money.\n\n“Everyone’s like, ‘Well, I’d be smarter than that,’” she said. “Well most people view me as a pretty intelligent person, but it still happened to me, too.”\n\nAlso on KSAT.com:"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2hvdy1vcmRpbmFscy1hcmUtYWZmZWN0aW5nLWJpdGNvaW4tbWVtcG9vbHMtdHJhbnNhY3Rpb24tc2l6ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "The impact of Ordinals on Bitcoin mempools & transaction size - CryptoSlate",
        "content": "The introduction of the Ordinals Protocol, which enables the development of Bitcoin-based NFTs, has coincided with significant changes to mempool activity and transaction size, new data by CryptoSlate and Glassnode show.\n\nWhat are Bitcoin Ordinals?\n\nThe ability to mint non-fungible tokens directly onto Bitcoin’s blockchain with all associated content, such as images and videos, is made possible by Ordinal NFTs, also known as digital artifacts or inscriptions.\n\nLaunched in January 2023, the Ordinals protocol allows users to interact with and exchange individual satoshis that may contain unique inscribed data. This new approach to creating NFTs on Bitcoin takes advantage of changes included in the Bitcoin Taproot upgrade. It involves placing the complete content of the NFT directly on-chain, providing a novel way to explore, transfer, and receive such tokens.\n\nWhen combined with the SEC’s decision to exempt Bitcoin from the “security” classification, some experts say a bullish outlook for Bitcoin begins to emerge, which could positively impact the entire cryptocurrency ecosystem.\n\nQuantitative analysis\n\nAccording to recent Glassnode data sourced in conjunction with CryptoSlate, the aftermath of Ordinals has positively impacted Bitcoin. However, the data suggests there are factors to consider in relation to the ‘health’ of the Bitcoin network. For example, the mean size of transactions increased by over 100%, from 600 B (bytes) to 1100 B.\n\nHowever, the below chart illustrates that Ordinal transactions have low satoshi fees (purple color dominant).\n\nThe total fees (USD Value) of transactions waiting in the mempool in different size (vByte) cohorts have increased since FTX collapsed, and inscriptions have lifted the baseline fee from 1 – 4 satoshis. The congestion within the mempools was raised partly due to an increase in space needed to store Ordinals inscriptions compared to standard transaction data. In addition, a surge in Bitcoin usage during the FTX saga, as investors led an exodus in exchange-held crypto, played a role in the November spike.\n\nGlassnode data shows that Bitcoin’s mean block size upper range has increased significantly since the launch of Ordinals, rising from 1.5-2.0 MB to 3.0-3.5 MB within a few weeks. The increase correlates with not only images but larger files such as audio and video starting to be stored as Ordinals.\n\nNotably, on Feb. 1, Inscription 652, the first piece in the Taproot Wizards collection, set a new record as the largest block and transaction in the history of Bitcoin, reaching 4 MB in size. Additionally, on Feb. 17., CryptoSlate reported on a fart that had been uploaded to the Ordinal network, inscription 2042.\n\nQualitative analysis\n\nGlassnode shows that while the Ordinal network has had a significant impact on Bitcoin transaction hash size and cost, qualitatively, this may be connected to a broader crackdown on proof-of-stake mechanisms.\n\nThe majority of other layer-1 crypto protocols, which refer to base-layer blockchains having their own native tokens, are built on a proof-of-stake consensus mechanism, including Ethereum.\n\nHowever, with the SEC’s crackdown on Kraken’s staking service in the United States, which suggests that only highly sophisticated retail investors can partake in validating networks of such blockchains, it appears that investing in ETH and similar tokens could become the exclusive domain of institutional players, leading to improvements to the Ordinal network.\n\nAs a result, the Ordinals Protocol is being hailed as a game-changer for the Bitcoin blockchain. By enabling the creation of Bitcoin-based NFTs, it has given the world’s most famous cryptocurrency a new purpose beyond just facilitating peer-to-peer transactions. This is particularly significant, given that the mainstream appeal of Bitcoin has arguably been hindered by factors like banking system regulations and its volatile price swings.\n\nAs evidenced by data from Glassnode, intense bullish activity appears to be forming around the Ordinal network.\n\nFeatured Data Partner\n\nMentioned in this article"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdGhlLW9yZGluYWxzLW1vdmVtZW50LXdpbGwtYmVuZWZpdC10aGUtYml0Y29pbi1ibG9ja2NoYWlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "How the Ordinals movement will benefit the Bitcoin blockchain - Cointelegraph",
        "content": "According to independent developer Udi Wertheimer, Bitcoin (BTC) non fungible tokens (NFTs) will positively impact the ecosystem by improving its security and incentivizing developers to build on the network.\n\nThe number of newly created Ordinals has been spiking in recent weeks, causing a surge in transaction fees and average block size on the Bitcoin blockchain.\n\nAccording to Wertheimer, Bitcoin NFTs are going to be beneficial for Bitcoin’s security budget. By driving up transaction fees, the creation of Ordinals will incentivize miners to secure the network while the revenue from mining rewards will decrease with each Bitcoin halving.\n\n“Because the block space is scarce and because there’s demand for stuff like inscriptions, there’s a lot of hope that we will get enough people who want to pay fees in order to keep the Bitcoin network secure,” Wertheimer explained in a recent interview with Cointelegraph.\n\nAlso, Wertheimer noted, Ordinals provide a new use case to make building on Bitcoin commercially profitable.\n\n“With all of that interest around Ordinals and inscriptions, I expect that there is going to be a very big ecosystem that is built around that,” he said.\n\nWertheimer dismisses the notion held by some Bitcoin core developers that creating NFTs is not an appropriate use case for Bitcoin. According to him, in recent years, Bitcoin core developers “have ignored what actual Bitcoin users want.“\n\nTo learn more about Ordinals and how they impact the Bitcoin network, watch the full interview on our YouTube channel and don’t forget to subscribe!"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDIvMTcvb3JkaW5hbHMtYml0Y29pbi0yNWstc2F0b3NoaS1leHBsYW5hdGlvbi_SAVNodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzAyLzE3L29yZGluYWxzLWJpdGNvaW4tMjVrLXNhdG9zaGktZXhwbGFuYXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin just broke $25,000, and it could be due to ordinals. Here’s everything you need to know about them - Fortune",
        "content": "Despite the Securities and Exchange Commission’s recent crackdown on crypto, Bitcoin is up, and up big: From Tuesday to Thursday, the price rose almost 14%, peaking just above $25,000, according to CoinMarketCap.\n\nPinpointing exactly why the price of the world’s first cryptocurrency rises and falls isn’t an exact science, but reports of a recent short squeeze—investors who’d bet the price of Bitcoin would decrease sold holdings—is one explanation for Bitcoin’s sudden rally.\n\nAlso driving up Bitcoin’s value are ordinals, according to a report from blockchain data company Glassnode. But what are they, and how are they contributing to Bitcoin’s latest price surge?\n\nOrdinals’ origins\n\nAn ordinal is essentially a non-fungible token, a digital asset most famously used to prove that only one person owns, for example, a $69 million piece of digital art sold in March 2021.\n\nNFTs are most famously used on blockchains like Ethereum and Solana. The computing capabilities of these digital ledgers extend far beyond Bitcoin’s, whose blockchain is primarily designed to record transactions between owners of the digital currency.\n\nHowever, in December, Casey Rodarmor, a Bitcoin engineer, designed a method to allow NFTs to exist on Bitcoin’s blockchain, as opposed to earlier efforts to add NFTs to Bitcoin’s ledger that were hosted “off-chain,” or not in the same database that records daily transactions. Rodarmor called these “digital artifacts” ordinals.\n\nCumulative fees spent minting Ordinals approaching $1M and looking exponential.\n\n\n\n🔗 https://t.co/kD6KnYFd8f pic.twitter.com/BjvotTwnpc — Ben DiFrancesco (@BenDiFrancesco) February 16, 2023\n\nHow do ordinals work?\n\nFirst, Rodarmor invented an algorithm to create a serial number for each and every satoshi, the name for the smallest subdivision of a Bitcoin (there are 100 million satoshis per Bitcoin), based on when the satoshi was first generated.\n\nThen, he created a method for “inscribing” data on a satoshi, exploiting recent updates to Bitcoin’s code in 2017 and 2021, which expanded the capacity for the blockchain to store data beyond transaction records.\n\n“Imagine the one-cent piece you have in your pocket, and I can put a piece of data on it,” Daniel Peter, cofounder and CEO of CapsuleNFT, a blockchain infrastructure company that recently announced its work with ordinals, told Fortune. “Instead of that being a cent, now I’ve attached a picture of Benjamin Franklin to that cent.”\n\nLike NFTs on other blockchains, ordinals are “non-fungible.” In other words, there is a unique record on Bitcoin’s ledger that says that the slight sliver of Bitcoin with, say, Benjamin Franklin’s image on it belongs to one owner and one owner only.\n\nBut, as opposed to the NFTs on blockchains like Ethereum and Solana, the data piggybacking on top of a satoshi is not a link to where the actual file resides (often on decentralized file storage systems). The data is stored, or “inscribed,” on the ordinal itself.\n\nIt’s worth noting that Ethereum and Solana also allow users to store large data files on an NFT; however, pushing this data “on chain,” or having it reside on the blockchain itself, is more computationally intensive and therefore expensive, Jon Wong, technical lead on the NFT team at the Solana Foundation, told Fortune.\n\n“It’s decidedly an anti-scale model,” Austin Federa, head of strategy and communications at the Solana Foundation, said of ordinals. He added: “Here’s a version of something that sort of, if you squint, resembles fine art, in terms of its ability to create value through scarcity.” However, he noted, its uses are otherwise limited.\n\nStaying power?\n\nSince ordinals became hot in early February, the number of “mints,” or creations, of Bitcoin NFTs have soared, according to data from Dune Analytics. The majority of data “inscribed” or stored on ordinals are images, including reprints of Bored Apes illustrations and a space turtle GIF. But people have also attached other media, including a clip of amateur Spanish rap. Almost 130,000 ordinals have been minted so far, per Dune.\n\nAs ordinal mints have increased, the minters have been willing to pay the miners, the computers that run and secure Bitcoin’s blockchain, more and more in transaction fees. The increased frenzy is one of the reasons behind Bitcoin’s recent price increase, says Wong of the Solana Foundation.\n\nIt remains to be seen whether ordinals, which are only about two months old, have staying power. But, in the meantime, Bitcoiners are cheering on the rally."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8xNy9iaXRjb2luLW9yZGluYWxzLWNhbi1saWZ0LXRoZS1lbnRpcmUtY3J5cHRvLWVjb3N5c3RlbS_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDIvMTcvYml0Y29pbi1vcmRpbmFscy1jYW4tbGlmdC10aGUtZW50aXJlLWNyeXB0by1lY29zeXN0ZW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals Can Lift the Entire Crypto Ecosystem - CoinDesk",
        "content": "It’s also why the Ordinals Protocol is so important. The Bitcoin blockchain now has a purpose beyond peer-to-peer payments, whose mainstream appeal has always been undermined by regulation of the on- and off-ramps to the banking system and by bitcoin’s own price volatility. Now that it incorporates NFTs – the most important crypto innovation since Bitcoin itself – the Bitcoin blockchain is engaging with creators of digital content, the backbone of the internet economy. That will unleash a torrent of new creative innovation in the space."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvYy9jb25zZW5zdXMtbWVjaGFuaXNtLWNyeXB0b2N1cnJlbmN5LmFzcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "What Are Consensus Mechanisms in Blockchain and Cryptocurrency? - Investopedia",
        "content": "What Is a Consensus Mechanism?\n\nA consensus mechanism is a program used in blockchain systems to achieve distributed agreement about the ledger's state. Generally, it is implemented in a network with many processes and users. Cryptocurrencies, blockchains, and distributed ledgers benefit from their use because the consensus mechanism replaces much slower human verifiers and auditing.\n\nFor instance, the Bitcoin blockchain uses a mechanism called Proof-of-Work (PoW), which requires computational power to solve an encrypted puzzle, called the hash. After the hash is solved by one miner (or a group working together), Bitcoin's PoW requires that every node on the network verifies the data that has been changed by checking:\n\nThe data structure\n\nThe block header hash\n\nThe block timestamp\n\nThe block size\n\nThe first transaction\n\nIt then completes a long transaction verification checklist. This verification takes much less time than the process of solving the hash, which is called mining, and is orders of magnitude less time-consuming than human verification.\n\nKey Takeaways A consensus mechanism is any method used to achieve agreement, trust, and security across a decentralized computer network.\n\nIn the context of blockchains and cryptocurrencies, proof-of-work (PoW) and proof-of-stake (PoS) are two of the most prevalent consensus mechanisms.\n\nConsensus mechanisms play an essential part of securing information by encrypting it and using automated group verification.\n\nHistory of Consensus Mechanisms\n\nWhen computers and networks began gaining popularity in the 1980s and 90s, shared databases were created so that multiple users could access the information they stored. Most had a centralized database with permissions that users accessed from different stations. This setup evolved into centralized networks with administrators who granted user rights and maintained the integrity of the data.\n\nThese shared databases became known as distributed ledgers because they recorded information and were networked for many users in different locations to access. One of the most significant issues that needed addressing was that of preventing data tampering and unauthorized access, whether it was malicious or not. A method to automate distributed database management was required to ensure data was not changed.\n\nThis need led to the creation of distributed autonomous consensus, where programs on a network agreed on a database's state using cryptographic techniques. Agreement was designed to be reached using encryption algorithms to create long strings of alphanumeric numbers—called a hash—which were then verified by programs running on the network. A hash only changes if the information input into the hashing algorithm is changed, so the programs were designed to compare hashes to ensure they matched.\n\nWhen each program running on the network created a matching alphanumeric string, the data was said to be agreed upon by consensus of the network. Thus, consensus mechanisms were made, with credit generally given to Satoshi Nakamoto, the anonymous Bitcoin creator. However, many people worked on consensus mechanisms for years before Nakamoto released the whitepaper that made Bitcoin famous.\n\nData and computer scientists such as Moni Naor, Cynthia Dwork, Adam Beck, Nick Szabo, and many others worked on and contributed to developing networked consensus mechanisms.\n\nTypes of Consensus Mechanisms\n\nThere are different kinds of consensus mechanism algorithms, each of which works on different principles.\n\nThe proof of work (PoW) is a common consensus algorithm used by the most popular cryptocurrency networks like Bitcoin and Litecoin. It requires a participant node to prove that the work done and submitted by them qualifies them to receive the right to add new transactions to the blockchain. However, the bitcoin mining mechanism requires high energy consumption and long processing times.\n\nThe proof of stake (PoS) is another common consensus algorithm that evolved as a low-cost, low-energy consuming alternative to the PoW algorithm. It involves allocating responsibility in maintaining the public ledger to a participant node in proportion to the number of virtual currency tokens held. However, this has the drawback that it incentivizes hoarding instead of spending.\n\nProof of History (PoH) was developed by the Solana Project. It is similar to Proof of Elapsed Time (PoET), which encodes the passage of time itself cryptographically to achieve consensus without expending many resources.\n\nWhile PoW and PoS are by far the most prevalent in the blockchain space, there are other consensus algorithms like Proof of Capacity (PoC) which allow sharing of memory space of the contributing nodes on the blockchain network. The more memory or hard disk space a node has, the more rights it is granted for maintaining the public ledger. Proof of Activity (PoA), used on the Decred blockchain, is a hybrid that makes use of aspects of both PoW and PoS. Proof of Burn (PoB) requires transactors to send small amounts of cryptocurrency to inaccessible wallet addresses, in effect \"burning\" them out of existence.\n\nFuture of Consensus Mechanisms\n\nWhile used by all cryptocurrencies, consensus mechanisms are just as important in distributed ledger networks used by enterprises. Platforms have been created for business and government use, allowing each entity to choose from modules created for their needs, backed by consensus mechanisms. Hyperledger Fabric, one of the more well-known distributed ledger platforms, provides different consensus mechanisms. For example, one entity might not need proof-of-work, considered byzantine fault tolerant, whereas another might not need that level of consensus.\n\nCryptocurrency's future may be unknown and volatile, but consensus mechanisms remain an essential part of emerging technology. They ensure data safety and integrity and keep those with nefarious intentions locked out of distributed ledgers.\n\nWhich Consensus Mechanism Is Best? The best consensus mechanism is one that fits the needs of the users. Proof of work is thought to be best for Bitcoin, while proof of stake was adopted by Ethereum and is believed to be best by its community. Other mechanisms might work better for enterprises, businesses, or personal uses.\n\nWhat Is an Example of a Consensus Mechanism? Proof of stake is one example. In this mechanism, users \"stake\" their tokens to be given the privilege of conducting work on the blockchain for rewards like transaction fees.\n\nWhat Are the Types of Consensus Mechanisms? Several have been created, but only a few have been implemented. Some types besides proof of work and proof of stake are delegated proof of stake, proof of importance, proof of elapsed time, proof of authority, and proof of capacity. Each uses different concepts to validate data changes.\n\nThe Bottom Line\n\nConsensus mechanisms have become an essential aspect of distributed ledgers, databases, and blockchains because much of the world is becoming more digital. Ownership of physical assets is being tokenized on ledgers and blockchains, people without access to financial services have access through blockchains, and businesses need data security more than ever.\n\nConsensus mechanisms verify data inputs and outputs, which translates to automatically auditing the digital transactions that are common today—without human oversight or intervention. They create an environment where you don't need to trust that the other party in a transaction is honest because they ensure the information is unalterable and secure.\n\nInvesting in cryptocurrencies and other Initial Coin Offerings (“ICOs”) is highly risky and speculative, and this article is not a recommendation by Investopedia or the writer to invest in cryptocurrencies or other ICOs. Since each individual's situation is unique, a qualified professional should always be consulted before making any financial decisions. Investopedia makes no representations or warranties as to the accuracy or timeliness of the information contained herein. As of the date this article was written, the author does not own cryptocurrency.\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1ldHJpYy1wcmludHMtbW90aGVyLW9mLWFsbC1idGMtYnVsbGlzaC1zaWduYWxzLWZvci00dGgtdGltZS1ldmVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin metric prints 'mother of all BTC bullish signals' for 4th time ever - Cointelegraph",
        "content": "A Bitcoin (BTC) price indicator has flashed green for just the fourth time ever this week in a major warning to bears.\n\nIn a tweet on Feb. 16, crypto market analyst Mohit Sorout announced that the dollar cost average (DCA) indicator was now “suggesting a raging bull market.”\n\nDCA breakout last preceded 640% BTC price upside\n\nThe latest Bitcoin metric to flip bullish on long timeframes, the DCA indicator is even getting attention from major Bitcoin investment circles.\n\nIts buy signals are rare, with Sorout seeing just three throughout Bitcoin’s history, each precluding serious BTC price upside.\n\n“Today marks the 4th time this signal is suggesting a raging bullmarket,” he wrote in comments, describing the event as “the mother of all btc bullish signals.”\n\nThe mother of all $btc bullish signals has flashed - DCA indicator\n\n\n\nHistorically, it has flashed only thrice in btc's existence & each occurence led to massive rallies of\n\n7400% (2015)\n\n160% (2019)\n\n640% (2020)\n\n\n\nToday marks the 4th time this signal is suggesting a raging bullmarket pic.twitter.com/suMVlWFrzc — Mohit Sorout (@singhsoro) February 16, 2023\n\nDCA refers to an investment strategy whereby a buyer allocates a fixed amount of capital to gain exposure to an asset at set intervals. This could be buying $10 per week in Bitcoin, with the concept regularly touted as an optimal way of gaining exposure to volatile cryptocurrencies.\n\nThe DCA Indicator measures the relative profitability of a hypothetical DCA strategy involving $1 buys per day for a year.\n\nOnce it crosses into profitable territory, marked as 365 on its scale, major bull markets have historically begun, Sorout argues. An exception appears to be mid-2022 when a move above the 365 mark subsequently reversed, and BTC/USD started its journey to multi-year lows near $15,600.\n\nNonetheless, amid an atmosphere of increasing faith in Bitcoin’s 2023 recovery enduring, others were also willing to give the latest breakout the benefit of the doubt.\n\n“Rare massive Bitcoin Buy signal,” Dan Tapiero, founder and CEO of 10T Holdings, declared in a repost of Sorout’s findings.\n\nBitcoin price death crosses and a “failed breakout”\n\nBeyond DCA, another rare bull signal this month comes in the form of the Williams %R oscillator, Cointelegraph reported.\n\nRelated: Bitcoin gained 300% in year before last halving — Is 2023 different?\n\nDepending on the timeframe, however, its Bitcoin bull run signals do not yet point unequivocally to the moon.\n\nCaleb Franzen, a senior market analyst at Cubic Analytics who flagged the breakout, is warning that Bitcoin’s latest trip to six-month highs represents a “failed breakout.”\n\nThe largest cryptocurrency also faces a major hurdle in the form of several moving averages (MAs) overhead acting as resistance for much of 2022.\n\nData from Cointelegraph Markets Pro and TradingView further showed two MAs forming a “death cross” for the first time ever this month.\n\nBTC/USD 1-week candle chart (Bitstamp) with 50, 200MA. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTgvYml0Y29pbi1zb2Fycy10aGVuLXJldHJlYXRzLXdoYXRzLWJlaGluZC10aGlzLXdlZWtzLXJvbGxlcmNvYXN0ZXItd2hhdHMtYWhlYWQv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMi8xOC9iaXRjb2luLXNvYXJzLXRoZW4tcmV0cmVhdHMtd2hhdHMtYmVoaW5kLXRoaXMtd2Vla3Mtcm9sbGVyY29hc3Rlci13aGF0cy1haGVhZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Soars, Then Retreats: What’s Behind This Week’s Roller Coaster? What’s Ahead? - CoinDesk",
        "content": "To be sure, some observers think that regulatory overreach could drive away investment and spook markets. “Based on their unwillingness to come to the table, it’s clear that the SEC’s motivations of late are being driven by a desire to protect the financial incumbents – that is, Wall Street,” Al Morris, founder of the decentralized publishing protocol Koii Network, told CoinDesk in an email, adding that overly harsh U.S. regulations could benefit other crypto hubs in Europe and Dubai."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZhY2VzLWRvLW9yLWRpZS13ZWVrbHktbW9udGhseS1jbG9zZS13aXRoLW1hY3JvLWJ1bGwtdHJlbmQtYXQtc3Rha2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin faces do-or-die weekly, monthly close with macro bull trend at stake - Cointelegraph",
        "content": "Bitcoin (BTC) is leaving traders guessing as the bull market's future depends on the last week of February.\n\nIn multiple tweets on Feb. 17, popular trader and analyst Rekt Capital flagged crucial resistance battles ongoing on BTC/USD across multiple timeframes.\n\nBitcoin price squares off with bear market downtrend\n\nBitcoin hit new six-month highs this week as the latest innings of its 2023 recovery kept the bull-bear debate raging.\n\nAfter a consolidatory start to the month, February has become a reckoning point for Bitcoin price strength. Gains have been harder to cement than in January, when BTC/USD finished up nearly 40%.\n\nFor Rekt Capital, now is the time to pay attention — whether trading daily, weekly or even monthly timeframes.\n\nThe weekly chart perhaps represents the biggest struggle in the wake of the 2022 bear market. Bitcoin is currently attempting to beat out an area of resistance it failed to conquer last August, so far without success.\n\n“Ultimately, a Weekly Close above this key area is what BTC needs to achieve to break this confluent area of resistance to continue moving higher,” Rekt Capital wrote in part of an update on the weekly chart.\n\nThe picture is complicated thanks to two other major resistance trend lines lying overhead, coming in the form of the 50-week and 200-week moving averages (MAs).\n\nAs Cointelegraph reported, these have formed their first-ever “death cross” — a potential nail in the coffin for those hoping that a new bull market is beginning.\n\nOn monthly time frames, an equally tense situation is developing. Here, too, BTC/USD is “getting very close to breaking the Macro Downtrend,” Rekt Capital says.\n\nThe upcoming monthly close will be the deciding factor, as continued strength could see Bitcoin begin March outside a falling trend line in place since the November 2021 all-time highs.\n\nWhile this would be a significant event, certain signs already suggest that it could become a reality. Bitcoin’s relative strength index (RSI), formerly at all-time lows, “has confirmed a new Bull Trend already.”\n\nBTC price analysis: Whales targeting “bull market maxis”\n\nCloser to home, intraday activity remains tantalizingly opaque as Bitcoin bulls cling to a portion of the week’s upside.\n\nRelated: Bitcoin metric prints ‘mother of all BTC bullish signals’ for 4th time ever\n\nTwo trips above $25,000 have nonetheless failed to result in a resistance-support flip, and at the time of writing, BTC/USD traded at around $24,500, data from Cointelegraph Markets Pro and TradingView showed.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nWhile Rekt Capital is celebrating a confirmed breakout, others remain fearful that the entire episode has been the result of manipulation by market whales.\n\nAnalyzing order book activity on Binance, monitoring resource Material Indicators appeared to be in no doubt about the spurious nature of current price “strength.“\n\nWhales have been moving bid support moving higher, creating the illusion of a “bull market breakout.“\n\n“We already have 2 rejections so if they get it, it’s a bonus,“ Material Indicators wrote about the twin moves above $25,000.\n\n“IMO, the goal was to raise the distribution range and drop ask liquidity on to bull market maxis.“\n\nAn accompanying order book chart captured the action, along with whale volumes decreasing as spot price increased — a phenomenon Material Indicators recently dubbed “whalish divergence.“\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDIvMTcvdGVycmFmb3JtLWxhYnMtZG8ta3dvbi10cmFuc2ZlcnJlZC1tb3JlLXRoYW4tMTBrLWJpdGNvaW4tb3V0LW9mLXBsYXRmb3JtLWFjY291bnRzLWFmdGVyLWNvbGxhcHNlLXNlYy_SAZQBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAyLzE3L3RlcnJhZm9ybS1sYWJzLWRvLWt3b24tdHJhbnNmZXJyZWQtbW9yZS10aGFuLTEway1iaXRjb2luLW91dC1vZi1wbGF0Zm9ybS1hY2NvdW50cy1hZnRlci1jb2xsYXBzZS1zZWMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Terraform Labs, Do Kwon Transferred More Than 10K Bitcoin Out of Platform Accounts After Collapse: SEC - CoinDesk",
        "content": "The collapse of Kwon's crypto enterprise last year sent ripples through the industry and set off a series of high-profile bankruptcies that are ongoing. Authorities in South Korea, who are looking for the disgraced founder, have also frozen funds that are suspected to be tied to him."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxldmVscy10by13YXRjaC1hcy1idGMtcHJpY2UtcmVqZWN0cy1hdC1rZXktMjVrLXRyZW5kbGluZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin levels to watch as BTC price rejects at key $25K trendline - Cointelegraph",
        "content": "Bitcoin (BTC) climbed back above $24,000 at the Feb. 17 Wall Street open as analysis favored “consolidation and continuation” higher.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBitcoin faces key level to “break” bear trend\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD recovering some overnight losses after dipping to $23,369 on Bitstamp.\n\nThe pair had hit fresh six-month highs the day prior, these facing stiff resistance in the form of two weekly moving averages (MAs) and a heavy sell wall.\n\nBTC/USD 1-week candle chart (Bitstamp) with 200MA. Source: TradingView\n\nScott Melker, the trader and podcast host known as “The Wolf Of All Streets,” stressed the importance of levels acting as lines in the sand for bulls.\n\n“$25,212. I’ve been screaming about this number for weeks. A break above (ideally close) makes a higher high for the first time since $69,000,” he tweeted about the weekly chart on Feb. 16.\n\n“That breaks the bear trend. Just tapped it, to the penny... and dropped in the short term. Time to pay attention!”\n\nBTC/USD annotated chart. Source: Scott Melker/Twitter\n\nInvestigating activity on exchanges, monitoring resource Material Indicators identified bid support inching higher, taking spot price with it.\n\n“The notorious BTC buy wall we’ve been tracking for 5 weeks just strategically moved again, this time just above the 21-Day Moving Average,” it noted alongside a chart.\n\n“This entity seems to be playing the Technicals level by level.”\n\nAccompanying data from the Binance BTC/USD order book also showed resistance laddered up to $25,600 — well above the site of the 200-week MA, which flipped from support to resistance last August.\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nTrader: Crucial support at $22,800\n\nCointelegraph contributor Michaël van de Poppe was upbeat on the outlook, meanwhile, calling for “consolidation and continuation.”\n\nRelated: Bitcoin metric prints ‘mother of all BTC bullish signals’ for 4th time ever\n\n“Bitcoin sees a sweep of the high and rejects a little there, but that doesn’t mean we’ll go to $12K,” he reasoned in a tweet on the day.\n\nA chart flagged $22,800 as the key area for bulls to hold should BTC/USD opt to print a higher low (HL) next.\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/Twitter\n\nThe day prior, van de Poppe argued that the period from March to June should be a “party” throughout crypto markets.\n\n“It’s hard to define a proper strategy when everyone around you shouts the opposite. That’s what’s happening in those relief rallies,” he continued about the current state of crypto sentiment.\n\n“People are stuck in the mindset of the past 18 months and can only expect further downside. Hence they keep on shorting.”\n\nIt was long traders who nonetheless felt the bulk of the pain on Feb. 16, as Bitcoin’s trip lower liquidated $45 million of positions, data from Coinglass shows. Cross-crypto long liquidations almost reached $125 million.\n\nBitcoin liquidations chart. Source: Coinglass\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL3doYXQtaXMtdGhlLXZlcnNlLWRldmVsb3BtZW50LWZ1bmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 09:11:15 GMT",
        "title": "What is the Verse Development Fund? | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "What is Verse?\n\nLearn about Bitcoin.com’s official token, ways to earn it, and how to use it in the Bitcoin.com ecosystem and beyond."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vc2VjLXN1ZXMtdGVycmEtYW5kLWZvdW5kZXItZm9yLWZyYXVkLTcxMTEyNTbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "SEC Sues Terra Founder for Fraud, Says Kwon Removed 10,000 Bitcoin From Ecosystem - Investopedia",
        "content": "The U.S. Securities and Exchange Commission sued Terraform Labs and its CEO Do Kwon for a multi-billion dollar fraud involving the algorithmic stablecoin TerraUSD (UST) and said Kwon transferred more than 10,000 bitcoin from the Terra ecosystem to a wallet that wasn’t on a digital exchange when UST started crashing last May.\n\nKey Takeaways The SEC sued Terraform Labs and Kwon for orchestrating a multi-billion dollar securities fraud.\n\nThe regulator said Terraform’s 'mAssets' and its TerraUSD algorithmic stablecoin are securities.\n\nTerraUSD and related cryptocurrency LUNA collapsed in May 2022.\n\nTerraUSD Was Fraud, Not DeFi\n\nTerra and LUNA collapsed in May, erasing almost $18 billion of Terra’s market value and jolting the industry in a foretaste of the FTX meltdown that brought it to its knees.\n\nTerraUSD was a stablecoin with a 1:1 peg to the U.S. dollar maintained through another cryptocurrency, LUNA. An algorithm would convert LUNA to UST or UST to LUNA to manage supply and keep the peg intact.\n\n\"The Terraform ecosystem was neither decentralized, nor finance,” said Gurbir S. Grewal, Director of the SEC’s Division of Enforcement. “It was simply a fraud propped up by a so-called algorithmic 'stablecoin'—the price of which was controlled by the defendants, not any code.”\n\nTerraform and Kwon Illegally Sold Securities\n\nThe SEC’s suit reiterated the regulator’s stance that stablecoins are securities and their sale, if not registered with the SEC, violates federal securities laws. It also took aim at Kwon for moving large amounts of bitcoin from the Terra ecosystem into a cold wallet as UST collapsed. Finally, the SEC said Terraform and Kwon misled investors with false promises of high returns.\n\nTerraform and Kwon “offered and sold crypto asset securities in unregistered transactions and perpetrated a fraudulent scheme that led to the loss of at least $40 billion of market value, including devastating losses for U.S. retail and institutional investors,” the SEC said. That includes the sale of crypto securities called ‘mAssets,’ which were swaps that mirrored the price of stocks of U.S. companies.\n\nTerraform and Kwon Removed 10,000 Bitcoin\n\nTerraform and Kwon removed 10,000 bitcoin from the Terra and Luna ecosystem, according to the SEC, and ultimately moved them to a bank in Switzerland. Since June, about $100 million has been withdrawn, the regulator alleged.\n\nKwon’s whereabouts are unknown, as the SEC noted, and the suit could present a renewed effort to bring the Terraform founder to justice. South Korean authorities are conducting their own investigations.\n\nTerraform Misled Investors with False Promises\n\nThe SEC alleges that the CEO and the company advertised returns as high as 20% for investors who deposited their UST using what Terra and Kwon called the Anchor Protocol.\n\n\"We allege that Terraform and Do Kwon failed to provide the public with full, fair, and truthful disclosure as required for a host of crypto asset securities, most notably for LUNA and Terra USD. We also allege that they committed fraud by repeating false and misleading statements to build trust before causing devastating losses for investors,\" said SEC chair Gary Gensler.\n\nWhat SEC's Focus on Crypto Means for Stablecoins?\n\nThe suit is the latest effort by regulators to scrutinize cryptocurrency. The SEC won a $30 million settlement from crypto exchange Kraken that forced the company to shutter its U.S. staking business last week.\n\nThe SEC also sued Ripple, in a move that could determine whether cryptocurrencies are securities. The regulator is maintaining Gensler’s stance that most cryptocurrencies are securities until that case is decided.\n\nFormer CFTC employee and now Web3 lawyer Mike Selig tweeted that an SEC decision to categorize UST as a stablecoin could set a precedent for anything to be considered a security."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY3J5cHRvLm5ld3MvYml0Y29pbi1jb3JlLWhhcy1vbmx5LTUtZGV2ZWxvcGVycy1sZWZ0LWFzLWtleS1tYWludGFpbmVyLWRlcGFydHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Core has only 5 developers left as key maintainer departs - crypto.news",
        "content": "Long-serving bitcoin (BTC) lead maintainer and developer Wladimir Jasper van der Laan has reportedly had his access to Bitcoin Core’s GitHub repository taken away.\n\nAccording to Wall Street Journal (WSJ), Van der Laan voluntarily gave up his access to the bitcoin client software on Feb. 16 after being at the helm for more than nine years.\n\nSatoshi Nakamoto’s second successor\n\nVan der Laan had spent the last two years trying to step away from his role as a maintainer, citing burnout, health issues, and “constant, bizarre spats on social media.”\n\nWSJ: Wladimir van der Laan's access to Bitcoin Core’s GitHub repository was finally taken away on Thursday, at his own request. Bitcoin Core has five maintainers now, after a sixth long-serving maintainer stepped down Thursday morning. In the past 18 months, four Bitcoin Core… https://t.co/42fdmubAEI — Wu Blockchain (@WuBlockchain) February 17, 2023\n\nAs the second successor to Bitcoin’s mysterious inventor Satoshi Nakamoto, he was one of the few individuals having final commit access to Bitcoin Core’s GitHub repository.\n\nNakamoto first owned this administrator key and then transferred it to Gavin Andresen. When Andresen, who received direct instruction from Nakamoto on maintaining bitcoin’s code, stepped down from the project nine years ago, Van der Laan took over.\n\nVan der Laan has played the lead role in maintaining all aspects of Bitcoin’s development for even longer than Satoshi. He led all operations involving bug fixes, code reviews, upgrades, software maintenance, and dispute resolution.\n\nHowever, the WSJ report indicates that as far back as January 2021, Van der Laan announced that he would reduce his involvement in running the world’s largest cryptocurrency.\n\nVan der Laan now becomes the third maintainer to step away from their Bitcoin Core role in the last 18 months.\n\nIn December 2021, Bitcoin Core maintainer Samuel Dobson announced his resignation to finish his Ph.D. program. Dobson worked on the project’s crypto wallet and ensured the protocol’s security.\n\nI am officially stepping down as a maintainer of Bitcoin Core.\n\n\n\nServing as the wallet maintainer for the past three years has been an absolute privilege, and I want to thank my incredibly generous sponsor John Pfeffer (@jlppfeffer) for his support throughout. /1 — Samuel Dobson (@meshcollider) December 9, 2021\n\nDobson’s departure followed that of Jonas Schnelli, who left in October 2021, citing the stress of increasing legal risks for developers.\n\nOnly five Bitcoin Core maintainers remain\n\nWith Van der Laan’s departure, Bitcoin’s development will now be steered by five people: Hennadii Stepanov, Michael Ford, Andrew Chow, Marko Falke, and Gloria Zhao.\n\nEach is responsible for an aspect of Bitcoin; for example, Stepanov maintains the network’s graphical user interface, while Ford oversees the build system.\n\nGloria Zhao, the only woman in the maintainers’ team, writes and reviews the code that governs Bitcoin’s transaction validation process. Andrew Chow is in charge of programming for crypto wallets, which allow investors to store their bitcoin, while Marco Falke focuses on testing.\n\nTogether, these coders keep Bitcoin’s digital ledger up to date on its network’s thousands of computers. They must ensure that the software remains compatible with the latest versions of operating systems like Windows or MacOS and that it keeps up with transaction volumes.\n\nMany of the cryptocurrency’s proponents claim that its current value and future potential are partly in the hands of these maintainers.\n\nFollow Us on Google News"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vd3d3LmNuYmMuY29tL3NlbGVjdC9ob3ctaXMtY3J5cHRvLXRheGVkL9IBNGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC9zZWxlY3QvaG93LWlzLWNyeXB0by10YXhlZC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Everything you need to know about filing crypto taxes — especially if your exchange went bankrupt - CNBC",
        "content": "Cryptocurrency is classified as property by the IRS. That means crypto income and capital gains are taxable and crypto losses may be tax deductible. Last year, many cryptocurrencies lost more than half their value and major crypto exchanges — like FTX — collapsed. The silver lining is you may be able to reduce your 2022 tax burden if you lost money in crypto. CNBC Select talked with Shehan Chandrasekera, head of tax strategy at CoinTracker, a crypto tax software company, about how cryptocurrency is taxed and what you need to know if your crypto exchange declared bankruptcy.\n\nHow cryptocurrency is taxed\n\nMany of cryptocurrency's most passionate advocates emphasize the decentralization of the blockchain, but it's important to remember that the federal government is keeping tabs on who is earning how much when it comes to crypto and taxes. \"The biggest misconception in this space in general is that people think that crypto is invisible to the regulators. But that's not the case,\" says Chandrasekera. There's a permanent record of all your activity on the blockchain and many crypto exchanges report to the IRS. For the most part, the IRS treats crypto as an asset subject to its rules on capital gains and losses, similar to stocks. When you buy cryptocurrency or stocks, the original purchase price of the asset becomes its cost basis. When you sell that asset, you're taxed based on the difference between the cost basis and the sale price. Capital gains and capital losses are based on the net total of all transactions that year. If you sold five different assets for a total gain of $10,000 and three other assets at a total loss of $15,000, then you have $5,000 in capital losses. You can deduct up to $3,000 a year in capital losses from your taxable income and can carry over losses exceeding that annual limit to future years. For example, if you had $5,000 in capital losses in 2022, you can reduce your taxable income by $3,000 in 2022 and apply the remaining $2,000 in losses to 2023. Capital gains are taxed differently based on how long you hold an asset before selling. Short-term capital gains taxes apply to assets you've held for one year or less and long-term capital gains taxes are assessed when you sell an asset after owning it for more than one year. Your exact capital gains rate depends on several factors, but long-term capital gains are typically taxed at a lower rate than short-term gains. And you may not have to pay any capital gains tax at all, depending on your filing status and taxable income. If you use digital currency for daily transactions, you may want to enlist the help of a tax professional. For everyone else, tax software offered by companies such as H&R Block, TurboTax, TaxSlayer can help you file your taxes when you have taxable-crypto transactions.\n\nH&R Block Learn More On H&R Block's secure site Cost Costs may vary depending on the plan selected (Free Online, Deluxe, Premium, or Self-Employed) - click \"Learn More\" for details\n\nFree version Yes (for simple returns only)\n\nMobile app Yes\n\nLive support Available with some pricing and filing options Terms apply.\n\nTurboTax Learn More On TurboTax's secure site Cost Costs may vary depending on the plan selected - click \"Learn More\" for details\n\nFree version TurboTax Free Edition. ~37% of taxpayers qualify. Form 1040 + limited credits only.\n\nMobile app Yes\n\nLive support Available with some pricing and filing options Click here for TurboTax offer details and disclosures. Terms apply.\n\nTaxSlayer Learn More On TaxSlayer's secure site File your taxes for as low as $27.02 with TaxSlayer* Use Code: CNBC18\n\nCost Costs may vary depending on the plan selected\n\nFree version Yes (basic 1040)\n\nMobile app Yes\n\nTax expert support Yes, certain plans *18% off your federal tax return. Offer is valid on federal tax returns e-filed by April 15, 2024, at 11:59 p.m. ET. Only valid for new or first time TaxSlayer users only. Promotion code must be entered at checkout. Offer is not applicable to state tax returns or additional products. Offer is valid for one-time use only and cannot be combined with any other coupons, promotions, discounts, or offers. Offer is nontransferable, cannot be sold or otherwise bartered, and is not applicable to previous purchases or returns.\n\nIn most cases, capital gains and losses apply to your crypto transactions. However, there are instances where cryptocurrency is taxed as income, in which case it's subject to a marginal tax rate of up to 37% depending on your income level and filing status. Below we examine how each type of crypto transaction is classified for tax purposes: 1. Selling cryptocurrency (capital gains) Anytime you sell cryptocurrency the gain or loss in value has tax implications. This type of transaction tends to be straightforward, especially if you aren't frequently buying and selling crypto, and is classified under capital gains. 2. Exchanging one cryptocurrency for another (capital gains) A crypto swap is when you directly trade one cryptocurrency for another without exchanging your crypto for cash. Chandrasekera points out that many people mistakenly overlook this type of transaction when it comes to taxes because no cash was realized. But if you exchange Bitcoin for Litecoin or Ethereum for Bitcoin, it's a taxable event. 3. Spending crypto for goods or services (capital gains) Using crypto to buy goods or services has the same tax implications as selling it. \"It could be as little as you're going to Starbucks and spending a fraction of a Bitcoin to buy something and that could result in a taxable gain,\" Chandrasekera says. When you're buying anything with crypto, the taxable gain or loss is based on what you paid for the cryptocurrency and its value at the time of the transaction. 4. When you earn cryptocurrency (income) When you earn cryptocurrency it is considered taxable income based on the value of the coins at the time of receipt. This includes crypto earned from activities such as: Mining cryptocurrencies\n\nCrypto staking income\n\nYields on crypto accounts\n\nCrypto earned as regular pay or bonuses 5. Anytime you receive free coins (income) There are instances where you may receive free crypto and the value of the digital coins you receive is considered income. Two common scenarios where you may receive free crypto are airdrops and hard forks. An airdrop is when cryptocurrencies are given away for free and it's typically used as a marketing tool for new cryptocurrencies. A hard fork is a bit more complicated but to simplify it, it's essentially when a cryptocurrency splits into two types of tokens or coins. When this happens, you'll have your original coin and a new coin, with a separate value. The value of the cryptocurrency you receive from a hard fork is taxable income.\n\nWhat to do if your crypto exchange went bankrupt in 2022\n\nLast year, a crash in the crypto markets led to a string of crypto firms declaring bankruptcy — most notably FTX, which at its peak was valued at $32 billion. If you had crypto assets tied up in a company that's filed for bankruptcy, unfortunately, there isn't anything you can do for the 2022 tax year. \"When those bankruptcies get finalized in 2023, we will have more clarity on the amount of loss, the type of deduction you can get depending on the findings of the bankruptcies,\" Chandrasekera says. The bankruptcies could be the result of fraud or simply bad business decisions and, \"all those things affect the amount of the deduction, the type of the deduction and even when you can take the deduction,\" Chandrasekera says. It's also possible that you may get (some of) your money back, he says.\n\nSubscribe to the Select Newsletter! Our best selections directly into your inbox. Shopping recommendations that help upgrade your life, delivered weekly. Sign-up here.\n\nBottom line\n\nThe IRS classifies cryptocurrency as property or a digital asset. Any time you sell or exchange crypto, it's a taxable event. This includes using crypto used to pay for goods or services. In most cases, the IRS taxes cryptocurrencies as an asset and subjects them to long-term or short-term capital gains taxes. However, sometimes cryptocurrency is treated as income. Keep track of all your crypto activity so you don't get a nasty surprise at tax time. Catch up on CNBC Select's in-depth coverage of personal finance, tech and tools, wellness and more, and follow us on Facebook, Instagram and Twitter to stay up to date.\n\nEditorial Note: Opinions, analyses, reviews or recommendations expressed in this article are those of the Select editorial staff’s alone, and have not been reviewed, approved or otherwise endorsed by any third party."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJhbGx5LXRvLTI1ay1mb2xsb3dlZC1ieS10b3RhbC1jcnlwdG8tbWFya2V0LWNhcC1yZXRlc3Qtb2YtdGhlLTEtMTN0LXJlc2lzdGFuY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price rally to $25K followed by total crypto market cap retest of the $1.13T resistance - Cointelegraph",
        "content": "The total crypto market capitalization rejected at $1.13 trillion on Feb. 16, but there was no change in the month-long ascending channel structure. More importantly, this level represents a 43% gain in 2023, which is far from the $3 trillion level achieved in November 2021. Still, the current recovery is notable.\n\nTotal crypto market cap in U.S. dollars, 1-day. Source: TradingView\n\nAs shown above, the ascending channel initiated in mid-January has left some room for a 10% correction down to $1 trillion without breaking the bullish formation.\n\nInvestors reacted positively to the 5.6% year-on-year U.S. Consumer Price Index inflation increase on Feb. 14 and the 3% retail sales monthly growth on Feb. 15. Bitcoin (BTC) had the biggest positive impact on the total crypto capitalization as its price gained 12.5% on the week.\n\nOne area of concern is a Feb. 16 story on Binance.US financial transactions to Merit Peak, a trading firm managed by CEO Changpeng Zhao. Interestingly, Reuters reported that a Binance.US spokesperson said Merit Peak was “neither trading nor providing any kind of services on the Binance.US platform.”\n\nThe 10.1% weekly increase in total market capitalization was held back by the modest 1.8% gains from BNB (BNB) and the XRP (XRP) 2.5% price increase. On the other hand, only three out of the top 80 cryptocurrencies finished the week with negative performances.\n\nWeekly winners and losers among the top 80 coins. Source: Messari\n\nDecentralized storage solution Filecoin (FIL) gained 59% and Internet Computer (ICP) soared 52% as Bitcoin blockchain demand for nonfungible token (NFT) inscription vastly increased the block space.\n\nGMX rallied 34% as the protocol received $5 million in transaction fees on a single day.\n\nLido DAO’s LDO gained 34% as stakers evaluated proposals to manage the 20,300 Ether (ETH) held by the corporate treasury.\n\nLeverage demand is balanced despite the generalized rally\n\nPerpetual contracts, also known as inverse swaps, have an embedded rate that is usually charged every eight hours. Exchanges use this fee to avoid exchange risk imbalances.\n\nA positive funding rate indicates that longs (buyers) demand more leverage. However, the opposite situation occurs when shorts (sellers) require additional leverage, causing the funding rate to turn negative.\n\nPerpetual futures accumulated 7-day funding rate on Feb. 17. Source: Coinglass\n\nThe seven-day funding rate was close to zero for Bitcoin and Ether, meaning the data points to a balanced demand between leverage longs (buyers) and shorts (sellers).\n\nInterestingly, BNB is no longer a top six cryptocurrency ranked by futures open interest, as investors’ demand for Polygon’s MATIC (MATIC) markets increased by 70% in February.\n\nThe options put/call ratio remains optimistic\n\nTraders can gauge the market’s overall sentiment by measuring whether more activity is going through call (buy) options or put (sell) options. Generally speaking, call options are used for bullish strategies, whereas put options are for bearish ones.\n\nA 0.70 put-to-call ratio indicates that put options open interest lag the more bullish calls by 30% and is therefore bullish. In contrast, a 1.40 indicator favors put options by 40%, which can be deemed bearish.\n\nRelated: Bitcoin price derivatives look a bit overheated, but data suggests bears are outnumbered\n\nBTC options volume put-to-call ratio. Source: Laevitas\n\nEven though Bitcoin’s price failed to break the $25,000 resistance, the demand for bullish call options has exceeded the neutral-to-bearish puts since Feb. 14.\n\nPresently, the put-to-call volume ratio nears 0.40 as the options market is more strongly populated by neutral-to-bullish strategies, favoring call (buy) options by 2x.\n\nFrom a derivatives market perspective, there are no signs of demand from short sellers, while leverage indicators show bulls are not using excessive leverage. Ultimately, the odds favor those betting that the $1.13 trillion total market cap resistance will break, opening room for further gains.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8xNy9uby1ob25nLWtvbmctd29udC1iZS1hbGxvd2luZy1yZXRhaWwtdHJhZGVycy1hY2Nlc3MtdG8tY3J5cHRvLW9uLWp1bmUtMS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDIvMTcvbm8taG9uZy1rb25nLXdvbnQtYmUtYWxsb3dpbmctcmV0YWlsLXRyYWRlcnMtYWNjZXNzLXRvLWNyeXB0by1vbi1qdW5lLTEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "No, Hong Kong Won’t Be Allowing Retail Traders Access to Crypto on June 1 - CoinDesk",
        "content": "Those individuals, the retail investors, are bound to be excited by the chance to use a local Hong Kong entity to trade. After all, there is no capital gains tax in Hong Kong, and Japan shows what happens when retail investors are able to trade in a regulated environment. Post-FTX, Japanese traders seem to be living in a parallel world, where their tokens were stored with a custodian and funds are being returned."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Jlc2VhcmNoLXB1YmxpYy1iaXRjb2luLW1pbmVycy1pbi1iZXR0ZXItZmluYW5jaWFsLWhlYWx0aC1kZXNwaXRlLTEyLTEteW95LWRyb3AtaW4tYnRjLWhvbGRpbmdzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Research: Public Bitcoin Miners in better financial health despite 12.1% YoY drop in BTC holdings - CryptoSlate",
        "content": "Glassnode data analyzed by CryptoSlate shows that Bitcoin miners are beginning to enjoy some respite in the current year after struggling in 2022.\n\nBitcoin miner’s holdings decline 12.1% YoY\n\nAs of Jan. 2022, Bitcoin miners held 36,003 BTC, with mining firms like Core Scientific, Riot, Hut8, Marathon, and Bitfarms holding over 30,000 coins.\n\nHowever, the landscape appears to have changed in the current year as Hut 8, Marathon, and Riot are now the dominant miners, holding 87% — 27,760 BTC — of the miners’ BTC holdings, according to CryptoSlate’s research.\n\nBitfarms and Core Scientific fell off as they struggled in 2022 — the latter filed for bankruptcy while the former dealt with debt obligations.\n\nMeanwhile, the market has seen a little BTC distribution from miners in January 2023 compared to the previous year.\n\nBesides that, the shares of several miners have risen by three figures on the year-to-date (YTD) metric. Miners like Hut8, Riot, Iris, Marathon, etc., have all seen their shares increase by over 100% YTD.\n\nMiners are selling their BTC to exchanges at “extremely low levels”\n\nCryptoSlate’s analysis showed that miners appear to be in a healthier position compared to the previous year.\n\nAccording to Glassnode’s data, as analyzed by CryptoSlate, miners are selling their BTC to exchanges at extremely low levels compared to previous years.\n\nThis is because profitability is beginning to return to the mining industry as BTC’s price has risen by around 50% in 2023 — the flagship digital asset briefly traded above $25,000 for the first time since August 2022 on Feb. 16.\n\nMeanwhile, Bitcoin hash rate rose 34% on the year-on-year metric and hit a new all-time high of 300 TH/s. This shows the network’s current consistency and strength.\n\nMining BTC is currently cheaper\n\nThe Difficulty Regression Model, a metric used to measure the cost of mining Bitcoin, is currently under the asset’s spot price.\n\nAccording to the chart above, the DRM is at $20,000, more than $4000 below BTC’s current spot price at the time of writing.\n\nThe current DRM level is essential for the miners to hold as it ensures that they are in an excellent financial position even if the hash rates continue to soar and the mining difficulty rises.\n\nMeanwhile, the DRM could also be used to gauge bear markets sentiments when BTC’s price falls under the DRM.\n\nMentioned in this article"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kby1rd29uLXJlbW92ZWQtMTBrLWJpdGNvaW4tZnJvbS10ZXJyYS1hZnRlci1jb2xsYXBzZS10YWtlYXdheXMtZnJvbS1zZWMtY29tcGxhaW500gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Do Kwon removed 10K Bitcoin from Terra after collapse — Takeaways from SEC complaint - Cointelegraph",
        "content": "A complaint filed by the United States Securities and Exchange Commission said Terra co-founder Do Kwon and Terraform Labs laundered more than $100 million worth of Bitcoin from the platform following its collapse in May 2022.\n\nAccording to the SEC complaint filed in the U.S. District Court for the Southern District of New York on Feb. 16, Kwon and Terraform have transferred more than 10,000 Bitcoin (BTC) from the platform and the Luna Foundation Guard to a cold wallet, then to a Swiss bank account to convert to fiat. The financial regulator said that the Terra co-founder and his company might have access to more than $100 million in cash since withdrawals started in June 2022.\n\nIn addition to identifying the stockpile of Bitcoin, the SEC said Kwon and Terra artificially restored TerraUSD’s (UST) dollar peg — the stablecoin had been one of the largest by market capitalization at the time the platform collapsed. According to the complaint, the platform solicited a third party to purchase “massive amounts of UST to restore the $1.00 peg” when it dropped below $1 in May 2021, misleading investors as to its stability and reliability:\n\n“UST’s price falling below its $1.00 ‘peg’ and not quickly being restored by the algorithm would spell doom for the entire Terraform ecosystem, given that UST and LUNA had no reserve of assets or any other backing.”\n\nThe SEC also claimed several of the tokens involved in the collapse of Terra were “crypto asset securities” falling under its regulatory purview. According to the SEC, these tokens included UST, LUNA and wrapped LUNA, as well as MIR tokens and mAssets developed under Terra’s Mirror Protocol.\n\n“Defendants solicited investors for these crypto assets by touting their profit potential,” said the SEC. “Defendants repeatedly stated that the crypto assets would increase in value based on Terraform’s development, maintenance, and promotion of its blockchain, protocols, and the entire Terraform ecosystem.”\n\nTerra’s business connections were also a target of the financial regulator, as the SEC reported Chai — a South Korean payment app linked to Terra at the time — “did not process or settle transactions on the Terraform blockchain.” Rather, Terra allegedly reported transactions “that had already happened in the real world using Korean Won” while claiming to the public that Chai transacted on the blockchain.\n\n“In at least five instances between October 2021 and March 2022, there were one or more days when no transactions whatsoever were confirmed on the Terraform blockchain,” said the SEC. “Yet, there is no evidence that the Chai payment application was not functioning during those periods.”\n\nThe SEC has charged Do Kwon with fraud - and their charges include how he lied about the Terra-Chai relationship.\n\n\n\nIn October, I grilled him on faking the Chai transaction data as well.\n\n\n\nFull interview here: https://t.co/xZyRGFBYnh pic.twitter.com/iQ4XT8q7X7 — Laura Shin (@laurashin) February 17, 2023\n\nRelated: ‘Wild’ — SEC going after Terra sparks responses from crypto lawyers\n\nKwon has continued to be active on his Twitter account following the collapse of Terra despite many crypto users blaming him for their loss of funds and the seeming “ripple event” leading to multiple bankruptcies amid the crypto crash of 2022. South Korean authorities reportedly sent two officials to Serbia in an attempt to track down the Terra co-founder. At the time of publication, Kwon’s location i unknown."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnBlZGlhLm9yZy9kb2N1bWVudHJpZXMvcHJlLWhpc3Rvcnktb2YtYml0Y29pbi10aGUtNDAteWVhci1ldm9sdXRpb24tb2YtYml0Y29pbi_SAV9odHRwczovL2NvaW5wZWRpYS5vcmcvZG9jdW1lbnRyaWVzL3ByZS1oaXN0b3J5LW9mLWJpdGNvaW4tdGhlLTQwLXllYXItZXZvbHV0aW9uLW9mLWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Pre-History of Bitcoin – From Cryptography to Cryptocurrency: The 40-Year Evolution of Bitcoin - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nWelcome to our article, where we take a deep dive into the pre-history of Bitcoin, the revolutionary digital currency that has disrupted the traditional monetary system. In this piece, we explore the key events and individuals who laid the foundation for the creation of the world’s first decentralized digital currency.\n\nBy understanding the origins of this technology, we can gain valuable insights into how it has transformed the way we think about money and financial transactions.\n\nJoin us on a fascinating 40 years journey through the early days of Bitcoin and discover how it all began.\n\nBut before we explore its growth and adoption, let’s first understand the loopholes in traditional money. As the renowned economist, Friedrich Hayek once said,\n\n“I don’t believe we shall ever have good money again before we take the thing out of the hands of the government.”\n\nThe traditional monetary system is controlled by central authorities and is susceptible to inflation, corruption, and manipulation. This led to a growing need for a decentralized and transparent alternative.\n\nIn 2008, an unknown individual or group of people using the pseudonym Satoshi Nakamoto introduced a revolutionary idea – a peer-to-peer digital currency that operates without a central authority. This invention marked the beginning of a new era in the world of money – Bitcoin.\n\nOver the years, Bitcoin has grown to become a global phenomenon, with more and more people recognizing its potential as a store of value and a medium of exchange.\n\nThe adoption of digital currency has grown exponentially, with major companies such as Tesla and Square investing in it. Payment companies like PayPal and Visa are also integrating Bitcoin into their systems, and regulations have been put in place to ensure digital currency’s safe and legal use.\n\nBut as the famous quote goes, “Be patient, Empires are not built in a day“. It took 40 years of discoveries and inventions for bitcoin org bitcoin org Event OrganiserTechnologyPayment solution to become a reality. And as we continue to see its growth and adoption, it’s clear that the future of money may just be digital.\n\nLet’s begin our journey into the World of Bitcoin.\n\nBitcoin’s Prehistory\n\nThe period of time before the creation of the Bitcoin network in January 2009. This prehistory is a complex and fascinating story that involves various individuals and events that contributed to the development of the digital currency.\n\nOne of the major events in Bitcoin’s prehistory is the development of digital currencies that preceded it. One of the earliest examples is Ecash, created by David Chaum in 1982. Ecash was a digital currency that used encryption to ensure anonymity and security for transactions.\n\nAnother important precursor to Bitcoin is E-gold, created by Douglas Jackson and Barry Downey in 1996. E-gold was an online payment system that was based on the gold standard. It allowed users to make instant, low-cost transactions in gold.\n\nIn 1997, Adam Back developed hashcash, a proof-of-work system that was designed to prevent email spam. This system was later adapted and used in the Bitcoin network as a mechanism to secure transactions.\n\nAnother prominent figure in Bitcoin’s prehistory is Nick Szabo, who created Bit gold in 1998. Bit gold was a decentralized digital currency that used a proof-of-work system similar to Hashcash.\n\nWei Dai, another computer scientist, and cryptographer created B-money in 1998. B-Money was a proposed electronic cash system that would use a distributed network to prevent double-spending.\n\nNow Finally, Hal Finney was an American computer scientist who developed Reusable Proof of Work (RPOW) in 2004. RPOW was a proposed system for creating digital tokens that could be traded on a peer-to-peer network, similar to Bitcoin.\n\nAll of these early digital currencies and projects laid the foundation for the creation of Bitcoin.\n\nWe have just learned about the prehistory of Bitcoin and the various individuals and projects that laid the foundation for its creation. Now, let’s introduce the man behind the curtain, satoshi nakamoto satoshi nakamoto satoshi nakamoto Developer/Programmer .\n\nEntry of Satoshi Nakamoto\n\nSatoshi Nakamoto, the pseudonym of the individual or group who created Bitcoin, entered the scene in 2008 with the publication of a white paper outlining a peer-to-peer electronic cash system. This system, known as Bitcoin, aimed to address the existing loopholes in traditional money that we discussed earlier.\n\nSatoshi identified that traditional money was controlled by central authorities and was susceptible to inflation, corruption, and manipulation. He also recognized that earlier digital currencies, such as Ecash and E-gold, faced issues of scalability and centralization, which led to their eventual demise.\n\nWith the launch of Bitcoin, Satoshi proposed a solution – a decentralized digital currency that operates on a peer-to-peer network. This network is secured by cryptography and operates without a central authority, making it resistant to manipulation and fraud.\n\nBefore the launch of Bitcoin, it was not possible to have a decentralized and transparent digital currency that operates on a peer-to-peer network. Satoshi’s creation of Bitcoin made it possible for individuals to have direct control over their money, without the need for intermediaries.\n\nAlso Read: Who is Satoshi Nakamoto?The Ultimate Quest for Bitcoin’s Creator\n\nSatoshi’s Goal of Building Decentralization\n\nSatoshi Nakamoto was successful in building decentralization in Bitcoin by designing the network to operate on a peer-to-peer basis. In a peer-to-peer network, there is no central authority or intermediary controlling the network. Instead, all participants in the network are equal and have the same authority to validate transactions and create new blocks.\n\nTo achieve this, Satoshi implemented several key features in the Bitcoin network. One of the most important features is the blockchain. The blockchain is a decentralized, digital ledger that records all transactions on the network. It is maintained by a network of participants called nodes, who work together to validate transactions and create new blocks.\n\nAnother key feature that enables decentralization in Bitcoin is the consensus mechanism known as Proof of Work (PoW). PoW is a system that requires nodes to solve complex mathematical problems in order to add new blocks to the blockchain. This process is called mining, and it ensures that no single node can control the network.\n\nSatoshi also implemented a decentralized system for the distribution of new Bitcoins, which is known as the mining reward. In this system, new Bitcoins are created and distributed to nodes who successfully mine new blocks. This ensures that new Bitcoins are distributed fairly among all participants in the network.\n\nAdditionally, Satoshi designed Bitcoin to be open-source software, which means that anyone can access and modify the source code. This ensures that the network is transparent and allows the community to contribute to its development.\n\nOverall, Satoshi’s design of a peer-to-peer network, the use of blockchain technology, the consensus mechanism of proof of work, the decentralized distribution of new Bitcoins, and the open-source nature of the software all contribute to the decentralization of the Bitcoin network.\n\nConclusion\n\nIn conclusion, we have just seen how Satoshi Nakamoto’s vision of a decentralized digital currency led to the launch of Bitcoin. By designing a peer-to-peer network, implementing blockchain technology, using the consensus mechanism of Proof of Work and the open-source nature of the software, Satoshi was able to achieve decentralization in the Bitcoin network.\n\nThis decentralization has opened up new possibilities for the future of money, giving individuals direct control over their funds without the need for intermediaries. The rise of decentralization has also led to the launch of blockchain technology, which is now being used in various industries beyond just digital currency.\n\nAs we have seen, the growth of Bitcoin has been nothing short of remarkable. From its humble beginnings in 2008, it has grown to become a global phenomenon. Adoption of the digital currency has grown exponentially, with more and more people recognizing its potential as a store of value and a medium of exchange.\n\nIn the next article, let’s dive deeper into the world of blockchain and bitcoin and see how decentralization has led to their launch and their potential for revolutionizing various industries. Thank you for reading and stay tuned for more updates on the world of decentralization and blockchain technology."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGUtZWNvbm9taWNzLW9mLWNyeXB0b2N1cnJlbmN5LW1pbmluZy1jb3N0cy1yZXZlbnVlcy1hbmQtbWFya2V0LXRyZW5kc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "The economics of cryptocurrency mining: Costs, revenues and market trends - Cointelegraph",
        "content": "Mining refers to the process of verifying and adding new transactions to a blockchain network, such as in the case of Bitcoin (BTC) or other cryptocurrencies. The economics of mining refers to the economic incentives and costs associated with the mining process, as well as its impact on the broader economy.\n\nThe economics of crypto mining are driven by a variety of factors, including cryptocurrency prices, mining difficulty, hardware costs, energy expenses, block rewards and transaction fees. This article will explain economics of mining, including costs, revenues and market trends.\n\nCryptocurrency mining costs\n\nThe costs associated with cryptocurrency mining can be broken down into several categories:\n\nHardware costs: The price of specialized application-specific integrated circuits (ASICs), for example, can have a big impact on the profitability of mining.\n\nEnergy expenses: Since mining uses a substantial quantity of electricity to run the computing equipment, energy consumption is one of the highest costs involved. Therefore, the profitability of mining can be significantly impacted by the cost of power in a particular area.\n\nCooling costs: The heat produced by mining equipment needs to be dispersed to keep the machinery in good condition. Costs associated with cooling can be high, particularly in hotter areas or in large-scale mining operations.\n\nMaintenance and repair costs: For mining equipment to operate at its best, constant maintenance and repairs are necessary, and these expenses can mount over time.\n\nTransaction fees: Miners may receive transaction fees in addition to block rewards for processing network transactions. The profitability of mining may be impacted by the level of transaction fees, which may change depending on network activity and other elements.\n\nRelated: Bitcoin miners as energy buyers, explained\n\nCryptocurrency mining revenues\n\nThe amount of cryptocurrency that a miner is able to produce over a specific time period is often used to determine how much mining revenue a miner generates. The revenue is determined by multiplying the value of the mined cryptocurrency by its current market price.\n\nConsider a scenario in which a miner employs mining equipment that can produce 1 BTC every 10 days. The miner’s profit for each block produced would be as follows if the market price of BTC is $50,000:\n\nHowever, the amount of revenue made from mining cryptocurrencies fluctuates based on a number of variables, such as the price at which the cryptocurrency is currently trading on the market, the difficulty of the mining process, the price of power and the effectiveness of the mining equipment being utilized.\n\nFor example, in the early days of Bitcoin mining, it was possible to generate significant revenue with relatively simple hardware. The revenue per unit of computer power did, however, decline as mining complexity and the number of miners rose.\n\nRelated: How to build a cryptocurrency mining rig\n\nCryptocurrency mining market trends\n\nIn recent years, the cryptocurrency mining market has experienced significant growth and has become an increasingly important part of the overall cryptocurrency ecosystem. Some key trends in the crypto mining market include:"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2UvMjAyMy8wMi8xNy8yNjEwODE2LzAvZW4vVGhlLUljb25pYy1Cb3JlZC1BcGUtWWFjaHQtQ2x1Yi10by1iZS1SZWxlYXNlZC1hcy1hLUJpdGNvaW4tTkZULWNvbGxlY3Rpb24uaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "The Iconic Bored Ape Yacht Club to be Released as a Bitcoin NFT collection - GlobeNewswire",
        "content": "Dubai, UAE, Feb. 17, 2023 (GLOBE NEWSWIRE) -- Over the past couple of weeks the original BAYC monkeys have marked themselves as the second most popular selling NFT collection worth $1.3M. The offspin of the ultimate NFT collection has now been released on the ultimate blockchain of Bitcoin.\n\nThe Ordinals protocol, which has been originally introduced to crypto in 2014, has gained momentum along with the market interest two weeks ago when the option of creating NFTs on the Bitcoin blockchain was revealed. The main idea of such NFTs is that they are completely stored on the blockchain, which is possible thanks to the updates of SegWit (2017) and Taproot (2021). Ordinals was also the first protocol to create a Bitcoin NFT. The latest & hottest NFT collection named the Ordinal Punks - inspired by the legendary CryptoPunks - has already appeared on the marketplace, with the Ordinal Punk NFT #620 being sold for 9.5 BTC (~$215,000).\n\nThe next one to have their say within the rapid bloom of Bitcoin NFTs is BAYC Bitcoin NFT, a which is extremely popular with celebrities and brands - Eminem for example has recently joined the list of BAYC holders, he purchased his monkey for the staggering 123.4 ETH (~$380,000) and made it his avatar on Instagram, other celebrity owners being Justin Bieber, Snoop Dogg, and Jimmy Faloon.\n\nBAYC BITCOIN NFT is a collection of 10,000 original monkeys with unique Bitcoin traits, as well as 10 ultra rare signature NFT monkeys in Satoshi masks. The mint of the collection is set to kick off on February, 17 at 11:00 UTC. The users who are lucky enough to secure a mint will become the owners of a BAYC NFT for a flat price of 0.01 BTC. Given the success of the previous BAYC collections, there is good evidence that BAYC BITCOIN NFT will perform just as well.\n\nTo make it even more compelling, as soon as the BAYC Bitcoin NFT collection is 100% minted, the user to have minted the BTC BAYC #910 will receive a 1 BTC offer from the team in exchange for it.\n\n\n\n”This is an exciting time for the world of bitcoin and NFTs, the potential of this and other similar projects designed and implemented via the Bitcoin blockchain is huge. The level of interest in the Bitcoin NFTs continues its exponential growth despite the current fees, proving that there is a huge demand for reunion with the technological roots of the blockchain technology”, says Mike Fritz, CTO at Baycbitcoin. - “The NFT market is booming again, and this immense interest might be the best indicator of the hatching bull market”.\n\nOfficial BAYC Bitcoin NFT Twitter: https://twitter.com/baycbitcoincom\n\nOfficial BAYC Bitcoin NFT Telegram: https://t.me/Baycbitcoin\n\n"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZ2l6bW9kby5jb20vZG8ta3dvbi1jcnlwdG8tc2VjLWJpdGNvaW4tdGVycmEtbHVuYS0xODUwMTI3MTE20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "SEC Complaint Says Do Kwon Transferred 10,000 Bitcoin From Terra to a Swiss Bank - Gizmodo",
        "content": "Do Kwon, the erstwhile CEO of Terraform Labs and its infam ously unstable stablecoin Terra, now has another reason to remain on the lam. The U.S. Securities and Exchange Commission alleged he and his company transferred 10,000 bitcoin worth hundreds of millions of dollars out of the Terra/Luna project before it inevitably went bust in May last year.\n\n\n\nWhy Bitcoin won’t reach $1,000,000 CC Share Subtitles Off\n\nEnglish view video Why Bitcoin Won’t Reach $1,000,000\n\nThe collapse of the Terra/Luna stablecoin ecosystem led to an approximate $40 billion loss for investors and led to an enormous market downturn for the entire crypto industry that’s still ongoing. This was due to the Terra stablecoin, which was supposed to remain algorithmically “pegged” to the price of the U.S. dollar, becoming “de-pegged,” leading to a death spiral for both the Terra and Luna cryptocurrencies.\n\nAdvertisement\n\nAccording to the complaint, the now 31-year-old Kwon had transferred “over 10,000 bitcoin from Terraform a nd Luna Foundation Guard crypto asset platform accounts to an un-hosted wallet” meaning a so-called “cold wallet” not related to any crypto exchange which can be disconnected from the internet. The SEC then allege Kwon has been transferring bitcoin from this wallet to a bank in Switzerland, converting it all into cash.\n\nAdvertisement\n\nAlthough the complaint did not name which bank the Terraform Labs founder was using, Kwon has withdrawn more than $100 million in fiat currency from June of last year to now, according to the SEC’s complaint.\n\nAdvertisement\n\nAt the time just before the crypto collapse in May of last year, the price of bitcoin was hovering around $30,000, which means the 10,000 bitcoin could have been worth $300 million if Kwon tried to immediately convert it into fiat currency.\n\nThe SEC wants Kwon and Terraform Labs to be barred from dealing in crypto, and for them to pay penalties for illegally dealing in securities. SEC Chair Gary Gensler said in a press release “This case demonstrates the lengths to which some crypto firms will go to avoid complying with the securities laws, but it also demonstrates the strength and commitment of the SEC’s dedicated public servants.”\n\nAdvertisement\n\nThe SEC also alleged Kwon misled investors about the stability of its UST stablecoin. According to the complaint, the company also lied to investors that the Terraform blockchain was being used by a popular Korean mobile payment app called “Chai.” Instead, the SEC said Terraform Labs “replicated Chai payments on the Terraform blockchain” to make it seem like there was far more adoption for the tech than there really was.\n\nThe complaint references a presentation aired on CNBC Africa that the company posted on YouTube back in 2019, where Kwon said “we have had 430,000 shoppers over the Chai gateway, and most of them coming in the last month. And we’ve processed nearly 2 [million] transactions up to date.”\n\nAdvertisement\n\nDo Kwon has been avoiding international law enforcement for months now after South Korean prosecutors issued a warrant for his arrest. He was last traced to Dubai and then Serbia, but the failed crypto founder has repeatedly maintained he is not on the run, and has further called the allegations against him “politically motivated.” Still, the man who is definitely not running from prosecution has kept uncharacteristically quiet on his once-prolific Twitter account since the start of 2023.\n\nThroughout the SEC’s complaint, it routinely argues that Terraform Lab’s promotion and transactions of its Terra, Luna, and wrapped Luna tokens all counted as securities in some way, shape, or form, meaning the majority of the crypto buying and selling was using unregistered assets. The SEC has stepped up its attempts to control crypto markets, reportedly taking on other stablecoins like the BUSD token issued by Paxos."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZGVjcnlwdC5jby8xMjE2NjgvbmZ0LWFydC1pcy1mYWlybHktc2lsbHktc2F5cy1jYXNhLWN0by1qYW1lc29uLWxvcHAtYml0Y29pbi1vcmRpbmFscy1yaXNl0gFoaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMTY2OC9uZnQtYXJ0LWlzLWZhaXJseS1zaWxseS1zYXlzLWNhc2EtY3RvLWphbWVzb24tbG9wcC1iaXRjb2luLW9yZGluYWxzLXJpc2U_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "'NFT Art Is Fairly Silly’ Says Casa CTO Jameson Lopp on Bitcoin Ordinals Rise - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe crypto times, they are a-changin’.\n\nThe recent hype around Bitcoin NTFs, also called Ordinals, has driven a key thorn in the side of the maximalist community.\n\nInstead of laying down the rails for “thermodynamically sound money,” it's being used for printing more jpegs. Bitcoin proponents are also concerned about the scarce amount of block space available, a resource apparently too precious to share with digital art.\n\nAD\n\nAD\n\nThe rise of Bitcoin NFTs is also a symptom of a bear market, he said. With prices low, block space is inexpensive. “In a bull market, it [Ordinals] would be costing people thousands of dollars to do this,” Casa CTO Jameson Lopp told Decrypt.\n\nTo say it’s irked Bitcoin advocates is an understatement.\n\n“I understand that because I've thought all along that NFT art is fairly silly. Personally, I've never found value in tokenized art,” he said. “It's not something that I would pay tens of thousands of dollars for so that I could say that it gives me pleasure that no one else is the owner of this art.”\n\nLopp’s in a unique position to view the crypto culture wars too, having had to face a similar variety once his wallet firm announced it would add support for Ethereum. Previously, the self-custody wallet provider Casa had only offered Bitcoin services since 2018.\n\nIn the belly of the Bitcoin beast\n\nThe move to add Ethereum, announced last November, generated similar outrage from many of the same individuals complaining about new inscriptions on Bitcoin.\n\nAD\n\nAD\n\n“Not something to be proud of,” tweeted Samson Mow, CEO of Jan3 and noted Bitcoin promoter, at the time. “RIP Casa ” and “embarrassing,” read some of the milder responses.\n\nToday, we are proud to announce a major step in the future of private key management with Casa. We have redesigned our app, reimagined the membership experience, and now our members will be able to secure #ethereum alongside #bitcoin within Casa. — Casa (@CasaHODL) November 30, 2022\n\nThese days, though, adding support for Ethereum looks like it will pay off once the product finally launches in a few weeks, Lopp insists.\n\n“From what we can tell and what we expected, a vast majority of the folks who were openly hostile and upset about it were not even our customers,” he said.\n\nInstead of taking sides, what Casa is really looking at from a business perspective “is to address as much of the market as possible when it comes to encouraging self-custody,” meaning users have to take responsibility for handling sometimes complex aspects of multi-signature transactions.\n\nSelf-custody of cryptocurrencies refers to the process of managing your assets yourself with the help of private keys rather than trusting third-party providers like centralized exchanges. The latter is considered a low-entry barrier for those new to the crypto space, however, security is a major concern, something the FTX collapse last year demonstrated as users weren’t able to withdraw their funds.\n\nThere are also \"multi-sig\" wallet options, such as Casa, which offer additional flexibility for the self-custody of crypto assets. Instead of just one private key, a multi-sig wallet is secured by a few at once. If the user loses one key, their funds are still safe.\n\nWhat irks the Casa CTO the most is less the inter-coin tribalism, but “seeing people who are choosing third-party trusted custodians because they make it really easy to hold every asset and take care of all of the complexities for you.”\n\nAD\n\nAD\n\nAdding support for both Ethereum and Bitcoin thus appears more as a middle-ground.\n\n“From an ideological perspective, it's a trade-off that I'm willing to make if adding other highly adopted assets means that we get more people to self-custody Bitcoin as well,” said Lopp.\n\nLopp ‘canceled’ by maximalists\n\nStill, many in the Bitcoin community haven’t been as understanding of that compromise.\n\n“I fully understand the tribalistic aspects—this is a result of competing narratives and the fact that you have different assets that are claiming to be the best,” Lopp told Decrypt. “You should expect that their proponents will use various tactics to support one over the other because they're competing for a limited amount of value that they're trying to absorb and get people to adopt.”\n\nAdmitting that the Bitcoin space is no stranger to some extreme individuals “who made being a Bitcoin maximalist—whatever that means—a large part of their personality,” Lopp also conceded that he has a lot of issues with the term itself.\n\nLopp also revealed that he has been “canceled” a number of times, with people getting upset over his interest in privacy-centric cryptocurrencies.\n\n“Some of that went off the rails and became a bit unproductive, especially when you're getting into sort of puritanism like shaming people for being interested in other things,” he said.\n\nAccording to Lopp, the crypto space “is all about doing what you want without permission,” which also means that “people should expect that they're going to get upset by other people doing certain things, like the Bitcoin NFT controversy that is happening right now.”\n\nAD\n\nAD"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYW5jZWZlZWRzLmNvbS9tdC1nb3gtYmlnZ2VzdC1jcmVkaXRvcnMtdG8tcmVjZWl2ZS05MC1vZi10aGVpci1wYXlvdXQtaW4tYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Mt. Gox biggest creditors to receive 90% of their payout in Bitcoin - FinanceFeeds",
        "content": "Mt. Gox biggest creditors to receive 90% of their payout in Bitcoin\n\nThe two largest creditors of infamous defunct crypto exchange Mt. Gox, Bitcoinica and MtGox Investment Funds (MGIF), have chosen to get their bankruptcy recovery funds paid out in bitcoin.\n\nAlongside other claimants, who have been waiting for a payout since Mt. Gox shuttered a decade ago, will receive 90% of what they are owed under a proposal by the trust managing the exchange’s liabilities.\n\nRather than waiting another 3 to 5 years, the Early Lum-Sum Repayment will enable creditors to recover somewhere between 15%-25% of what they actually held on to the exchange. The liquidity option also allows them to choose which assets would like to be paid back in BTC and/or BCH or cash.\n\nMtGox Investment Funds (MGIF) and Bitcoinica, a New Zealand-based crypto exchange, collectively represent about 20 percent of all Mt. Gox claims, which are estimated at $3.4 billion.\n\nAlmost a decade after an attack forced the platform to shut down, Mt. Gox creditors were given the option to choose between bitcoin, cash or Bitcoin Cash to receive repayment. The process could make the frozen crypto assets liquid again, depending on the entitled users’ choices.\n\nThose who chose to receive their repayment in bitcoin are reportedly posing a new selling threat to an already battered market. Even those who opt to get paid in fiat money are risking pressuring the market further as the trustee would supposedly liquidate an equivalent amount of bitcoin to pay out those interested in receiving cash.\n\nHowever, Eric Wall, a Mt. Gox creditor, dismissed the rumors that all of the roughly 150,000 BTC sent to creditors would soon be offloaded into an already stressed bear market.\n\nInterestingly, crypto exchange Bitstamp was appointed by Mt. Gox trustee as one of the designated crypto exchanges to assist in the repayment procedures to creditors. Bitstamp has released a complete description of how those affected can register to reclaim their digital assets through the exchange.\n\nBitstamp was approved, along with three other cryptocurrency exchanges, to assist creditors in receiving their assets. A creditor of Mt. Gox can choose their preferred cryptocurrency exchange and register as a user for the receipt of the relevant assets according to the repayment procedures under the rehabilitation plan."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDIvMTcvNTAway13b3J0aC1vZi1iaXRjb2lucy1zZWl6ZWQtZnJvbS1hbmRyZXctdGF0ZS1oaXMtYnJvdGhlci1pbi1yb21hbmlhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "$500K Worth of Bitcoins Seized from Andrew Tate & his Brother in Romania - Crypto Times",
        "content": "The spokesperson for controversial social media influencer, Andrew Tate Aka Top-G, and his brother Tristan Tate revealed that the Romanian authority has frozen $500,000 in BTC from them.\n\nA pair of brothers were detained by Romanian police for allegedly human trafficking last December. Apart from human trafficking charges, rape charges were also filed against Andrew Tate. Many people are calling it false allegations. He has also been in controversy for his misogynist comments on feminism.\n\nHowever, after winning the championship in kickboxing, he is now running a crypto trading school, Hustler’s University. Through this, he has been a vocal advocate of cryptocurrency for a long time.\n\nAlso Read: ZachXBT accuses Crypto Influencer Lark Davis of Pump and Dump\n\nThe spokesperson named Mateea Petrescu said to a famous news website that the Romanian police seized crypto hardware wallets, where digital assets are stored.\n\nAccording to Patrescu, the wallet collected from Andrew Tate has 5 bitcoins within it, while his brother’s wallet held nearly 16 bitcoins. In total, the total worth of ceased bitcoins is around $500,000 according to the current market price. However, Andrew Tate’s bitcoins were recovered from his girlfriend’s hardware wallet.\n\nCurrently, there is no clarification over how many bitcoin holdings Andrew Tate and his brother have. During one podcast, he disclosed his profit from the investment. He said, “I turned 600 grand to $12 million.”"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnN3aXNzaW5mby5jaC9lbmcvYnVzaW5lc3Mvc3dpc3MtYmFua3MtcmVtYWluLXdhcnktb2YtYml0Y29pbi80ODI5NTU5ONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Swiss banks remain wary of bitcoin - SWI swissinfo.ch - SWI swissinfo.ch in English",
        "content": "Swiss banks remain wary of bitcoin\n\nIs Credit Suisse’s investment in digital assets platform Taurus the moment Crypto Nation Switzerland has been waiting for? It looks more a case of blockchain ‘Yes’, bitcoin ‘No’.\n\n2 minutes\n\nMatthew Allen\n\nWhen not covering fintech, cryptocurrencies, blockchain, banks and trade, swissinfo.ch's business correspondent can be found playing cricket on various grounds in Switzerland - including the frozen lake of St Moritz.\n\nSwitzerland’s second largest bank is the lead investor in a $65 million (CHF60 million) series B round in Taurus, which specialises in crypto finance.\n\nExternal Content Your subscription could not be saved. Please try again. Almost finished… We need to confirm your email address. To complete the subscription process, please click the link in the email we just sent you. Fintech: from cryptocurrencies to neo-banks We will send you a bi-weekly exploration of financial technology innovations in Switzerland. Biweekly Email The SBC Privacy Policy provides additional information on how your data is processed. I consent to the use of my data for the SWI swissinfo.ch newsletter. Subscribe\n\nThe Geneva-based Taurus provides services to store and manage cryptocurrencies and to issue stablecoins, a type of cryptocurrency backed by more traditional assets.\n\nBut this doesn’t mean that Credit Suisse is primed to dive into bitcoin. The bank is more interested in Taurus’s other business – creating blockchain compliant versions of company shares and other securities.\n\nThis means creating digital versions of securities that are stored and transferred on Distributed Ledger Technology (DLT) systems. The hope is that DLT will make it faster, more cost-effective and transparent to create and trade stocks and bonds.\n\nDLT interest spreading\n\nCredit Suisse is following a path already trodden by other traditional financial players, such as the Swiss stock exchange and other banks.\n\nTaurus has a proven track record of tokenising company shares. It recently helped the Swiss private bank Cité Gestion achieve this feat with its own shares.\n\nSwiss companies Metaco, Daura and Aktionariat are also very much in the same game.\n\nThe term digital assets can these days encompass a whole range of items: from cryptocurrencies to digital securities and DLT tokens representing art and real estate.\n\nDecentralised vs centralised\n\nCredit Suisse’s foray into digital assets is a far cry from the libertarian values of bitcoin and other public blockchains that are striving to move away from centralised gatekeepers, such as banks.\n\nVery few Swiss banks are willing to jump on the bitcoin bandwagon, particularly after the collapse of the crypto exchange FTX last year. “Like many banks, we are still conservative,” Credit Suisse Switzerland CEO André Helfenstein told the Handelszeitung newspaper.\n\nThe centralised and decentralised pathways for digital assets are locked in an arm wrestle for the future of finance.\n\nIt’s perfectly possible that both systems could prevail, running in parallel, depending on consumer demand and the exact goal of their operations."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL21pbnRnZW5pZS5saXZlbWludC5jb20vbmV3cy9wZXJzb25hbC1maW5hbmNlL3doYXQtZG9lcy13YXJyZW4tYnVmZmV0dC10aGlua3Mtb2YtY3J5cHRvY3VycmVuY3ktYWxsLXlvdS1uZWVkLXRvLWtub3ctMTUxNjc2NTI2MzMxNjA00gGoAWh0dHBzOi8vbWludGdlbmllLmxpdmVtaW50LmNvbS9hbXAvbmV3cy9wZXJzb25hbC1maW5hbmNlL2FzLWNyeXB0b2N1cnJlbmNpZXMtY3Jhc2gtaW52ZXN0b3JzLWFyZS1yZW1pbmRlZC1vZi13YXJyZW4tYnVmZmV0dC1zLWVhcmx5LWRpc21pc3NhbC1vZi1iaXRjb2luLTE1MTY3NjUyNjMzMTYwNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "What does Warren Buffett thinks of cryptocurrency? All you need to know - MintGenie",
        "content": "Cryptocurrencies have fallen to their lowest since November 2021 with many personal financial experts even comparing the unbridled fall to a pack of cards.\n\nAs opposed to 2021 when many new investors bet their earnings in Bitcoin, Ether and other cryptocurrency forms following multiple crypto success stories, many people have been reduced to penury owing to billions of dollars being wiped out of the crypto space.\n\nFor example, in November 2021 the value of Bitcoin had risen to $ 67,566.83. The latest price of Bitcoin is somewhere around $ $24,307.84. Similarly, Ethereum is today priced at $ 1,673.75 compared to the high of $ 4,812.09 in November 2021.\n\nInvestor confidence is at an all-time low considering how many had put in their lifetime earnings and savings. Amidst all the cacophony in favour of cryptocurrencies and the world’s largest crypto coin Bitcoin hitting the mainstream in 2021, the Chief Executive Officer of Berkshire Hathaway, Warren Buffett continued to be sceptical about its growth and continuity.\n\nDismissing bitcoin as “rat poison squared” Explaining why he does not find Bitcoin investable, Buffett cited, “If you told me you own all of the bitcoin in the world and you offered it to me for $25, I wouldn’t take it because what would I do with it? I’d have to sell it back to you one way or another. It isn’t going to do anything,” adding, “Whether it goes up or down in the next year, or five or 10 years, I don’t know. But the one thing I’m pretty sure of is that it doesn’t produce anything. It’s got a magic to it and people have attached magic to lots of things.”\n\nIronically, many crypto investors have found innovative ways to use these coins productively, for example, through lending or using them as collateral to take loans from banks and financial institutions. Backed by inexplicable speculation, crypto coins were once the most sought-after investment options that people looked for to add to their investment portfolios till all hell broke loose and new-age investors realized them as nothing short of risky and worthless delusion.\n\nAnticipating a bad ending to cryptos While crypto fans brushed off all warning signs by conservative investors worldwide, Buffett labelled these coins as liabilities and a by-product of craze and misconceptions surrounding how one must evaluate investments in the long run.\n\nBuffett shared with CNBC in 2018, “If you and I buy various cryptocurrencies, they're not going to multiply. There are not going to be a bunch of rabbits sitting there in front of us. They're just gonna sit there. And I gotta hope next time you get more excited after I've bought it from you and then I'll get more excited and buy it from you. We could sit in the house by ourselves and we could keep running up the price between us. But at the end of the time, there's one bitcoin sitting there and now we've gotta find somebody else. They come to an end.”\n\nThe famous billionaire also added, “In terms of cryptocurrencies generally, I can say almost with certainty that they will come to a bad ending. If I could buy a five-year put on every one of the cryptocurrencies, I'd be glad to do it, but I would never short a dime's worth.”, thus, putting to rest his thoughts about such phoney investments.\n\nThe total number of bitcoins"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnRoZXRpbWVzLmNvLnVrL2FydGljbGUvaW52ZXN0b3JzLXJlZGlzY292ZXItYW4tYXBwZXRpdGUtZm9yLWJpdGNvaW4tNXE1a2wya2I40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Investors rediscover an appetite for bitcoin - The Times",
        "content": "Bitcoin rose yesterday to its highest level since August\n\nBitcoin scaled a six-month peak yesterday as concerns over a recession and a crackdown on cryptocurrencies eased, helping to drive the asset higher.\n\nThe world’s largest digital coin — prone to volatile swings in value — has rallied by almost 50 per cent since the turn of the year, having come under stark pressure during 2022 in the face of a global markets rout and the bankruptcy of FTX, a top crypto exchange, which rattled confidence in the wider sector.\n\nSponsored\n\nStronger-than-expected economic releases have led investors to reconsider the prospect of a steep economic downturn. Policymakers are seeking a “soft landing,” where growth continues as they battle to combat rising prices.\n\nRobust inflation readings for January, including 10.1 per cent in Britain and 6.4"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LnBoaWxzdGFyLmNvbS9idXNpbmVzcy9jcnlwdG8vMjAyMy8wMi8xNy8yMjQ1NjMxL2JpdGNvaW4tdG9wcy0yNTAwMC1oaXQtZWlnaHQtbW9udGgtaGlnaNIBaGh0dHBzOi8vd3d3LnBoaWxzdGFyLmNvbS9idXNpbmVzcy9jcnlwdG8vMjAyMy8wMi8xNy8yMjQ1NjMxL2JpdGNvaW4tdG9wcy0yNTAwMC1oaXQtZWlnaHQtbW9udGgtaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin tops $25,000 to hit eight-month high - Philstar.com",
        "content": "Bitcoin tops $25,000 to hit eight-month high\n\nLONDON, United Kingdom — Bitcoin hit an eight-month high to surge past $25,000 on Thursday as the volatile cryptocurrency rises despite pressure from US regulators.\n\nThe digital coin has soared by 50 percent since the start of the year, though it remains far off its peak of $68,992, which it reached in November 2021.\n\nBitcoin reached $25,249 on Thursday, its highest point since June and the first time it topped $25,000 since August.\n\nA more optimistic outlook for the world economy is propping up the markets, including cryptocurrencies, with Paris and London stock exchanges hitting all-time highs on Thursday.\n\n\"While regulatory crackdowns continue to drive some unease, there's clearly a growing sense of relief that the worst is behind it for the industry and 2023 could be a much better year,\" said Craig Erlam, analyst at online trading platform OANDA.\n\nUS officials are cracking down on the cryptocurrency sector after the uproar caused by the recent bankruptcy of FTX and Alameda Research.\n\nFTX, once the world's highest-profile crypto exchange, collapsed spectacularly in November, leaving nine million customers in the lurch and seeing cofounder Sam Bankman-Fried indicted for fraud by US prosecutors.\n\nUS regulators on Monday ordered crypto firm Paxos Trust to stop issuing dollar-pegged cryptocurrency BUSD, a stablecoin, for trading platform Binance.\n\n\"The third largest stablecoin was given an expiration date of February 2024 and the market has seemingly shrugged it off,\" said Riyad Carey, analyst at cryptocurrency data provider Kaiko.\n\nAs stablecoins are backed by one or more national currencies with a near fixed rate of exchange they don't experience the swings in value that cryptocurrencies like Bitcoin have seen."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vd3d3LmZpbmRlci5jb20uYXUvYnV5LWJpdGNvaW4tY3JlZGl0LWNhcmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "How to buy Bitcoin with credit card in Australia (2024 update) - finder.com.au",
        "content": "Although it's possible to buy cryptos like Bitcoin with a credit card, you should think very carefully before you do.\n\nWhile a credit card might seem like a convenient payment option, there are some serious downsides you need to consider, including excess fees and the risk of your payment being blocked. And, it can be tricky to find a crypto trading platform that accepts credit card payments.\n\nThis is not an endorsement of cryptocurrency or any specific provider, service or offering. It is not a recommendation to trade or use any services.\n\nHow to buy Bitcoin with credit card\n\nIf you've decided to buy Bitcoin with credit card from an exchange, there are a few steps you will need to follow.\n\nChoose a platform that accepts credit cards First you will need to find a platform that actually accepts credit card payments. There are a small number of platforms including crypto exchanges, investment apps and brokers that may let you pay by card. Create an account Regardless of which service you use to buy Bitcoin with a credit card, you will need to create an account. At a minimum, this requires you to sign up with an email and password. Additionally, most exchanges will require you to pass a Know Your Customer (KYC) process which involves photo ID. Make your purchase The next step is to actually purchase Bitcoin with your credit card. This requires you to provide your full credit card details. Depending on the service provider, they will also ask for billing details such as the associated address, along with the name on the card. Once the details of the credit card have been entered, then you can choose the amount of Bitcoin you would like to purchase. Remember – you can purchase less than 1 whole BTC. Store your crypto Trading platforms typically offer an in-built wallet to hold your Bitcoin on your behalf. If you don't plan on trading frequently, it's a good idea to consider transferring most of your funds to a personal crypto wallet for added security.\n\nPurchasing Bitcoin with a credit card might seem convenient but it carries a lot more risk than using funds in your bank account. Using a credit card means you are taking on debt which is going to compound rapidly if you don't pay it off immediately. Taking on debt to invest in anything – especially a volatile asset like Bitcoin – is particularly ill-advised because you could wind up losing more than your initial investment. James Edwards\n\nFinder's Global Crypto Editor\n\nWhere to buy crypto with credit card in Australia\n\nUse the table to compare platforms that let you purchase Bitcoin with a credit card in Australia. Compare fees, supported currencies and special offers.\n\nBest places to buy Bitcoin with a credit card\n\nThere are several places to buy Bitcoin with a credit card, including:\n\nCryptocurrency trading platforms. Exchanges and brokers that accept credit card typically require identity verification before purchase.\n\nExchanges and brokers that accept credit card typically require identity verification before purchase. Bitcoin ATMs. Some Bitcoin ATMs accept credit card payments, allowing users to purchase Bitcoin in person.\n\nSome Bitcoin ATMs accept credit card payments, allowing users to purchase Bitcoin in person. Peer-to-peer marketplaces. P2P platforms such as Paxful connect crypto buyers and sellers, some of whom may accept credit card payments.\n\nHow much does it cost to buy Bitcoin with a credit card?\n\nWhile buying crypto with credit is generally straightforward, it can also be quite expensive. This is because there are several fees that can contribute to the cost of your transaction, not only from the crypto broker but also from your card issuer. These charges can include:\n\nCash advance fee Many card issuers treat a cryptocurrency purchase as a cash advance. This means your purchase will usually incur a cash advance fee and will also attract higher interest rates than normal purchases. Exchange/broker fee The platform you use to buy Bitcoin or another cryptocurrency will impose its own transaction fee. These tend to range from 4–5%, but are higher in some cases. Credit card surcharge You may also be asked to pay a credit card surcharge on top of any other fees and commissions being charged. Currency exchange fee If you're using a local credit card on an overseas exchange, you might wind up paying foreign currency conversion fees. Higher interest rates Credit card providers often charge fees upwards of 10% p.a on credit loans. Double-check the loan and repayment information with your card provider and remember to account for interest rates when calculating your repayments.\n\nPros and cons of buying Bitcoin with a credit card Pros Speed. Transactions made with a credit card are usually processed quickly, allowing you to buy Bitcoin and have it in your wallet in a matter of minutes.\n\nTransactions made with a credit card are usually processed quickly, allowing you to buy Bitcoin and have it in your wallet in a matter of minutes. Earn rewards. Some credit cards offer rewards or cashback for purchases made on the card, which could help offset the cost of buying Bitcoin. Cons High fees. Buying Bitcoin with a credit card can be more expensive than other methods due to the fees charged by the credit card company and the platform used to make the purchase. Exchanges typically apply a surcharge of between 1.5% and 5%.\n\nBuying Bitcoin with a credit card can be more expensive than other methods due to the fees charged by the credit card company and the platform used to make the purchase. Exchanges typically apply a surcharge of between 1.5% and 5%. Debt. Using a credit card to purchase Bitcoin means you are going into debt. If the price of Bitcoin drops, you will still need to repay your debt in full, plus any interest.\n\nUsing a credit card to purchase Bitcoin means you are going into debt. If the price of Bitcoin drops, you will still need to repay your debt in full, plus any interest. Interest. If you don't pay off your credit card balance in full each month, you will be charged interest on the purchase, which can add significant costs over time and increase your debt.\n\nIf you don't pay off your credit card balance in full each month, you will be charged interest on the purchase, which can add significant costs over time and increase your debt. Blocked payments. Credit card issuers have been known to freeze the accounts of customers who use their cards to buy crypto, so it's a good idea to check if your bank is crypto-friendly before making a purchase.\n\nCredit card issuers have been known to freeze the accounts of customers who use their cards to buy crypto, so it's a good idea to check if your bank is crypto-friendly before making a purchase. Credit card fraud. As with any online purchase, there is a risk of credit card fraud when buying Bitcoin with a credit card. It's important to only buy from reputable platforms and to take steps to secure your credit card information.\n\nIs it safe to buy Bitcoin with a credit card?\n\nThere are a few things worth considering before you decide to purchase Bitcoin with a credit card.\n\nSecurity of the platform. Make sure the platform you are using is reputable and has a good track record of protecting customer information. Check for security features such as 2-factor authentication and SSL encryption.\n\nFees and charges. Be aware of any fees or charges associated with buying Bitcoin with a credit card. Compare these to other purchasing options to ensure you get a fair deal.\n\nVolatility of Bitcoin. The value of Bitcoin can be highly volatile, so be prepared for the possibility of significant price fluctuations after purchasing.\n\nLegal and regulatory compliance. Some countries have regulations and laws that restrict or prohibit the buying and selling of Bitcoin. Be sure to check the laws and regulations in your country before making a purchase.\n\nWallet security. If you plan to store your Bitcoin in a wallet, make sure to choose a secure and reputable wallet provider.\n\nReputation of the company. Check the company's reputation, its regulatory compliance and if it has had any security breaches in the past.\n\nCredit card debt. Buying Bitcoin on credit can easily lead to credit card debt if not managed properly, so it's essential only to spend what you can afford to repay.\n\nOther ways to buy Bitcoin\n\nCredit cards aren't the only way to purchase Bitcoin – or the best. There are several other ways to buy Bitcoin that are generally more cost effective.\n\nBank transfer. You can use a cryptocurrency exchange that accepts bank transfers as a payment method. Many major exchanges allow you to deposit funds via bank transfer and then use those funds to buy Bitcoin. ACH transfers are often free and instant. Wire transfers typically incur a cost.\n\nYou can use a cryptocurrency exchange that accepts bank transfers as a payment method. Many major exchanges allow you to deposit funds via bank transfer and then use those funds to buy Bitcoin. ACH transfers are often free and instant. Wire transfers typically incur a cost. PayPal. You can buy Bitcoin with PayPal which can then be used to make purchases on millions of online stores that accept PayPal as a payment method. Some crypto exchanges also support PayPal as a deposit method, allowing you to transfer funds from your PayPal onto the exchange, and then trade them for Bitcoin.\n\nYou can buy Bitcoin with PayPal which can then be used to make purchases on millions of online stores that accept PayPal as a payment method. Some crypto exchanges also support PayPal as a deposit method, allowing you to transfer funds from your PayPal onto the exchange, and then trade them for Bitcoin. Cash. You can buy Bitcoin with cash through a variety of methods, including a Bitcoin ATM or via a peer-to-peer crypto marketplace.\n\nIt's important to remember that each of these methods has its own advantages and disadvantages. Be sure to research and compare the different options before making a decision, and always use reputable providers to ensure the safety and security of your funds.\n\nFrequently asked questions about buying Bitcoin with a credit card\n\nCan I buy Bitcoin with a credit card instantly? Yes, but you will need to complete the ID verification process first. Verification times vary between platforms, but it's still possible to complete the sign-up and purchasing process within an hour.\n\nCan I buy Bitcoin anonymously with a credit card? Buying crypto with a credit card without ID verification can be difficult as most exchanges require personal details and KYC verification before allowing a purchase. While it may be possible to find a platform where you can make an anonymous purchase, such as a peer-to-peer exchange, the credit card you use will still be linked to your ID, making the purchase traceable.\n\nCan I buy Bitcoin with a prepaid card? Yes, some exchanges will allow you to buy cryptocurrency with a prepaid debit card or voucher.\n\nCan I buy cryptocurrency with a debit card? Yes. Check the comparison table for details of a number of leading crypto exchanges that accept debit card payments."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1leGhpYml0cy1leHRyZW1lbHktYnVsbGlzaC1zaWduYWwtb24tMi1tb250aC1zdG9jaGFzdGljLXJzaS1jaGFydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin exhibits 'extremely bullish signal' on 2-month Stochastic RSI chart - Finbold - Finance in Bold",
        "content": "After a brief rally, the cryptocurrency market is consolidating again in what looks like a continuous loop of good news and bad news for the industry, and Bitcoin (BTC) is no exception, but some of its technical analysis (TA) indicators are suggesting a bullish future for the maiden cryptocurrency.\n\nSpecifically, Bitcoin has recently undergone the third Stochastic relative strength index (RSI) bullish crossover on the two-month chart, indicating “an extremely bullish signal in macro view,” as observed by the pseudonymous crypto analyst Trader Tardigrade in a tweet published on February 17.\n\nThe Stochastic RSI is the result of using the Stochastic oscillator formula to a set of RSI values instead of standard price data, giving stock market or cryptocurrency traders an opportunity to compare the asset’s closing price to its price range to predict price turning points.\n\nAccording to the chart, the first such crossover took place in mid-2015, and then it happened again in early 2019, and both times it was followed by a powerful bullish rally of the flagship decentralized finance (DeFi) asset in the long run, which indicates history could indeed repeat itself this time around as well.\n\nBitcoin Stochastic RSI chart. Source: Trader Tardigrade\n\nBitcoin price movements\n\nMeanwhile, the price of Bitcoin at press time stood at $23,865, recording a downswing of 2.03% but, at the same time, representing an increase of 9.73% across the previous seven days, as well as a 12.8% gain over the past month, according to the latest data retrieved on February 17.\n\nBitcoin 30-day price chart. Source: Finbold\n\nIt is also worth noting that, according to the information by the blockchain and financial data tracking platform Kaiko, Bitcoin’s correlation with gold last week hit its highest level in nearly two years, indicating that investors are increasingly seeing BTC as a safe haven.\n\nOne of them is the author of the best-selling personal finance book ‘Rich Dad Poor Dad,’ Robert Kiyosaki, who has often praised the largest digital asset by market capitalization, placing it side by side with silver and gold as the alternatives to fiat money.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbmN1bHR1cmUuY29tL2F1L2xlYXJuL2JpdGNvaW4vaXMtYml0Y29pbi1taW5pbmctcHJvZml0YWJsZS11bHRpbWF0ZS1ndWlkZS10by1iaXRjb2luLW1pbmluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "Is Bitcoin Mining Profitable? Ultimate Guide to Bitcoin Mining - Coin Culture",
        "content": "Are you thinking about mining Bitcoin but wondering if it’s worth your investment? The truth is, you’re not alone. Many people need clarification on whether or not it is still profitable to mine bitcoin in light of increased energy costs. The quick answer is “yes,” but only if you have access to the necessary equipment and join a Bitcoin mining pool.\n\nNonetheless, there are several unknowns, and a high profit isn’t guaranteed. To help you determine if bitcoin mining is suitable for you, this post will go through the ins and outs of the process, including the potential benefits, drawbacks, and how to get started.\n\nWhat is Bitcoin Mining?\n\nBitcoin mining is a computationally and technologically sophisticated process verifying Bitcoin transactions on the network. It’s quite similar to verifying a block on the chain network in exchange for Bitcoin payment.\n\nThose who work in this industry are referred to as “miners.” Because there is a fixed supply of Bitcoins, just like gold or oil, acquiring them is “mining.” There is a maximum of 21,000,000 Bitcoin in circulation. Bitcoin mining requires electricity as its source of energy to create Bitcoin.\n\nEven while mining Bitcoins may sound hard, it’s relatively simple once you get the hang of it. A hash is a complicated integer consisting of 64 digits, and miners compete by trying to predict it. So the term “hash mining” may be used to describe the process.\n\nMiners utilise high-powered computers to make predictions about the hash as rapidly as feasible. The first miner to guess the number accurately is rewarded with newly created Bitcoins. Remember that the machine is making all the number guesses here. The more powerful a computer is, the more predictions a miner can make each second, and the better their chances of succeeding.\n\nBitcoin mining is mainly done to validate ongoing transactions and bring new coins to circulation, eliminate counterfeiting and double-spend and maintain the ledger in a decentralised manner.\n\nMany Bitcoin miners opt to work together in “mining pools,” or organisations that pool resources and divide the reward. By joining a pool, you can increase your chances of adding a block to the blockchain, but doing so will reduce your payment.\n\nPros & Cons of Bitcoin mining\n\nYou should only enter the Bitcoin mining industry with careful consideration. Although the investment of time, effort, and money is high, it may be well worth it. Here are some of the benefits and drawbacks of bitcoin mining for you to make up your mind.\n\nBenefits of Bitcoin mining\n\nProven track record. PoW has been around for 13 years. Since then, there hasn’t been a major security breach in the Bitcoin network. Many in the field attribute this to the massive amount of computer power needed to achieve such a high hash rate. While it’s true that hackers have successfully brought down smaller PoW networks in the past, the same is hard for large PoS networks.\n\nPotential earnings. Dollars per terahash (TH) per second are the standard unit of Bitcoin profitability. In 2017, bitcoin mining produced $3.39/TH per second. Towards the year’s conclusion in 2022, it was closer to $0.104/TH per second.\n\nCryptographic security. While hackers have compromised smaller PoW networks in the past, larger ones like Bitcoin have remained secure thus far. PoW might be the safest option when entrusting a network with substantial funds.\n\nRisks of Bitcoin mining\n\nUpfront costs. The upfront cost is the main negative of bitcoin mining. You need a specialised computer (a “mining rig”) to compete for block rewards. Even those parts of a mining pool require the right mining hardware. The expense of power must also be factored in. The mining machines consume a lot of energy, so if you’re considering getting into Bitcoin mining, you should be prepared for a high monthly electricity expense.\n\nPrice volatility. There is uncertainty with Bitcoin, as there is with other digital currencies. When bitcoin prices drop very low, mining profits might become negligible. Since its inception in 2009, the value of bitcoin has seen significant fluctuations. It ranged from about $60,000 to less than $20,000 in the past year of trading. It is difficult for miners to determine if the potential benefit of their efforts is worth the significant expenditures involved when the crypto price fluctuates so wildly.\n\nRegulation. Many governments have met virtual currencies like Bitcoin with scepticism since any central bank or other governing body does not back them. Mining Bitcoin and other cryptocurrencies may be outlawed by governments in the future, as happened in China in 2021, due to concerns over financial stability and increasing speculative trading.\n\nWhat Are Incentives For Bitcoin Miners?\n\nSince miners are greatly driven by the prospect of receiving free Bitcoins and transaction fees for their efforts, they verify transactions and solve the complex mathematical problem that underlies Bitcoin.\n\nBitcoin Miner Payment= Block Reward + Transaction Fees\n\nBitcoin miners have their payouts cut in half every four years. In 2009, when Bitcoin was originally mined, a single block could be mined for a reward of 50 BTC. This was reduced to 25 BTC in 2012, then cut in half again to 12.5 BTC by 2016. In 2020, the reward halved again to 6.25 BTC.\n\nBy 2040, the block reward will be down to less than 0.2 BTC, and just 80,000 BTC will be available for mining. Mining will truly end once the last Bitcoin is mined, somewhere around 2140.\n\nIs Bitcoin Mining Profitable?\n\nMining for bitcoins may appear to be lucrative, but is it? Bitcoin’s creator, Satoshi Nakamoto, designed the system so that the more influential the mining network, the harder it is to solve the mathematical issue. The whole network mining power is factored into the difficulty adjustment process.\n\nTo put it another way, if more miners join the fray, the difficulty of the challenge rises. This system was implemented to ensure continuity and a consistent stream of new Bitcoins to control inflation. With the current mining difficulty, a new block is generated around every 10 minutes.\n\nPeople are motivated to employ Bitcoin mining for substantial financial gain because of the rewards in the mining process itself. However, turning mining into a viable venture is sometimes a walk in the park. In light of this, it is essential to take into account and verify the following elements, all of which significantly affect mining profits:\n\nHash rate\n\nMining difficulty\n\nBlock rewards\n\nMining pool fees\n\nPower consumption expenses\n\nBitcoin’s market price\n\nHow to Start Bitcoin Mining\n\nIf the benefits have convinced you to start mining, keep reading for a primer on getting set up to mine Bitcoin.\n\nSet Up Bitcoin Mining Hardware\n\nPick out the Bitcoin mining hardware to use first. You can use any computer, but you probably won’t make any money unless you have a robust system built for Bitcoin mining. To cut costs, consider searching online for second-hand mining equipment.\n\nIt’s worth noting that most mining rigs use the Linux OS and need a high level of computer expertise to set up and run. It’s important to factor in more time for learning and fixing problems if you’re unfamiliar with high-level computer systems.\n\nCreate a Dedicated Bitcoin Wallet\n\nYou’ll need a working wallet if and when you validate a Bitcoin block. You need to set up a unique wallet to keep your cryptocurrency mining earnings apart from your other Bitcoin holdings.\n\nBitcoin wallets come in various ways, each with ease of use and security. If you’re serious about protecting your Bitcoins, set up a hardware wallet, as it’s the most secure type.\n\nConfigure Your Mining Equipment\n\nTo earn Bitcoins, you’ll need to get mining gear, store your currency in a Bitcoin wallet, and set up your mining program. Like the previous step, this one calls for technical know-how if you want to enhance your Bitcoin mining capacity by joining various hardware miners.\n\nSome mining hardware has a graphical user interface (GUI) that enables the device to be configured using a mouse. Another sophisticated computer skill typically used by programmers and developers is familiarity with the command line, which is required to use some mining devices. Choose the Bitcoin mining program for your gear after carefully considering your needs.\n\nStart Bitcoin Mining Process\n\nOnce you have a local copy of the blockchain for the cryptocurrency you wish to mine, you may begin mining immediately. Your mining is now underway, and you may take a break. Your mining gear is what mines the cryptocurrency for you. You don’t have to do anything more, but you should check in on your rig repeatedly to ensure it’s still mining. Your mining hardware can mine cryptocurrency 24/7, even if you are at work or asleep.\n\nIs Bitcoin mining legal?\n\nConsidering the adoption by many countries, the answer to the question of whether Bitcoin mining is legal or not is yes. For example, Enigma (located in Iceland) developed one of the world’s most massive Bitcoin mining operations.\n\nIn Israel, crypto mining is regarded as a commercial activity that must pay corporate income tax. On the other hand, the Financial Crimes Enforcement Network (FinCEN) in the United States classifies cryptocurrency miners as money transmitters, which means they may be subject to the regulations governing such activity.\n\nFurther, El Salvador’s President Nayib Bukele declared in November 2021 that a new “Bitcoin city” will be constructed in the shape of a coin near the base of the Conchagua volcano. Geothermal energy will supply the city’s Bitcoin mining operations. With the support of crypto infrastructure provider Blockstream, El Salvador plans to issue a billion-dollar “Bitcoin bond” to fund the city’s building.\n\nBut Bitcoin mining is illegal in Algeria, Nepal, Russia, Bolivia, Egypt, Morocco, Ecuador, and Pakistan. Find out if Bitcoin mining is legal where you reside by looking into the relevant local laws and regulations.\n\nFrequently Asked Questions (FAQs)\n\nHow long does it take to mine one Bitcoin?\n\nAbout once every 10 minutes, a new block is added to the Bitcoin blockchain, and with it comes the creation of one Bitcoin. Approximately 900 Bitcoins are mined each day, with the average amount of Bitcoins mined every block expected to decrease as more Bitcoins are distributed. Bitcoin blocks are generated around 144 times daily, each containing 6.25 newly produced Bitcoins. By that measure, a new Bitcoin is generated every 1.6 minutes.\n\nHow much does it cost to mine Bitcoin?\n\nMiners must constantly spend money on mining hardware, the internet, and energy. Investing in new mining hardware might consume thousands of dollars, depending on your needed tools. Power and data connection fees change based on factors including distance and consumption. Thus, Bitcoin mining may either bring in profits or cause losses.\n\nCan you get rich by crypto mining?\n\nDue to the high value of cryptocurrencies, mining has become highly competitive. Several coins might have been mined annually in the early days of crypto, but today’s mining difficulty and competition mean that only large-scale mining operations can generate a profit. However, it is feasible to earn several hundred dollars monthly by mining bitcoins.\n\nHow do you mine Bitcoin without hardware?\n\nCloud miners use the services of a cloud provider to mine Bitcoin without needing specialised mining hardware. Cloud miners forgo the upfront expense of mining gear in favour of a subscription fee charged by the cloud mining service provider.\n\nIs Bitcoin Mining Right for You?\n\nPeople often view Bitcoin mining as a lucrative business opportunity. It’s important to remember that Bitcoin mining is not a get-rich-quick scheme and requires a high level of technical expertise and sophisticated hardware. Massive expenditures in costly technology, along with plenty of computing power, dependable connectivity to the internet, and plenty of energy, are also needed. Therefore, before committing significant funds, it is prudent to do your own research."
    }
]