[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjQvMDEvMzAvYnVzaW5lc3MvYml0Y29pbi1nZXJtYW55LWlsbGVnYWwtbW92aWUtc2l0ZS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "German Authorities Seize $2 Billion Worth of Bitcoin - The New York Times",
        "content": "A German programmer who is accused of running an illegal movie streaming site more than a decade ago transferred $2.17 billion worth of Bitcoin to the authorities to repay at least some of the money he had made illegally, the police said on Tuesday. The transfer required the man to use his unique Bitcoin credentials to hand over the funds.\n\n“This is the most extensive seizure of Bitcoins by law enforcement in the Federal Republic of Germany to date,” said Kay Anders, a spokesman for the Saxony state police. The money will remain in the authorities’ Bitcoin account until a court can figure out what to do with it, Mr. Anders added.\n\nThe man, identified only as a 40-year-old German citizen, and his business partner are under investigation on allegations that they ran what was once the country’s most successful illegal video-sharing site.\n\nIn its heyday, from 2008 to 2013, the site, movie2k.to, had tens of thousands of movies in a host of languages available for download. Users from around the world visited the site, making it among the 25 most-visited websites in Germany, according to news reports at the time. After the authorities shut it down in 2013, several sites with similar names opened to fill the void."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmJhbmtyYXRlLmNvbS9pbnZlc3RpbmcvYml0Y29pbi1wcmljZS1oaXN0b3J5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin’s price history: 2009 to 2024 - Bankrate.com",
        "content": "Advertiser Disclosure\n\nWe are an independent, advertising-supported comparison service. Our goal is to help you make smarter financial decisions by providing you with interactive tools and financial calculators, publishing original and objective content, by enabling you to conduct research and compare information for free - so that you can make financial decisions with confidence.\n\nOur articles, interactive tools, and hypothetical examples contain information to help you conduct research but are not intended to serve as investment advice, and we cannot guarantee that this information is applicable or accurate to your personal circumstances. Any estimates based on past performance do not a guarantee future performance, and prior to making any investment you should discuss your specific investment needs or seek advice from a qualified professional.\n\nHow We Make Money\n\nThe offers that appear on this site are from companies that compensate us. This compensation may impact how and where products appear on this site, including, for example, the order in which they may appear within the listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. But this compensation does not influence the information we publish, or the reviews that you see on this site. We do not include the universe of companies or financial offers that may be available to you.\n\nEditorial disclosure\n\nAll reviews are prepared by our staff. Opinions expressed are solely those of the reviewer and have not been reviewed or approved by any advertiser. The information, including any rates, terms and fees associated with financial products, presented in the review is accurate as of the date of publication."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc1NDA2L2JpdGNvaW4tdHJhZGVzLWZsYXQtYXMtZmVkZXJhbC1yZXNlcnZlLWhvbGRzLXJhdGVzLXN0ZWFkedIBYWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3NTQwNi9iaXRjb2luLXRyYWRlcy1mbGF0LWFzLWZlZGVyYWwtcmVzZXJ2ZS1ob2xkcy1yYXRlcy1zdGVhZHk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's price dips as Federal Reserve holds rates steady - The Block",
        "content": "Bitcoin BTC -6.79% 's price dipped on Wednesday after the U.S. Federal Reserve kept interest rates at their current level on Wednesday.\n\nThe Federal Open Market Committee did what the majority of analysts predicted and held the benchmark federal funds rate in the current range of 5.25%-5.50%. The move marks the first rate pause of 2024.\n\n\"The Committee decided to maintain the target range for the federal funds rate at 5.25% to 5.50%,\" the central bank said in a statement.\n\nInflation has eased, but still elevated\n\n\"Recent indicators suggest that economic activity has been expanding at a solid pace. Job gains have moderated since early last year but remain strong, and the unemployment rate has remained low. Inflation has eased over the past year but remains elevated,\" the FOMC statement added.\n\nReferring to the possibility of a rate cut, the Federal Reserve said that \"the Committee does not expect it will be appropriate to reduce the target range until it has gained greater confidence that inflation is moving sustainably toward 2%.\"\n\nRELATED INDICES See crypto indices\n\nThe world's largest cryptocurrency by market capitalization fell 2.2% over the past 24 hours to $42,701 at 3:56 p.m. ET, according to The Block's Price Page.\n\nCoinShares Head of Research James Butterfill suggested that as financial institutions increasingly participate in the market through multiple spot bitcoin ETFs, bitcoin will become more responsive to interest rate decisions.\n\n\"Bitcoin prices have realigned with futures market interest rate expectations, suggesting that bitcoin will become more responsive to interest rate sensitive macro data, such as payrolls and CPI, especially as the excitement surrounding ETFs diminishes,\" Butterfill told The Block.\n\n(Updates with bitcoin price data.)"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMzEvYml0Y29pbi1kaXBzLXRvLTQyNGstYXMtZmVkcy1wb3dlbGwtcG91cnMtY29sZC13YXRlci1vbi1tYXJjaC1yYXRlLWN1dC_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzMxL2JpdGNvaW4tZGlwcy10by00MjRrLWFzLWZlZHMtcG93ZWxsLXBvdXJzLWNvbGQtd2F0ZXItb24tbWFyY2gtcmF0ZS1jdXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Dips to $42.4K as Fed's Powell Pours Cold Water on March Rate Cut - CoinDesk",
        "content": "Ruslan Lienkha, chief of markets at Web3 fintech platform YouHodler, said that \"any possible hawkish rhetoric about the longer-than-expected time of high rates may trigger a correction in the stock market and as a consequence, capital outflow from risk assets such as bitcoin.\""
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2dlcm1hbi1wb2xpY2UtYml0Y29pbi1zZWl6dXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Unprecedented $2.1B bitcoin seizure in Germany linked to online piracy group - Blockworks",
        "content": "Police in Germany seized nearly 50,000 bitcoin worth roughly $2.1 billion.\n\nThe authorities alleged that the bitcoin is tied to a piracy site that violated the Copyright Act back in 2013. According to a police statement, a German and Polish man were found responsible for the alleged money laundering and reportedly bought bitcoin with the proceeds.\n\nThe Tuesday statement marks the largest bitcoin seizure by German authorities.\n\nThe future of the assets remain uncertain, though the police statement clarified that a suspect “voluntarily transferred them to official wallets provided by the BKA.”\n\n“A final decision has not yet been made about the utilization,” the statement said.\n\nRead more: SEC settles with ‘Bitcoin Beautee’ over $1.7B HyperFund scheme\n\nHowever, authorities said they would not be providing more information until they complete the investigation. No charges have yet been filed against the men. Bitcoin (BTC), as of Tuesday morning, was trading above $43,000.\n\nWhile the United States leads in global Bitcoin node count with 28%, Germany is not far behind with over 13% of global nodes, according to Bitnodes. From a regulatory standpoint, it has become more crypto-friendly over the last few years, with some of its biggest banks seeking crypto-custody licenses.\n\nGermany granted a crypto custody license to Commerzbank in November, making it the first “full-service bank” to receive such a license.\n\nDeutsche Bank’s Paul Maley told Blockworks last September that it was interested in offering corporate and institutional clients custody of “selected cryptocurrencies and some stablecoins.”\n\nThe bank applied for a crypto custody license back in June of last year.\n\nUpdated Jan. 39, 2024 at 11:07 am ET: Modified headline to reflect value of bitcoin seizure.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzMwL2dlcm1hbi1wb2xpY2Utc2VpemUtMjFiLXdvcnRoLW9mLWJpdGNvaW4taW4tcGlyYWN5LXN0aW5nL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzMwL2dlcm1hbi1wb2xpY2Utc2VpemUtMjFiLXdvcnRoLW9mLWJpdGNvaW4taW4tcGlyYWN5LXN0aW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "German Police Seize $2.1B Worth of Bitcoin in Piracy Sting - CoinDesk",
        "content": "In 2023, the U.S. government seized $216 million worth of bitcoin linked to Silk Road, a dark net market that was taken down in 2013. The U.S. government now holds $9.5 billion worth of bitcoin, according to Arkham data."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyNC8wMS8zMC93aHktcGVvcGxlLXN0aWxsLXRoaW5rLWJpdGNvaW4td2lsbC1kaWUv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDI0LzAxLzMwL3doeS1wZW9wbGUtc3RpbGwtdGhpbmstYml0Y29pbi13aWxsLWRpZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Why People Still Think Bitcoin Will Die - CoinDesk",
        "content": "That might be because it’s too abstract an idea. What is the tangible benefit to him? He has dollars and they work, more or less. While he might not be happy with his government, he accepts its monetary system. To ponder the bigger question of how a censorship-resistant, depoliticized form of value exchange can underpin the sovereignty of human beings on a global scale that transcends nation-states’ systems of dependency is just not meaningful to his day-to-day existence."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMzAvYml0Y29pbi1wcmljZS1uZWFycy00NGstYXMtZXRmcy1zZWUtbmV0LWluZmxvd3MtZm9yLWZpcnN0LXRpbWUtaW4tYS13ZWVrL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMzAvYml0Y29pbi1wcmljZS1uZWFycy00NGstYXMtZXRmcy1zZWUtbmV0LWluZmxvd3MtZm9yLWZpcnN0LXRpbWUtaW4tYS13ZWVrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price Nears $44K as ETFs See Net Inflows for First Time in a Week - CoinDesk",
        "content": "Outflows at GBTC have continuously slowed since the launch of the ETFs. The fund saw an average of $470 million in money exiting in the first six days after the spot ETFs began trading. On Monday, that number slid to $192 million, according to research firm BitMEX ."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDIvMDEvYXJrLWludmVzdC1zYXlzLW9wdGltYWwtYml0Y29pbi1wb3J0Zm9saW8tYWxsb2NhdGlvbi1mb3ItMjAyMy13YXMtMTk0L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDIvMDEvYXJrLWludmVzdC1zYXlzLW9wdGltYWwtYml0Y29pbi1wb3J0Zm9saW8tYWxsb2NhdGlvbi1mb3ItMjAyMy13YXMtMTk0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "ARK Invest Says Optimal Bitcoin Portfolio Allocation for 2023 Was 19.4% - CoinDesk",
        "content": "The ARK report also notes that most of the 2022-2023 crypto winter crises have come to a close. FTX recently announced that it plans to fully re-pay creditors, while Celsius will be distributing $3 billion and equity allocation in a new venture as part of its bankruptcy resolution."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDIvMDEvaXQtbWF5LWJlLXRpbWUtZm9yLWJpdGNvaW4tdHJhZGVycy10by1mb2N1cy1vbi1qb2huLWJvbGxpbmdlcnMtcHJpY2UtYmFuZHMtYWdhaW4v0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDIvMDEvaXQtbWF5LWJlLXRpbWUtZm9yLWJpdGNvaW4tdHJhZGVycy10by1mb2N1cy1vbi1qb2huLWJvbGxpbmdlcnMtcHJpY2UtYmFuZHMtYWdhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "It May Be Time for Bitcoin Traders to Focus on John Bollinger's Price Bands Again - CoinDesk",
        "content": "Though the latest bandwidth pattern resembles developments before previous bull runs, the indicator, by itself, only signals that a major price move is due but doesn't tell us anything about the direction."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTMxL2JpdGNvaW4tYnRjLWZ1dHVyZXMtZGVtYW5kLWNvb2xzLWFzLWV0Zi1lcmEtY2xvc2VzLWdidGMtYXJiLXRyYWRl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Futures Demand Cools as Spot ETF Era Concludes Key Arb Trade - Bloomberg",
        "content": "Demand for Bitcoin futures has eased following the US debut of exchange-traded funds that directly hold the largest digital asset, an initial indication of how the products can impact crypto trading trends.\n\nOutstanding contracts — or open interest — for CME Group Bitcoin futures dropped some 24% to 20,679 by Jan. 30 after the 10 spot ETFs began trading three weeks ago, data compiled by Bloomberg show. Open interest had been at a record in the wake of Bitcoin’s 157% surge last year in anticipation of the ETFs."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmZyYW5jZTI0LmNvbS9lbi9saXZlLW5ld3MvMjAyNDAxMzEtd2FpdGluZy1vdXQtYnVrZWxlLXMtYml0Y29pbi1jaXR5LW9uLWEtc2FsdmFkb3Jhbi1iZWFjaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Waiting out Bukele's 'Bitcoin City' on a Salvadoran beach - FRANCE 24 English",
        "content": "Conchagua (El Salvador) (AFP) – When President Nayib Bukele announced plans to create the world's first \"Bitcoin City,\" a futuristic metropolis financed by cryptocurrency bonds, American Corbin Keegan packed up his life in Chicago and headed for El Salvador.\n\nAdvertising Read more\n\nMore than two years later, no brick has been laid, and 42-year-old Keegan ekes out a living in Playa Blanca, a coastal town in the Conchagua municipality named after the nearby volcano meant to power the new city of which he hopes to be the first resident.\n\n\"It's going to happen. So I'm staying,\" he told AFP, sitting in a hammock and sipping coffee as waves crashed on the beach a few meters away.\n\n\"I'll wait as long as it takes.\"\n\nTo fireworks and fanfare, Bukele announced in November 2021 that his \"Bitcoin City\" would boast everything from residential and commercial areas to museums, an airport and a monument to the currency on its central square.\n\nBukele said geothermal energy generated by the Conchagua volcano would power the city some 200 kilometers (125 miles) east of the capital San Salvador.\n\nIt would also power bitcoin mining -- the massively energy-consuming process by which bitcoin is created using supercomputers that solve complex mathematical problems.\n\nEl Salvador President Nayib Bukele announced in November 2021 that his 'Bitcoin City' would boast everything from residential and commercial areas to a monument to the currency © Marvin RECINOS / AFP\n\nThe president's announcement came just two months after El Salvador became the first country in the world to adopt bitcoin as legal tender despite a chorus of warnings about the currency's notorious volatility.\n\nIn September 2021, bitcoin traded at about $45,000 and a few months later it reached a record $68,000. But it later dipped to a low of about $16,000 and is today again hovering around $40,000.\n\n'It cannot be stopped'\n\nBukele had promised the issuing of $1 billion in bitcoin bonds, partly to finance his city. But that did not happen.\n\nThe government has invested an undisclosed amount of taxpayer money in the cryptocurrency -- vowing at one point it would buy a bitcoin a day -- though it is not known whether this has come to pass.\n\nA poll by the Central American University found that hardly anyone used bitcoin last year in El Salvador, where the other legal tender is the US dollar.\n\nAccording to the UN, more than a quarter of Salvadorans live in poverty, while the US State Department has warned the country's public debt was \"on an unsustainable path.\"\n\nPresident Nayib Bukele's bitcoin gambit is widely thought to have failed © MARVIN RECINOS / AFP\n\nBukele had promoted the move to bitcoin as a way to bring more Salvadorans, most of them lacking bank accounts, into the formal economy -- including through the receipt of remittances from abroad, a major contributor to GDP.\n\nThe change meant that every Salvadoran business -- even neighborhood shopkeepers -- had to accept the cryptocurrency as payment.\n\nBut the IMF and World Bank warned that quite apart from currency volatility, the move could leave the country vulnerable to money laundering and other illicit activity that could in turn affect underlying stability.\n\nDespite his crypto gambit widely seen as a failure -- at least for now -- Bukele remains immensely popular ahead of presidential elections on Sunday.\n\nPolls show his approval ratings hovering around 90 percent, thanks largely to a crackdown on criminal gangs.\n\nHis actions are credited with vastly improving the daily life of crime- and violence-fatigued citizens, but also criticized for human rights violations.\n\nKeegan said people told him he was \"crazy\" when he predicted a decade ago that one day a country would adopt bitcoin as tender.\n\nWhen bitcoiner Corbin Keegan needs money, he rides his rickety motorcycle to the city of Conchagua to draw money from an ATM that disperses bitcoin and dollars © Marvin RECINOS / AFP\n\nWhat he did not know at the time was that the country would be El Salvador, and that it would take him to a new life in Central America.\n\nIn Playa Blanca, nobody uses crypto.\n\nWhen Keegan needs money, he rides his rickety motorcycle to the city of Conchagua about 20 kilometers away to draw money from an ATM that disperses bitcoin and dollars.\n\nWhile he waits for the new city to arise, the self-described jack of all trades fishes and does odd jobs for neighbors who fondly call him \"El Gringo.\"\n\nKeegan would not disclose how much he had invested in bitcoin, but remains convinced that crypto is \"the future. It cannot be stopped.\"\n\n© 2024 AFP"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTMwL2JpdGNvaW4tYnRjLXNldC1mb3Itd2lubmluZy1zdHJlYWstbGFzdC1zZWVuLWJlZm9yZS1yZWNvcmQtaGlnaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Heads Toward Winning Streak Last Seen in Pandemic Before Record High - Bloomberg",
        "content": "Bitcoin is on course to advance for a fifth straight month in what would be the token’s longest such winning streak since a pandemic-era rally oiled by easy money.\n\nThe largest digital asset has risen about 2% in January, a month of pronounced swings sparked by the rollout of the first US spot Bitcoin exchanged-traded funds and shifting views on the outlook for monetary policy."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8zMS91ay1wb2xpY2Utc2VpemUtbmVhcmx5LTE4Yi1vZi1iaXRjb2luLWZyb20taW52ZXN0bWVudC1mcmF1ZC1pbi1jaGluYS1mdC_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjQvMDEvMzEvdWstcG9saWNlLXNlaXplLW5lYXJseS0xOGItb2YtYml0Y29pbi1mcm9tLWludmVzdG1lbnQtZnJhdWQtaW4tY2hpbmEtZnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "UK Police Seize Nearly $1.8B of Bitcoin From Investment Fraud in China: FT - CoinDesk",
        "content": "Zhang stole roughly 5 billion pounds from more than 128,000 investors, which she then converted into bitcoin. She has since fled and is currently on the run, Southwark Crown Court in London heard."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzMwL3NvbC1hdmF4LWxlYWQtY3J5cHRvLW1hcmtldC1yZWNvdmVyeS1iaXRjb2luLXRvcHMtNTAtZGF5LWF2ZXJhZ2UtYmVmb3JlLWZlZC1tZWV0aW5nL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzMwL3NvbC1hdmF4LWxlYWQtY3J5cHRvLW1hcmtldC1yZWNvdmVyeS1iaXRjb2luLXRvcHMtNTAtZGF5LWF2ZXJhZ2UtYmVmb3JlLWZlZC1tZWV0aW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "SOL, AVAX Lead Crypto-Market Recovery, Bitcoin Tops 50-Day Average Before Fed Meeting - CoinDesk",
        "content": "The central bank is likely to keep the benchmark borrowing cost between 5.25% and 5.5%, with markets now anticipating a first rate cut in May instead of the previously expected March."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy50aGVibG9jay5jby9wb3N0LzI3NTI0MC9ibGFja3JvY2stYW5kLWZpZGVsaXR5LXNwb3QtYml0Y29pbi1ldGZzLWFyZS1vbi10cmFjay10by1vdXRwYWNlLWdyYXlzY2FsZS1pbi1kYWlseS10cmFkaW5nLXZvbHVtZS1mb3ItZmlyc3QtdGltZdIBmQFodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzUyNDAvYmxhY2tyb2NrLWFuZC1maWRlbGl0eS1zcG90LWJpdGNvaW4tZXRmcy1hcmUtb24tdHJhY2stdG8tb3V0cGFjZS1ncmF5c2NhbGUtaW4tZGFpbHktdHJhZGluZy12b2x1bWUtZm9yLWZpcnN0LXRpbWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "BlackRock and Fidelity spot bitcoin ETFs close in on Grayscale in daily trading volume - The Block",
        "content": "After several days in a row of dominance, it appeared for a time on Tuesday that BlackRock and Fidelity spot bitcoin ETFs might surpass Grayscale's fund in terms of daily volume for the first time since the products began trading more than two weeks ago.\n\nGrayscale's fund, a conversion rather than a brand new product, has shed billions of dollars after starting with more than $25 billion in assets under management. In terms of total trading volume — buying and selling — the BlackRock and Fidelity new spot bitcoin ETFs have been ranking second and third behind Grayscale.\n\nAs market close on Tuesday, BlackRock and Fidelity had generated, according to Yahoo Finance data compiled by The Block, $383 million and $288 million in trading volume, respectively. Grayscale ranked first again with $396 million.\n\nAround the midway point on Tuesday, BlackRock and Fidelity both led Grayscale in terms of daily volume.\n\nSince trading began this month, the three issuers have dominated total trading volume, accounting for, at times, about 90% of all buying and selling activity. Other spot bitcoin ETFs like those offered by Invesco and Galaxy, Franklin Templeton and Ark Invest have trailed far behind the top three.\n\nTotal daily trading volume for Tuesday was about $1.2 billion, according to Yahoo Finance data compiled by The Block.\n\nRELATED INDICES See crypto indices\n\nSo far, Grayscale's ETF has lost more than $5 billion in assets under management, according to Bloomberg Intelligence ETF analyst James Seyffart. Both BlackRock and Fidelity's products are net positive by more than $2 billion.\n\nTotal spot bitcoin ETF volume nears $27 billion\n\nIn what may be an effort to gain a competitive edge, Invesco and Galaxy Asset Management on Monday announced in a filing that the firms intend to cut their fund's fee from 0.39% to to 0.25%, which will put them on par with most rivals.\n\nTotal trading volume for all of the active spot bitcoin ETFs is nearing $27 billion, also according to Seyffart's post on Tuesday. Many market watchers and crypto enthusiasts have heralded the billions of dollars of money flowing into the new ETFs as a positive development for digital assets."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjQvMDEvMzEvZ3JheXNjYWxlLWJpdGNvaW4tZXRmcy1nYnRjLWJpbGxpb25zL9IBT2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjQvMDEvMzEvZ3JheXNjYWxlLWJpdGNvaW4tZXRmcy1nYnRjLWJpbGxpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Grayscale ‘fought the law and won’ to help get Bitcoin ETFs approved. So why did billions of dollars pour out of GBTC? - Fortune",
        "content": "Grayscale’s victory against the Securities and Exchange Commission ushered in a watershed moment for crypto.\n\n“They fought the law and won,” Eric Balchunas, Bloomberg’s ETF analyst, told Fortune. “You have to give them credit and tip your hat.”\n\nWhen the SEC repeatedly denied Grayscale’s application to convert its closed-end trust into a spot exchange-traded fund, the asset manager fought back. But since the much anticipated Jan. 11 approval, Grayscale’s trust-turned-fund, GBTC, has seen outflows of over $5.2 billion, according to Bloomberg data.\n\nBy freeing up investors to redeem their shares, it unleashed staggering outflows, leading some analysts to speculate whether Grayscale could be the architect of its own downfall.\n\nUnderstanding the outflows\n\nStarting in 2013 as a closed-end trust fund, GBTC was the only real option to trade Bitcoin on the stock market, for which investors paid a premium. But since February 2021, it has traded at a deep discount, hitting record lows of almost 50% in December 2022. Investors had been locked into the trust, while they watched GBTC’s discount on the underlying asset, Bitcoin, widen, Bloomberg ETF analyst James Seyffart told Fortune.\n\nThat was the case until Jan. 11.\n\nExperts told Fortune the outflows so far typically have fallen into three categories: investors wanting to jump ship for lower fees; sales by FTX; and investors who were betting on the SEC approving spot Bitcoin ETFs.\n\nThe Bitcoin ETFs are engaged in a fierce race to the bottom on rates, a competition in which Grayscale has no interest.\n\nAt 1.5%, GBTC charges the highest fee among peers, whereas competitors have all kept fees below 0.3%, according to Bloomberg data. Both Seyffart and Balchunas estimate that a third of the outflows belong to investors seeking lower fees, and lightly held GBTC in their IRAs, and thus aren’t subject to capital gains taxes. (This also could mean about a third of outflows have been reinvested into competing ETFs.)\n\nMeanwhile, the analysts also attribute outflows to FTX liquidating its GBTC holdings as part of the firm’s bankruptcy proceedings. FTX has sold 22.28 million shares—worth roughly $1 billion—to eliminate its GBTC position, CoinDesk reported.\n\nThe third category of sellers, Seyffart and Balchunas explained, likely have been typical “buy the rumor, sell the news” investors. “They were using GBTC to bet on a Bitcoin ETF approval,” says Seyffart. “They were just basically betting on the discount collapsing.”\n\nA Grayscale spokeswoman told Fortune that GBTC will continue to provide investors and capital market allocators with “credible, confident, and regulated” exposure to Bitcoin, and remains the “backbone” of the ETF market.\n\n‘Playing the waiting game’\n\nBut outflows haven’t yet dislodged Grayscale’s market dominance. With assets of over $21 billion, GBTC still represents the lion’s share of the total Bitcoin ETF value of about $27.2 billion. This leaves the 10 further funds that have joined the so-called Cointucky Derby since the approval trailing. Meanwhile, digital asset manager CoinShares reported on Monday that outflows may be beginning to slow.\n\nDuring the first two weeks of trading, the daily outflow average was approximately $530 million, whereas it has been reducing since Thursday, falling to $191 million on Monday—the lowest since trading began.\n\n“In my opinion, last week was the last with strong outflow,” said Matteo Greco, a crypto analyst at Fineqia. But he also said fresh inflows to GBTC are unlikely. “For new customers, it’s not really sensible, because they have much, much less-expensive options.”\n\nThe remaining GBTC likely belongs to non-IRA investors who are planning on staying put, analysts said, because redeeming those shares would be a taxable event. The 20% tax on large gains accumulated since the trust’s formation will trump the 1.5% annual fee. “The math is gonna favor staying,” says Balchunas.\n\n“They’re probably just playing the game of ‘Let me just wait this thing out’ for two or three years, until that calculation on the spreadsheet at DCG [Digital Currency Group] flips, and they reduce the price,” says Swan CEO Cory Klippsten, hinting at a fee cut in the next few years. “I think a lot of people are just playing the waiting game.”"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc1MjEyL2JpdGNvaW5zLXByaWNlLWNvbnRpbnVlcy1hYm92ZS00MzAwMC1hcy1sb25nLXRlcm0taG9sZGVycy1yZW1haW4tc3RlYWRmYXN00gFyaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjc1MjEyL2JpdGNvaW5zLXByaWNlLWNvbnRpbnVlcy1hYm92ZS00MzAwMC1hcy1sb25nLXRlcm0taG9sZGVycy1yZW1haW4tc3RlYWRmYXN0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's price continues above $43,000 as long-term holders 'remain steadfast' - The Block",
        "content": "Bitcoin BTC -6.86% 's price continued to trade above $43,000 on Tuesday as it continued a rally that's pushed the digital asset up more than 10% over the past week.\n\nThe largest digital asset by market capitalization has increased by over 0.5% in the past 24 hours and was changing hands for $43,507 at 12:00 p.m. ET, according to The Block data.\n\nThe majority of long-term bitcoin investors remain unwilling to part with their coins at current prices, according to Glassnode analysts.\n\nGlassnode's market report released on Tuesday stated that the vast majority of bitcoin holders, \"appear to be calmly riding the market waves.\"\n\nIn reference to the bitcoin supply last active metric, which measures the proportion of the circulating supply of BTC held for multi-year time horizons, the analysts said \"the vast majority of the bitcoin holder base remains steadfast, with the percentage of held supply across multiple age bands residing just below all-time highs.\"\n\n\"The dominant majority of the supply remains tightly held, arguably waiting for higher spot prices, or perhaps increased volatility as a motivator to spend,\" the report added.\n\nHowever, the analysts referred to sell pressure in the one -and two-year holder cohort. \"Many of these, but not all, are associated with GBTC, this indicates that a non-trivial volume of older supply has been on the move in recent weeks,\" the analysts added.\n\nRELATED INDICES See crypto indices\n\nETF flows driving trading volume uptick\n\nAccording to Tuesday's K33 Market Research report, bitcoin spot trading volume has reached \"persistently higher activity following the ETF approvals.\"\n\nThe report added that the increased trading volume is likely partially attributed to spot bitcoin ETF flows. \"Nonetheless, a substantial portion of ETF flows are likely netted between other OTC orders without touching spot market order books,\" the K33 analysts added.\n\nAccording to The Block's Data Dashboard, bitcoin's monthly on-chain transaction volume for January was a multi-month high. Trading volume for January stands at $1.11 trillion, with almost two days still left in the month. Bitcoin on-chain volume has been climbing steadily since September 2023."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tdXAtc3RvY2tzLWV0aGVyLWRvd27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin floating above $43k as Fed decision looms - Blockworks",
        "content": "Tuesday witnessed a modest decline in equities as investors navigated market uncertainties influenced by the anticipation of big tech earnings and cautious signals from Federal Reserve officials.\n\nMeanwhile, cryptocurrencies presented a mixed picture, amidst a week packed with key earnings reports and the looming Federal Reserve decision on interest rates set for Wednesday.\n\nBitcoin bounced modestly Tuesday, hovering around $43,500 after dipping below the $40,000 level late last week. Ether traded sideways Tuesday morning, but both cryptocurrencies were able to maintain their recovery path after a disappointing few weeks.\n\nBitcoin (BTC) is now up around 3.3% over the month and ether (ETH) has gained 1% in the same time period. Analysts are growing cautiously optimistic that upcoming tailwinds will propel bitcoin higher.\n\n“Will bitcoin hit a $20,000 bottom this year, as some analysts and — notably — Deutsche Bank’s recent survey predicts? I would say unlikely,” Lucas Kiely, chief investment officer of digital wealth platform Yield App, said. “The big story this year is about crypto maturing into a stable market that combines the benefits of DeFi with best practice from [traditional finance].”\n\nRead more: SEC officially approves spot bitcoin ETFs in landmark decision\n\nThe latest Job Openings and Labor Turnover Survey (JOLTS) data, released after the open Tuesday, showed there were an estimated 9.026 million job openings in December, a slight increase from November and higher than analysts had anticipated.\n\nAfter clocking record highs on Monday, the S&P 500 and Dow Jones Industrial Average slipped at the open on Tuesday, losing 0.1% each. The Nasdaq Composite also dipped, falling 0.4% in the first hour of trading.\n\nMonday’s equity rally, analysts say, is largely thanks to a late-afternoon Treasury announcement that quarterly borrowing estimate by roughly $56 billion.\n\n“We know that was the key positive catalyst because stocks accelerated the rally during the final hour and sectors that benefit most from falling yields (small caps and tech) outperformed,” Tom Essaye, founder of Sevens Report Research, said. “Specifically, the Treasury only needs to borrow $760 billion in Q1 compared to the previously estimated $816 billion.”\n\nThe Federal Open Market Committee will wrap its two-day policy-setting meeting Wednesday and futures markets Tuesday morning showed there is an overwhelming expectation that rates will stay where they are. Future market moves will depend on Chair Jerome Powell’s comments and the statement from the Committee, Essaye said.\n\n“There’s virtually zero chance of a rate cut at tomorrow’s meeting,” he added. “What will make this meeting hawkish or dovish (and push stocks lower or extend the rally) will be whether the Fed hints that rate cuts are coming soon.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMzAvdGFwcm9vdC13aXphcmRzLWRlbGF5cy1xdWFudHVtLWNhdHMtc2FsZS1mb3ItMm5kLXRpbWUtYWZ0ZXItbWVzc3ktYml0Y29pbi1uZnQtZGVidXQv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMzAvdGFwcm9vdC13aXphcmRzLWRlbGF5cy1xdWFudHVtLWNhdHMtc2FsZS1mb3ItMm5kLXRpbWUtYWZ0ZXItbWVzc3ktYml0Y29pbi1uZnQtZGVidXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Taproot Wizards Delays 'Quantum Cats' Sale for 2nd Time, After Messy Bitcoin NFT Debut - CoinDesk",
        "content": "\"We tried to build a custom, unique minting experience that solves issues like fee/gas wars, mempool sniping, etc, and gives everyone an instant guaranteed mint,\" Wertheimer added. \"It was new and innovative, but needless to say, it did not work out as well as we expected.\""
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzMxL2dsb2JhbC14LXB1bGxzLW91dC1vZi1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbi_SAV9odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8zMS9nbG9iYWwteC1wdWxscy1vdXQtb2YtYml0Y29pbi1ldGYtYXBwbGljYXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Global X Pulls Out of Spot Bitcoin ETF Application - CoinDesk",
        "content": "Overall, the ETFs have brought in nearly $250 million in capital. This number is significantly lower than BlackRock and Fidelity’s flows because of the continuing high outflows out of Grayscale Bitcoin Trust (GBTC). The fund has seen nearly $5.4 billion in outflows since its launch."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyNC8wMS8zMS90aW1lLXRvLWVuZC1jcmFpZy13cmlnaHRzLWhhcmFzc21lbnQtY2FtcGFpZ24tYWdhaW5zdC1iaXRjb2luLWRldnMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDI0LzAxLzMxL3RpbWUtdG8tZW5kLWNyYWlnLXdyaWdodHMtaGFyYXNzbWVudC1jYW1wYWlnbi1hZ2FpbnN0LWJpdGNvaW4tZGV2cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Time to End Craig Wright’s Harassment Campaign Against Bitcoin Devs - CoinDesk",
        "content": "Next week, starting Feb. 5, this case will finally go to trial. But the trial is about much more than just debunking Wright's delusions of grandeur. COPA is committed to stand up to bullies like Wright whose intention has been to “personally hunt every dev[eloper] until they are broke, bankrupt and alone.” It is time to put an end to his campaign against the heart of our industry, and set the record straight that Wright is not Satoshi and therefore can’t stall progress with false IP claims."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9ibGFja3JvY2stYW5kLWZpZGVsaXR5LWF0dHJhY3QtYmlsbGlvbnMtd29ydGgtb2YtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "BlackRock and Fidelity inch closer to becoming two largest Bitcoin holders as ETFs gobble up $5bn - DLNews",
        "content": "BlackRock and Fidelity have lead the charge among several new spot Bitcoin ETF providers.\n\nGrayscale’s GBTC product experienced billions in outflows, due to profit-taking and fee competition.\n\nBlackRock and Fidelity are leading the charge on spot Bitcoin exchange-traded funds, and are fast becoming two of the most prominent holders.\n\nThe two asset managers have attracted $2.7 billion and $2.3 billion to their spot Bitcoin exchange-traded funds, respectively, since January 11.\n\nThe total Bitcoin held on behalf of investors by these two firms has reached a combined total of over 100,000, representing about 0.5% of the total 21 million Bitcoin supply that can ever be minted.\n\nBy comparison, business intelligence firm MicroStrategy, the world’s largest private Bitcoin holder, holds 189,150 Bitcoin with it acquired for an aggregate price of around $6 billion.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nThe explosive growth over the past two weeks poses issues for Grasycale, the crypto native digital asset manager.\n\nGrayscale’s flagship fund, the Grayscale Bitcoin Trust, paved the path for spot Bitcoin ETF approval in the US, but could lose out to traditional competitors in the long run.\n\nGrayscale holds around 492,000 Bitcoin, or $21.4 billion, on behalf of its investors, making it the largest spot ETF by far.\n\nIts higher fee model and long list of creditors have seen investors flock to newer offerings like BlackRock or Fidelity.\n\nJoin the community to get our latest stories and updates\n\nThis, as well as investors taking profits has resulted in over $5.4 billion in outflows.\n\nBlackRock’s ETF is seeing activity beyond investors reallocating from GBTC though, according to Bloomberg Intelligence ETF analyst, James Seyffart.\n\nDay 13 #Bitcoin ETF Cointucky Derby update. Net inflows of over $247 million. Still had -$221 million pulled from $GBTC though. $IBIT almost traded as much as $GBTC yesterday. pic.twitter.com/EOu2EXx3cD — James Seyffart (@JSeyff) January 31, 2024\n\nCombined all 10 Bitcoin ETFs in the US account for just over 3% of the current Bitcoin supply, Hildobby, a data specialist at crypto venture fund Dragonfly, said on X.\n\nAs Bitcoin’s price stabilises and Grayscale’s outflows slow, the competition for investors is bound to intensify in the coming weeks.\n\nInvesco and Galaxy digital made an early play to entice fresh interest this week, dropping their management fee to 0.25% from 0.39% on Tuesday.\n\nTyler Pearson is a junior markets correspondent at DL News. Got a hot tip? Reach out to him at ty@dlnews.com."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm1pbnR6LmNvbS9pbnNpZ2h0cy1jZW50ZXIvbmV3cy1wcmVzcy80MDFrLXBsYW4tc3BvbnNvcnMtbXVzdC1iZS13YXJ5LWZpZHVjaWFyeS1saWFiaWxpdHktYXNzb2NpYXRlZC1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "401k Plan Sponsors Must Be Wary Of Fiduciary Liability Associated With Bitcoin ETFs - Mintz",
        "content": "Fiduciary News spoke to Of Counsel Michelle Capezza on the impact of the SEC’s approval of the creation of Bitcoin ETFs on 401k plan sponsors.\n\nMichelle said, “Plan sponsors and fiduciaries that seek to offer access to bitcoin ETFs or other cryptocurrency investments through their retirement plans must be extremely diligent in their diligence, decision-making and monitoring processes, and prepare for heightened scrutiny of their decisions. SEC Chair Gary Gensler noted in his January 10, 2024 Statement that while the listing and trading of certain spot bitcoin exchange-traded product shares were approved, bitcoin was not approved or endorsed and investors should remain cautious about the risks associated with bitcoin and products whose value is tied to cryptocurrencies.”\n\nSource\n\nFiduciary News"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3QvYml0Y29pbi1yZWNvdmVycy1hcy1ncmF5c2NhbGUtZXRmLW91dGZsb3dzLWVhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's losing streak is over as Grayscale ETF outflows fall below $200m - DLNews",
        "content": "Bitcoin’s price has risen in the past five days after an earlier January slump.\n\nGrayscale outflows are showing signs of slowing down, predicted by some analysts to lessen the pressure from Bitcoin selling.\n\nBitcoin is bouncing back from a price slump this month, as the biggest driving force behind the cryptocurrency’s price decline — outflows from Grayscale’s Bitcoin Trust — is decelerating.\n\nBitcoin recovers\n\nAfter falling about 20% from its $49,000 high earlier in January, Bitcoin has climbed 10% over the past five days.\n\nSince January 25, the world’s leading cryptocurrency has increased from $39,900 to about $43,400.\n\nThe recent slump has been linked to shifting market dynamics following the approval of 11 US spot Bitcoin exchange-traded funds.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nGrayscale’s GBTC is the largest of the approved offerings, with $20.8 billion in assets under management.\n\nAnalysts say factors including forced selling linked to the FTX estate and profitable investor strategies linked to GBTC’s discount over the past two years have been big drivers of outflows.\n\nThose outflows — combined with overall bearish macroeconomic outlooks — have hit Bitcoin’s price. Grayscale’s ETF has seen about $5 billion in outflows since its launch on January 11.\n\nOn January 23, they peaked at $640 million a day.\n\nJoin the community to get our latest stories and updates\n\nNow, Grayscale is averaging nearly $500 million daily, according to crypto analytics firm Kaiko. That’s a 22% drop.\n\n“The good news is that trade volumes and outflows have showed signs of slowing, providing much-needed support” for Bitcoin, Kaiko analysts wrote. “While GBTC outflows have been expected and are partly compensated by inflows into the other newly launched spot ETFs, the impact on sentiment has been significant.”\n\nGBTC Trade Volume and Outflows from Kaiko GBTC Trade Volume and Outflows from Kaiko (Kaiko/Kaiko)\n\nHowever, Bloomberg analyst James Seyffart noted that daily GBTC outflows had dropped to $191.7 million on Monday.\n\nGBTC outflows have been partially offset by inflows into newly launched spot ETFs.\n\nTotal inflows to the newly issued US Bitcoin ETFs, meanwhile, swelled to $1.8 billion, according to data from digital asset manager CoinSshares.\n\nDownward pressure\n\nA lessening of GBTC’s outflows would ease the “downward pressure” on Bitcoin’s price, JPMorgan said last week.\n\nAlthough Seyffart had a more nuanced take.\n\n“ETFs aren’t THE market themselves,” Seyffart tweeted. “Yes they’re now a big slice of the pie but there’s a lot more to the pie. Bitcoin ETF inflows can coincide with falling Bitcoin prices. Outflows can coincide with rising prices.”\n\nThe rotation of funds from GBTC to newly issued ETFs raises questions about the nature of these inflows, whether they represent fresh capital entering the market or merely a shift between investment products, Kaiko said.\n\nA clearer picture is expected to form in the coming months as the funds mature, and as market makers show signs of entering.\n\nCrypto market movers\n\nBitcoin is up 3.09% in the last 24 hours, trading at $43,503.\n\nEthereum is up 2% in the same period, at $2,311.\n\nAvalanche and Solana are down 6.1% and 8.8%, respectively.\n\nWhat we’re reading\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com.\n\nThis story has been updated to reflect that the average daily pace of GBTC outflows was $500 million, according to Kaiko’s estimates and to show that it has now dropped below $200 million, per Seyffart’s numbers."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMzEvaG93LXRoZS1sYXVuY2gtb2Ytc3BvdC1ldGZzLWNvdWxkLWRhbXBlbi1iaXRjb2lucy12b2xhdGlsaXR5L9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMzEvaG93LXRoZS1sYXVuY2gtb2Ytc3BvdC1ldGZzLWNvdWxkLWRhbXBlbi1iaXRjb2lucy12b2xhdGlsaXR5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "How the Launch of Spot ETFs Could Dampen Bitcoin’s Volatility - CoinDesk",
        "content": "Overall, the BTC options market should continue to increase in importance in 2024, even after the massive growth it posted last year . A more developed options market can yield lower volatility because it allows investors to express a broader range of investment strategies and make the most liquid ETFs even more liquid. It also expands the importance of events such as expirations and dealer positioning as price action drivers."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzMwL2ludmVzdG9ycy1hcmUtcG91cmluZy1iaWxsaW9ucy1pbnRvLXRoZXNlLTItYml0Y29pL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Investors Are Pouring Billions Into These 2 Bitcoin ETFs and Leaving the Rest Behind - The Motley Fool",
        "content": "The Securities and Exchange Commission (SEC) approved 11 new spot Bitcoin (BTC -4.97%) ETFs earlier this month; two stand out as clear winners among the group.\n\nThe iShares Bitcoin Trust (IBIT -5.82%) from Blackrock (BLK -2.08%) was the first to reach $1 billion in assets under management less than one week after its launch. The Fidelity Wise Origin Bitcoin Fund (FBTC -5.85%) followed close behind, reaching the milestone the next day. Two weeks into the start of trading of this new breed of Bitcoin ETFs, the two leaders account for about 70% of all inflows.\n\nIn other words, the market is showing a clear preference for the Bitcoin ETFs from Blackrock and Fidelity over the competition. Should you follow the wisdom of the crowd, or are there better options?\n\nWhy size matters in Bitcoin ETFs\n\nNeither Blackrock nor Fidelity offer the lowest fees among the new Bitcoin ETFs. That title belongs to the Bitwise Bitcoin ETF (NYSEMKT: BITB), which charges just 0.20% of assets under management. It's also waiving the fee for the first six months up to $1 billion in assets. But Blackrock and Fidelity are not too far behind, with expense ratios of 0.25% each. Both issuers are also offering generous fee waivers.\n\nImportantly, scale can play an important role in driving down costs for shareholders. Issuers can leverage certain operational expenses for an ETF, such as marketing spend. Additionally, bigger funds may be able to negotiate lower custodial fees for their Bitcoin holdings. (In the case of Fidelity, its crypto arm is handling the custody of the trust's holdings, so it has a lot of room to lower fees.) As a result, the biggest ETF issuers are often very competitive on price. Over time, both Blackrock and Fidelity may offer lower fees than the competition for their respective Bitcoin ETFs.\n\nBut size matters for another reason as well. More funds flowing into (and out of) an ETF means the shares are more liquid. That provides investors with tighter bid-ask spreads and helps the ETF price track the net asset value of the fund's holdings. Even if you're not an active trader, the ability to buy an ETF that tracks the actual underlying assets very closely can ensure you're not paying an unnecessary premium to invest in Bitcoin.\n\nShould you follow the crowd?\n\nIf I were to invest in a Bitcoin ETF, it would either be the Fidelity Wise Origin Bitcoin Fund or the iShares Bitcoin Trust. Not only do the two issuers have the factors of scale working in their favor, but they also have long track records of providing low-cost ETFs and mutual funds for traditional asset classes, like stocks, bonds, and real estate investment trusts.\n\nThe ETFs are particularly interesting for anyone looking to add Bitcoin exposure to a retirement account, such as an IRA. While it's possible to invest directly in cryptocurrency with a self-directed IRA, those plans are expensive and the process of opening an account can be cumbersome. The simplicity of an ETF that tracks Bitcoin is a great option for those investors, and I wouldn't hesitate to buy either the Blackrock or Fidelity fund in that situation.\n\nBut for those investing in a regular brokerage account, they might consider a direct investment in Bitcoin itself. Holding Bitcoin instead of an ETF has several advantages. For one, you can transfer it to a wallet you control and use it for purchases. Second, you won't pay any fees just for holding Bitcoin.\n\nThat said, there are costs to purchase and sell Bitcoin. And those costs can be substantial on certain cryptocurrency exchanges. If you want a small amount of Bitcoin or will be buying a small amount at a time, you may end up paying less in fees with an ETF, despite the expense ratio.\n\nBuying the actual cryptocurrency itself will be a great option for some, but many will be better off with an ETF. And if you're going to buy a Bitcoin ETF, the iShares Bitcoin Trust or Fidelity Wise Origin Bitcoin Fund are the most appealing options."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8zMC9maW50ZWNoLXByb3ZpZGVyLXBvcnRhbC1yYWlzZXMtMzRtLXNlZWQtcm91bmQtZm9yLWJpdGNvaW4tYmFzZWQtZGVjZW50cmFsaXplZC1leGNoYW5nZS_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjQvMDEvMzAvZmludGVjaC1wcm92aWRlci1wb3J0YWwtcmFpc2VzLTM0bS1zZWVkLXJvdW5kLWZvci1iaXRjb2luLWJhc2VkLWRlY2VudHJhbGl6ZWQtZXhjaGFuZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Fintech Provider Portal Raises $34M Seed Round for Bitcoin-Based Decentralized Exchange - CoinDesk",
        "content": "The healthy size of the funding round is an indicator both of the brightening prospects for raising capital in the crypto industry after a tough couple of years and the growing interest in the use of bitcoin in the decentralized finance (DeFi) world, which is otherwise dominated by altcoins like ether (ETH) and Solana (SOL)."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LndtYXIybmV3cy5jb20vbG9jYWwvYml0Y29pbi1iZWF1dGVlLW9mLXNldmVybmEtcGFyay1wbGVhZHMtZ3VpbHR5LWZvci1kdXBpbmctaW52ZXN0b3JzLWludG8tY3J5cHRvY3VycmVuY3ktc2NoZW1l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "“Bitcoin Beautee\" of Severna Park pleads guilty to duping investors into cryptocurrency scheme - wmar2news.com",
        "content": "BALTIMORE — A Severna Park woman, nicknamed “Bitcoin Beautee,” has pleaded guilty to federal wire fraud charges.\n\nBrenda Chunga is accused of advertising and promoting a phony online cryptocurrency investment company called HyperFund.\n\nProsecutors say the scheme was carried out between June 2020 and April 2022.\n\nHyperFund was co-founded by an Australian man named Sam Lee who lives in the United Arab Emirates.\n\nLee and Chunga, along with others, would allegedly talk clients into buying a HyperFund membership under the false premise of receiving daily returns on their investment.\n\nInvestors were duped into believing they would earn double or sometimes even triple the amount they put in.\n\nHyperFund lied claiming payouts would be generated from revenues of large-scale crypto mining operations, when in reality no such thing existed.\n\nIn all the feds say Lee, Chunga, and company defrauded their investors of approximately $1.89 billion.\n\nA chunk of Chunga's promotional work for HyperFund was conducted in Maryland. She admitted to personally making $3 million off the conspiracy.\n\nChunga faces up to five-years behind bars. Prosecutors are also seeking to reclaim all the money she received from the scheme."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pZ2h0LWRyb3AtMzAwMDAtdGhhdHMtb2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin might drop to $30000, but that's OK - Cointelegraph",
        "content": "Regardless of any short-term pullback, Bitcoin will spend this year further cementing its reputation as digital gold. Indeed, just as it did in March 2023 during a narrowly avoided banking crisis, BTC will likely hold up in ways many traditional assets — perhaps even gold — fail to.\n\nIt is true that the grand institutional entry into Bitcoin has not lit up the markets as some might have hoped, and it probably won’t for a while yet. Much of this event was already baked into prices and there are few investors that saw the SEC's reluctant capitulation as any kind of ringing endorsement of cryptocurrency.\n\nRelated: An Ethereum ETF is coming sooner than you expect\n\nNonetheless, BlackRock's ETF has already hoovered up $2 billion in assets as others follow fast in the rear, providing a level of support never before seen for the world’s biggest digital currency. The day is soon coming, infact, that we all reminisce about the good old days of BTC volatility.\n\nIn the meantime, though, we will almost certainly see a pullback in the face of global economic pressures. Chief among these is the resurgence of inflation in the US, which has dashed hopes for a rate cut before Q2, and which will likely continue to be exacerbated by rising tensions in the Middle East and an ongoing war in Europe.\n\nOn top of this, we have the end of the Bank Term Funding Program (BTFP) coming up on March 11. The saving grace of U.S. banks during last year’s almost-crisis, this may well reveal some further shaky foundations that could again spook markets into a significant sell-off.\n\nEven more significant than all this, though, we have a growing global sovereign debt pile. Now standing at $91 trillion, this stone around the neck of global economies is continuing to put pressure on fiat currencies and bond markets all over the world, with the IMF increasingly citing concerns about public debt sustainability.\n\nGlobal debt trend. Source: International Monetary Fund\n\nWhile Bitcoin may initially wobble with global markets in the face of these pressures, though, as a finite resource that is transparent, immutable and decentralized, its long-term concept value will continue to grow and this will support prices in the medium to long term. In-fact this year we could truly see Bitcoin become a North Star for the global economy — if not in exactly the way the Bitcoin maxis had hoped.\n\nUltimately, however, we are unlikely to see any major Black Swan economic events this year. Not only are we facing a presidential election in the U.S., but several others across the world — with seven out of 10 of the world’s most populous nations (equating to around half the global population) hitting the polls over the next 10 months.\n\nRelated: 3 bull market narratives for 2024 that you haven’t heard about yet\n\nAs such, while there isn’t the economic wriggle room to offer the rate cuts and huge spending sprees that many politicians might like, we can bank on policymakers pulling out all the stops to avert any kind of crisis — especially in the banking sector. In the U.S., we will see some new packages to support banks while the real estate market will also likely win some attention.\n\nAs such, we won’t see Bitcoin — or indeed any market — staying down for very long this year. Rather, after an initial pullback on global economic concerns and some reserved trading around sustained interest rates, we will — in my personal opinion — see BTC rebound and surpass $50,000 in the second quarter before taking off into the oncoming bull market.\n\nPrices and sentiment have been subdued for too long and risk appetite has returned to crypto, if not global markets at large. And if all those politicians want to win any votes, they will need to make sure that it stays that way.\n\nStefan Rust is the CEO of Truflation.com, which tracks real-time data across networks, markets, and feeds to provide financial and economic data on-chain. He served previously as the CEO of Bitcoin.com. He got into crypto in April 2012 before expanding his investment and advisory portfolio across the entire blockchain industry.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdGhlcmVjb3JkLm1lZGlhL2dlcm1hbi1wb2xpY2Utc2VpemUtYml0Y29pbi1waXJhdGVkLW1vdmllc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "German police seize $2.1 billion in crypto from pirated movie website operators - The Record from Recorded Future News",
        "content": "German law enforcement seized 50,000 bitcoins, valued at approximately $2.1 billion, allegedly earned through the operation of an illegal movie streaming website. With the price of bitcoin reaching $43,500 on Tuesday, this could be the largest ever crypto seizure by German authorities, Saxony prosecutors said.\n\nOne of the suspects voluntarily transferred the bitcoin to the wallet of the Federal Criminal Police Office (BKA) “to make up for the damage.” The money will remain in the BKA’s crypto account until a court determines how it will be used, prosecutors said.\n\nThe police did not disclose the name of the website in their latest press release, but it was identified during a 2020 investigation as Movie2k, “the most popular German streaming platform for pirated movies.”\n\nFounded in 2008, Movie2k distributed over 880,000 copies of pirated films. It was among the most-visited websites in Germany at that time. Its administrators earned money through advertising fees and subscriptions.\n\nThe police suspect that a 40-year-old German citizen and a 37-year-old Polish citizen acquired the bitcoin with revenues from the website until it was shut down in 2013.\n\nOne of the Movie2k operators, who cooperated with the police and agreed to transfer his crypto, is a programmer and real estate entrepreneur from Berlin. He has been in custody since November 2019, suspected of commercial money laundering. In 2020, the whereabouts of the second operator are unknown.\n\nThe ongoing investigation, supported by the U.S. Federal Bureau of Investigation (FBI), focuses on the illegal sharing of copyrighted work and money laundering.\n\n“All further information will be provided once the investigation is completed,” the police said. According to Patrick Pintaske, the spokesman for the public prosecutor's office in Dresden, as of yet no charges have been brought against the suspects.\n\nCryptocurrency is often used by criminals to store and transfer substantial sums of money stolen from victims. Currently, the U.S. government stands as one of the world's largest holders of crypto assets seized from cybercriminals and darknet markets, having confiscated almost 200,000 bitcoins, valued at more than $8 billion, since 2020."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vcXouY29tL2NyeXB0b2N1cnJlbmN5LWNyeXB0by1iaXRjb2luLWZyYXVkLWh5cGVyZnVuZC1mdHgtc2FtLWItMTg1MTIwOTEzNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "\"Bitcoin Beautee\" is pleading guilty to her role in a $2 billion crypto Ponzi scheme - Quartz",
        "content": "Brenda Chunga, known online as “Bitcoin Beautee,” was the American face of an Australian Ponzi scheme called HyperFund.\n\n\n\nChunga made nearly $4 million promoting the scheme—which defrauded investors across the globe of $1.9 billion (pdf)—on social media, according to the US Securities and Exchange Commission (SEC). With her fortune, she bought a million-dollar house in her home state of Maryland, a million-dollar condo in Dubai, a BMW, and some designer handbags.\n\nAdvertisement\n\nBut it all came crashing down, and on Monday (Jan. 29), Chunga pled guilty to fraud in a federal court in Maryland. HyperFund’s co-founder, Australian citizen Sam Lee, was also charged. Another American promoter, Miami resident Rodney Burton, aka “Bitcoin Rodney,” was arrested the same day and is being detained. Chunga faces up to five years in prison; Burton could serve 10.\n\nAdvertisement\n\n“The level of alleged fraud here is staggering,” said US attorney Erek L. Barron this week in the announcement of the charges by the Department of Justice (DoJ). “Whether it’s cryptocurrency fraud, or any other financial frauds, if it sounds too good to be true, it probably is.”\n\nAdvertisement\n\nThe big crypto crackdown continues\n\nCrypto schemes have been on the rise since the pandemic, and HyperFund’s activities were put on blast by a Guardian Australia investigation at the end of last year. The charges against Chunga and Lee by the SEC and the DoJ, as well as Burton’s arrest, signal that the American crackdown on crypto isn’t finished.\n\nAdvertisement\n\nLast year, federal regulators took action against the biggest cryptocurrency exchanges, Coinbase, FTX, and Binance, or their founders. In perhaps the most high-profile case, FTX founder Sam Bankman-Fried was convicted of stealing at least $10 billion from investors.\n\nOther schemes were also exposed. A YouTuber was charged for defrauding investors of about $1 billion and using it to buy himself shiny things like Rolex watches. Federal and state investigators probed the founder of cryptocurrency lender Celsius over fraud concerns.\n\nAdvertisement\n\nSmaller-scale scams haven’t been spared. Most recently (and surprisingly), a Colorado pastor of an online church was charged by the state’s Division of Securities for crypto fraud, after milking about $3 million from investors."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9yZXRpcmVtZW50L2ZlYXR1cmVzL2JpdGNvaW4tZXRmcy1pbi00MDFrcy1hLXVzZWZ1bC1kaXZlcnNpZmllci1wcm9wb25lbnRzLXNheS0yNDg1ODnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs in 401(k)s a useful diversifier, proponents say - InvestmentNews",
        "content": "The SEC’s approval of spot-price bitcoin ETFs means that the digital asset finally has an entry point into 401(k) plans – but don’t count on it appearing on investment menus anytime soon.\n\nInstead, retirement investors will most likely be able to access bitcoin ETFs through 401(k) plans’ brokerage windows and, eventually, through asset allocation products like target-date funds. Given the extreme volatility of bitcoin and the range of opinions about its future, only a small proportion of a portfolio should be devoted to it, proponents say.\n\n“Because these are ordinary ETFs, they are immediately available in self-directed accounts,” said Ric Edelman, founder of Edelman Financial Engines. For people who are active investors or traders in 401(k) plans, that access is meaningful – but those who are in default investment options or choose funds from the plan menu might not get bitcoin exposure for a while.\n\nThere are a couple of reasons for that. Because the ETFs are new, they haven’t been incorporated into any target-date products that would seek to add them. Additionally, 401(k) plan sponsors are widely risk-averse when it comes to making changes, including adding what is essentially a new asset class. Guidance in 2022 from the Department of Labor also tempered expectations, as the regulator urged fiduciaries to “exercise extreme care” when considering the addition of bitcoin to their plans.\n\nFurther, ETFs are few and far between in 401(k) plans, in part because record-keeping systems weren’t designed around intraday trading.\n\nPOTENTIAL BENEFITS\n\nAllocating 1 percent to 5 percent of assets to bitcoin can have advantages, as that range is small enough to protect investors from harm if the digital asset fails, but the potential for outsize price appreciation could have a materially positive effect on portfolios, said Edelman, who’s co-founder of the Digital Assets Council of Financial Professionals.\n\n“This is the best of both worlds – it reduces risk in the portfolio but improves returns,” he said.\n\nThe lack of correlation to stocks and bonds also makes bitcoin advantageous as a diversifier, said Mike Alfred, who runs hedge fund Alpine Fox, which focuses on bitcoin and bitcoin-related equities. Alfred also co-founded retirement plan ratings firm BrightScope, as well as fintech Digital Assets Data.\n\n“From a mathematical standpoint, it’s kind of foolish not to include it in 401(k) plans,” he said. “It’s just another asset class. It’s not different from emerging markets, gold, or other commodities. Once the gatekeepers understand the asset class, it invariably ends up in these plans.”\n\nFamed Yale chief investment officer David Swensen, who died in 2021, began incorporating bitcoin into the university’s endowment in 2018 through investments in venture funds. Swensen’s “Yale model” of investing, developed along with Dean Takahashi, for many years delivered strong returns by focusing on alternative asset classes rather than traditional stocks and bonds, Alfred noted.\n\nThe best manifestation within 401(k)s, at least in the near future, would be inclusion of bitcoin ETFs within asset allocation funds that are used as the defaults, he said.\n\n“People need to understand that this is coming,” Alfred said.\n\nIt’s also evident that people want bitcoin, said Edelman, who projects that $150 billion will flow into bitcoin ETFs within three years, with the price of bitcoin reaching $150,000.\n\n“Employers who respond to those workers’ demands will improve employee morale by demonstrating their responsiveness to this new opportunity,” he said. “This is an opportunity for forward-thinking advisors and employers.”\n\nOf course, changes in the 401(k) world are slow to happen, and the consultants who help shape investment menus may not see incentives to add bitcoin soon, Edelman noted.\n\nThe fact that the digital asset is available in an ETF format helps address the concerns the DOL has cited with bitcoin, but the regulator’s stance will nonetheless be slow to soften, he said.\n\nCurrently, there are means of accessing bitcoin through 401(k)s, including through Fidelity’s Digital Assets Account, which has not caught on quickly, Edelman said. But the fact that Fidelity is among those with a spot bitcoin ETF is significant, given that it is one of the biggest retirement plan providers.\n\n“This will make it very easy for millions of 401(k) plans to make this ETF available,” Edelman said.\n\nMeanwhile, the biggest 401(k) provider, Vanguard, has indicated that it is not planning to offer access to spot bitcoin ETFs.\n\n“Vanguard is getting a lot of criticism – and deservedly so – for denying millions of investors from making their own investment choices,” Edelman said.\n\nALL THE HYPE\n\nSince the SEC begrudgingly approved 11 spot bitcoin ETFs on January 10, nearly $2 billion flowed into the products in the first three days of trading, according to figures from Reuters.\n\nMike Harris, associate professor of retirement studies at the College for Financial Planning, said the excitement reminds him of the tech bubble or the housing market in 2007. In cases with such intense investor interest, there is a risk that valuations are already at a high point, he said.\n\n“I would be astounded if a 401(k) investment committee would say, ‘Hey, we’ll let people invest in the bitcoin ETF.’ Their liability on that would be pretty huge,” Harris said. That said, small holdings within an asset allocation product could be more reasonable, he said.\n\nIn individual retirement accounts, people should limit their bitcoin exposure, particularly if they are in or near retirement, he noted.\n\nIt’s helpful to keep in mind that if people see significant investment losses, the returns needed to make up for those in future years are higher, Harris said. “This is like dynamite – which is really helpful if you’re digging a hole.”"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjQvMDEvMzAvYml0Y29pbi1maWdodC1vdmVyLW9yZGluYWxzLW5mdHMv0gFLaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyNC8wMS8zMC9iaXRjb2luLWZpZ2h0LW92ZXItb3JkaW5hbHMtbmZ0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin is in the midst of a civil war over NFTs—but one side is clearly winning - Fortune",
        "content": "Bitcoin zealots fighting on social media are about as rare as the torrent of Taylor Swift-Super Bowl stories we’re fated to endure for the next 12 days, so I typically ignore them. But one long-running feud has caught my attention because tribes of Bitcoin warriors are not attacking other blockchains, which is their usual thing, but instead are going after each other. So I figured it was finally time to figure out what the fuss was about.\n\nThe beef in question is over a new thing called Ordinals, which arrived last year following an update to Bitcoin’s core code. The invention is a clever one and involves ascribing a number to each satoshi (0.00000001 of a Bitcoin) that is minted on every new Bitcoin block, thereby creating a new type of record system on the world’s preeminent blockchain.\n\nThis new numbering system also provided an opportunity to inscribe media on each Ordinal, meaning Bitcoin has a new use case in addition to its original one as a financial ledger. And so Bitcoin’s version of the NFT was born. The Ordinal regime can be used to inscribe any piece of text or small image (here’s an example), and so the most popular applications have become compilations of great artworks and passages from the Constitution to inspire others. Just kidding. This is crypto, so people are rushing to inscribe images of wizards and cats and god knows what else in hopes of flipping them for a profit.\n\nThe flood of Bitcoin NFTS—there are already millions of them—seems harmless but has infuriated segments of the Bitcoin old guard, who dislike the idea of using the blockchain for anything but financial transactions, and who are irked that a wave of digital crap has led to higher transaction fees. “Another civil war is brewing between a laser-eyes faction who thinks money is the only use case, and another faction that wants NFTs and to open up more uses cases,” explains Hong Kim, a cofounder of the Bitcoin-focused firm Bitwise.\n\nI spoke to Kim to get an honest broker’s take on what the Bitcoin feud is all about and who is likely to prevail. He says the laser-eyed purists have a point because Ordinals have caused Bitcoin transaction costs to spike at times. This has led to proposed countermeasures, including a Jack Dorsey-backed mining pool that warned it would refuse to process Bitcoin blocks containing Ordinals.\n\nKim added, though, that he and others might not be especially fond of “people degen-ing with Ordinals,” but that very few support the idea of censoring transactions based on their content. He also says that, like them or not, Ordinals are here to stay. A big reason for this is that, unlike the bitter block-size wars of 2015—when Bitcoin was in a full-blown schism over whether to increase blocks by two or even eight times—the blockchain’s influential core developers are willing to put up with Ordinals. Some even like the idea of opening Bitcoin up to new use cases.\n\nThis doesn’t mean the current feud is over, especially as so many Bitcoiners can’t seem to get through the day without beefing with someone on X. In the longer term, though, Ordinals will likely come to be seen as one of the most interesting things to happen to Bitcoin in years.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nFranklin Templeton removed \"Laser Eyes Ben Franklin\" as its social media avatar, saying the profile pic was always intended to be temporary for its Bitcoin ETF launch. (WSJ)\n\nSoFi, which recently ended crypto sales, saw its share price jump after posting its first quarterly profit based on increased cross-selling and new member growth. (PYMNTS)\n\nA new Baltimore pilot program is using blockchain as a means of solving the city's long-time vacant housing problem. (Marketplace)\n\nA JPMorgan report pointed to \"a perhaps more normalized flow environment\" for crypto inflows and outflows as the hype over Bitcoin ETFs has abated. (Bloomberg)\n\nCoinbase Ventures and others invested $34 million in Portal, a startup that seeks to enable swapping of Bitcoin across a range of blockchains without risky intermediate technology like wrappers and bridges. (Fortune)\n\nMEME O’ THE MOMENT\n\n“Do as I say not as I do,” terror finance edition:"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LnJlY2hhcmdlbmV3cy5jb20vZW5lcmd5LXRyYW5zaXRpb24vYml0Y29pbi1taW5pbmctYm9vbS1jb3VsZC1iZS1kaXNhc3Rlci1mb3ItZ3JlZW4tZW5lcmd5LXdhcm5zLWV4cGVydC8yLTEtMTU5MTQwNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin mining boom could be disaster for green energy, warns expert - Recharge",
        "content": "A recent breakthrough moment for Bitcoin marks the start of a new era for the cryptocurrency, but analyst Ben Hertz-Shargel warns that its staggering energy demands risk destabilising power grids and wiping out green energy gains.\n\nThe US Securities and Exchange Commission this month approved the first US-listed exchange traded funds to track Bitcoin, making it much easier to trade and opening the door to a whole new class of prospective investors.\n\nThis is all very exciting for Bitcoin enthusiasts, says Ben Hertz-Shargel, global head of grid edge at energy consultancy Wood Mackenzie, but it comes with a problem: the news will likely spark a boom in the staggeringly energy-intensive mining process that underlies the cryptocurrency.\n\nBitcoin requires so much energy because the decentralised blockchain structure it uses employs a system where to verify transactions computers must guess at a 64-digit string of numbers and letters, with trillions of possible options. Computers all over the world race to guess the string and the fastest not only certifies the transaction but is also rewarded in Bitcoin – hence, ‘mining’ it.\n\nFor context, cryptocurrency mining, which Bitcoin represents the vast majority of, used a fifth as much electricity in 2022 as global centralised data computing and data transmission combined.\n\n“That is stunning,” said Hertz-Shargel, as it means that cryptocurrency mining is using a fifth of “all of the fruits of the internet revolution, industrial revolution, the cloud and AI industrial revolution.”\n\nArticle continues below the advert\n\nPut another way, “it is consuming at a level that is on par with everything else that has come out of modern technology,” he said. “And that is to me a completely incommensurate cost.”\n\nWhat’s more, Hertz-Shargel said that Bitcoin mining now uses up to 75% more electricity than it did back then.\n\nOne of the most recent estimates is that Bitcoin mining uses around 127TWh of electricity annually – around the same as Norway.\n\nMuch like tech giants, Bitcoin miners often develop their own data centres to run their operations, and many have flooded to Texas to set up facilities due to the US state's abundant wind and solar farms.\n\nHowever, Hertz-Shargel said that while Bitcoin miners often site their operations next to renewables facilities – claiming they are ‘sustainable’ as a result – this is very different to data centres run by Big Tech companies that run off renewables.\n\nThe “critical difference” is that Big Tech companies such as Amazon and Microsoft sign power purchase agreements with renewables developers, prompting new wind and solar farms to get built.\n\n“No Bitcoin mines are doing that,” he said.\n\n'Chequered past'\n\nPart of the problem is that the modern Bitcoin mining industry has been around for less time than the duration of many green power offtake agreements, he said.\n\nCombine that with the volatile price of cryptocurrency and the “chequered past” of many Bitcoin miners and Hertz-Shargel said it is “very doubtful” that renewables developers will want to get into bed with the industry as a partner.\n\nInstead, Bitcoin data centres are syphoning off green energy that could be used elsewhere, he said. “The direct effect is causing high cost, high emissions generators to be run much more often.”\n\nHertz-Shargel said that, despite popular belief that Bitcoin miners stop operations at periods of peak demand, many run almost constantly, and are at times pushing the grid “closer to a brownout.”\n\nIn a global context, this could mean that the boom in the rollout of renewables risks being in some part cancelled out by a parallel boom in the energy demands of Bitcoin.\n\n“The energy transition is all about tradeoffs,” said Hertz-Shargel “We have a finite grid, a finite amount of clean energy that we can deploy in a realistic period of time.” The question “you have to ask yourself” is therefore “what can we afford to power via the grid?”"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmF4aW9zLmNvbS8yMDI0LzAxLzMwL2NvaW5iYXNlLXBvcnRhbC1iaXRjb2luLTM0LW1pbGxpb24tcm91bmQtZnVuZGluZy1kZWNlbnRyYWxpemVkLWV4Y2hhbmdlLWRleNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Portal secures $34 million funding round for decentralized bitcoin exchange - Axios",
        "content": "Portal has raised a new $34 million funding round to build a decentralized exchange for trading bitcoins with assets on other blockchains. Why it matters: Centralized exchanges, like FTX and Binance, have been a liability for an industry created to undermine financial intermediaries. The better the DeFi variety gets, the less their centralized cousins will be needed.\n\nContext: A decentralized exchange, known as a DEX, operates on code alone, autonomously, without the need of a human intermediary.\n\nIf everyone who built such an exchange were to quit and walk away, it would continue to operate. In this way it's no more a third-party than a road or flightpath.\n\nThe issue, however, is that blockchains have a hard time dealing with data that lives on other blockchains. And cryptoassets — which are just data — exist on a number of different ones.\n\nTrading between blockchains is both tricky and risky. The best known DEXs, such as Uniswap or Pangolin, operate on one blockchain, allowing users to trade tokens that run on that chain.\n\nZoom out: Portal — whose backers include Coinbase Ventures, Arrington Capital, OKX Ventures and Gate.io — aims to improve the experience of making trades between assets regardless of where they run.\n\nWhat they're saying: \"Bridges, centralized exchanges and other custodial solutions that enable cross-chain exchange have been vulnerable and insecure for as long as they have existed,\" Portal CEO Chandra Duggirala said in a statement.\n\nReality check: It's a crowded field. Thorchain, Stargate, Wormhole and others are all taking on the use case.\n\nYes, but: No project has truly nailed it yet. Solutions to bridge assets across chains have been hit with hundreds of millions of dollars worth of losses from code exploits.\n\nBetween the lines: To secure its transactions between chains, Portal touts its use of so-called atomic swaps — a cryptographic method that uses a predetermined code to allow two people to make a trade.\n\nWhat we're watching: The fact that Portal is leading with functionality for the Bitcoin blockchain. The oldest cryptocurrency has mostly been an afterthought for most of these projects."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JsYWNrcm9jay1maWRlbGl0eS1ldGYtZmxvd3MtcmFjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "BlackRock-Fidelity bitcoin ETF asset race 'a heavyweight fight that can go either way' - Blockworks",
        "content": "While the daily net flows entering BlackRock’s spot bitcoin ETF have repeatedly beat competing offerings, Fidelity Investments’ BTC fund remains on its tail in a battle analysts expect to persist.\n\nThe Fidelity Wise Origin Bitcoin Fund (FBTC) edged BlackRock’s iShares Bitcoin Trust (IBIT) in net flows on Monday — $208 million to $198 million — according to Bloomberg Intelligence data.\n\nOverall, the two financial giants are neck and neck atop the flows leaderboard since launching alongside eight other spot bitcoin ETFs on Jan. 11.\n\nIBIT and the FBTC have so far seen flows amounting to about $2.4 billion and $2.1 billion, respectively.\n\nRead more: Bitcoin ETF Tracker\n\nThe companies benefit from their large and well-established distribution networks, analysts told Blockworks — particularly when it comes to the financial adviser channel.\n\nBlackRock manages about $9 trillion in assets, including about $2.6 trillion in its US ETFs. Though not as large of an asset manager, Fidelity had $11.5 trillion assets under administration, as of Sept. 30.\n\nSumit Roy, a senior analyst at ETF.com, said while he expects both firms’ funds to grow substantially over time, it’s “impossible” to predict which will be larger.\n\n“Fidelity’s advantage is that it has a massive base of retail and adviser clients using its brokerage services, so it can easily push the ETF to them,” he told Blockworks. “On the other hand, BlackRock is the largest asset manager in the world, with plenty of marketing and distribution muscle of its own.”\n\nRoy added: “It really is a heavyweight fight that can go either way.”\n\nA Fidelity spokesperson declined to comment on how it could seek to boost assets in FBTC. A BlackRock representative did not immediately return a request for comment.\n\nCoinShares product head Townsend Lansing noted that exchange-traded products are access tools for traditional investors, many of whom place a lot of value in brand names.\n\n“That doesn’t mean that more crypto native [firms] won’t have opportunities to show value or earn flows as investors demand and reward more bespoke and informed insight into digital assets,” Lansing added.\n\nLoading Tweet..\n\nA fund by Ark Invest and 21Shares, as well as one by crypto-focused firm Bitwise, sit in third and fourth place with about $600 million of net inflows each.\n\nWhile Grayscale Investments’ Bitcoin Trust ETF (GBTC) started with a big asset lead of roughly $28 billion, its net outflows have totaled more than $5 billion in its first few weeks trading as an ETF.\n\nRead more: As GBTC outflows continue, will the largest bitcoin ETF be dethroned?\n\nSome have compared spot bitcoin ETFs to the launch of physically-backed gold ETFs.\n\nBut David Lawant, head of research at crypto prime brokerage FalconX, noted the more competitive landscape this time around, with 10 spot bitcoin ETFs launching on the same day.\n\nContrarily, while State Street Global Advisors’ SPDR Gold Shares (GLD) came to market in November 2004, BlackRock’s Gold Trust (IAU) didn’t launch until January 2005. GLD has roughly $55.5 billion in assets, while IAU manages about $25.7 billion.\n\n“Given the differences in the competitive dynamics on the spot [bitcoin] ETF launch versus the gold ETFs launched almost two decades ago, I’d not be surprised to see a group of three to five funds gathering the lion’s share of assets, perhaps with the top three more distant from the rest of the group,” Lawant said.\n\nThe FalconX research executive said predicting the ultimate spot bitcoin ETF asset leader is tough at this stage.\n\n“The primary winner in this race is the consumer, who ultimately gets products that offer access to crypto at a highly competitive cost,” he said. “The speed at which the fees got to where they are now suggests that both firms are dead serious about establishing their presence in crypto.”\n\nExcluding GBTC, which sports a fee of 1.5%, the nine other US spot bitcoin ETFs have expense ratios ranging between 0.19% and 0.30%.\n\nA product by Invesco and Galaxy was the latest to adjust its fee, reducing its price Monday from 0.39% to 0.25% — matching BlackRock and Fidelity.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc1MDMzL2JpdGNvaW4tZGV4LXBvcnRhbC1zZWVkLWZ1bmRpbmctY29pbmJhc2XSAVBodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzUwMzMvYml0Y29pbi1kZXgtcG9ydGFsLXNlZWQtZnVuZGluZy1jb2luYmFzZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin-based DEX Portal raises $34 million in seed funding - The Block",
        "content": "Portal, a startup building a Bitcoin BTC -6.86% -based cross-chain decentralized exchange and wallet, has raised $34 million in a seed funding round. Investors in the round included Coinbase Ventures, Arrington Capital, OKX Ventures, and Gate.io, Portal said Tuesday.\n\nThe seed round was structured as a combination of a simple agreement for future equity (SAFE) and convertible notes, all of which have been fully converted into equity, Portal co-founder and CEO Chandra Duggirala told The Block in an interview. There is no debt component in the round, Duggirala noted, declining to comment on valuation. He also declined to comment on the specific timeline for when the funding round started and ended but said it \"closed recently.\"\n\nAt $34 million, Portal's seed round surpasses the typical size for a seed round. Duggirala said it was oversubscribed by more than two times due to increased interest in the growth of the Bitcoin ecosystem.\n\nThe seed round brings Portal's total funding to $42.5 million, adding to the $8.5 million raised in pre-seed funding in 2021.\n\nWhat is Portal?\n\nPortal is a Bitcoin-based cross-chain atomic swaps protocol. Its two main products are a decentralized exchange and a wallet.\n\nPortal DEX enables Layer 2 atomic swaps of cryptocurrencies across blockchains. Portal wallet, a \"fully non-custodial\" tool, integrates the DEX and allows users to send, receive, and store cryptocurrencies across blockchains.\n\n\"You can think of Portal as a cross-chain Lightning Network,\" Duggirala said. \"It's fast, inexpensive, easy, and there is no custodial risk.\"\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe current cross-chain swap tools, such as wrapped tokens and bridges, are risky as they have lost billions of dollars in hacks and involve some type of custody risk, Duggirala said, adding that Portal doesn't custody user funds at all, either through one signature or multiple signatures.\n\nPortal products are currently in the testnet form, and \"mainnet readiness is quite feasible by March,\" Duggirala said.\n\nPortal plans and token\n\nWith fresh funding in place, Portal plans to launch its products on the mainnet and grow its ecosystem. \"We want to support and integrate with as many wallets and single-chain decentralized exchanges that use bridges,\" Duggirala said. \"Our goal is to replace completely the custodial risk in this space.\"\n\nAsked if Portal plans to launch its own native token, Duggirala said that decision would depend on the validators of the Portal network. The network runs on the xport (proposed ticker) token, an ERC-20 token, Duggirala said, adding that it is used to secure the network and reward validators for enabling the swaps.\n\nFounded in 2019, Portal is based in the San Francisco Bay Area. Duggirala declined to comment on the current headcount of the firm but said the team has doubled in the last year, and Portal is continuing to hire.\n\nIn the coming months, Portal also plans to launch an AI-powered investment application that will help users leverage the AI technology to make \"intelligent\" investing decisions, Duggirala said."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vbmV3cy55YWhvby5jb20vbWVuLWhhbmQtb3Zlci1iaXRjb2lucy13b3J0aC0xMDU3MjQ0NTEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Men hand over bitcoins worth €2 billion to German police - Yahoo News",
        "content": "A total of 50,000 bitcoins have been provisionally seized during investigations in the eastern German state of Saxony in what is believed to have been the biggest seizure of its kind to date in Germany.\n\nThe bitcoins were worth around €2 billion ($2.17 billion) at Tuesday's exchange rate, Kay Anders, the press spokesman for the Saxon State Criminal Police Office (LKA), confirmed to dpa on Tuesday.\n\nOne of the suspects in the investigation had voluntarily transferred the virtual currency to the Federal Criminal Police Office (BKA), the spokesman said.\n\nThe investigations were directed against a 40-year-old man and a 37-year-old man. According to the LKA, it is suspected that the men operated a piracy portal until the end of May 2013. They are said to have purchased bitcoins with the proceeds.\n\nThe investigations by the Dresden Public Prosecutor General's Office, the state of Saxony's LKA and the tax investigation department of the Leipzig tax office were supported by the BKA, the US Federal Bureau of Investigation (FBI) and a Munich-based IT expert firm, the spokesman said.\n\nAccording to Patrick Pintaske, spokesman for the public prosecutor's office in Dresden, no charges have yet been brought against the men.\n\n\"If an indictment is brought, the investigation will be closed,\" said Pintaske.\n\nAccording to the Saxon LKA, this seizure of bitcoins by law enforcement authorities is the most extensive in Germany to date.\n\nOne of the men had transferred the bitcoins to a so-called wallet - an account for the virtual currency - of the BKA. No final decision has yet been made on cashing in the bitcoins, the agency said."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmR3LmNvbS9lbi9nZXJtYW55LXBvbGljZS1zZWl6ZS1iaXRjb2lucy13b3J0aC0yLWJpbGxpb24vYS02ODEyMTM4NNIBTmh0dHBzOi8vYW1wLmR3LmNvbS9lbi9nZXJtYW55LXBvbGljZS1zZWl6ZS1iaXRjb2lucy13b3J0aC0yLWJpbGxpb24vYS02ODEyMTM4NA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Germany: Police seize bitcoins worth €2 billion - DW (English)",
        "content": "German authorities have seized 50,000 bitcoins, worth some €2 billion, in what could be the largest seizure to date in the country.\n\nGerman law enforcement authorities said Tuesday they seized nearly €2 billion ($2.17 billion) worth of bitcoins in the eastern state of Saxony.\n\nAn investigation is still underway and no charges have yet been filed, police said.\n\nThe Saxon State Criminal Police Office said the seizure of 50,000 bitcoins could be the biggest to date of its kind in Germany.\n\nPolice said they were investigating two men, aged 40 and 37, who are suspected of running a piracy website until the end of 2013. Authorities allege the men bought bitcoins from the money they earned from the portal.\n\nThey added that their investigation was into suspected unauthorized commercial exploitation of copyrighted works and subsequent commercial money laundering.\n\nSuspects transfer bitcoins to federal agency\n\nThe seizure came after the \"accused voluntarily transferred\" the bitcoins to an official wallet of the Federal Criminal Police Office (BKA), police added in a statement.\n\nThe BKA did not provide further details about the transfer, but investigators cited by German news agency dpa said no decisions had been made regarding cashing in the bitcoins.\n\nPolice said no further information would be available until the investigation comes to a close."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzdhZWM5OGRkLTYxNjEtNGVlOS04ZTBlLTY1NGZjN2UwZmFlM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "UK police seized £1.4bn of bitcoin from China investment fraud, court told - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nThe Metropolitan Police seized more than £1.4bn worth of bitcoin derived from a huge investment fraud in China, a London court heard on Tuesday, one of the largest seizures of the cryptocurrency by law enforcement globally.\n\nThe disclosure came during the trial of Jian Wen, 42, who is accused of laundering bitcoin on behalf of her former employer, an alleged fugitive from the Beijing authorities. Wen has pleaded not guilty.\n\nIn 2018 the UK police seized four separate devices containing more than 61,000 bitcoin from a safety deposit box and a property where Wen and her then-employer, Yadi Zhang, lived at the time, Southwark Crown Court heard.\n\nThe value of the bitcoin by the time all of the cryptocurrency had been recovered by the police, in July 2021, added up to about £1.4bn.\n\nThe prosecution told the jury at the start of the trial on Monday that the bitcoin derived from an investment fraud Zhang had committed in China between 2014 and 2017.\n\nZhang, whose real name is Zhimin Qian, stole roughly £5bn from more than 128,000 investors. She then converted the money into bitcoin and arrived, under a false identity, in London in 2017, the court heard.\n\nShe has since fled the UK and remains at large, according to prosecutors.\n\nWen is not accused of any involvement in that fraud. However, she has been accused of helping to convert some of Zhang’s bitcoin into cash, jewellery and other luxury items, as well as property, while allegedly knowing it was the proceeds of crime.\n\nGillian Jones KC, counsel for the Crown Prosecution Service, told the jury on Tuesday that Wen had tried to purchase a £12.5mn London property on behalf of Zhang in 2018 using the law firm Mishcon de Reya. The purchase had failed because the law firm could not verify the source of the bitcoin, the jury heard. In October that year, the Met froze money held by Mishcon in its client account.\n\nWen had moved to the UK in 2007 from China and became a British citizen in 2018. She has described herself as Zhang’s “carer” and said she believed all of Zhang’s bitcoin had derived from legitimate business activities, Jones told the jury.\n\nBut Jones said on Monday that Wen was a “front person” who was paid to “keep Ms Zhang in the background”.\n\n“Ms Wen had been trusted not only with copies of the passwords and passphrases to access the laptops [containing the bitcoin] but with access to where the laptops were being stored,” Jones said.\n\nBefore meeting Zhang in 2017, Wen had worked in Chinese takeaway restaurants, the court heard.\n\nThe trial continues."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTMxL3VrLXBvbGljZS11bmNvdmVyZWQtMS03LWJpbGxpb24tYml0Y29pbi1saW5rZWQtdG8tY2hpbmEtZnJhdWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "UK Police Uncovered $1.7 Billion Bitcoin Linked to China Fraud - Bloomberg",
        "content": "British police uncovered $1.7 billion worth of Bitcoin linked to a woman accused of laundering the proceeds of a $6 billion investment fraud in China, prosecutors said at her London trial.\n\nJian Wen, 42, a UK citizen, denies allegations she helped launder vast sums amassed by Zhimin Qian, wanted in China for running a fraud scheme that robbed around 130,000 investors. The whereabouts of Zhimin, also known as Yadi Zhang, are unknown."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2tnZWVrcy5jb20vZ3VpZGVzL2Jlc3QtYml0Y29pbi1vcmRpbmFscy13YWxsZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "10 Best Bitcoin Ordinals Wallet: Secure Your Digital Assets Now! - Blockgeeks",
        "content": "Looking to secure your Bitcoin assets? A reliable bitcoin ordinals wallet is the answer! In this listicle, we’ve rounded up the top contenders in the market. From robust security features to user-friendly interfaces, these wallets offer a blend of convenience and protection for your digital wealth.\n\nDiscover our handpicked selection that caters to both beginners and seasoned crypto enthusiasts. Whether you prioritize accessibility or advanced security measures, there’s a perfect fit waiting for you. Scroll down for reviews of our top picks, including hardware wallet, ordinals wallets, and take the first step towards fortifying your cryptocurrency portfolio.\n\n1. The Ordinals Wallet\n\nThe Ordinals Wallet, made of leather, stands out for its user-friendly interface, ensuring easy navigation for both beginners and experienced users. With a sleek design and intuitive layout, users can effortlessly manage their digital assets without feeling overwhelmed.\n\nThis multi-currency wallet offers support for Bitcoin and other cryptocurrencies, allowing users to store and manage digital assets within a single platform. This feature eliminates the need to switch between different wallets when dealing with diverse cryptocurrencies, streamlining the user experience.\n\nIn terms of security, the Ordinals Wallet incorporates advanced features to ensure the safe storage of digital artifacts, tokens, and blocks. It employs robust encryption methods to protect private keys and sensitive information from unauthorized access or cyber threats. This provides users with peace of mind knowing that their investments, tokens, are well-protected within the wallet’s secure ecosystem.\n\n2. Xverse Wallet\n\nXverse Wallet offers seamless integration with various decentralized applications and tokens, providing users with a smooth and interconnected experience within the blockchain ecosystem. This feature allows for easy access to a wide range of services and functionalities within the network ecosystem without having to switch between multiple platforms.\n\nThe wallet boasts a built-in decentralized exchange, enabling users to conveniently trade cryptocurrencies directly from their wallets. This eliminates the need for third-party exchanges and streamlines the trading process, offering enhanced security and control over assets.\n\nMoreover, Xverse Wallet ensures cross-platform accessibility, allowing users to manage their digital assets and tokens across different devices such as desktops, laptops, smartphones, or tablets. This flexibility provides convenience and freedom for users who prefer managing their cryptocurrency portfolios on various devices seamlessly.\n\n3. Hiro Wallet\n\nHiro Wallet offers a range of benefits, including:\n\nCustomizable transaction fees for flexible usage\n\nIntegration with popular DeFi platforms for enhanced functionality\n\nRobust encryption to ensure asset protection\n\nThe customizable transaction fees and tokens provided by Hiro Wallet allow users to adjust the fees according to their preferences and current network conditions. This feature ensures that users have control over their transactions, providing flexibility in managing costs.\n\nMoreover, the integration with popular DeFi platforms enhances the wallet’s functionality, enabling seamless interaction with decentralized finance applications. This integration opens up opportunities for users to participate in various DeFi activities directly from their wallets.\n\nHiro Wallet prioritizes security through robust encryption methods. By implementing advanced security measures, such as multi-signature protocols and secure key storage mechanisms, the wallet ensures that tokens are well-protected against unauthorized access and potential cyber threats.\n\n4. MetaMask + GenerativeXYZ\n\nMetaMask, in collaboration with GenerativeXYZ, offers a user-friendly interface for exploring the world of digital collectibles and tokens through NFT support. This integration provides users with an intuitive experience to engage with and manage their digital artifacts and tokens seamlessly.\n\nThe interoperability feature allows MetaMask + GenerativeXYZ to connect with various blockchains and tokens, enhancing its versatility for different use cases. Users can access and interact with diverse blockchain networks, expanding their digital asset portfolio within a single platform.\n\nCommunity-driven development lies at the core of MetaMask + GenerativeXYZ’s continuous improvements. Developers actively engage with the community to gather feedback and implement enhancements that align with user needs and preferences. This collaborative approach ensures that the platform evolves in tandem with the dynamic demands of its user base.\n\n5. OKX Wallet\n\nOKX Wallet offers high liquidity options, making it ideal for efficient trading activities within the bitcoin ecosystem. This means users can easily buy and sell tokens without experiencing significant price slippage, providing a seamless trading experience.\n\nOKX Wallet provides staking and yield farming capabilities, allowing users to earn passive income through their token holdings. This feature enhances the potential for long-term profitability within the wallet’s platform.\n\nMoreover, OKX Wallet boasts comprehensive asset management tools that enable users to optimize their portfolios effectively. With features such as real-time market data analysis and customizable alerts, investors can make informed decisions to maximize their returns on investment.\n\n6. Atomic Wallet\n\nAtomic Wallet offers a range of features that make it a standout option for Bitcoin and cryptocurrency enthusiasts.\n\nThe wallet’s built-in atomic swaps allow for direct peer-to-peer transactions, enabling users to exchange cryptocurrencies without the need for an intermediary. This feature contributes to enhanced security and privacy by eliminating the involvement of third parties.\n\nWith support for over 500 cryptocurrencies, including Bitcoin and various altcoins, Atomic Wallet provides extensive versatility in managing diverse digital assets within a single platform. This broad support is especially advantageous for investors with diversified crypto portfolios.\n\nThe in-wallet buy/sell options facilitate seamless fiat-crypto conversions, streamlining the process of exchanging traditional currency for cryptocurrencies directly within the app.\n\n7. Leather (Formerly Hiro Wallet) – Feature-Packed for Bitcoin and Stacks NFTs\n\nLeather, formerly known as Hiro Wallet, stands out with its enhanced NFT support tailored specifically for Stacks blockchain assets. This means users can seamlessly manage their fungible tokens and non-fungible tokens in one place, providing a comprehensive solution for cryptocurrency enthusiasts.\n\nThe wallet’s intuitive staking features allow users to earn rewards while simultaneously securing the network. By participating in the staking process, individuals contribute to the overall security and efficiency of the blockchain network while earning passive income—a win-win situation.\n\nMoreover, Leather boasts a user-friendly interface designed to streamline Bitcoin and NFT management. Its accessibility makes it an ideal choice for both beginners and experienced crypto investors who seek convenience without compromising on functionality.\n\nFor those interested in exploring NFT marketplaces or engaging with Stacks-based assets, Leather offers a robust platform that simplifies these processes. The wallet’s emphasis on usability ensures that users can navigate through complex transactions with ease, making it an attractive option within the realm of cryptocurrency wallets.\n\n8. Hardware Wallets – Maximum Security for Your Assets\n\nHardware wallets provide cold storage solutions, safeguarding digital assets against online threats. Unlike hot wallets (connected to the internet), hardware wallets store private keys offline, minimizing the risk of hacking and unauthorized access.\n\nThese wallets offer compatibility with various operating systems and devices, ensuring accessibility for a wide range of users. Whether using Windows, macOS, Linux, Android, or iOS platforms, investors can securely manage their digital assets without constraints.\n\nBiometric authentication and PIN protection add layers of security to hardware wallets. Biometric features such as fingerprint scanning enhance identity verification, while PIN protection acts as an additional barrier against unauthorized transactions or access attempts.\n\nThe advantages of using hardware wallets go beyond mere convenience; they provide peace of mind by offering maximum security for investments in digital assets. With cyber threats on the rise globally, investing in resources that prioritize asset security is crucial for long-term investment success.\n\n9. Sparrow Wallet – Advanced Bitcoin-Focused Features\n\nSparrow Wallet offers tailored features that are finely tuned to optimize Bitcoin transactions, making it an ideal choice for those looking to interact with the bitcoin network seamlessly. With a user-friendly interface, it allows users to create custom transaction types based on their individual preferences, providing flexibility and control over their transactions.\n\nOne of the standout features of Sparrow Wallet is its advanced privacy capabilities, including CoinJoin integration. This integration enables users to combine their individual satoshis with others’ coins in a single transaction, enhancing privacy by obfuscating the source of funds and making it harder for external parties to trace the origin of transactions.\n\nFurthermore, Sparrow Wallet provides comprehensive support for full bitcoin nodes, allowing users to have direct access to the entire blockchain while maintaining complete control over their funds. This not only enhances security but also contributes towards reinforcing the decentralized nature of the Bitcoin network.\n\n10. Ledger – Renowned Hardware Wallet with Upcoming Ordinals Support\n\nLedger has solidified its position as a top hardware wallet provider, renowned for its robust security features and user-friendly interface. With the ongoing development to integrate support for Ordinals wallet functionality, Ledger is poised to achieve another milestone in the cryptocurrency space.\n\nThe upcoming Ordinals compatibility adds a new layer of versatility to Ledger’s already impressive multi-currency support. This enhancement will enable users to seamlessly manage their Bitcoin ordinals alongside other cryptocurrencies within the same secure hardware environment.\n\nLedger’s commitment to staying at the forefront of technological advancements ensures that users can trust their platform for managing various digital assets efficiently and securely. The integration of Ordinals support aligns with Ledger’s dedication to providing comprehensive solutions for crypto enthusiasts seeking advanced storage options.\n\nSummary\n\nYou’ve now explored a range of Bitcoin ordinals wallets, each offering unique features to cater to different needs. Whether you’re drawn to the security of hardware wallets like Ledger or seeking advanced Bitcoin-focused features with Sparrow Wallet, there’s a solution for everyone. From feature-packed options like Leather (formerly Hiro Wallet) to the upcoming Ordinals support in Ledger, the world of Bitcoin wallets is diverse and evolving.\n\nNow that you’re equipped with insights into these top Bitcoin ordinals wallets, it’s time to take action. Consider your priorities – whether it’s security, user experience, or specific features – and select the wallet that aligns with your needs. Remember to stay informed about updates and new releases in this dynamic space to ensure your Bitcoin assets are always well-protected and easily accessible.\n\nFrequently Asked Questions\n\nWhat is the Ordinals Wallet?\n\nThe Ordinals Wallet is a secure and user-friendly Bitcoin wallet designed to provide easy access and management of your cryptocurrencies. It offers a seamless experience for both beginners and experienced users, ensuring the safety of your digital assets.\n\nHow does Leather (Formerly Hiro Wallet) differ from other wallets?\n\nLeather, formerly known as Hiro Wallet, stands out with its feature-packed capabilities for managing Bitcoin and Stacks NFTs. Its intuitive interface and robust security measures make it an ideal choice for those seeking versatility in their digital asset management.\n\nWhy choose a hardware wallet for maximum security?\n\nHardware wallets offer unparalleled security by keeping your private keys offline, protecting them from potential cyber threats. They are like vaults for your digital assets, providing peace of mind knowing that your cryptocurrencies are stored in the most secure manner possible.\n\nWhat makes Sparrow Wallet stand out among other options?\n\nSparrow Wallet distinguishes itself with advanced features tailored specifically for Bitcoin users. With its focus on enhancing the Bitcoin experience, it provides unique functionalities that cater to the needs of cryptocurrency enthusiasts who prioritize convenience and control over their assets.\n\nWhat upcoming support does Ledger offer for ordinals?\n\nLedger is renowned for its hardware wallets and will soon introduce support for ordinals. This enhancement will further expand the capabilities of Ledger devices, allowing users to seamlessly manage their ordinals alongside other cryptocurrencies with utmost security."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2dsb2JhbC14LXdpdGhkcmF3cy1iaXRjb2luLWV0Zi1wcm9wb3NhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Global X withdraws bitcoin ETF proposal - Blockworks",
        "content": "Global X filed to withdraw its proposed spot bitcoin ETF weeks after a slew of ETFs were approved by the Securities and Exchange Commission.\n\nThe proposed ETF was not the first of its kind filed by the firm. Back in 2021, Global X pursued a similar fund but was met with resistance from the SEC.\n\nGlobal X first filed its proposal back in August, but — like other applicants — a decision on the bitcoin ETF was delayed by the SEC. In January, the SEC issued a slew of ETF decisions but Global X was notably absent.\n\nRead more: Bitcoin ETF Tracker\n\nGlobal X didn’t immediately return a request for comment.\n\nThe firm wasn’t on the final list of potential ETFs earlier this month after it failed to file updated documentation alongside other potential ETF issuers.\n\nGlobal X wasn’t the only one of the bitcoin ETF hopefuls that failed to make it across the finish line. Pando Asset Management joined the race back in December and has yet to receive approval for its proposed spot bitcoin ETF.\n\nRead more: Bitwise publishes bitcoin ETF holdings address after on-chain sleuths uncover BlackRock’s\n\nSimilarly, 7RCC filed for a spot bitcoin ETF that would also hold carbon credit futures contracts. The proposal, filed in December, has yet to receive regulatory approval.\n\nAfter receiving approval, nearly a dozen bitcoin ETFs launched earlier this month. The funds — which include Grayscale, BlackRock and Fidelity — have seen billions in outflows, mostly from GBTC.\n\nJPMorgan analysts, however, believe that GBTC’s outflows are slowing.\n\n“As we’ve been seeing transaction volumes slowing this past week, we think we are perhaps seeing indication of the hype around these ETFs abating and entering a perhaps more normalized flow environment,” analysts led by Kenneth Worthington said in a note Monday.\n\nOutside of flows, the group has remained pretty competitive with a majority of the funds offering waivers for fees for a set amount of time or assets. On Monday, Invesco Galaxy — which offers a six-month or $5 billion in assets waiver — announced that it was cutting its fee to 0.25% from 0.39%.\n\nAside from Grayscale — which has a 1.5% fee — the group has very low fees ranging from 0.19% to 0.30%.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzMwL2JpdGNvaW4tbWluZXItZ3JpaWQtc2hhcmVzLWV4dGVuZC1kcm9wLWFmdGVyLW5hc2RhcS1saXN0aW5nL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzMwL2JpdGNvaW4tbWluZXItZ3JpaWQtc2hhcmVzLWV4dGVuZC1kcm9wLWFmdGVyLW5hc2RhcS1saXN0aW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Miner GRIID Shares Extend Drop After Nasdaq Listing - CoinDesk",
        "content": "The listing comes after the company first announced its intention to go public during the bull market of 2021 when the combined enterprise value of the two companies was $3.3 billion. The miners, considered a proxy for bitcoin as their revenue is mainly based on the digital currency they mine, were hit particularly hard during the recent crypto winter. GRIID delayed its public listing during the bear market and was finally able to go public this year as the digital assets industry came out of the bear market."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc1MTc2L2dlcm1hbi1hdXRob3JpdGllcy1zZWl6ZS01MDAwMC1iaXRjb2luLWNvbm5lY3RlZC10by1waXJhdGVkLW1hdGVyaWFscy1vcGVyYXRpb27SAXdodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzUxNzYvZ2VybWFuLWF1dGhvcml0aWVzLXNlaXplLTUwMDAwLWJpdGNvaW4tY29ubmVjdGVkLXRvLXBpcmF0ZWQtbWF0ZXJpYWxzLW9wZXJhdGlvbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "German authorities seize 50,000 bitcoin connected to pirated materials operation - The Block",
        "content": "German authorities seized 50,000 bitcoin worth nearly $2.2 billion that was allegedly purchased using funds connected to copyrighted materials.\n\nThis seizure became the largest amount of bitcoin German law enforcement has ever seized, according to a police statement.\n\nTwo men of German and Polish nationality, respectively, are being investigated for managing a pirated materials operation, buying bitcoin with the funds. The two individuals could face charges including unauthorized commercial exploitation of copyrighted works and money laundering.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe suspects voluntarily transferred the bitcoin to wallets controlled by German authorities, and it is not clear what law enforcement will do with the cryptocurrency.\n\nGerman authorities assisting in the investigation included the Dresden General Prosecutor’s Office, the Saxony State Criminal Police Office and the tax investigation of the Leipzig II Tax Office as the Saxony Integrated Investigation Unit."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjQvMDEvMzAvcG9ydGFsLWRlY2VudHJhbGl6ZWQtYml0Y29pbi1leGNoYW5nZS1yYWlzZXMtMzQtbWlsbGlvbi_SAWJodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDI0LzAxLzMwL3BvcnRhbC1kZWNlbnRyYWxpemVkLWJpdGNvaW4tZXhjaGFuZ2UtcmFpc2VzLTM0LW1pbGxpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Portal, a decentralized Bitcoin exchange, raises $34 million to develop cross-chain swaps - Fortune",
        "content": "Fintech provider Portal today announced it’s received $34 million in seed funding to further development of a decentralized Bitcoin ecosystem that will enable peer-to-peer, cross-chain swaps of digital assets.\n\n“Portal intends to solve the problem of custodial risk once and for all,” cofounder and CEO Chandra Duggirala said in a statement.\n\nInvestors include Coinbase Ventures, Arrington Capital, OKX Ventures, and Gate.io, and the seed funding builds on Portal’s angel round of $8.5 million, which closed in 2021.\n\n“Portal is rapidly pushing ahead the Bitcoin ecosystem by enabling fast and low-cost economic activity without being beholden to third parties,” Michael Arrington, founder and partner of Arrington Capital, said in a statement.\n\nFounded in San Francisco in 2019, Portal enables customers to make safe cross-chain transactions without relying on third parties such as exchanges, bridges, or wrappers, which pose additional risks.\n\n“From the very early days of Mt. Gox to FTX, centralized exchanges have been a persistent source of risk to user funds,” said Duggirala. “Now, the risk remains, but it has taken a new form in bridges and other custodial cross-chain solutions.”\n\n“Custodial bridges have been the single-biggest problem in crypto, and it becomes particularly important when it comes to cross-chain operations because different blockchains are completely disparate things,” Duggirala told Fortune. Bridges are touch points that allow transfers of tokens between blockchains, but they can be extremely vulnerable to hackers—a single cross-chain exploit in 2022 drained some $625 million.\n\nWrapping is another solution users have opted for to make cross-chain transactions, whereby tokens are backed by a coin or asset, native to a different blockchain, to make them usable on a different network. But wrapped tokens rely on custodians to hold the original assets, which raises questions about centralization and counterparty risk.\n\n“So, how do you bind two completely independent systems together, the only reliable way?” Duggirala asked. He says it can be done using transparent layer-2 atomic-swap technology. Layer-2 refers to protocols that operate atop a layer-1 blockchain—like Bitcoin or Ethereum—to improve scalability. Atomic swaps are exchange contracts that allow cryptocurrencies to be traded peer-to-peer without requiring a trusted third party.\n\n“It hasn’t been done before; as far as we know, this is the first of its kind,” Duggirala said.\n\nPortal plans to use the funds to invest in engineering and building the ecosystem of two of its flagship products: Portal DEX and Portal Wallet. The former is the first Bitcoin-based exchange that allows swaps of cryptocurrencies across blockchains, and the latter is the non-custodial, user-facing tool that integrates Portal DEX.\n\n“The portable mobile wallet serves as basically like a standard for the user experience,” Duggirala said, “but we want as many third-party wallets to integrate the swap as quickly as possible.”"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2lzLXRoZS1iaXRjb2luLXBvd2VyLWxhdy1tb2RlbC1tb3JlLXJlYWxpc3RpYy10aGFuLXN0b2NrLXRvLWZsb3cv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Is the Bitcoin Power Law model more realistic than Stock-to-Flow? - CryptoSlate",
        "content": "Since finance YouTuber Andrei Jikh recently covered the so-called Bitcoin Power Model, there has been a notable debate within the Bitcoin community around its viability.\n\nJikh opened his video entitled “2024 Bitcoin Price Prediction (CRAZY!)” by stating,\n\n“Today I want to show how a simple math rule that’s able to predict patterns of the universe has also accurately tracked the last 15 years of Bitcoin’s price, and I want to show you what this formula says Bitcoin should be worth 10 years from now.”\n\nHe mentions a ‘rule’ based on a model that describes Bitcoin’s price growth as following a power law principle over time. The model is based on the work of astrophysicist Giovanni Santostasi, who has analyzed 15 years of Bitcoin data.\n\nA power law is a statistical relationship between two quantities, where a relative change in one quantity results in a proportional relative change in the other, independent of the initial size of those quantities. This means that one quantity varies as a power of another. For example, if you double the length of a side of a square, the area will quadruple, demonstrating a power law relationship.\n\nJikh discusses how power laws have been used to predict various phenomena, including Bitcoin’s price patterns. The video suggests that Bitcoin’s price could potentially reach $200,000 in the next cycle and $1 million by 2033.\n\nThe significance of power laws in this context is that they allegedly allow for accurate predictions across different domains. In the case of Bitcoin, Santostasi claims they explain its price patterns with a high degree of accuracy, as indicated by a 95.3% accuracy based on regression analysis.\n\nIn a blog post from Jan. 12, Santostasi suggested renaming the model the BTC Scaling Law for reference.\n\nUnsurprisingly, comparisons with PlanB’s Stock to Flow (S2F) quickly emerged as both models depict bullish scenarios for the world’s leading digital asset. On Jan. 30, Santostasi shared a graph comparing the Power Law prediction for Bitcoin to S2F and commented,\n\n“I wish S2F was true. But I rather count on a more realistic model that seems correct than on a model that is too optimistic and then to get disappointed. Also it is not good for BTC PR for the community to make these unrealistic claims. I don’t think it is possible to get to tens of millions by 2033 (as S2F predicts). 1 M is already amazing (more realistic Power Law in time prediction).”\n\nThere has been a sizeable debate on X regarding which model is more accurate. Some believe the S2F model has been invalidated along with the rainbow chart, while others assert that global adoption will activate a return to the trend.\n\nHowever, there has been little to discuss the other power law models used to analyze Bitcoin over time.\n\nOther power law models for Bitcoin.\n\nSantostasi is not the first to utilize power laws for Bitcoin analysis. In 2014, Alec MacDonell at the University of Notre Dame introduced the Log Periodic Power Law (LPPL) model, which has been influential in understanding a Bitcoin bubble. This model focuses on asset price growth leading up to a crash.\n\nCentral to the LPPL model is the concept that Bitcoin’s price growth follows an exponential trend relative to log-time. Essentially, a consistent percentage increase in time correlates with a proportional increase in Bitcoin’s price. This model has proven useful in establishing critical support and resistance levels, guiding Bitcoin’s upward price trajectory. Despite the model’s predictive success, it’s crucial to recognize its foundational assumption that Bitcoin’s growth will continue to decelerate over time.\n\nIn 2019, Harold Christopher Burger built upon this foundation with the Power Law Oscillator (LPO), a tool designed to pinpoint optimal moments for Bitcoin investment, effectively predicting all four of Bitcoin’s all-time highs. Notably, Santostasi suggests that Burger’s PLO model was inspired by his own work from 2018, citing this Reddit thread. The thread includes Santostasi’s model against Bitcoin at the time. In the top comment, the OP claimed that “BTC will be around 150K in 2025.”\n\nThe Power Law Oscillator gauges Bitcoin’s relative valuation. With a range of 1 to -1, it signals whether Bitcoin is overpriced or underpriced at any given time. This tool’s efficacy stems from its alignment with several key factors: historical data analysis, network value correlation, complex system dynamics, and resistance to traditional financial models.\n\nBitcoin price and power/scaling laws.\n\nWhen plotted on a log-log graph, Bitcoin’s price trends reveal a power law relationship. A regression model based on this data can account for much of Bitcoin’s price behavior, underscoring the model’s predictive capabilities. The model resonates with Metcalfe’s Law, which posits that a network’s value is proportional to its users’ square. This relationship has been validated in Bitcoin’s case, especially over medium to long-term periods.\n\nThe prevalence of power laws in complex systems, such as urban growth and network development, suggests that Bitcoin, following a similar pattern, is more than a mere financial asset; it’s a complex system in its own right. Bitcoin’s unique characteristics, including its decentralization and detachment from traditional financial controls, render conventional currency models less effective. In contrast, the power law model offers an arguably more accurate representation of Bitcoin’s market behavior.\n\nThe Stock-to-Flow (S2F) model offers a different yet complementary perspective. Popularized by an anonymous figure known as Plan B, this model assesses Bitcoin’s value based on its scarcity, a concept intrinsic to commodities. The S2F model calculates the ratio of Bitcoin’s total supply (stock) to its annual production rate (flow). This model’s relevance is amplified by Bitcoin’s predetermined supply schedule, characterized by halving events that reduce mining rewards and, thus, the flow, increasing the stock-to-flow ratio.\n\nThe S2F model gained significant attention, especially during the pandemic, as Bitcoin’s price seemed to follow its predictions. However, this model focuses solely on the supply side, omitting demand, a vital component in price determination. Its predictions, sometimes reaching astronomical figures, have sparked debates in the financial community.\n\nWhile the S2F model provides a standardized measure of scarcity, helping compare Bitcoin with other scarce assets, it’s essential to consider it as one of many factors in evaluating Bitcoin’s investment potential. Market acceptance, technological advances, regulatory changes, and macroeconomic conditions are equally crucial in shaping Bitcoin’s price.\n\nInterestingly, Santostasi’s models are more conservative than other predictions. Many argue that Bitcoin is in the early phase of S-curve exponential growth. Santostasi rejects such models, stating that exponential growth on log charts is not feasible.\n\n“Because the middle part implies exponential growth given in a log linear chart a straight line is an exponential. BTC has never gone through an exponential growth (I mean the general trend), the bubbles are exponential.”\n\nThus, while all of these models are used to predict Bitcoin’s price, they differ in their specific methodologies and assumptions. The S2F model focuses on supply and demand, Santostasi’s model uses regression analysis to predict future prices, MacDonell’s LPPL model uses a calibration approach, and Burger’s Power Law Oscillator is used chiefly as a technical analysis tool that varies over time within a particular band.\n\nIf the BTC Scaling Law (power law model) continues to be validated, Bitcoin’s current value is closer to $60,000, and the next all-time high will be around March 2026, above $200,000."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tcHJpY2UtZm9yZWNhc3QtaGVyZXMtd2hhdC1uZWVkcy10by1oYXBwZW4tZm9yLWJ0Yy10by1oaXQtNTAtMDAwLTIwMjQwMTMxMDQwNNIBhwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9iaXRjb2luLXByaWNlLWZvcmVjYXN0LWhlcmVzLXdoYXQtbmVlZHMtdG8taGFwcGVuLWZvci1idGMtdG8taGl0LTUwLTAwMC0yMDI0MDEzMTA0MDQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price Forecast: Here’s what needs to happen for BTC to hit $50,000 - FXStreet",
        "content": "Bitcoin price hovers above the 2024 open at $42,479 and the 2024 POC at $42,643.\n\nBTC has a higher chance of resuming the uptrend after tagging the daily FVG, extending from $41,396 to $40,288.\n\nA breakdown of the weekly level at $39,851 will invalidate the bullish thesis.\n\nBitcoin (BTC) price shot up 3% on Monday but has since undone most of the gains and currently trades around $42,762. But a few things need to happen before BTC shows its bullish hand and resumes the uptrend.\n\nAlso read: Week Ahead: Bitcoin price likely to support these altcoin narratives this week\n\nBitcoin price could reveal directional bias soon\n\nBitcoin price created the Monday’s range, extending from $41,807 to $43,324. The most common trade idea is to short BTC after a sweep of Monday’s high and book profits at Monday’s low.\n\nRead more: Bitcoin Week ly Forecast: As monthly close draws near, significance of $43,750 grows\n\nHere are a few key levels to watch if one is in this trade.\n\nThe highest traded volume level of 2024, aka the Point of Control (POC) at $42,643. The 2024 yearly open at $42,479. The midpoint of the previous bear market at $42,235.\n\nIn addition to these levels, the daily imbalance, extending from $41,396 to $40,288, is also a key area to watch. Imbalances or gaps are formed when the asset moves rapidly up or down due to inefficient order flow. These gaps are often revisited by the asset to rebalance and serve as support or resistance, depending on the type of imbalance.\n\nIn BTC’s case, the imbalance was formed due to a spike in buying pressure, so a retracement into this area will be a good place for sidelined buyers to open a long position.\n\nWhile this short-term play shows promise of a quick upside, investors need to be mindful of the big picture as well. As mentioned in a previous publication, Bitcoin price needs to produce a daily candlestick close above $48,222 to sustain the uptrend outlook.\n\nSupporting the bullish outlook are the Relative Strength Index (RSI) and the Awesome Oscillator (AO) momentum indicators. The RSI has overcome the 50 mean level and is retesting it as a support, which is a bullish indication. The AO is close to flipping above the zero level, which shows a shift in momentum favoring bulls.\n\nIn such a case, Bitcoin price could easily overcome the $48,222 level and potentially retest the $50,000 psychological level.\n\nBTC/USDT 1-day chart\n\nHowever, a potential spike in selling pressure that pushes Bitcoin price to slice through the $41,396 to $40,288 imbalance would denote a weak bullish camp. If this trend continues and leads to the production of a daily candlestick close below $39,851, it would produce a lower low and invalidate the bullish thesis for BTC.\n\nIn such a case, a steeper correction could be anticipated by investors, as pointed out in a previous publication. The $34,067 and $32,293 support levels will be where the Bitcoin price would likely consolidate and rethink a bounce."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDI0LzEvMzEvMjQwNTcxNzYvY3J5cHRvLWJpdGNvaW4tbWluaW5nLXN1cnZleS11cy1lbmVyZ3ktaW5mb3JtYXRpb24tYWRtaW5pc3RyYXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Crypto mines will have to start reporting their energy use in the US - The Verge",
        "content": "The US Department of Energy (DOE) will begin collecting data on crypto mines’ electricity use, following criticism from environmental advocates over how energy-hungry those operations are.\n\n“We will specifically focus on how the energy demand for cryptocurrency mining is evolving, identify geographic areas of high growth, and quantify the sources of electricity used to meet cryptocurrency mining demand,” Joe DeCarolis, administrator of the Energy Information Administration (EIA), said in a press release today.\n\n“We will specifically focus on how the energy demand for cryptocurrency mining is evolving.”\n\nThe EIA, the statistical agency of the Department of Energy, announced that it is “initiating a provisional survey of electricity consumption information from identified cryptocurrency mining companies” starting next week. The cryptocurrency mining companies will have to comply, per an “emergency collection of data request” the Office of Management and Budget authorized last week.\n\nGetting to this point has been a slog. After a ban on Bitcoin mining in China in 2021, the US became the world’s biggest hub for Bitcoin mining. The mining boom raised flags for lawmakers and activists because of the energy demands of the process. Bitcoin mines managed to resurrect fossil fuel power plants and raise electricity costs for some residents in New York.\n\nIn 2022, Democratic lawmakers asked the biggest crypto mining companies in the US to disclose their electricity consumption and associated pollution. None of the companies responded with all the data they were asked to provide, and Congress subsequently asked the DOE and EPA to require that crypto companies publicly share the information.\n\nIn letters between the agencies and Democratic lawmakers shared exclusively with The Verge last year, Secretary of Energy Jennifer Granholm wrote a letter to Senator Elizabeth Warren (D-MA) saying that the EIA has the authority to require crypto operations to report their energy use. Doing so would “require development of a new survey to collect this information,” the letter says. It looks like that’s what’s happening now. According to the letter, the EIA can potentially also require utilities to share information about how much electricity they sell to crypto companies."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvY3J5cHRvY3VycmVuY2llcy1ib3VuY2UtYmFjay13ZWVrLWJpdGNvaW4v0gFXaHR0cHM6Ly93d3cuZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC9jcnlwdG9jdXJyZW5jaWVzLWJvdW5jZS1iYWNrLXdlZWstYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrencies: Bounce-Back Week for Bitcoin - ETF Trends",
        "content": "This weekly update tracks some of the largest cryptocurrencies by market share: bitcoin and ether. We’ve also included XRP, as it was one of the largest cryptocurrencies when this series began. According to Wikipedia, a cryptocurrency is “a digital asset designed to work as a medium of exchange that uses cryptography to secure its transactions, to control the creation of additional units, and to verify the transfer of assets.”\n\nBitcoin was the world’s first cryptocurrency and decentralized digital currency. The first bitcoin transaction occurred in early 2009 and has since grown worldwide. Ether is another cryptocurrency run on the Ethereum blockchain platform and has the second largest market share, despite being the newest of the three with its launch in July 2015. XRP, which is owned by Ripple and launched in 2012, was one of the larger cryptocurrencies for some time until new coins joined the market. We’ve included it here for reference.\n\nThe third-largest market share of cryptocurrency, tether, is a token “backed by actual assets.” This includes one US dollar, one euro, or loans to affiliate companies and is controlled by the owners of Bitfinex. It’s a controversial cryptocurrency due to its alleged manipulation of crypto pricing. It is called a “stable coin” because it was designed to always be worth $1.00. We do not chart it because its price rarely changes.\n\nFor a better understanding of crypto market cycles, read more here.\n\nThe Latest Crypto Data (through January 30, 2024)\n\nBitcoin’s price bounced back this week to $43,000 but is still down ~3% year to date.\n\nXRP’s price inched down further and is currently down ~19% year to date.\n\nEther’s price improved over this past week and is now practically flat year to date.\n\nAn index has been created in order to chart these three cryptocurrencies together, considering their significantly different pricing histories. Ether tops the chart, i.e., the price of an ether has changed the most out of all three cryptocurrencies.\n\nOn January 10th, the SEC approved spot bitcoin ETFs from a range of issuers such as Grayscale Bitcoin Trust ETF (GBTC), iShares Bitcoin Trust (IBIT), Fidelity Wise Origin Bitcoin Fund (FBTC), ARK 21Shares Bitcoin ETF (ARKB), Bitwise Bitcoin ETF (BITB). Here are some of the quick takeaways from the spot bitcoin ETF launch.\n\nOther ETFs associated with cryptocurrencies include: ProShares Bitcoin Strategy ETF (BITO) ProShares Short Bitcoin Strategy ETF (BITI), VanEck Ethereum Strategy ETF (EFUT), and Bitwise Ethereum Strategy ETF (AETH).\n\nFor more news, information, and strategy, visit the Crypto Channel."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9hbHRlcm5hdGl2ZXMvbmV3cy93ZXJlLXNjcmFtYmxpbmctdG8tZmlndXJlLW91dC1zcG90LWJpdGNvaW4tZXRmcy1zYXlzLWluZHVzdHJ5LWV4ZWMtMjQ4NjM20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "'We're scrambling to figure out spot-bitcoin ETFs,' says broker-dealer exec - InvestmentNews",
        "content": "While broker-dealers can now allow their financial advisors to sell a new spot-bitcoin exchange-traded fund, firms still have plenty of work to perform regarding the product, according to senior brokerage executives who spoke Tuesday morning at an industry conference.\n\nOn January 11, the Securities and Exchange Commission gave its approval to 11 bitcoin ETFs, and they’re up and trading on public exchanges.\n\nSome firms were early adopters. For example, Wells Fargo Advisors, with close to 12,000 financial advisors across various business channels, said this month that it was selling new spot bitcoin exchange-traded funds, but only when a customer asked for the security in a nonsolicited trade, or without any prompting from a salesperson.\n\nBut other firms are much more tentative, according to executives who spoke Monday at the Financial Services Institute’s annual meeting, OneVoice, in Orlando, Florida.\n\n“When new structures come out, it presents new challenges,” said Matt Fries, head of investment products and partner solutions at Cetera Financial Group. “It’s daunting because there is so much innovation occurring with investment products.”\n\n“We’re scrambling to figure out spot-bitcoin ETFs right now,” said Fries, who was speaking on a panel titled, “Including Alternative Investments in Mainstream Portfolio Allocations.” “That wasn’t something that was on my mind a month ago, but now I’m writing a policy on how we’re going to handle these.”\n\nCetera Financial Group is developing training for its financial advisors regarding the product, he added.\n\nBroker-dealers typically have tight restrictions on trading volatile products such as futures and options contracts, which require special training at many firms. Volatile alternative asset classes, including currencies and metals, also face strict limitations in client portfolios. Spot-bitcoin ETFs are facing that same kind of scrutiny.\n\n“It is very difficult to stay ahead of this kind of stuff even when you are trying to stay ahead of it,” said Seth Miller, general counsel at Cambridge Investment Research Inc. He said that while he had anticipated the SEC’s decision to approve spot-bitcoin ETFs, it still took a week to introduce training for financial advisors who were interested in the product.\n\nMeanwhile, one Cambridge financial advisor was admonishing Miller over email to hurry and immediately approve trading of the new ETFs, Miller said. “When I look at other executives in this position, I ask, were you unprepared or were you just cautious?”\n\n[More: Bitcoin ETFs in 401(k)s a useful diversifier, proponents say]"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vaGFja2Vybm9vbi5jb20vbm8tcG93ZXItZ3JpZC10aGlzLWFmcmljYW4tdmlsbGFnZS1taW5lcy1iaXRjb2luLWZvci1lbGVjdHJpY2l0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "No Power Grid? This African Village Mines Bitcoin for Electricity - hackernoon.com",
        "content": "600 reads\n\nNo Power Grid? This African Village Mines Bitcoin for Electricity"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzMxL2NvdWxkLWJpdGNvaW4tZmFsbC1iZWxvdy0yMDAwMC10aGlzLXllYXItdGhhdHMtd2hhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Could Bitcoin Fall Below $20,000 This Year? That's What Many Retail Investors Are Expecting - The Motley Fool",
        "content": "Where will Bitcoin (BTC -5.14%) go from here? Now that spot Bitcoin exchange-traded funds (ETFs) have obtained approval, there should be more room for Bitcoin's value to go up given that it is easier than ever to invest in it. But in the days following the approval, the cryptocurrency actually declined in value.\n\nThere aren't earnings reports or sales numbers that can help suggest where Bitcoin's value will go. Speculators play a big role in the digital currency's valuation, and that's why there can often be a great deal of volatility and risk when investing in Bitcoin. And right now, a large chunk of retail investors are expecting a significant decline in 2024.\n\nMany retail investors expect Bitcoin to fall below $20,000 this year\n\nAccording to a recent survey from Deutsche Bank, retail investors aren't overly optimistic about crypto's near-term future. More than a third of retail investors expect the price of Bitcoin to fall to less than $20,000 by the end of the year. And around 10% believe that it will finish the year between $20,000 and $40,000, suggesting a more modest decline.\n\nThere are some crypto bulls out there who believe it could rise to more than $75,000 before the end of 2024, but that is the minority, with about 10% of retail investors in the U.S. expecting it to hit those levels. And that falls to just 5% of retail investors in Europe, and even less than that in the U.K.\n\nCould this be a self-fulfilling prophecy?\n\nWhen it comes to speculation, expectations can play a large role in returns. If investors expect an investment to underperform, they could sell the asset, hoping to avoid a loss on it in the future. And if there is a large number of people holding that opinion, there could be a surge of selling, putting downward pressure on the investment -- which in this case would be Bitcoin.\n\nThere are some early signs that investors may already be cashing out. After approval of many spot Bitcoin ETFs in January, investors unloaded Bitcoin as the digital currency went in the opposite direction of where some investors might have expected it to go after the approvals (i.e., up). At the end of 2023, Bitcoin was trading at more than $42,000, but it is little changed since then.\n\nThe big test for Bitcoin could come in April\n\nAn expectation of a lower price for Bitcoin is troubling, because it could lead to more selling in the near future. But one potential catalyst that may help the digital asset's valuation is Bitcoin halving. That's when the rewards for mining the crypto are cut in half in order to limit its supply growth. After halving events, there is typically an increase in the price of Bitcoin. That's at least what has happened at previous halving events in 2020, 2016, and 2012.\n\nHowever, at previous halving events, Bitcoin's value was never as high as it is now. In 2020, when it was trading at about $8,820 on halving day, it would rise to roughly $10,940 in the 150 days after the event, a 24% gain. A similar type of move this year could push Bitcoin up to around $50,000.\n\nThe next halving event is likely to happen in April. Whether Bitcoin does indeed benefit from a big rally after could dictate how the digital currency does the rest of the year, as that momentum could carry it for months.\n\nUltimately, there isn't a reason to think halving will have such a positive effect on the price, which suggests the event may already be priced in. But given the pattern of previous halving events, it wouldn't be surprising to see Bitcoin's price jump this year -- the big question is how much.\n\nShould you buy Bitcoin today?\n\nBitcoin is a volatile and risky investment. It can be extremely difficult to try and predict where its value will go. For the majority of investors, it may not be a suitable investment option given its inherent volatility.\n\nIf you're willing to take on that risk and are looking to hang on for the long term, then it may make sense to invest in the digital asset given the approval of the recent spot Bitcoin ETFs, as that should bring in a broader pool of investors.\n\nAt the very least, investors should expect a bumpy ride, regardless of which direction you expect Bitcoin to go this year."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnRoaW5rYWR2aXNvci5jb20vMjAyNC8wMS8zMC93aWxsLXNjaHdhYi1sYXVuY2gtaXRzLW93bi1iaXRjb2luLWV0Zi_SAVVodHRwczovL3d3dy50aGlua2Fkdmlzb3IuY29tLzIwMjQvMDEvMzAvd2lsbC1zY2h3YWItbGF1bmNoLWl0cy1vd24tYml0Y29pbi1ldGYvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Will Schwab Launch Its Own Bitcoin ETF? - ThinkAdvisor",
        "content": "What You Need to Know Bitcoin ETFs will be ubiquitous, Ric Edelman predicted.\n\nSchwab could be a low-cost competitor when and if it offers its own spot bitcoin ETF.\n\nEric Balchunas expects Schwab to file for a spot bitcoin ETF within a year.\n\nIt could take a year or more before Charles Schwab introduces its own spot bitcoin ETF, which market experts expect the giant asset manager to do eventually. And it could make a big splash when and if it does.\n\nSchwab typically isn’t the first to enter new categories, analysts note. In the meantime, the company can reap the benefits of offering all the new spot bitcoin ETFs developed by other asset managers and approved by the Securities and Exchange Commission this month, including funds from Fidelity and BlackRock.\n\nSchwab, as a “financial supermarket,” has good reasons to avoid or delay entering the spot bitcoin ETF fracas, according to Ric Edelman, founder of the Digital Assets Council of Financial Professionals.\n\nRemaining Agnostic\n\n“They pride themselves on making available an array of products and services to both investors and advisors that allow them to cater to the largest number possible. So by making available all 11 of these new spot bitcoin ETFs, Schwab is able to remain agnostic,” Edelman told ThinkAdvisor on Monday.\n\n“They don’t have to put themselves in a position of promoting a particular product or even promoting the asset class. They can simply stand above the fray and make it clear to their investors and advisors that the products are available for them to select as they wish,” he added.\n\nEric Balchunas, Bloomberg senior ETF analyst, sees Schwab potentially introducing its own spot bitcoin ETF within a year.\n\nSchwab and Fidelity are “always looking to stay in competition with each other, and so as Fidelity gets more and more success with their bitcoin ETF, it may start to torture Schwab,” Balchunas said.\n\n“Unlike Vanguard, they’re not anti-crypto at all. In fact, they have a crypto thematic ETF. So we know they’re open to it. … And then there’s just the fact that they generally enter categories late. They’re never the first,” the Bloomberg analyst said in an interview with ThinkAdvisor on Monday.\n\nA Competititve Splash?\n\n“So those are the reasons I could see them coming in with something and I could see them being really cheap. I mean, they do enter late, but when they enter, they usually make a splash with the lower fee,” Balchunas added. He predicted the company would at least file an application for a spot bitcoin ETF within 12 months, noting he was only speculating.\n\n“The timetable in this new category always seems sped up to me versus normal time. It just feels like it’s been like six months since they launched and it’s been two weeks,” Balchunas added. As Schwab sees demand for Fidelity and BlackRock spot bitcoin ETFs on its platform, there would be no reason for the brokerage not to develop its own, he said.\n\nFidelity and BlackRock already have gathered $2 billion in assets for their new bitcoin ETFs, Balchunas noted. “That’s strong for two weeks. It’s more than strong … That happens never, to be honest.”\n\nSchwab doesn’t comment on speculation, a spokeswoman said Monday.\n\nSchwab has no need to launch its own ETF in this category, according to Edelman, who nonetheless expects most all ETF sponsors to eventually offer crypto products.\n\nBy staying above the fray while offering other companies’ spot bitcoin ETFs, Schwab reinforces its objectivity and the investment community’s ability to obtain and execute any strategy they wish on Schwab’s platform “without worrying that there are limitations that could interfere with the preferences of the investors or advisors,” Edelman said.\n\nAs for a delayed entry, Edelman added, “it makes sense for Schwab to wait and see what market reaction is to these new products. Is there demand? Is there sufficient asset flow to justify the effort of creating your own investment option?”\n\nEdelman noted that “there’s been a race to the bottom” as spot bitcoin ETF providers, in an effort to win assets under management, are offering fees as low as 19 basis points, with many waiving fees for as much as a year."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNvcnJlY3Rpb24tZ3JheXNjYWxlLWdidGMtZXRmLW91dGZsb3dz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Grayscale GBTC exodus shakes up Bitcoin market dynamics - Cointelegraph",
        "content": "A new market report from Bitfinex suggests that a sizable sell-off of Grayscale Bitcoin Trust exchange-traded fund (ETF) shares, partly driven by bankrupt exchange FTX, significantly impacted Bitcoin’s recent price drop in January 2024.\n\nAccording to the latest market update from Bitfinex Alpha, the realization of profits following Grayscale’s successful conversion of its GBTC trust to an ETF was a significant influence on the marketwide correction that took BTC from $48,700 to $38,600 in a matter of days.\n\nGBTC and BlackRock’s IBIT spot ETF flows reflect the largest total positive and negative flows for spot Bitcoin ETFs. Source: etf.com/Bitfinex Alpha\n\nBitfinex head of derivatives Jag Kooner unpacked the finer details of report in correspondence with Cointelegraph. Kooner emphasizes the significant “discount” afforded to GBTC investors as a primary driver for the high volume of share selling in recent weeks:\n\n“The discount was over 50% during the bear market lows in late 2022, and it’s non-existent now because of arbitrage traders. This was one of the most expected results of spot ETFs rolling out, which means these investors have been waiting for a long time to realize these profits,” Kooner explains.\n\nThe report highlights $4.3 billion outflows following GBTC’s conversion to a spot Bitcoin ETF on Jan. 16. Conversely, the highest net inflows for an individual spot Bitcoin ETF were to BlackRock’s iShares Bitcoin Trust (IBIT), attracting $1.82 billion.\n\nRelated: Fidelity Bitcoin ETF rakes in reported $208M, offsetting Grayscale outflows alone\n\nBitfinex analysts also draw attention to the impact of ETF flows on the BTC price, illustrated by the fact that there was no flow of funds into the respective spot Bitcoin ETF on Saturday, Jan. 20.\n\nGrayscale’s GBTC remains the largest Bitcoin ETF, with its total assets under management hovering around the $24 billion mark despite dropping from $28.6 billion before its conversion.\n\nFTX sells GBTC shares as ETF fee battle begins\n\nThe Bitfinex report also notes that converting Grayscale’s trust to a spot Bitcoin ETF facilitated the sale of significant shares held by bankrupt cryptocurrency exchange FTX. FTX sold 22 million GBTC shares, valued at nearly $1 billion, completely liquidating its shares.\n\nAnother factor highlighted by Bitfinex Alpha is the impact of spot BTC ETF fees. Kooner noted that Grayscale’s competitors currently charge fees ranging from 0.2% to 0.9%, while it charges 1.5%:\n\n“This difference in fees has incentivized investors to move their funds from GBTC to lower-cost Bitcoin ETF options. Additionally, multiple other ETF filings have waived off fees for the first year, further incentivizing a migration from GBTC to other products.”\n\nData reflects a cooling of trading volume between Bitcoin ETF funds toward the end of January 2024. Source: Bitfinex Alpha/CryptoQuant.\n\nKooner said that investors are looking for more cost-effective ways to gain exposure to Bitcoin, which has impacted the shift of capital within the nascent Bitcoin ETF space. As January draws to a close, ETF data suggests that the movement of capital between the various ETF funds is beginning to settle.\n\n\"The daily outflows are reducing on a daily basis but are still quite high at an average of around $450 million per day. Unless there is change in fee structure, outflows are expected to continue,\" Kooner adds.\n\nThe Bitfinex head of derivatives concluded by highlighting that large GBTC investors who bought shares at a 50% discount over the past two years would realize profits on an earlier timeline than other investors, which is indicative of the trading behavior in January.\n\nMagazine: Big Questions: How can Bitcoin payments stage a comeback?"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMzEvZXRoZXItdGFrZXMtY2VudGVyLXN0YWdlLWFzLWJpdGNvaW4tZmluZHMtZm9vdGluZy1oZWFkaW5nLWludG8tb25lLW9mLXN0cm9uZ2VzdC1tb250aHMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ether takes center stage as bitcoin heads into one of strongest months - CNBC",
        "content": "Ether is ready to take the limelight in the month ahead after bitcoin and newly launched bitcoin exchange-traded funds dominated crypto investor attention in January. Both bitcoin and ether are on pace to finish the month higher by 0.01%, according to Coin Metrics. January saw sharp price swings driven first by hype before the launch of the first spot bitcoin ETFs in the U.S., and subsequent flows into and out of the funds after they began trading Jan. 11. By now, the outflows have tapered off and bitcoin's outlook for the year is still strong, boosted by the upcoming halving and the potential for rate cuts. As investors came to expect slow, steady flows into bitcoin through newly institutionalized ETFs in coming months, ether and altcoins have been ready for a breakout. \"Short-term flow has been dominated by GBTC [Grayscale Bitcoin] sales. … As that flow is easing, the market has found its footing and the reality of a world where large asset managers promote crypto actively is starting to hit home,\" said Darius Tabatabai, co-founder at decentralized exchange Vertex Protocol. \"ETH and the alts are acting as high beta plays on this trend and our expectation is that both will outperform as more focus starts to direct towards ETH rolling out upgrades to [the Ethereum network] … as well as a potential ETF approval.\" February is a historically strong month for both bitcoin and ether. Bitcoin has finished nine of the last 11 Februarys in the green and has had an average return of 13.12% for the month, according to CoinGlass. Ether has finished the month higher in six of the last seven since its inception, giving it an average February gain of 12.97%. Soon after the U.S. Securities and Exchange Commission approved spot bitcoin ETFs for trading, investors took profits and rotated into ether, pushing it to a 20-month high as they looked ahead to what might come next. The SEC is due to give decisions on spot ETH ETF applications beginning in May. BlackRock, Invesco, Ark and VanEck are among the firms in line for approval, as well as Grayscale, which is seeking to convert its existing Ethereum Trust (ETHE) into an ETF. Standard Chartered said in a note this week that ahead of the May decision, it expects ether to track or outperform bitcoin's pre-ETF uptrend in the comparable period. If it does, it could reach $4,000 by then, the bank added, which would equal a roughly 70% increase from current levels. \"Bitcoin remains the more popular macro asset with cross-over appeal to traditional finance, and Solana is gaining popularity as a faster and cheaper alternative to Ethereum,\" said Jeff Dorman, chief investment officer at crypto asset manager Arca. \"Nonetheless, Ethereum is not going away anytime soon, and it could even compete with Bitcoin if an ETF is approved, or if bitcoin investors realize they want exposure to areas of blockchain's growth that Bitcoin doesn't offer, such as stablecoins, NFTs, [decentralized finance], gaming [and] AI.\" Ethereum is continually improving and upgrading , Dorman added, which will help the network grow in line with cheaper and faster alternatives such as Solana. Its next big update, called \"Dencun,\" is expected to take place in February and is meant to make transactions on so-called Layer 2 solutions — networks that sit on top of a base network like Ethereum and exist to provide extra capacity and functionality to the network — less expensive. Ether is also poised to benefit from the popularity of altcoins , many of which run on top of the Ethereum blockchain, according to Jason Urban, the global head of trading at Galaxy Digital. \"We've seen an uptick in alt interest. … ETH is probably more poised to benefit from that\" than bitcoin, he said. \"There are going to be people that will manifest that play, especially more [traditional finance] people that might not have access or the ability to trade a bag of alts. You'll see that manifest in ETH.\" For January, ETH is heading to a less than 1% gain, while other alts are a mixed bag. Since Jan. 23, however, when bitcoin fell below $40,000 for the first time this year, they've rallied, while ETH has been stagnant. ETH is weaker during that period, while SOL has gained 14%, Polygon's MATIC rose 4% and the tokens tied to Chainlink and Cardano advanced 4% and 3%, respectively. \"If you believe in a bullish market trend like in 2020 and 2021, then it makes sense to invest in the 'fastest horse,' which are the smaller and cheaper blockchains and applications,\" Dorman said. — CNBC's Michael Bloom contributed reporting."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmV0Zi5jb20vc2VjdGlvbnMvbmV3cy9zcG90LWJpdGNvaW4tZXRmLXJhY2UtbmFycm93cy1pYml0LXZzLWZidGPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Spot Bitcoin ETF Race Narrows to IBIT vs. FBTC - etf.com",
        "content": "Spot bitcoin ETFs from the largest issuers are separating themselves from the pack of 10 that launched earlier this month, as the race for billions of investor dollars flowing into the crypto investments begins to declare winners and losers.\n\nThe iShares Bitcoin ETF (IBIT) and the Fidelity Wise Origin Bitcoin Fund (FBTC) have gathered $2.8 billion and $2.2 billion in assets under management, respectively, since their Jan. 11 debut, according to Bloomberg data.\n\nEach of those totals is larger than the next seven spot bitcoin exchange-traded funds combined. The ARK 21 Shares Bitcoin ETF (ARKB) and the Bitwise Bitcoin ETF (BITB) have $662 million and $634 million in AUM, respectively, while the rest of the pack has $307 million or less.\n\nFund Data\n\nThe outcome may not necessarily surprise anyone. BlackRock was expected to eventually take the spot bitcoin ETF crown thanks to its position as the largest asset manager in the world, as well as the largest ETF issuer in the U.S.\n\nAnd as the third largest brokerage firm with a massive asset management business of its own, Fidelity was also anticipated to be a big player in the space.\n\nIBIT, FBTC Go for the Spot Bitcoin ETF Gold\n\nAs expectations are now being met, the gap between IBIT, FBTC and the rest of the pack will likely widen. Still, when or if either of those ETFs grabs the spot bitcoin ETF crown from the Grayscale Bitcoin Trust (GBTC) is open to debate.\n\nSince its conversion into an ETF, investors have pulled $5.5 billion out of GBTC, pushing its AUM down to $21.2 billion, according to Bloomberg data. But that still leaves it 10 times bigger than Fidelity’s ETF and almost eight times bigger than BlackRock’s fund.\n\nThe outflows from GBTC are already slowing. Most investors who were going to swap out of the relatively-expensive GBTC and into cheaper alternatives have already done so, while arbitrageurs who bought the trust at a discount before its conversion have already locked in their gains.\n\nOn the other hand anyone interested in investing in bitcoin through ETFs probably won’t choose GBTC over its competitors due to its high fees, so it’s unlikely that the trust sees substantial inflows anytime soon.\n\nWhat’s at Stake\n\nStill, IBIT or FBTC taking over GBTC as the largest spot bitcoin ETF will take time. Assuming prices for bitcoin stay flat, it would take almost $20 billion of inflows for either ETF to eclipse GBTC in terms of total assets.\n\nIf bitcoin prices rise, it will take even larger inflows since GBTC’s AUM will disproportionately benefit from that increase (a 10% increase in GBTC’s AUM is $2.1 billion, while the same increase in IBIT’s AUM is only $200 million).\n\nThe task becomes easier if bitcoin prices fall. In that scenario, GBTC’s AUM will decline faster than that of either IBIT or FBTC (on a dollar basis), closing the gap between the funds."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2Utb24tamFudWFyeS0zMS1iaXRjb2luLWZhbGxzLWJlbG93LTQzMDAwLWxldmVsLWFoZWFkLW9mLXVzLWZlZGVyYWwtcmVzZXJ2ZS1pbnRlcmVzdC1yYXRlLWRlY2lzaW9uL2FydGljbGVzaG93LzEwNzI4NjQyOC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLW9uLWphbnVhcnktMzEtYml0Y29pbi1mYWxscy1iZWxvdy00MzAwMC1sZXZlbC1haGVhZC1vZi11cy1mZWRlcmFsLXJlc2VydmUtaW50ZXJlc3QtcmF0ZS1kZWNpc2lvbi9hbXBfYXJ0aWNsZXNob3cvMTA3Mjg2NDI4LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Crypto Price on January 31: Bitcoin falls below $43,000 level ahead of US Federal Reserve interest rate de - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nAhead of the US Federal Reserve policy decision later in the day, major crypto tokens were trading mixed with a negative bias on WednesdayAt 12.20 p.m., Bitcoin was trading 0.79% lower at $42,954, while Ethereum was up 1.3% at $2,332. Meanwhile, the global cryptocurrency market cap declined 0.61% to around $1.65 trillion in the last 24 hours.All eyes are on the Federal Reserve's decision on interest rates today, widely anticipated to stay the same. Maintaining this price until month-end would signify Bitcoin's fifth consecutive monthly gain, its lengthiest positive streak. This is likely to continue until Bitcoin halving takes place, said Edul Patel, CEO of Mudrex.Shivam Thakral, CEO of BuyUcoin, said, \"The crypto market is in a wait-and-watch mode as the Fed meeting on the first interest rate decision of 2024 is underway. A decision to cut the interest rate will boost market liquidity and spark economic activity across sectors. Bitcoin is well-positioned to start another growth cycle owing to positive macroeconomic factors.\"In today's trade, altcoins such as BNB , Solana, XRP , Cardano, Avalanche, Dogecoin , Polkadot, Toncoin, Internet Computer and Shiba Inu declined 2-4%. While Tron, Chainlink, and Polygon rose 1-5%.The total volume in DeFi is currently $5.02 billion, 8.73% of the total crypto market 24-hour volume. The volume of all stablecoins is now $52.85 billion, which is 91.83% of the total crypto market 24-hour volume.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, dropped to $842 billion. Bitcoin's dominance is currently 51.02%, according to CoinMarketCap. BTC volume in the last 24 hours surged marginally to $22.7 billion.\"BTC has maintained stability, hovering around $43,000. It remains above both the 20 and 50 EMA Daily. For a substantial upside move, BTC needs to overcome the key resistance level at $44,500,\" said CoinDCX Research Team.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXNlYy1mdWVscy1zcG90LWV0aGVyLWV0Zi0wNjAwMzQ4NzcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin success with SEC fuels anticipation for ether spot ETF - Yahoo Finance UK",
        "content": "Investors are anticipating that ethereum (ETH-USD) could be the next cryptocurrency included in a spot exchange-traded fund (ETF), leading to a shift in market sentiment, an analyst told Yahoo Finance UK.\n\nZodia Markets CEO Usman Ahmad told Yahoo Finance Future Focus: \"Ethereum is where the market is looking next for a spot ETF approval.\"\n\nRead more: Turning assets into tokens on blockchain is $15tn market, says analyst\n\nAfter the US Securities and Exchange Commission (SEC) approved the first US-listed ETFs to track bitcoin (BTC-USD) earlier in January, investors are anticipating the potential approval of spot ether ETFs.\n\nMarket focus has shifted to anticipate the approval of ethereum spot ETFs. (SOPA Images via Getty Images)\n\nMarket shifts focus to ether\n\nAhmad said that the market had initially priced in the approval of a spot bitcoin ETF. Once this became a reality, attention turned to ethereum. He highlighted a price increase of around 10% to 12% for ether after the approval of multiple spot bitcoin ETFs, indicating that ethereum is now in the spotlight for the next potential ETF approval.\n\nADVERTISEMENT\n\n\"It is difficult to forecast whether ether will outperform bitcoin because now that bitcoin has an ETF wrapper, there is potentially more demand,\" Ahmad said. Bitcoin has seen increased demand due to its newfound accessibility through ETFs.\n\nRead more: Crypto live prices\n\nTaking a longer-term view, he expects bitcoin to continue performing well and experiencing a price increase as it becomes more widely accessible to the mass market.\n\nAhmad also observed that fund managers such as BlackRock (BLK), who filed an application for a spot ether ETF with the SEC in November 2023, might pave the way for the market to gain access to baskets of crypto assets within ETF wrappers in the future.\n\nSpot bitcoin ETF a 'sell the news' event\n\nAlthough the price of bitcoin has decreased from a post-ETF approval peak of over $48,000 to its current value of around $42,000, investors remain optimistic that spot Bitcoin ETFs will pave the way for mainstream capital to enter the cryptocurrency market.\n\nStory continues\n\nRead more: US crypto crackdown 'an opportunity for the UK'\n\nDespite the short-term fluctuations, Ahmad said: \"In the medium to longer-term, we will see a stabilization and long-term positive tailwinds for Bitcoin price action and volume activity going forward.\"\n\nPossibility of another rate pause\n\nSwitching gears to the macroeconomic perspective, Ahmad discussed the potential for a US interest rate pause and its implications for investor confidence in capital allocation strategies. He pointed out that after a rapid increase in rates following 15 years of near-zero interest rates, the market is now likely to experience another rate pause at this week's US Federal Reserve meeting.\n\nThis pause may provide investors, particularly those dealing with risk assets like bitcoin and digital assets, with more confidence to allocate capital to this asset class, according to Ahmad.\n\nWatch: Turning real assets into tokens on blockchain has $15 trillion market potential | Future Focus\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDI0MDEzMDAxMTg2My9lbi9Qb3J0YWwtUmFpc2VzLTM0LU1pbGxpb24tU2VlZC1Sb3VuZC10by1TdXBwb3J0LURldmVsb3BtZW50LW9mLURlY2VudHJhbGl6ZWQtQml0Y29pbi1CYXNlZC1FeGNoYW5nZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Portal Raises $34 Million Seed Round to Support Development of Decentralized Bitcoin-Based Exchange - Business Wire",
        "content": "SAN FRANCISCO--(BUSINESS WIRE)--Portal, a fintech provider advancing financial self-sovereignty with robust technology for seamless access to Bitcoin and diverse cryptocurrency markets, today announced it has exited stealth mode and raised $34 million in seed funding. Investors that participated in the round include Coinbase Ventures, Arrington Capital, OKX Ventures and Gate.io, as well as many other high-profile fintech and crypto investors. The seed funding builds on Portal’s angel round of $8.5 million, which closed in 2021.\n\nThe new funding comes at a pivotal moment for the crypto industry as it grapples with the security risks and fragmentation inherent in cross-chain bridges, centralized exchanges (CEXs) and decentralized exchanges (DEXs). In fact, over the last two years, approximately $2.5 billion has been stolen from bridges alone by hackers, according to Token Terminal, with prominent hacks of bridges such as Wormhole, HECO/HTX, Nomad, Harmony, Multichain, BNB bridge and Orbit. With few alternative cross-trading solutions on the market, users are forced to rely on highly centralized, opaque and risky swapping solutions like wrappers, bridges and custodians.\n\n“Bridges, centralized exchanges and other custodial solutions that enable cross-chain exchange have been vulnerable and insecure for as long as they have existed,” said Chandra Duggirala, co-founder and CEO of Portal. “From the very early days of Mt. Gox to FTX, centralized exchanges have been a persistent source of risk to user funds. Now, the risk remains, but it has taken a new form in bridges and other custodial cross-chain solutions. Portal intends to solve the problem of custodial risk once and for all using secure and transparent Layer 2 atomic swap technology. With the support of our investors, we look forward to introducing cross-chain infrastructure that finally enables users to execute trades quickly and safely.”\n\nThrough its novel, decentralized and trust-minimized infrastructure, Portal is building a solution that will enable peer-to-peer swapping of Bitcoin across a range of blockchains without the need for dangerous intermediaries like wrappers, bridges, CEXs and multi-hop DEXs. As a staking and swapping layer, interoperability layer and execution layer, Portal’s infrastructure will enable any user to swap Bitcoin across a range of blockchains and back in seconds without giving up custody, privacy or security.\n\nPortal will use the funds to develop its two flagship products: Portal DEX and Portal Wallet. Portal DEX is the first Bitcoin-based exchange that enables Layer 2 atomic swaps of cryptocurrencies across blockchains at greater speed, lower cost and with increased transparency, security and interoperability. Portal Wallet is a fully non-custodial tool that integrates Portal DEX and allows users to receive, store and send cryptocurrencies across blockchains.\n\nIn the coming months, Portal will launch several new groundbreaking products previously only available to large institutions and hedge funds. They include an AI-powered, co-pilot investment application for acquiring financial intelligence and maximizing high-level investment strategies; and an API integration tool for building Portal DEX cross-chain swap functionality into existing wallets, DeFi applications on any chain and Web3 DApps. Portal will also be announcing several strategic partnerships with major Bitcoin projects to enhance the utility and accessibility of Bitcoin, which have been bottlenecks for the crypto community.\n\n“Portal is pioneering what DeFi on Bitcoin looks like and we are thrilled to be supporting this team that continues to deliver,” said Michael Arrington, founder and partner of Arrington Capital. “Portal is rapidly pushing ahead the Bitcoin ecosystem by enabling fast and low-cost economic activity without being beholden to third parties. As one of the largest asset classes, Bitcoin will be more accessible and secure for individuals thanks to Portal’s unique approach to access, security and products.”\n\n“Portal is carving a unique niche in the evolving Bitcoin landscape, crafting an innovative, cross-chain, private DEX protocol that masterfully addresses the complexities and risks of both centralized and decentralized exchanges,” said Dora Yue, founder of OKX Ventures. “The Portal platform is a game-changer, making decentralized trading and financial contract creation for Bitcoin and other assets both faster and more secure. It's a leap towards a future where trading is more responsive, liquid and secure.”\n\nAbout Portal\n\nPortal is a fintech provider advancing financial self-sovereignty with robust technology for seamless access to Bitcoin and diverse cryptocurrency markets. A builder of the foundational pieces of technology required for a trustless and inclusive economy, Portal offers an advanced technological infrastructure, improved systems for coordination and easy-to-use tools previously only available to large institutions and hedge funds. Portal enables individual investors to exchange digital assets across blockchain networks with greater efficiency and speed, lower costs, increased transparency and enhanced security and privacy. A pioneer and an advocate for free and unfettered markets, Portal was founded in 2019 and is based in the San Francisco Bay Area. Portal is backed by Coinbase Ventures, Arrington Capital, OKX Ventures, Gate.io and many other prominent fintech/crypto investors. For more information, visit https://portaldefi.com."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTMwL2dlcm1hbi1wb2xpY2Utc2VpemUtMi0xLWJpbGxpb24taW4tYml0Y29pbi1mcm9tLWZpbGUtc2hhcmVyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "German Police Seize $2.1 Billion in Bitcoin From File Sharers - Bloomberg",
        "content": "German prosecutors provisionally seized nearly 50,000 Bitcoin worth about $2.1 billion as part of an investigation into what they see as an illegal file-sharing platform.\n\nIt’s the largest amount of Bitcoin ever secured by law enforcement in Germany, Saxony prosecutors said Tuesday. Germany’s Federal Criminal Police Office and the US Federal Bureau of Investigation supported the investigation."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3dlYWx0aC1tYW5hZ2Vycy1iaXRjb2luLWV0ZnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "'Primary market' for bitcoin ETFs largely hasn't yet adopted such funds - Blockworks",
        "content": "Net inflows into US spot bitcoin ETFs stand at more than $1.2 billion — a number industry watchers expect to balloon exponentially as more investment professionals allocate to such funds.\n\nBut much of the “primary market” for spot bitcoin ETFs needs more time before putting client capital into them, according to Galaxy Digital research head Alex Thorn.\n\nThorn is referring to the wealth management sector, which he estimates to control $48 trillion in assets.\n\n“Most of US wealth management [assets under management] is affiliated with banks or broker-dealers, and these platforms have not yet added the bitcoin ETFs to their investment options,” Thorn told Blockworks. “That takes time, but it will happen.”\n\nRoughly 80% of financial advisers surveyed by Bitwise and VettaFi late last year said they were either unable to buy crypto for clients, or unsure whether they could. Respondents included independent registered investment advisers (RIAs), as well as broker-dealer representatives, financial planners and other institutional investors.\n\nOf the surveyed advisers interested in adding bitcoin exposure to client portfolios, nearly 90% said they were waiting until after a spot bitcoin ETF was approved.\n\nRead more: SEC officially approves spot bitcoin ETFs in landmark decision\n\nWirehouses — a term for firms such as Bank of America Merrill Lynch, Morgan Stanley and Wells Fargo — are usually the slowest to allocate to new offerings, said Ric Edelman, founder of Edelman Financial Services and the Digital Assets Council of Financial Professionals.\n\n“Major firms all have investment committees, which need time to decide which of these products to approve for use,” Edelman told Blockworks. “Meanwhile, their legal and compliance officers must write policies governing which of their advisers can offer these products, and which of the firm’s clients will be permitted to invest in them — along with how much each client is permitted to invest.”\n\nWhile independent RIAs are more agile when it comes to allocating new funds, a majority won’t do so immediately, Edelman added. He noted that most advisers don’t fully understand crypto or blockchain technology and will have to figure out how to explain these sectors to clients.\n\n“Only after they get past that hurdle are advisers ready to tackle the big tactical questions,” Edelman said. “Which clients should invest in these ETFs? What allocation is best for them? How will the advisers communicate this recommendation, and how will they respond to client questions and objections?”\n\nEdelman expects financial advisers to allocate more than $150 billion into spot bitcoin ETFs in the next two years.\n\nTen spot bitcoin ETFs launched on Jan. 11. While funds by BlackRock and Fidelity lead the pack with more than $2 billion of net inflows each, outflows from Grayscale Investments’ Bitcoin Trust ETF (GBTC) have tempered the sector’s asset gains.\n\nEdelman predicts the BTC funds to be on wealth manager platforms — with advisers given the ability to allocate to them on behalf of clients — over the next six to 12 months.\n\n“To assess the real success of the bitcoin ETFs, months three through 12 will be much more important than months one through three,” Thorn noted.\n\nRyan Rasmussen, senior crypto research analyst at Bitwise, said some wealth managers — namely RIAs — are already investing in crypto products, with allocations ranging between 1% and 5%. Teams at such investment firms are creating a crypto sleeve in their model portfolios, he added.\n\nRead more: Financial pros mull allocation boosts to ‘chaos-resilient’ BTC: Bitwise\n\n“That should translate to meaningful inflows into these products,” Rasmussen told Blockworks. “For example, if the spot bitcoin ETFs sucked up 1% of all ETF assets in the US, that would be more than $70 billion of assets under management in spot bitcoin ETFs. We believe that is very reachable.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvZW5jb3VyYWdpbmctc2lnbnMtbW91bnQtYml0Y29pbi_SAU1odHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2VuY291cmFnaW5nLXNpZ25zLW1vdW50LWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Encouraging Signs Mount for Bitcoin - ETF Trends",
        "content": "Good timing often helps some new exchange traded funds. And that was expected to be the case for the 10 recently launched spot bitcoin ETFs, including the Invesco Galaxy Bitcoin ETF (BTCO).\n\nBTCO and friends were expected to be beneficiaries of pent-up demand. The reality is the debut of spot bitcoin ETFs proved to be a “buy the rumor, sell the news” event. As highlighted by a strong showing Monday, the selling appears to be ebbing. And with Monday’s rally, the digital currency is now in the green on a year-to-date basis.\n\nObviously, that’s constructive for ETFs such as BTCO. But the good news for investors is that, well, there’s more good news.\n\nStars Could Align for BTCO, Bitcoin Rally\n\nMultiple factors indicate BTCO and the digital currency could be in for some near-term upside. For example, JPMorgan said in a new report that selling pressure on bitcoin caused by the conversion of one of BTCO’s rivals to an ETF from the index fund structure appears to be abating. That’s pertinent because that selling was in the billions of dollars.\n\nData indicates that outflows from the BTCO rival waned last week. That might be one reason the digital currency started this week on a strong note. Additionally, The Daily Hodl reports that the cryptocurrency whales have accumulated $3 billion worth of the largest cryptocurrency this month.\n\n“Whales’ include any entity, individual or fund (including the ETFs) holding over 1,000 BTC. While Bitcoin ETFs have seen net inflows of $820 million, Bitcoin whales have seen an increase of ~$3 billion (76,000 BTC) so far in 2024. Including GBTC, Bitcoin ETFs now hold 3.23% of Bitcoin’s circulating supply,” according to the publication.\n\nIn other words, ETFs such as BTCO are having the desired effects of acting as new buyers of bitcoin while removing supply from the market. The April halving of bitcoin could act as another significant catalyst for the digital currency and funds such as BTCO.\n\nOn a recent edition of the Scott Melker podcast, Skybridge Capital Founder and Managing Partner Anthony Scaramucci said in the 18 months post-halving, bitcoin could quadruple in price. So if it trades at $40,000 on the day of halving, it could reach $160,000 or more by late 2025.\n\nHe added that his long-term forecast for the digital currency is that its market capitalization will eventually reach half that of gold. That implies a run to $400,000.\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhhbHZpbmctaG9waXVtLXN0dWR5LXJldmVhbHMtODQtb2YtaW52ZXN0b3JzLWV4cGVjdC1uZXctYWxsLXRpbWUtaGlnaHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin halving hopium: Study reveals 84% of investors expect new all-time highs - Cointelegraph",
        "content": "The fourth-ever Bitcoin halving is driving optimism for new all-time highs for Bitcoin (BTC), according to a market study involving nearly 10,000 cryptocurrency investors.\n\nData from a survey focused on investor sentiment and anticipation of Bitcoin’s next mining reward halving by cryptocurrency exchange Bitget reflects investor confidence around the highly anticipated event.\n\nResults shared with Cointelegraph outline key findings of the study and its methodology, which aimed to draw from a representative sample of cryptocurrency investors worldwide. A range of demographics was covered, with participants hailing from countries in Western and Eastern Europe, South and Southeast Asia, the Middle East and Northern Africa, and Latin American regions.\n\nRelated: $100K BTC? Don’t undervalue Bitcoin ETF influence, says Adam Back\n\n9,748 people participated in the study between November and December 2023, with the data anonymized for analysis.\n\n84% of participants expect Bitcoin to surpass the 2021 bull market all-time high of $69,000. Eastern Europe respondents were the least bullish on this outcome at a regional level, with 75% of respondents voting yes to BTC potentially surpassing its previous record.\n\nInvestors indicated an optimistic view of Bitcoin’s price following a prolonged bear market cycle. Source: Bitget Bitcoin halving survey\n\nInvestors from Western European countries were the most optimistic about the next price top for Bitcoin, with 41% of respondents expecting BTC to surpass the $100,000 mark. However, the report notes that investors from the region were less convicted about the Bitcoin halving impact on BTC’s price:\n\n“It may indicate that these investors are ‘short-term cautious, long-term optimistic,’ as some Western European investors do not believe the Bitcoin halving will trigger a new bull market.”\n\nMeanwhile, respondents from Latin America, East Asia and Southeast Asia were the most optimistic that the Bitcoin halving would significantly impact BTC’s price. 84%, 82% and 81% of respondents from the regions above foresee a substantial impact of the mining reward halving.\n\nIn an interview with Cointelegraph on Jan. 30, Bitcoin proponent Paul Sztorc offered a contrasting view of the impact of the Bitcoin halving, suggesting the event would be a litmus test for the mining industry in particular as rewards drop while the hash rate and mining difficulty continue to reach new highs.\n\nRelated: Bitcoin halving 2024 — Miners predict potential outcomes of reduced BTC rewards\n\nSztorc suggests that the initial impact on price might not be as pronounced as some commentators predict. In an interview in December 2023, fellow Bitcoin proponent and cryptographer Adam Back told Cointelegraph that the next Bitcoin peak might come 18 months after the next halving.\n\nSeveral prominent mining companies gave in-depth predictions about the impact of the halving on their operations and the need to be highly efficient to remain profitable in one of Cointelegraph’s 2024 New Year Specials.\n\nMagazine: Big Questions: How can Bitcoin payments stage a comeback?"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9nYnRjLW91dGZsb3dzLWRyb3AtYml0Y29pbi1leGNoYW5nZXMtYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "GBTC outflows drop 70% from peak as Bitcoin exchanges shed BTC - Cointelegraph",
        "content": "Bitcoin (BTC) exchange outflows in January are chipping away at bearish BTC price prognoses.\n\nThe latest data from on-chain analytics firm Glassnode confirms that despite a 20% dip on BTC/USD, coins have continued to leave exchanges.\n\nData: Bitcoin ETF panic subsiding\n\nBitcoin investor appetite has not suffered as a result of current BTC price pressures, according to on-chain monitoring.\n\nPer Glassnode, outflows from United States exchange Coinbase alone have consistently totaled more than 10,000 BTC per day since the launch of the first U.S. spot Bitcoin exchange-traded funds (ETFs).\n\nBitcoin net outflows from Coinbase. Source: Glassnode\n\nWhile balance data shows the impact of corresponding inflows, a trend is nonetheless emerging in the second half of the month — outflows and inflows are becoming more balanced, suggesting a cooling of the volatility seen post-ETF launch on Jan. 11.\n\nBitcoin netflows for Coinbase. Source: Glassnode\n\nExchanges’ BTC balances had been rising throughout January, only reversing direction on Jan. 23.\n\nSince that date, the trading platforms tracked by Glassnode have become lighter to the tune of 7,400 BTC ($321 million).\n\nBitcoin exchange balances. Source: Glassnode\n\nGBTC inches toward flow “flippening”\n\nAt the same time, ETF flows themselves are also trending in Bitcoin bulls’ favor.\n\nRelated: BlackRock Bitcoin ETF passes $2B holdings as GBTC outflows dip 50%\n\nWhereas the Grayscale Bitcoin Trust (GBTC) was sending around $700 million in BTC to Coinbase per day previously, the latest daily outflows totaled less than $200 million.\n\nIn BTC terms, Jan. 25 saw 24,000 BTC in outflows, while Jan. 29 saw little over 6,000 BTC.\n\nGrayscale Bitcoin Trust (GBTC) netflows (screenshot). Source: CoinGlass\n\nAnalyzing GBTC flows using data from statistics resource CoinGlass, financial commentator Tedtalksmacro predicted an incoming flip for the spot ETFs — from net outflows to net inflows.\n\n“Once we start to see green on this chart, what narrative do you have to sell other than some unknown event that we don’t know about now,” he argued in his latest YouTube video.\n\nTedtalksmacro described the bearishness accompanying GBTC outflows in recent weeks as “overblown.”\n\n“$26 billion in on-chain holdings in these BTC ETFs, and that number is going to keep going higher and higher and higher as people get more comfortable with this asset class,” he forecast about worldwide ETF products.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzMxL3doeS1jYXRoaWUtd29vZC10aGlua3MtYml0Y29pbi1jYW4tc3VycGFzcy02NTAwMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Why Cathie Wood Thinks Bitcoin Can Head Higher Than $650,000 - The Motley Fool",
        "content": "Ark Invest CEO and famous stock picker Cathie Wood is one of crypto's biggest bulls. It's no secret that she is extremely optimistic about the long-term potential for cryptocurrencies, with Bitcoin (BTC -5.14%) being potentially one of the best investments to hold on to, according to her.\n\nToday, Bitcoin's value is around $40,000 but in the long run, Wood believes it could be even better than a 10-bagger and grow to $650,000 or more. But why is she so bullish on Bitcoin?\n\nWhy Cathie Wood believes Bitcoin could soar to $650,000 and higher\n\nIn a recent interview with Yahoo! Finance, Wood was discussing her optimistic views on Bitcoin and what the approval of spot Bitcoin exchange-traded funds (ETFs) would mean for the cryptocurrency. And approval of the ETFs, she believes, would signal to institutional investors that the \"coast is clear,\" implying that it will be safer and more acceptable for institutions to invest in Bitcoin. At the time of the interview, which was in mid-November, regulators hadn't yet approved spot Bitcoin ETFs -- but that finally happened on Jan. 10.\n\nFor institutional investors, crypto represents a new asset class where they might decide to invest a certain percentage of their portfolios, with Bitcoin being the most likely option given its popularity and dominance.\n\nPlus, Wood believes Bitcoin's scarcity, with only 19.5 million Bitcoins mined and a limit of just 21 million ever, will also help drive up the price of the digital currency. As demand increases but there isn't a correspondingly large increase in supply, that imbalance could push Bitcoin's coin price and overall valuation higher.\n\nAccording to Wood, these two factors could help Bitcoin's value rise to $650,000 and potentially even higher.\n\nIs this too bullish of an outlook?\n\nThe challenge with Bitcoin is that it's difficult to predict how high the cryptocurrency could rise in value. A few years ago, when investors were bullish on meme stocks and high-risk investments, Bitcoin reached a high of nearly $68,000. But it fell to less than $20,000 again by the end of 2022, proving that it remains highly volatile.\n\nAnd the assumption that institutional investors will play a big role in such a massive spike in Bitcoin could be a bit too optimistic. After all, it's not as if institutional investors have been sitting on the sidelines, waiting for regulators to approve spot Bitcoin ETFs. According to a 2022 report from Fidelity, 58% of institutional investors were already invested in digital assets.\n\nWhile it's possible more institutional investors could buy Bitcoin in the future, it also isn't an untapped market. And for institutional investors, it's often a mix of balancing risk and returns. With crypto being highly volatile, there may not be an overwhelming reason to dedicate a significant part of their investment portfolios to crypto.\n\nInvestors should temper their expectations for Bitcoin\n\nIt's easy to get caught up in the excitement around Bitcoin, given the approval of spot ETFs. But that doesn't mean it's off to the races or that it's going to be a 10x investment on short notice. Institutional investors have already been buying digital assets, and the overall scarcity of Bitcoin is already known and likely priced into its valuation.\n\nInvestors who are expecting significant gains from Bitcoin need to remember there are also considerable risks, such as heightened regulation and countries setting up restrictions and even banning crypto altogether. It's by no means a clear path for Bitcoin to get to $650,000 or any other specific level.\n\nWhile there can be a lot of upside with Bitcoin, there's a lot of risk as well. This remains a highly speculative asset to be investing in. If you're interested in adding crypto to your portfolio, you may want to diversify with other, safer investments to keep your risks under control."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zMC1tLW1hbnNpb24tcHVyY2hhc2UtMS03LWItYml0Y29pbi1zZWl6dXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "$30M mansion hunt leads to $1.7B Bitcoin seizure - Cointelegraph",
        "content": "Authorities reportedly confiscated Bitcoin worth $1.7 billion after a former restaurant worker attempted to buy a mansion worth about $30 million in London.\n\nOn Jan. 30, Sky News reported that Jian Wen, a Chinese national who became a British citizen in 2018, was allegedly recruited to assist Zhimin Qian in money laundering. Qian, who went to the United Kingdom under a false identity, needed help cleaning up the funds taken from an investment fraud scheme facilitated in China from 2014 to 2017.\n\nWen used to work at a Chinese restaurant in southeast London before meeting Qian. The takeaway worker lived in a room underneath the restaurant before she met her “boss,” whom she introduced as working in an international jewelry business.\n\nProsecutor Gillian Jones said that Wen attempted to buy luxury items and real estate in London with Bitcoin (BTC). This included a seven-bedroom mansion in Hampstead with a swimming pool. The property was on the market for $30 million, but the purchases didn’t go through when Wen could not explain the source of the crypto assets.\n\nImage of the property that Wen attempted to purchase. Source: Google Street View (via Sky New)\n\nJones told the jury at the trial that Wen was not involved in the fraud committed by Qian. However, Wen is accused of converting Bitcoin into cash, luxury items and real estate on behalf of Qian.\n\nAuthorities reportedly raided a house that Wen and Qian rented and confiscated various devices containing more than 61,000 BTC, worth about $1.7 billion when it was accessed back in 2021.\n\nRelated: Couple mistakenly sent $10.5M by Crypto.com to face October plea hearing\n\nInitially, Wen claimed that the crypto she held had been mined. Then, she changed her story, saying it was a “love present,” presenting a deed stating that she received 3,000 BTC from Qian.\n\nWen is now on trial at the Southwark Crown Court for three counts of money laundering between October 2017 and January 2022. She denies all the charges against her. Meanwhile, Qian has already fled the United Kingdom and is still at large.\n\nMagazine: $308M crypto laundering scheme busted, Hashkey token, Hong Kong CBDC: Asia Express"
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8zMS9zdXBwbHktYW5kLWRlbWFuZC1zaG9ja3MtY291bGQtZHJpdmUtYml0Y29pbi10by10YWtlLW91dC1hbGwtdGltZS1oaWdocy1pbi1kYXlzLXNheXMtbW9yZ2FuLWNyZWVrcy1tYXJrLXl1c2tvL9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8zMS9zdXBwbHktYW5kLWRlbWFuZC1zaG9ja3MtY291bGQtZHJpdmUtYml0Y29pbi10by10YWtlLW91dC1hbGwtdGltZS1oaWdocy1pbi1kYXlzLXNheXMtbW9yZ2FuLWNyZWVrcy1tYXJrLXl1c2tvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Supply and Demand Shocks Could Drive Bitcoin To Take Out All-Time Highs in Days, Says Morgan Creek’s Mark Yusko - The Daily Hodl",
        "content": "The founder and CEO of Morgan Creek Capital Mark Yusko believes that Bitcoin (BTC) will have an explosive rally this year.\n\nIn an interview on the Thinking Crypto channel, Yusko says that BTC could appreciate to a price of at least $100,000 by the end of 2024.\n\n“I think we hit six figures. I do these 10 surprises every year and one of mine was that we hit six figures. We definitely take out the all-time high. That could happen in days.”\n\nOn what will drive the price of Bitcoin higher, the hedge fund veteran says,\n\n“Once people realize that these exchange-traded funds (ETFs) are taking out more Bitcoin out of the market than is mined every day… and after the halving, it’s going to be two or three times that. So it’s just a supply-demand problem. So we have the demand shock and, you know, basic supply and demand, right?\n\n…So we’re having a demand shock right now. And we’re going to have a supply shock in April where we go from 900 Bitcoin [mined] a day to 450. You put those two things together, numbers go up.”\n\nAccording to the Morgan Creek Capital CEO, some central banks will eventually include Bitcoin in their reserve holdings.\n\n“Yes, we will see central banks adopt Bitcoin the same way that central banks eventually adopted the [Chinese] Renminbi [currency]. So at first, you know, all central banks own gold. Gold is the base layer of money, and then they hold other currencies of each other as a store of value.\n\nAnd then they issue currency on top of that. So gold is the base layer. Bitcoin is digital gold. So at some point the smart ones are going to say, ‘you know what, I’m going to put some in there.’”\n\nBitcoin is trading at $43,452 at time of writing.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9iaXRjb2luLXVzZWQtbGF1bmRlci1tb25leS1mcmF1ZC1zY2hlbWUtY291cnQtaGVhcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin \"used to launder money in fraud scheme\", court hears - CCN.com",
        "content": "Key Takeaways\n\nA woman in London is on trial for laundering crypto worth billions of dollars, stolen from Chinese investors.\n\nThe UK’s National Crime Agency is expanding its capabilities to combat cryptocurrency fraud.\n\nThe European Banking Authority is proposing an update to the AML/CFT regulations.\n\nIn a London court on Monday, prosecutors alleged that Wen Jian converted Bitcoin into cash and real estate, effectively laundering funds from a massive $6.3 billion fraud.\n\nThe fraud reportedly victimized nearly 130,000 investors in China in a period between 2014 and 2017.\n\nLaundering $6.3 Billion in Chinese Fraud Scheme\n\nThe 42-year-old faces charges at London’s Southwark Crown Court for her role in concealing the origins of the stolen money. Despite facing three counts of money laundering, Wen Jian maintains her innocence and is not accused of participating in the initial fraudulent schemes.\n\nProsecutor Gillian Jones identified Zhang Yadi, also known as Qian Zhimin, as the mastermind behind the $6.3 billion fraud scheme. According to Jones, Zhang, who is cited in the indictment as the beneficiary of the laundered funds, escaped to Britain with a fake identity in 2017 when Chinese officials initiated an investigation into the fraudulent operations.\n\nBritish prosecutors have charged a Chinese woman with money laundering, according to the FT. Zhang stole around £5bn from more than 128,000 Chinese investors through wealth management fraud between 2014 and 2017, before converting the money into Bitcoin and arriving in London in… — Wu Blockchain (@WuBlockchain) January 30, 2024\n\nWhile associates connected to the fraud have been apprehended in China, Jones highlighted that Zhang has successfully evaded capture. Furthermore, the stolen funds have yet to be recovered and returned to the defrauded investors.\n\nThe jury learned that Zhang appointed Wen as a facade to obscure the origins of the pilfered funds, which were initially invested in Bitcoin to facilitate their transfer out of China.\n\nUpon arriving in London in 2017, Zhang sought to transform the Bitcoin holdings back into tangible assets like cash, real estate, jewelry, or other valuable items, as explained by Prosecutor Gillian Jones.\n\nWen Jian has conceded her participation in the Bitcoin transactions, but the pivotal aspect of the trial revolves around discerning her level of awareness or suspicion regarding the illicit nature of the Bitcoin’s origins, as elucidated by Prosecutor Gillian Jones to the jury members.\n\nThe case is ongoing.\n\nUK to Expand National Crypto Crime Unit\n\nIn a strategic move to combat financial crimes, the UK’s National Crime Agency (NCA) is set to enhance its capabilities in addressing cryptocurrency fraud. The expansion includes the recruitment of four seasoned investigators, specifically designated to the financial crime unit, to address the increasing incidents of corruption and fraud associated with blockchain technology.\n\nFurther strengthening its operations, the NCA’s Complex Financial Crime Team (CFCT) will integrate a new Digital Asset Disclosure Officer , extending its operational reach across various jurisdictions. This enhancement is aimed at ensuring a robust monitoring and enforcement mechanism in the evolving digital asset landscape.\n\nCollaboratively, the team is poised to work in tandem with a dedicated surveillance unit and the police department. This coordinated effort is crucial for the in-depth investigation of high-profile cases involving fraud and money laundering, particularly those orchestrated by sophisticated, organized criminal networks.\n\nThe UK’s biggest taxpayer and algorithmic trader Alex Gerko wrote on Twitter last year that the crypto industry was “99% to 100% fraud or bullshit”. I agree. I just wish I paid as much tax as him! Sigh. Back to my modest self assessment form! https://t.co/in2nlIKm1I — Paul Lewis (@paullewismoney) January 27, 2024\n\nThe initiative encompasses a comprehensive approach to tackling criminal activities within the digital domain, specifically focusing on severe and harmful offenses related to cryptocurrency and virtual assets. This includes addressing sophisticated fraud and money laundering operations conducted by major organized crime syndicates and state-backed entities.\n\nEuropean Banking Authority Seeks to Fortify AML/CFT Standards for Crypto Providers\n\nThe European Banking Authority (EBA) is actively pursuing a comprehensive update to the Anti-Money Laundering and Combatting the Financing of Terrorism (AML/CFT) regulations, specifically targeting cryptocurrency service providers. Central to the EBA’s strategic initiative is the harmonization of AML/CFT guidelines across both payment service providers and crypto asset service providers (CASPs).\n\nMember States are being grilled on their bids for the newest EU agency in Brussels covering anti money laundering . Ireland are probably keen after losing the European Banking Authority on a coin toss pic.twitter.com/wQVtN0iWeZ — Kevin Hiney (@kevin_hiney) January 30, 2024\n\nThis alignment aims not only to standardize regulatory measures but also to significantly enhance the collaborative efficiency between these entities. A pivotal element of the proposed enhancements involves advancing the interoperability of protocols among CASPs. This development mandates CASPs to evolve their systems to facilitate the smooth and integrated exchange of information, underscoring the EBA’s commitment to ensuring a robust, transparent, and cohesive regulatory framework in the evolving digital finance landscape."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNjYWxpbmctZXRmcy1tb21lbnR1bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin needs to address scaling as ETFs drive momentum - Cointelegraph",
        "content": "Bitcoin Drivechain proponent Paul Sztorc believes the growing mainstream acceptance of BTC will drive a need for greater scalability and functionality of its infrastructure.\n\nIn a wide-ranging interview with Cointelegraph, Sztorc touched on the advantages and drawbacks of the high-profile approval of Bitcoin (BTC) exchange-traded funds (ETF) in the United States and the long-term implications of institutional money flooding into the ecosystem.\n\n“It’s a sign of health, a sign of validation. Bitcoin is certainly more recognizable, and its name is getting out there. It’s also a result of certain types of money that must flow through ETFs,” Sztorc said.\n\nRelated: Bitcoin Amsterdam: Focus on BTC fundamentals, says Edward Snowden\n\nThe co-founder of LayerTwo Labs described Bitcoin ETFs as an “inevitable consequence of age,” highlighting that customers of the BTC-backed investment products differ from everyday retail investors and hardcore Bitcoiners:\n\n“ETFs are inherently custodial, plugged into the apparatus of reporting to government and the state. Nevertheless, the type of person relying on an ETF would be unlikely to self-custody Bitcoin anyway.”\n\nSztorc admits that the hype around Bitcoin ETFs may serve as an entry point for investors and individuals who have yet to learn about BTC. At the same time, the focus on their impact could be causing undue attention on Bitcoin’s value rather than its underlying metrics and performance.\n\n“The bad things? ETFs continue people’s obsession with price. A CEO should never talk about stock price, they should focus on what drives it. The quality of the product and how happy their workers are,” Sztorc adds.\n\nBitcoin scaling is still a work in progress\n\nLayerTwo Labs has been developing Drivechains for over four years. Bitcoin Improvement Proposals (BIPs) 300 and 301 outline how the Bitcoin network could create, delete, send and receive BTC from layer-2 blockchains, commonly called sidechains.\n\nSztorc, who authored BIP-300, is a proponent of the functionality afforded by Drivechains and has spoken at length about the intricacies of the two BIPs at several Bitcoin conferences in recent years.\n\nRelated: Bitcoin Amsterdam highlights hurdles for consensus over improvement proposals\n\nAs more liquidity flows into the Bitcoin ecosystem through major adoption-driving events like the approval of Bitcoin ETFs, the network could face higher transaction volumes. It’s a point that Sztorc highlights, referring to a statement from Bitcoin’s pseudonymous creator.\n\n“Satoshi Nakamoto said that in 20 years, there will be high transaction volume or no volume. Large blockers used that to say Satoshi was a large blocker; regardless, I am fairly confident he’s right,” Sztorc said.\n\n“There’s no scenario where one billion people use another blockchain protocol and Bitcoin survives.”\n\nWhile the Lightning Network has been influential in providing a means for the Bitcoin network to process low-fee, high-throughput transactions, Sztorc maintains that the ecosystem needs additional functionality to combat existing threats from altcoin competition, hard fork campaigns and extension block campaigns.\n\nRelated: BIP-300 biff: Debate reignites over years-old Bitcoin Drivechain proposal\n\n“BIP-300 is about having competition, it’s the thing we need. Different software developers will compete, and it solves the last piece that people overlook. Sidechains allow people to play whatever game they want, while Bitcoiners who don’t opt in never need to care what a sidechain is doing,” Sztorc said.\n\nAs Cointelegraph previously reported, BIPs have played an essential role in laying the foundations for soft forks that have helped improve the functionality of Bitcoin’s protocol and the development of innovations like the Lightning Network.\n\nMagazine: ‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin"
    }
]