[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNubi5jb20vMjAyNC8wMS8yNS9pbnZlc3RpbmcvcHJlbWFya2V0LXN0b2Nrcy10cmFkaW5nLWJpdGNvaW4tZXRmL2luZGV4Lmh0bWzSAVxodHRwczovL2FtcC5jbm4uY29tL2Nubi8yMDI0LzAxLzI1L2ludmVzdGluZy9wcmVtYXJrZXQtc3RvY2tzLXRyYWRpbmctYml0Y29pbi1ldGYvaW5kZXguaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Crypto fans got what they wanted. So why is bitcoin falling? - CNN",
        "content": "A version of this story first appeared in CNN Business’ Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the same link.\n\nNew York CNN —\n\nMajor cryptocurrencies were on a tear at the end of last year, driven higher by anticipation that US regulators would approve bitcoin exchange-traded funds, broadening the pool of potential investors.\n\nOnce those funds received the go-ahead, bitcoin fell. What gives?\n\nBitcoin topped $47,000 early this month for the first time since April 2022, as investors anticipated that the US Securities and Exchange Commission would approve the first ever exchange-traded funds tracking the spot price of bitcoin.\n\nBut the cryptocurrency declined after the favorable SEC decision duly came on January 10. And bitcoin edged below $40,000 earlier this week for the first time since December.\n\nThe price of the cryptocurrency was trading at roughly $39,519 a coin as of 4 pm ET on Wednesday.\n\nSo, why is the price of bitcoin falling, even after investors got what they wanted? Part of the reason is likely a “buy the rumor, sell the news” mentality, according to Antoni Trenchev, co-founder of crypto lender Nexo. That’s the idea that the price of an asset often rises in anticipation of an announcement and then falls as investors take profits once the news actually comes out.\n\nInterestingly, bitcoin ETF activity actually shows net buying.\n\nInvestors have pulled about $4.4 billion from the Grayscale Bitcoin Trust since it was converted to an ETF on January 11, according to Coinshares data through Wednesday. Greyscale’s fund is the largest bitcoin ETF, holding roughly $20 billion in assets.\n\nBut those flows have been offset by about $5.3 billion poured into nine other spot bitcoin ETFs.\n\nETFs hold just a small portion of the bitcoin that’s traded, says Eric Balchunas, senior ETF analyst at Bloomberg Intelligence. That means “the call is coming from inside the house. Someone who pre-owned the crypto is doing the selling,” he said.\n\nBitcoin has made its way higher over the last year since plummeting to below $17,000 in late 2022, after cryptocurrency exchange FTX filed for bankruptcy and set off a firestorm in crypto trading. Still, it remains well below its record high of roughly $69,000 reached in November 2021.\n\n“We’re used to this kind of volatility in the space. What matters now is what’s coming next that could generate excitement around cryptos and deliver further gains,” wrote Craig Erlam, senior market analyst at OANDA, in a note on Tuesday.\n\nYour 401(k), gas prices and homes: 3 surprising reasons to be happy\n\nAmericans have been fed up with an economy that many feel isn’t working for them, and the 2024 election may turn out to be a referendum on that gloomy sentiment. But the winds may be changing a bit: 401(k) plans are on fire. Consumer sentiment is surging. Gas prices have fallen. The country’s economic vibes are finally vibing again, according to an analysis by my colleague Bryan Mena.\n\nThe years-long economic funk was largely driven by the unforgiving pain of high inflation. A tough housing market and exorbitant child care costs continue to bedevil budgets, but the inflation pendulum is finally swinging in the other direction.\n\nInflation is down substantially from its four-decade peak in the summer of 2022. A powerful US stock rally is now back on track, mortgage rates have eased a bit in recent weeks and the job market remains in great shape, with unemployment near historic lows.\n\nNone of this guarantees the good times will continue, of course. Conflicts abroad could push up prices for oil and other consumer goods, for example.\n\nBut consumer surveys have begun to capture a shifting, more upbeat sentiment among Americans. Here are three reasons to be happy about the current state of the US economy. (At least for now.)\n\nRead more here.\n\nIt’s still too hard to be a working parent in America, Janet Yellen says\n\nIn a major speech set to be delivered Thursday in Chicago, Treasury Secretary Janet Yellen plans to detail her vision for helping middle-class families overcome affordability challenges, according to excerpts shared first with CNN.\n\n“Our economic agenda is far from finished. There’s much more the President and I would like to do to support the middle class,” Yellen plans to say during the speech at the Economic Club of Chicago.\n\nTreasury officials have billed the speech as one of the most significant Yellen plans to deliver this year and an effort to set the tone for her domestic agenda during 2024, reports my colleague Matt Egan.\n\nYellen plans to balance the Biden administration taking credit for the economic recovery from Covid-19 with acknowledging that many Americans are frustrated with how expensive it is to buy a house, raise children and save money for college.\n\n“It is still too hard to be a working parent. We need to get American families access to affordable child care and other support for their children,” Yellen is set to say, according to the excerpts.\n\nRead more here."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhhbHZpbmctMjAyNC1leHBlY3QtMTQzNTU2MjI3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Halving 2024: What to Expect? - Yahoo Finance",
        "content": "Key Takeaways\n\nBTC halving will occur when the number of blocks reaches 840,000 in April 2024. Then, the reward per block will decrease from 6.25 to 3.125 BTC.\n\nUsually, the bitcoin price rises for about six months before halving and is rather stable during the event. The primary growth occurs in the year following the halving.\n\nIf Bitcoin mirrors its performance from the previous two periods, its price could reach the $220k mark in 2025.\n\nBitcoin (BTC) halving will occur in April 2024, resulting in a 50% reduction in bitcoin mining speed. Historically, this event catalyses value growth and, therefore, attracts the attention of investors. To determine whether Bitcoin halving will push BTC to new heights, let’s explore and analyse the dynamics together\n\nBitcoin, Mining, Halving — What You Need To Know\n\nBitcoin is a digital currency that operates on a decentralised computer network. Bitcoin was created in 2009 by an unknown group of individuals, or, according to some sources, a person named Satoshi Nakamoto. Bitcoin’s defining feature lies in its capped supply of 21 million coins acquired through the mining process. Mining uses computer power to solve complex mathematical puzzles and verify transactions on the Bitcoin network.\n\nNewly mined bitcoins are given to miners as a reward for their labour. However, the number of bitcoins miners receive for each block (set of transactions) varies. Every 210,000 blocks, or roughly every four years, miners’ rewards are cut in half. This phenomenon is referred to as ‘BTC halving’ or ‘halving’.\n\nThe purpose of Bitcoin halving is to maintain the currency’s scarcity and value while managing the inflation rate. The assumption is that as the number of new bitcoins issued decreases, demand for them will increase, and prices will rise accordingly. This is based on the economic concept of supply and demand. However, a halving event doubles the cost and complexity of mining, reducing miners’ profitability. This could lead to some miners leaving the market, reducing the hash rate—the overall computing power of the network—and potentially impacting its security.\n\nStory continues\n\nThe next Bitcoin halving will occur when the number of blocks reaches 840,000 in April 2024. The reward per block will decrease from 6.25 to 3.125 BTC at that time. This will be the fourth halving of the leading cryptocurrency in history. The previous three halvings occurred in 2012, 2016, and 2020.\n\nIs It Possible To Make Money From BTC Halving?\n\nAssuming constant demand, halving the supply is expected to double the asset’s value. Historical data indicates that investing in Bitcoin prior to a halving event has been a profitable strategy.\n\n‘Usually, bitcoin starts to rise about six months before the halving, and it doesn’t change much during the halving period,’ said Kar Yong Ang, the Octa financial market analyst. ‘On average, in the past, the upper peak of the exchange rate can be observed more than a year after halving,’ he added.\n\nExamining the price dynamics in the year preceding and following the halving events over the last three cycles reveals significant growth for Bitcoin. During these two-year spans, Bitcoin experienced remarkable increases: approximately 30,000% in 2012, 786% in 2016, and 712% in 2020. If Bitcoin continues to show the same performance this time, its price could reach the $220k mark in 2025.\n\nFor traders, it is important to focus on a shorter timeframe. Notably, 150 days after the first halving, the price of BTC surged by 928%, followed by a 16.6% increase after the second halving and a subsequent 25.8% rise after the third.\n\nHowever, as factors such as significant hacks or bankruptcies of crypto companies, stock market conditions, whale manipulation, or regulatory changes reduce the coin issuance, future halving events may be less potent.\n\nAbout Octa\n\n\n\nOcta is an international broker that has been providing online trading services worldwide since 2011. It offers commission-free access to financial markets and various services already utilised by clients from 180 countries with more than 42 million trading accounts. Free educational webinars, articles, and analytical tools they provide help clients reach their investment goals.\n\nThe company is involved in a comprehensive network of charitable and humanitarian initiatives, including the improvement of educational infrastructure and short-notice relief projects supporting local communities.\n\nOcta has also won over 60 awards since its foundation, including the ‘Best Educational Broker 2023’ award from Global Forex Awards and the ‘Best Global Broker Asia 2022’ award from International Business Magazine.\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI1L21hbnktcmV0YWlsLWludmVzdG9ycy1zZWUtYml0Y29pbi1wcmljZS1kcm9wcGluZy1iZWxvdy0yMGstYnkteWVhci1lbmQtZGV1dHNjaGUtYmFuay_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8yNS9tYW55LXJldGFpbC1pbnZlc3RvcnMtc2VlLWJpdGNvaW4tcHJpY2UtZHJvcHBpbmctYmVsb3ctMjBrLWJ5LXllYXItZW5kLWRldXRzY2hlLWJhbmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Many Retail Investors See Bitcoin Price Dropping Below $20K by Year End: Deutsche Bank - CoinDesk",
        "content": "The approval of spot bitcoin ETFs in the U.S. was seen as a game changer by many in the industry, with mainstream money now expected to flood into the sector. Investors who couldn’t trade digital assets are now able to use cheap and liquid ETFs to gain exposure without having to own the underlying cryptocurrency itself."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3VzLXNlbGxzLWJ0Yy1zaWxrLXJvYWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "US files notice to sell $130M in bitcoin linked to Silk Road agent - Blockworks",
        "content": "The United States filed a notice to sell over $130 million in bitcoin linked to the Silk Road forfeitures.\n\nThe public notification lists two lots of bitcoin that the government plans to sell.The first is roughly 2,800 BTC for roughly $129 million. The second, smaller, lot would sell 58 BTC for about $3 million.\n\nThe bitcoins are linked to Ryan Farace, who was sentenced in Maryland last year to 54 months in prison on a charge of money laundering conspiracy.\n\nFarace and his father, Joseph, were found guilty of laundering bitcoin initially used for drug trafficking that should have been forfeited to the US. Farace, initially convicted in 2018, claimed to not have access to bitcoin used for darknet transactions.\n\nHowever, he and his father were found to have conspired in an attempt to “transfer more than 2,874 Bitcoin to a third party, so that the funds could be moved into a foreign bank account.”\n\n“According to their guilty pleas and other court documents, in November 2018, Ryan Farace was convicted in U.S. District Court in Maryland for a scheme to manufacture and distribute [Xanax] in exchange for Bitcoin through sales on darknet marketplaces,” a Department of Justice press release said.\n\nThe first lot of bitcoin was also tied to Shaun Bridges, a former Secret Service agent and part of the Baltimore Silk Road Task Force.\n\nBridges was sentenced to a six-year prison term in 2015 in connection with the theft of BTC during the US government’s investigation of the Silk Road dark marketplace.\n\n“According to admissions made in connection with his guilty plea, Bridges admitted to using a private key to access a digital wallet belonging to the U.S. government, and subsequently transferring the bitcoin to other digital wallets at other bitcoin exchanges to which only he had access,” a Department of Justice press release said.\n\nBoth Farace’s were ordered to forfeit their bitcoin, while Bridges agreed to “turn over the stolen bitcoin to US agents.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0L2ZpZGVsaXR5LWFuZC1ibGFja3JvY2stYXJlLWRvbWluYXRpbmctdGhlLWJpdGNvaW4tZXRmLWZsb3ctcmFjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Spot-ETF Flow Race Dominated by Fidelity, BlackRock (FBTC, IBIT) - Bloomberg",
        "content": "Less than two weeks after US regulators fired the starting gun for ten spot Bitcoin exchange-traded funds, it’s increasingly looking like a two-horse race for new assets.\n\nBlackRock’s iShares Bitcoin Trust (ticker IBIT) and the Fidelity Wise Origin Bitcoin Fund (FBTC) are leading the field with about $1.9 billion and $1.6 billion of inflows, respectively, according the latest available data compiled by Bloomberg. That’s roughly a combined 70% of spot Bitcoin ETF inflows so far Bloomberg Terminal ."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2Y5NWE2NDhlLTMxMTYtNDY1Mi1iZmM4LTM0NjI0Y2NlM2E2ZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Is the worst over for Bitcoin? - Financial Times",
        "content": "Print this page\n\nSo how’s everyone doing in Bitcoin-land?\n\nNot so good! The chart above shows a drop of nearly 20 per cent in two weeks. As Bryce noted last week, the approval of spot Bitcoin ETFs has mostly been a chance to cash out of arbitrage trades.\n\nUntil recently, traders were able to buy the biggest US Bitcoin investment vehicle — a fund run by Grayscale — at a discount to its net asset value. This is because, before approval, investors weren’t actually able to make withdrawals.\n\nNow they can, as the SEC approved Grayscale’s request to convert into an ETF. The fund (ticker GBTC) has seen $4.3bn in outflows since then, says JPMorgan in a note Thursday.\n\nAt first one theory was that investors were shifting out of GBTC and into spot Bitcoin ETFs with lower fees. But the price action suggests otherwise.\n\nFrom JPMorgan’s Nikolaos Panigirtzoglou:\n\nProfit-taking on previous GBTC investments, made at a discount to NAV last year, has likely been a major driver behind bitcoin’s correction; $4.3bn has thus far exited GBTC since its conversion to ETF. When profits are booked on GBTC ‘s “discount to NAV trade” the money exits the crypto space, thus putting downward pressure on prices. We believe that most of this $4.3bn GBTC outflow reflects profit taking rather than a shift towards cheaper spot bitcoin ETFs (needless to say that such a shift would have had little market impact).\n\nThere could be a silver lining, though. Panigirtzoglou & Co have previously estimated that about $3bn of GBTC’s assets came from traders investing solely to take advantage of its discount.\n\nSo it’s possible that after $4.3bn of withdrawals, “GBTC profit taking has largely happened already. In turn, this would imply that most of the downward pressure on bitcoin from that channel should be largely behind us,” the team write.\n\nAnd what about the leftover $1.3bn? If we take the most optimistic view, we would assume that all of that cash moved into competing lower-cost Bitcoin ETFs. Of course, that would mean investors aren’t just selling in favour of safer and higher-yielding alternatives (such as US government debt), which seems like a very bold assumption.\n\nStill, JPMorgan argues that the US ETF approvals mean there will be a “significant change” in the market structure for Bitcoin:\n\n- Before 2023, the price discovery was done via trading across offshore spot exchanges, onshore spot exchanges, offshore futures and onshore (CME) futures. Following last year’s crackdown from US policy makers the importance of offshore marketplaces has diminished to the benefit of onshore spot exchanges and CME bitcoin futures. The emergence of spot ETFs is introducing another dimension in the bitcoin price discovery process along with onshore spot exchanges and onshore futures that echoes the price discovery that is taking place in the traditional financial system, in particular in equities where ETFs are more prevalent. - While, at face value, the introduction of spot bitcoin ETFs implies more fragmentation, in practice it would increase market depth and liquidity if the experience of ETFs in traditional asset classes such as equities is a guide. In other words, we expect that the emergence of spot bitcoin ETFs would make the bitcoin price discovery process more rather than less efficient.\n\nOh and Grayscale is trying to make a covered call Bitcoin ETF happen, which should be interesting:\n\nFinally, GBTC’s plan to introduce a covered call ETF is another step towards increasing market depth and liquidity for its ETF bolstering its status as the most liquid bitcoin fund. These vehicles are often used in the equity space to achieve exposure with less risk (the premiums from selling call options in covered call ETFs tend to offset losses in a declining market, albeit with the tradeoff of smaller gains in a big bull market). If approved, covered call ETFs would be a boost for GBTC’s and, more broadly, bitcoin’s derivatives markets.\n\n¯\\_(ツ)_/¯"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0NDIxL2JpdGNvaW4tcHV0LWNhbGwtb3B0aW9ucy1yYXRpby1pcy1hLWJlYXJpc2gtaW5kaWNhdG9yLWZvci10aGUtbWFya2V0LXNheXMtYW5hbHlzdNIBeWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3NDQyMS9iaXRjb2luLXB1dC1jYWxsLW9wdGlvbnMtcmF0aW8taXMtYS1iZWFyaXNoLWluZGljYXRvci1mb3ItdGhlLW1hcmtldC1zYXlzLWFuYWx5c3Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin put-call options ratio is a bearish indicator for the market, says analyst - The Block",
        "content": "An increase in the number of outstanding puts compared to calls in bitcoin options open interest could be a bearish omen ahead of Friday's expiry.\n\nDeribit Chief Commercial Officer Luuk Strijers said the put-call ratio for bitcoin options across all expiries currently stands at 0.44.\n\n\"Focusing on tomorrow's expiry, the ratio adjusts to 0.52, indicating a higher number of puts compared to calls,\" Strijers told The Block. \"This suggests a bearish sentiment for this month's bitcoin options expiry compared to the general trend in open contracts.\"\n\nThe analyst added that the ratio suggests that the market expected a short-term downside for bitcoin, and investors have used puts to hedge.\n\n\"However, they see the longer-term as having relatively more upside,\" he added.\n\nRELATED INDICES See crypto indices\n\nEther options skew is also bearish\n\nStrijers said that the call-put options skew for longer-term 30- and 60-day ether options remains slightly negative. He added that it is, however, close to zero.\n\n\"This indicates that puts are more expensive relative to calls, signaling a mildly bearish outlook for these longer-dated expiries,\" Strijers added.\n\nOptions are derivative contracts that give a trader the right but not the obligation to buy or sell the underlying asset at a predetermined price on or before a specific date. A call option gives the right to buy, and a put offers the right to sell. It is assumed that a trader who buys put options is implicitly bearish on the market, while a call buyer is bullish."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjQvMDEvMjQvYml0Y29pbi13cmVzdGxlcy13aXRoLTQwMDAwLWFzLWl0LXRyaWVzLXRvLXJlY292ZXItcmVjZW50LWxvc3Nlcy1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin wrestles with $40,000 as it tries to recover recent losses - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin wrestles with $40,000 as it tries to recover recent losses: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Core Scientific CEO Adam Sullivan discusses the company's reorganization and re-listing of shares on the Nasdaq."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vYXBuZXdzLmNvbS9hcnRpY2xlL2JpdGNvaW4tZXRmLXdhbGwtc3RyZWV0LWZ1bmRzLWNyeXB0by1jcnlwdG9jdXJyZW5jeS04NTUyMzIyMjU5NDgyYzg1ODJlOGY4YTNlN2MxZDNmY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Not all bitcoin ETFs are the same. Here are some questions to consider before buying any - The Associated Press",
        "content": "NEW YORK (AP) — Now that bitcoin funds are trading, which is the best to own?\n\nThe answer is not necessarily the one that rises the most. The job of these funds is to track the price of bitcoin, whatever that is, in what can be a more convenient thing to own for many investors.\n\nSo if bitcoin is falling, for example, a bitcoin fund that’s rising in price may not be doing what an investor is looking for.\n\nThe first question an investor needs to ask before buying one of the bitcoin funds is if they actually want to own bitcoin. The cryptocurrency has been around a decade and a half, but much of professional Wall Street still sees it as too risky and speculative to own.\n\nIt has a history of drastic swings in price, which can come suddenly and happen over the weekend or overnight in its 24/7 trading. Its daily average volatility is roughly three and a half times that of the global stock market, according to John Laforge, head of real asset strategy at Wells Fargo Investment Institute.\n\n“Highlighted a different way, bitcoin’s price return in 2022 was -64%,” he said, “while its 2023 return was 157%.”\n\nBut bitcoin also holds the allure of possibly moving in ways that other investments aren’t. Investors are always looking for what’s called an “uncorrelated asset” whose price might zig when everything else they own is zagging. Such independent movements can make an overall portfolio less volatile.\n\nAnother question investors must answer is how they want to buy bitcoin. The main way until now has been to buy it directly and then to either hold it in what’s called a wallet or leave it on an exchange.\n\nNow, following the approval earlier this month by U.S. regulators, investors can buy several exchange-traded funds that will take responsibility for holding actual bitcoin and protecting it. Earlier, bitcoin-related ETFs invested in contracts related to bets on prices for bitcoin in the future, but not on the cryptocurrency itself.\n\nAlready, there’s been some separation in performance among the bitcoin ETFs that have begun trading. Between Jan. 11 and Tuesday, the Grayscale Bitcoin Trust (GBTC) sank 14.3%, for example. That’s milder than the 16.3% drop for the Valkyrie Bitcoin fund (BRRR) over the same time.\n\nSo, what should investors be looking at? Here’s a look at several differences:\n\nFEES\n\nWhen many ETFs are trying to do the same thing, such as follow the market price of bitcoin, one of the easiest ways they can distinguish themselves is by charging lower fees.\n\nExpenses are a drag on any investment, and higher fees take more of an investor’s returns away from them. In traditional stock ETFs, fees have plummeted all the way to zero in some cases as expense-conscious investors steer their dollars toward the lowest-cost options.\n\nETFs will advertise their “expense ratios,” which show how much of a fund’s assets goes toward covering its expenses. Tiny differences in fees may not add up to all that much, even over the course of years, but why pay for something if you don’t have to?\n\nKeep in mind, ETF companies can change their expense ratios, up or down. Fidelity is one of the providers offering a temporary expense ratio of zero on its bitcoin ETF, for example. It will rise to 0.25% in August.\n\nTRADING VOLUMES AND ASSETS\n\nETFs that attract lots of investment and that trade often can make it easier for investors.\n\nFunds that trade more actively can mean a narrower gap between what’s called the “bid” price, or what investors are trying to buy a share of the ETF at, and the “ask” price, which is what prospective sellers are hoping to get. A slimmer gap can lower the costs of a transaction when buying or selling the ETF.\n\nTHE CUSTODIAN\n\nOne of the allures of cryptocurrencies is their potential to offer a “trustless” system where investors don’t have to trust whether the person at the other end of their deal will make good on it, unlike the 2008 financial crisis when banks were going bust.\n\nBut an ETF is firmly within the structure of Wall Street, and it requires trust. For ETFs, what’s called a custodian will be in charge of holding the actual bitcoin and protecting it. Different ETFs are using different custodians. Several are using Coinbase. Others aren’t, including Fidelity, which is housing its bitcoin at Fidelity Digital Asset Services."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nYnRjLXNoZWRzLWFzc2V0cy1yaXZhbC1iaXRjb2luLTIzMzcyOTcwMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "GBTC Sheds Assets as Rival Bitcoin ETFs Add Investors - Yahoo Finance",
        "content": "ETF Investing Tools\n\nThis week has continued the dueling spot bitcoin ETF narratives of Grayscale GBTC shedding assets at a fast clip but inflows to nine other products rising.\n\nTuesday outflows of $515 million brought this week’s total to over $1.15 billion. The Grayscale Bitcoin Trust ETF (GBTC) has lost nearly $4 billion in assets in the eight trading days since the Securities and Exchange Commission approved the new products. Its rivals gained $409 million in assets on Tuesday to raise their weekly inflows to $963 million. They have received nearly $5 billion in inflows since their Jan. 11 unveilings. Wednesday totals were unavailable at the time of publication.\n\nStill, Bloomberg Senior ETF Analyst Eric Balchunas struck an optimistic tone about what he has called “The Great GBTC Gouge,” in a post on X/Twitter.\n\n“Total rolling net flows down to +$983m as Nine loses a bit of ground despite $GBTC flows being slightly less bad,” Balchunas wrote, noting that BlackRock’s iShares Bitcoin Trust (IBIT) and the Fidelity Wise Origin Bitcoin Fund (FBTC) inflows continued at a $1 billion per week pace that only Vanguard’s VOO could match.\n\nHe added that both were a “near lock” to reach $2 billion in inflows by the week’s end.\n\n“Also this shows volume and discount (which were really low for GBTC yest) may emerge as best predictors of the flow coming later (vs the transfer number ppl report each morning),” Balchunas wrote.\n\nThe opposing trends have formed quickly since the SEC reversed a decade of objections on Jan. 10 to give a thumbs-up to 11 products based primarily on the spot price of bitcoin, including a Grayscale proposal to convert its GBTC trust into an ETF. Analysts have speculated that many Grayscale customers sold their shares to take profits after investing at a low price during the extended crypto bear market, which began in late 2021, or to move into competing products that charge a lower fee.\n\nGrayscale charges 1.5%, while Bitwise, among others, has waived its fee for the first six months on the first $1 billion of assets. On Monday, GBTC had dropped more than 13% of its outstanding shares. Balchunas and fellow Bloomberg analyst James Seyffart have predicted that the company would lose around 25% of its shares.\n\nStory continues\n\nBitcoin's Price Fade\n\nBitcoin’s was recently trading slightly above $40,100, a roughly 1.7% gain over the past 24 hours. But the price of the largest cryptocurrency by market capitalization has dropped about 20% since the approvals. Bitcoin dipped below $16,500 last January before rallying with a good portion of the gains coming later in the year amid rising hopes for a spot bitcoin ETF approval.\n\n“GBTC continues to bleed assets as investors swap out of the relatively expensive fund into cheaper alternatives,” etf.com analyst Sumit Roy wrote. “Selling by arbitrageurs, who bought the fund at a discount to its net asset value, has also likely contributed to the outflows.”\n\nHe added: “Bulls argue that inflows will pick up once the GBTC outflows are exhausted. A more bearish interpretation would be that most of the money flowing out of GBTC is flowing into these other spot bitcoin ETFs, so the modest $1 billion of net inflows for spot bitcoin ETFs that we’ve seen so far already reflects the true demand for spot bitcoin ETFs.\n\nGrayscale \"Dominating Trading Volume\"\n\nIn a statement emailed to ETF.com, Grayscale’s John Hoffman, Grayscale’s managing director of sales & distribution, wrote that GBTC had “launched as the world’s largest spot Bitcoin ETF,” and “been dominating trading volume.”\n\n“Broadly speaking, large capital markets ETFs are used in a variety of investing strategies, and we anticipate GBTC’s diverse shareholder base will continue to deploy strategies that impact inflows and outflows,” he wrote.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzI1L3N3YW4tYml0Y29pbi11bnZlaWxzLW1pbmluZy11bml0LWFzLXBhcmVudC1jb21wYW55LXByZXBhcmVzLXRvLWdvLXB1YmxpYy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8yNS9zd2FuLWJpdGNvaW4tdW52ZWlscy1taW5pbmctdW5pdC1hcy1wYXJlbnQtY29tcGFueS1wcmVwYXJlcy10by1nby1wdWJsaWMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Swan Bitcoin Unveils Mining Unit as Parent Company Prepares to Go Public - CoinDesk",
        "content": "The miners have faced a brutal crypto winter as their revenue is directly correlated to the price of bitcoin. At the depth of the bear market, many large miners, such as Core Scientific (CORZ), went bankrupt, and others barely hung on. However, the recent rally in bitcoin price, helped by the spot bitcoin ETF, has helped the mining economics and even seen companies, such as Core, coming out of bankruptcy."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0NTc0L3VzLWZpbGVzLWludGVudC10by1kaXNwb3NlLTExNy1taWxsaW9uLWluLWJpdGNvaW4tc2VpemVkLWZyb20tc2lsay1yb2FkLWRydWctZGVhbGVy0gF7aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjc0NTc0L3VzLWZpbGVzLWludGVudC10by1kaXNwb3NlLTExNy1taWxsaW9uLWluLWJpdGNvaW4tc2VpemVkLWZyb20tc2lsay1yb2FkLWRydWctZGVhbGVy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "US files intent to dispose $117 million in bitcoin seized from Silk Road drug dealer - The Block",
        "content": "The U.S. government filed a notice announcing its intention to dispose of about $117 million worth of bitcoin seized in a dark web drug bust.\n\nIn the notice dated Jan. 8, the U.S. government said it planned to dispose, \"in such manner as the United States Attorney General may direct,\" nearly 2,875 bitcoin seized from Ryan Farace and Sean Bridges in 2021, in addition to another roughly 59 bitcion that belonged to Farace alone.\n\nAt the time of the filing, the seized bitcoin was worth about $133 million.\n\nIn 2018, the U.S. Department of Justice said it was charging Farace for illegally selling Xanax on the dark web.\n\n\"The indictment alleges that Farace distributed the drugs through sales on the dark web in exchange for bitcoin,\" the DOJ's statement said at the time. Earlier this month, the U.S. Attorney's Office said Farace and his father Joseph Farace had both been sentenced to prison for money laundering conspiracy.\n\nXanaxman used Silk Road\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nFarace, who dealt drugs online under the pseudonym Xanaxman, stated in plea deal that he used Silk Road, the infamous dark web site. The U.S. government also said, in its statement outlining its intent to sell the bitcoin, that anyone that wanted to claim \"interest in the forfeited property\" could do so within 60 days.\n\nSeparately, in December, a U.S. appeals court finalized a mandate formalizing the forfeiture of 69,370 of bitcoin connected to the now-defunct Silk Road dark web market.\n\nMarket watchers have been closely monitoring those funds, often speculating how a large sale of bitcoin by the U.S. government could impact the cryptocurrency's price.\n\nSilk Road's founder Ross Ulbricht is currently serving a life sentence in jail. He operated the dark web site where drugs and weapons were sold from 2011 to 2013. The site was shut down by the Federal Bureau of Investigation following the Ulbricht's arrest in late 2013."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0Ly1hbGFtZWRhLWdhcC1rZWVwcy1iaXRjb2luLXZvbGF0aWxlLWV2ZW4td2l0aC1ldGZzLWJvb3N0aW5nLXRyYWRpbmctdm9sdW1l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price (BTC) Stays Volatile Even With Spot ETFs Boosting Trading Volume - Bloomberg",
        "content": "A dearth of liquidity in the digital-asset market continues to roil Bitcoin, even with the first US exchange-traded funds to hold the cryptocurrency logging billions of dollars in trading volume since their debut.\n\nThe ability to easily or quickly buy and sell the digital currency hasn’t improved since the 10 funds began trading Jan. 11, traders say. Liquidity is especially important in a relatively new market such as crypto, where a single large trade can have an outsized impact on an asset price, raising the risk of manipulation."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvYml0d2lzZS1iZWNvbWVzLWZpcnN0LXNwb3QtYml0Y29pbi1ldGYtcHJvdmlkZXItdG8tcHJvdmlkZS13YWxsZXQtYWRkcmVzcy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI0L2JpdHdpc2UtYmVjb21lcy1maXJzdC1zcG90LWJpdGNvaW4tZXRmLXByb3ZpZGVyLXRvLXByb3ZpZGUtd2FsbGV0LWFkZHJlc3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitwise Becomes First Spot Bitcoin ETF Provider to Provide Wallet Address - CoinDesk",
        "content": "Not including any flows today, Bitwise holds 11,858 bitcoins worth roughly $474 million at the current bitcoin price just under $40,000. The asset manager is the most successful crypto-native ETF issuer so far with $518 billion of inflows in the past eight days. Only spot ETFs from BlackRock and Fidelity have seen more inflows, roughly $1.8 billion and $1.5 billion, respectively."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjUvZ3JheXNjYWxlcy1nYnRjLXByb2ZpdC10YWtpbmctbGlrZWx5LW92ZXItZWFzaW5nLWJpdGNvaW4tc2VsbGluZy1wcmVzc3VyZS1qcG1vcmdhbi_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8yNS9ncmF5c2NhbGVzLWdidGMtcHJvZml0LXRha2luZy1saWtlbHktb3Zlci1lYXNpbmctYml0Y29pbi1zZWxsaW5nLXByZXNzdXJlLWpwbW9yZ2FuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Grayscale's GBTC Profit Taking Likely Over, Easing Bitcoin Selling Pressure: JPMorgan - CoinDesk",
        "content": "The bank’s estimates imply that about $1.3 billion has moved from GBTC to newly created spot bitcoin ETFs, which are cheaper . This is equivalent to a monthly outflow of $3 billion. These outflows are likely to continue if Grayscale is too slow to lower its fees and could even accelerate if other spot ETFs “reach critical mass to start competing with GBTC in terms of size and liquidity,” the report added."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjUvdGVzbGFzLWJpdGNvaW4taG9sZGluZ3MtcmVtYWluLXVuY2hhbmdlZC1pbi1xNC_SAV9odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI1L3Rlc2xhcy1iaXRjb2luLWhvbGRpbmdzLXJlbWFpbi11bmNoYW5nZWQtaW4tcTQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Tesla’s Bitcoin Holdings Remain Unchanged in Q4 - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0L2JpdGNvaW4tcy1idGMtcG9zdC1ldGYtc2x1bXAtcGF1c2VzLWFzLWNoYXJ0cy1zaWduYWwtcGl2b3RhbC10ZXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's Post-ETF Slump Pauses as Charts Signal Pivotal Test - Bloomberg",
        "content": "Bitcoin paused a retreat that began after US exchange-traded funds for the largest digital asset began trading on Jan. 11 and now faces a pivotal test if key charts are right.\n\nThe token rose as much as 3.4% on Wednesday before paring some of the gain to trade at $40,180 as of 6:55 a.m. in New York. It’s down almost 20% from an intraday peak of $49,021 when the ETFs went live, as fanfare about the products gives way to uncertainty over the eventual scale of demand for them."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjQvMDEvMjUvY3JhaWctd3JpZ2h0LWJpdGNvaW4tc2F0b3NoaS1jbGFpbS1sZWdhbC1iYXR0bGUv0gFaaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyNC8wMS8yNS9jcmFpZy13cmlnaHQtYml0Y29pbi1zYXRvc2hpLWNsYWltLWxlZ2FsLWJhdHRsZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin developers have fake Satoshi on the ropes in legal fight - Fortune",
        "content": "The crypto world is rife with scammers, including the Colorado pastor I wrote about on Monday who spent the proceeds from a token hustle on home renovations because “the Lord told us to.” But one of these scoundrels looms above the others for the sheer perversity of his lies—namely his claim to be Bitcoin’s founder, Satoshi Nakamoto—and for the misery he has inflicted on others with a decade of spurious lawsuits.\n\nLongtime crypto watchers know who I am talking about: Craig Wright. Ordinarily, I make a point of not writing about Wright because part of his con game is to persuade the media to cover his antics, and then use the coverage to advance the claim he is Satoshi. He is not. That’s been clear since at least 2015 when Wright failed to produce a piece of evidence he claimed to possess in the form of Satoshi’s private key. Since then, Wright has been discredited many times over—including over his propensity for forgery and academic plagiarism—yet still he persists with his stupid lawsuits.\n\nThis would be funny but for the people he has harmed. This includes exploiting the U.K.’s dreadful libel laws to nearly ruin Bitcoin podcaster Peter McCormack until an appeals court tossed a ruling to pay Wright’s legal costs because, well, he is a liar who is not Satoshi. Most recently, Wright has turned to another bogus legal strategy in the form of claiming he owns intellectual property related to Bitcoin and then suing developers who help maintain the open-source code.\n\nThe IP claims are nonsense, of course, but Wright nonetheless got some traction in court until Twitter cofounder Jack Dorsey stepped in to help the Bitcoin developers mount a defense. That’s when things got decidedly more fun. In October, a U.K. judge agreed to let the developers to press claims of their own that Wright had put forged documents before the court to support his fabrications. The judge set a date for this month to look more closely at the forgery allegations.\n\nNow, lo and behold, Wright is suddenly holding out a settlement offer to the Crypto Open Patent Alliance, which is allied with the defendants. Such a deal is out of character for a charlatan like Wright, and, as several lawyers have pointed out, the only reason he would offer one is that he fears he is in deep trouble. And he is. It is a serious matter to lie to a judge and much worse to file forged documents as evidence. Wright and his lawyers should be very worried.\n\nThe question now is whether the developers will agree to the settlement. So far, it looks like they won’t. On Wednesday, they took to social media to declare “hard pass” in part because Wright’s proposed deal included yet more dishonesty. This means the court inquiry into his forgery is set to go forward, setting the table for one of crypto’s worst liars and bullies to face justice.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nCrypto bank Sygnum, which operates in Switzerland and Singapore, raised $40 million to push into Europe. (Bloomberg)\n\nOptions trading followed days after the first Bitcoin futures ETF, but regulatory hurdles mean it will be months or more before exchanges can offer options for Bitcoin spot ETFs. (WSJ)\n\nAn International Energy Agency report says demand for electricity from data centers, crypto, and AI will double in the next three years. (Bloomberg)\n\nA report by FINRA, which oversees brokerages, says 70% of crypto ads and communications it reviewed may violate rules to be fair and truthful. (WSJ)\n\nSoccer star Lionel Messi and his Inter Miami will replace a crypto company logo on their jerseys with one for cruise ships. (Bloomberg)\n\nMEME O’ THE MOMENT\n\nCrypto world cheers the Craig Wright news:"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyNC8wMS8yNS9teS1sb25nLXRlcm0taW52ZXN0bWVudC1jYXNlLWZvci1iaXRjb2luL9IBZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyNC8wMS8yNS9teS1sb25nLXRlcm0taW52ZXN0bWVudC1jYXNlLWZvci1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "My Long-Term Investment Case for Bitcoin - CoinDesk",
        "content": "These triggers, however, can only explain changes in demand, given that there already is demand. If there were no other drivers, the value of bitcoin would be fragile as it would only rest on the shared illusion that it has value and not any underlying utility. If that were the case the critics would be right, and bitcoin would just be like Beanie Babies, NFTs, or tulips for that matter; a financial bubble that eventually would burst."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNvdWxkLWZhbGwtMzAtMDAwLTA3MDgyMDg2NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Could Fall to $30,000 in 2024, Says Crypto Billionaire Arthur Hayes - Yahoo Finance",
        "content": "Bitcoin Could Fall to $30,000 in 2024, Says Crypto Billionaire Arthur Hayes\n\nArthur Hayes predicted in a recent market commentary that Bitcoin could plunge to $30,000 in 2024.\n\nHayes, a Bitcoin billionaire known for founding the BitMEX crypto derivatives exchange, published his forecast in a blog post on Wednesday. He warned that Bitcoin could sink as low as $30,000 - $35,000 amidst a potential market downturn triggered by issues in traditional finance.\n\n\"I believe Bitcoin will dip before the BTFP renewal decision on March 12th. I didn’t expect it to happen so soon, but I think Bitcoin will find a local bottom between $30,000 and $35,000,\" wrote Hayes.\n\nThe prediction comes as Bitcoin hovers under $40,000. Hayes blamed the Bitcoin slump on outflows from the Grayscale Bitcoin Trust and the looming expiration of a key Federal Reserve liquidity program.\n\nHayes argued the Fed would likely let its Bank Term Funding Program expire in March instead of renewing it. That could spark a \"mini-financial crisis\" and force the Fed to resume money printing to bail out struggling regional banks.\n\nBitcoin often rallies on expectations of looser Fed policy. But Hayes says the leading cryptocurrency is flashing warning signs that the Fed won't ride to the rescue this time.\n\n\"Bitcoin is telling the world that the Fed is trapped between inflation and a banking crisis,\" explained Hayes. \"The market doesn’t appreciate this fact yet, but Bitcoin does.\"\n\nOnce Bitcoin sinks below $35,000, Hayes says he'll scoop up discounted coins ahead of an eventual Fed policy reversal."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjUvYml0Y29pbi1ldGYtZmxvd3Mtc2hvdy1uZWdhdGl2ZS10cmVuZC1mb3ItZmlyc3QtdGltZS1zaW5jZS1sYXVuY2gv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8yNS9iaXRjb2luLWV0Zi1mbG93cy1zaG93LW5lZ2F0aXZlLXRyZW5kLWZvci1maXJzdC10aW1lLXNpbmNlLWxhdW5jaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Flows Show Negative Trend For First Time Since Launch - CoinDesk",
        "content": "Among the other nine funds, BlackRock’s IBIT and Fidelity’s FBTC are leading the way, with each now holding more than 40,000 bitcoin as of Jan. 24 versus 20,000-25,000 for each one week ago. Both are also closing in on $2 billion in assets under management."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzJlNTVjZmI0LWE2ODItNDg3Yi04OWE5LWE4ZWIzZTRhMTIzZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Spot bitcoin ETFs spawn nascent derivatives ecosystem - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Exchange traded funds myFT Digest -- delivered directly to your inbox.\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nThe first derivative-based strategy piggybacking off US-listed bitcoin exchange traded funds has started trading, as experimentation in the fund industry accelerates at breakneck speed.\n\nRoundhill Investments’ Bitcoin Covered Call ETF (YBTC) aims to generate a yield from bitcoin and, like other covered call strategies such as JPMorgan’s wildly popular Equity Premium Income ETF (JEPI), investors surrender some potential market gains in return.\n\n“This is a unique intersection of two areas that have been very much in demand, income generation and crypto,” said David Mazza, chief strategy officer at Roundhill.\n\nYBTC is among the first in an anticipated wave of novel ETF launches in the wake of the recent approval of US-listed “spot” bitcoin ETFs investing directly in the cryptocurrency, industry observers say.\n\n“We are at the beginning, not the end, of ETF innovation tied to cryptocurrencies. The door is open to bring strategies to the public that provide exposure to bitcoin in a risk-on and risk-off manner,” said Todd Rosenbluth, head of research at VettaFi, a consultancy.\n\nCrypto powerhouse Grayscale Investments has filed with the US Securities and Exchange Commission to launch a Bitcoin Trust Covered Call ETF, which would be based on options on its $23.5bn Bitcoin Trust ETF (GBTC), the world’s largest crypto fund.\n\nOther novel ETFs in the works include proposed vehicles from ProShares and Direxion, which have each filed to launch five ETFs offering leveraged and inverse exposure to bitcoin, amplifying the swings of the already volatile asset.\n\nCovered call ETFs are designed to do the opposite: reduce risk. They work by selling out-of-the-money call options, allowing the purchasers to buy the underlying asset, in this case bitcoin, at a set price and a fixed expiration date. If bitcoin rises sufficiently for this option to be triggered, this caps upside returns for investors, meaning they may underperform the rise in the digital asset.\n\nHowever, the ETF pockets the premium income from writing the options irrespective of what happens — cushioning investors if the options are triggered, or helping them outperform if they are not.\n\nMazza argued that bitcoin’s high volatility meant it was ideally suited to this approach.\n\n“When you’re combining crypto, particularly bitcoin, with a covered call strategy, one of the biggest things is the potential for higher income,” he said.\n\n“Because bitcoin is so volatile as an instrument, when you are selling and capping some of your upside, the benefit is that you get paid a pretty attractive premium for doing so. It has the potential to get a higher yield than you would get with equities.”\n\nThis “manufactured” income stream may be welcome to some investors because bitcoin has no yield. This is because “mining” of new coins works on the basis of “proof of work”.\n\nMany other cryptocurrencies, such as ether, cardano and polkadot, instead use a “proof-of-stake” mechanism. This allows investors to lock away crypto assets for a set period of time to help support the operation of the blockchain. In return they earn more cryptocurrency, effectively generating income.\n\n“Being able to invest in GBTC and have a passive long-term exposure to bitcoin, while also allowing having an additional income or yield, is quite attractive,” said Michael Sonnenshein, chief executive of Grayscale.\n\nRosenbluth saw a potential market for covered call ETFs. “The number one concern that we hear from advisers about bitcoin is that it is volatile, so these products would help alleviate some of these concerns by having some downside protection and income generation,” Rosenbluth said.\n\nBut he pointed out the reverse could also be true. “The counter is that many people want exposure to bitcoin to take advantage of that volatility. They like that it’s a high-risk/high-reward experience.”\n\nBryan Armour, director of passive strategies research, North America at Morningstar, also pointed to the allure of volatility, saying he did not “understand the desire for a bitcoin covered call ETF”.\n\n“Volatility is why investors buy bitcoin — capping upside seems antithetical to its investment thesis,” Armour said. He added that a covered call ETF “keeps the tail risk of bitcoin, meaning if it craters like it did in 2022, investors will still lose a substantial amount of their investment. I don’t see these as a useful product for most investors.”\n\nUntil this month Grayscale’s GBTC was a private trust traded on the over-the-counter market. As such, there were no options listed on it. Sonnenshein hinted that this picture was changing.\n\n“We are committed to GBTC and growing the ecosystem around it,” he said. “There is a lot of investor interest and excitement about the development of an options ecosystem.”\n\nRoundhill, which does not have its own spot bitcoin ETF, is instead basing its options on the ProShares Bitcoin Strategy ETF (BITO), at $1.8bn by far the largest bitcoin futures ETF.\n\nThis is because, as yet, there are no options listed on the new spot ETFs, although several exchanges have filed with the SEC to launch them.\n\nLatest news on ETFs Visit the ETF Hub to find out more and to explore our in-depth data and comparison tools helping you to understand everything from performance to ESG ratings\n\n“We are closely monitoring what occurs with spot ETFs,” said Mazza, who added that YBTC has the freedom to “pivot to where the largest options market is”.\n\nYBTC has a fee of 95 basis points. Grayscale has yet to provide details of its proposed ETF.\n\nRosenbluth believed many more flavours of bitcoin exposure were likely to be on the way in the US.\n\nBuffered ETFs — which use options to provide some downside protection — are one possibility. Other vehicles such as the Cyber Hornet S&P 500 and Bitcoin 75/25 Strategy ETF (ZZZ), which provides exposure to bitcoin futures and Wall Street stocks, launched late last year.\n\n“It seems inevitable that we see more asset allocation approaches that incorporate bitcoin exposure in that package.” Rosenbluth said."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1yZWdhaW5zLTQway_SAVlodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI0L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWJpdGNvaW4tcmVnYWlucy00MGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Regains $40K - CoinDesk",
        "content": "A Donald Trump-labeled crypto wallet holds over $1 million of a TRUMP meme coin , having been worth only $7,100 on receipt. Issuance of the token has nothing to do with Trump directly, but some are using the tokens as a speculative bet on his ongoing presidential campaign. The tokens have a market capitalization of over $85 million on Wednesday, data shows. Sending tokens to a popular entity’s wallet is sometimes used as a strategy for attracting eyeballs by meme coin makers. The value of Trump’s wallet has shot up to $2.5 million, holding over $750,000 each in ether and wrapped ether and tiny amounts of several other tokens, most of which were likely sent to the wallet unsolicited."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjUvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1ob2xkcy00MGsv0gFXaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8yNS9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLWhvbGRzLTQway9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Holds $40K - CoinDesk",
        "content": "Tesla's bitcoin holdings remained unchanged in Q4 2023 , according to the company's latest earnings report. The report didn't mention bitcoin, suggesting the company did not buy or sell any BTC in the last three months of the year. Tesla holds over 9,720 BTC, according to data tracked by Bitcoin Treasuries, and is the third-largest public holder of the asset behind MicroStrategy and mining firm Marathon. The firm acquired 43,000 BTC in 2021 for $1.5 billion in February 2021 but had sold 75% of these by Q2 2022. Tesla's remaining holdings are worth $387 million at current prices."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tZXRmLW91dGZsb3dzLXRyYWRpbmctZGF5LTnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Spot bitcoin ETF net outflows hit highest level yet on day 9 of trading - Blockworks",
        "content": "Spot bitcoin ETFs saw the highest level of net outflows in a single day on Wednesday as flows into BlackRock’s product slowed.\n\nThe 10 US funds holding BTC directly endured outflows of $158 million on their ninth day of trading, according to Bloomberg Intelligence data — the highest in a single day thus far.\n\nLoading Tweet..\n\nGrayscale Investments’ Bitcoin Trust ETF (GBTC) continued to weigh the group down, with $429 million leaving the fund.\n\nRead more: As GBTC outflows continue, will the largest bitcoin ETF be dethroned?\n\nWhile BlackRock’s iShares Bitcoin Trust (IBIT) saw inflows of $66 million, the gains were a notable dip from previous days. IBIT had reeled in $272 million and $160 million on Monday and Tuesday, respectively.\n\nFidelity Investments’ Wise Origin Bitcoin Fund (FBTC) led the slate of bitcoin ETFs on Wednesday with inflows of roughly $126 million.\n\nThe $158 million of outflows marked the third consecutive day of combined outflows for the 10 spot bitcoin ETFs.\n\nRead more: Bitcoin ETF Tracker\n\nAfter the funds notched net inflows of $43 million on Friday, their outflows totaled $76 million on Monday and $106 million on Tuesday.\n\nOverall, spot bitcoin ETF net inflows stand at $824 million since the funds launched on Jan. 11, Bloomberg Intelligence data indicates. Inflows for the ETFs — when excluding the outflows of higher-priced GBTC — is $5.2 billion.\n\nDavid Lawant, head of research at crypto prime brokerage FalconX, said in an X post that the driving forces of spot bitcoin ETF flows — GBTC’s heavy outflows and the sizable net gains from IBIT and FBTC — “will both taper off.”\n\n“While the former dominates in the short run, the latter will dominate in the medium/long run by a mile,” Lawant added.\n\nRead more: GBTC’s asset bleeding to blame for week of flat crypto product flows\n\nBitwise Chief Investment Officer Matt Hougan has said he believes spot bitcoin ETFs could see $55 billion in net flows in their first five years on the market.\n\n21Shares President Ophelia Snyder told Blockworks in an interview earlier this month that a number of investors will be slow to adopt spot bitcoin ETFs. Others that do might start with small allocations before ramping those positions up later on.\n\n“So I think this fixation on the short-term flows is crazy short-sighted and largely not the point,” she said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDI0LzEvMjQvMjQwNDkwNDcvZGF0YS1jZW50ZXItYWktY3J5cHRvLWJpdGNvaW4tbWluaW5nLWVsZWN0cmljaXR5LXJlcG9ydC1pZWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "AI and crypto mining are driving up data centers' energy use - The Verge",
        "content": "Data centers could gobble up twice as much electricity by 2026 thanks in large part to cryptocurrencies and artificial intelligence, according to a new report from the International Energy Agency (IEA).\n\nWe rely on data centers to store all our emails, photos, cat videos, and everything else floating around in the cloud. More and more, data centers are cropping up to mine Bitcoin and train AI.\n\nThat’s already triggered backlash over the environmental impact of cryptocurrencies and AI tools like ChatGPT, since all those data centers are responsible for greenhouse gas emissions tied to their electricity use. The world will need a lot more renewable energy to clean up pollution from power grids and satiate skyrocketing electricity demand from data centers at the same time.\n\nThat growth is equivalent to adding an extra country’s worth of electricity demand\n\nData centers, cryptocurrencies, and AI made up around 2 percent of global electricity demand in 2022, using 460TWh of electricity, according to the IEA’s annual electricity report released today. Crypto mining alone is estimated to account for nearly a quarter of that electricity consumption, burning through 110TWh in 2022.\n\nBy 2026, electricity consumption from data centers — including those used for cryptocurrencies and artificial intelligence — could rise up to 1,050TWh depending on the pace the technology develops. That growth is equivalent to adding an extra country’s worth of electricity demand; Sweden under a more modest scenario or Germany at the most.\n\nThe US has the most data centers today, with 33 percent of the world’s approximately 8,000 data centers. It’s also the country with the most Bitcoin mining. The IEA forecasts a “rapid pace” of growth for data center electricity consumption in the US over the next couple of years, rising from roughly 4 percent of US demand in 2022 to 6 percent by 2026. Expanding 5G networks and cloud-based services are other drivers of that growth.\n\nImage: IEA\n\nIreland, with one of the lowest corporate tax rates in the European Union, is expected to see a boom in new data centers. Its 82 data centers already accounted for 17 percent of the country’s electricity consumption in 2022. Another 54 are either under construction or recently approved to start building. By 2026, all those data centers could be responsible for nearly a third of the country’s annual electricity demand.\n\n“The rapid expansion of the data centre sector and the elevated electricity demand can pose challenges for the electricity system,” the IEA report says. The risk isn’t unique to Ireland. In London, data center electricity demands have made it harder to develop more housing. Texas, a hub for Bitcoin mining in the US, has to grapple with new crypto mines (AKA data farms for crypto) adding pressure to its already aging and stressed out power grid.\n\nSince data centers are basically warehouses for computers, 40 percent of their electricity demand comes from computing. Keeping all that equipment cool accounts for another 40 percent of demand, with other IT equipment making up the rest.\n\nImage: IEA\n\nAdding AI into the mix increases data centers’ overall electricity demand. Google Search could use up to ten times more electricity in a scenario fully incorporating AI, the IEA report says. Similarly, it forecasts that the AI industry could burn through ten times as much electricity in 2026 as it did last year."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0NDAyL3Rlc2xhLWJpdGNvaW4taG9sZGluZ3MtcTQtMjAyM9IBRmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3NDQwMi90ZXNsYS1iaXRjb2luLWhvbGRpbmdzLXE0LTIwMjM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Tesla's bitcoin holdings remained unchanged in Q4, earnings suggest - The Block",
        "content": "Tesla Inc., the electric vehicle maker led by Elon Musk, did not sell or buy bitcoin during the fourth quarter of last year, according to its latest quarterly report.\n\nTesla Inc. did not report any activity regarding bitcoin in its fourth-quarter report, suggesting that the company retained its holding of 9,720 bitcoin. The absence of any mention of the largest cryptocurrency by market capitalization implies that Tesla did not engage in converting its bitcoin into fiat currency — a transaction that would typically be included in such reports.\n\nThe company remains the third-largest bitcoin holder among publicly traded firms, following MicroStrategy Inc. and Marathon Digital Holdings, according to data from Bitcoin BTC -7.18% Treasuries.\n\nTesla last sold bitcoin in the second quarter of 2022, reducing its bitcoin holdings by 75% by offloading $936 million worth of bitcoin at the time, according to the data.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nIn the fourth quarter of last year, Tesla generated $25.2 billion in total revenues — up 3% year-on-year — its Q4 report showed. The company reported earnings of 71 cents a share in the fourth quarter, coming in lower than the 74 cents a share forecast by analysts.\n\nThe company’s net income grew to $7.9 billion in the fourth quarter of last year, compared to $3.7 billion during the same period of the previous year."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8xMS1wdWJsaWNseS1saXN0ZWQtYml0Y29pbi1taW5lcnMtMDQwNDU4NTg5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "11 Publicly-Listed Bitcoin Miners May Not Mine Profitably After Halving: Report - Yahoo Finance",
        "content": "11 Publicly-Listed Bitcoin Miners May Not Mine Profitably After Halving: Report\n\nA recent analysis by financial services firm Cantor Fitzgerald has raised concerns among Bitcoin miners, suggesting that many may struggle to maintain profitability following the upcoming halving event. The report highlights that eleven of the largest publicly traded Bitcoin miners could face significant financial pressure if the price of BTC remains at the current $40,000 level after the halving.\n\nThe report identifies Argo Blockchain and Hut 8 Mining as the two miners most likely to face profitability issues after the halving, with their \"all in\" cost-per-coin rates currently exceeding the current Bitcoin price. In total, 11 Bitcoin miners have estimated cost-per-coin exceed the $40,000 level.\n\nIn contrast, Cantor analysts expect Singapore-based Bitdeer and U.S.-based CleanSpark to remain profitable, assuming an average Bitcoin price of $40,000 and no significant changes in hash rate. The report estimated that the cost-per-coin for Bitdeer is $17,744, while CleanSpark’s stands at $36,896.\n\nThe analysis was cited by CleanSpark executive chairman and co-founder Matthew Shultz in a January 25th post.\n\nAs Bitcoin miners' revenues are directly tied to the price of Bitcoin, miners may experience increased challenges in ensuring the revenue generated from mining Bitcoin can be profitable after covering operational costs.\n\nThe Bitcoin halving, scheduled for April, involves a 50% reduction in the block rewards received by Bitcoin miners. While this supply reduction is generally viewed as bullish for Bitcoin's long-term price prospects, it also means that miners with high operational costs could face severe challenges if the price of Bitcoin does not rise sufficiently to cover these costs."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0Mzk0L3N3YW4tYml0Y29pbi1hbm5vdW5jZXMtdXMtbWluaW5nLWJ1c2luZXNzLXdpdGgtNzUwLWJ0Yy1taW5lZC1hbHJlYWR50gFsaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjc0Mzk0L3N3YW4tYml0Y29pbi1hbm5vdW5jZXMtdXMtbWluaW5nLWJ1c2luZXNzLXdpdGgtNzUwLWJ0Yy1taW5lZC1hbHJlYWR5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Swan Bitcoin announces US mining business, with 750 BTC mined already - The Block",
        "content": "Swan Bitcoin BTC -7.18% , a California-based investment platform focused exclusively on the leading cryptocurrency, has expanded into bitcoin mining, the company announced on Thursday.\n\nAccording to CEO Cory Klippsten, the company, which offers bitcoin purchases, asset management and financial advisor services, has been operating a mining arm since July 2023 that’s now coming out of stealth mode. Since July, Swan has mined more than 750 bitcoins, the company said.\n\nSeven mining farms are powered by 160 megawatts of electricity and producing 4.5 exahash of mining power, Klippsten told The Block. Three more will come online in March, increasing the overall hashpower up to 8 exahash, he added. The farms will be both in the U.S. and overseas, Klippsten said, declining to disclose where or what kinds of power sources are being used.\n\n\"Our long-term goal is to be about 50% in the U.S. and 50% outside of the U.S.,\" Klippsten said, adding that he is \"a huge fan\" of mining domestically but also likes to look for low-cost power globally.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nPublic listing in the works\n\nSwan's mining operation is led by Rapha Zagury, an alumnus of Deutsche Bank and Merrill Lynch who spent over 5 years at Brazilian consumer credit startup Open Co before joining Swan as chief investment officer last January.\n\nAccording to Klippsten, Swan is working to achieve a public listing within the next 12 months. In December, Swan announced it is deploying $205 million of capital across its equity, credit and hedge funds. The company currently generates $125 million in annualized revenue and is planning to raise a Series C financing round in the coming months, according to Swan."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI1L2JpdGNvaW4tc3BvdC1ldGZzLXNhdy1oaWdoZXN0LW5ldC1vdXRmbG93cy1zaW5jZS10cmFkaW5nLWJlZ2Fu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Spot ETFs See Lowest Single-Day of Investor Gross Inflows Since Debut - Bloomberg",
        "content": "Interest in the much anticipated spot Bitcoin ETFs appears to be cooling, with Wednesday marking the group’s lowest single-day of investor gross inflows since trading began on Jan. 11.\n\nThe nine new funds received about $270 million in inflows yesterday, according to a report from JPMorgan Chase & Co. Once outflows from Grayscale Investment’s spot Bitcoin ETF are taken into account, overall net net outflows were about $153 million on Wednesday, It’s the third consecutive day of net outflows for the 10 funds. Outflows have come exclusively from GBTC, which converted from a trust following the US Securities and Exchange Commission’s approval of the investment vehicle."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0Mzg3L2JpdGNvaW4taG92ZXJzLWp1c3QtdW5kZXItNDAwMDAtYXMtbWFya2V0LXRyYWNrcy1ncmF5c2NhbGUtb3V0Zmxvd3PSAWtodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzQzODcvYml0Y29pbi1ob3ZlcnMtanVzdC11bmRlci00MDAwMC1hcy1tYXJrZXQtdHJhY2tzLWdyYXlzY2FsZS1vdXRmbG93cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin hovers just under $40,000 as market tracks Grayscale outflows - The Block",
        "content": "Bitcoin BTC -7.18% 's price eclipsed $40,000 at different points on Wednesday but largely hovered just below that mark, as market watchers continued to observe the selling off of Grayscale's spot bitcoin ETF.\n\nThe price of the world's largest cryptocurrency by market capitalization was $39,672 at 4:37 p.m. ET, according to The Block's Price Page. While it's up 1.3% over the past 24 hours, bitcoin's price has declined nearly 14% over the past two weeks.\n\nTrying to summarize why the asset has been sliding since the launch of spot bitcoin ETFs earlier this month — the price surpassed $48,000 on the first day the new products started trading — Bitwise executive Matt Hougan said on Tuesday that there has been an \"expectations-led\" sell-off in recent days.\n\n\"This is not strictly speaking an ETF-led sell-off. The ETFs are net buyers of Bitcoin,\" he said. \"This is an ETF expectations-led sell-off. The market front-ran the ETF approval by piling into to both spot bitcoin and bitcoin derivatives.\"\n\nETF trading volume\n\nSo far, total trading volume for all spot bitcoin ETFs is over $20 billion, according to The Block data. Products offered by Grayscale, BlackRock and Fidelity have dominated, accounting for about 90% of the total volume.\n\nRELATED INDICES See crypto indices\n\nMuch of Grayscale's volume has been made up of investors selling the fund, which is a conversion of the firm's flagship GBTC fund.\n\nHougan believes the market expected there would be \"larger net flows into ETFs than we’ve gotten so far.\" Now, the market is \"unwinding that bet,\" he also said, adding that in his opinion \"the market overestimated the short-term impact of ETFs.\"\n\nOn Wednesday afternoon, Bloomberg Intelligence senior ETF analyst Eric Balchunas posted data to X showing that Grayscale's trading volume was on pace to end the day at its lowest level since the new products began trading.\n\nAt the time of his post, Grayscale had generated about $463 million in trading volume, which was significantly lower than previous days. The first day spot bitcoin ETFs traded, Grayscale registered $2.3 billion in trading, the data also showed.\n\n\"GBTC volume down again today.. could be sign of some exhaustion in the selling,\" Balchunas said."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvZG8tYml0Y29pbi1ldGZzLWtpbGwtdGhlLWJ1bGwtY2FzZS1mb3ItY3J5cHRvLWVxdWl0aWVzL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvZG8tYml0Y29pbi1ldGZzLWtpbGwtdGhlLWJ1bGwtY2FzZS1mb3ItY3J5cHRvLWVxdWl0aWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Do Bitcoin ETFs Kill the Bull Case for Crypto Equities? - CoinDesk",
        "content": "The same cannot be said for Bitcoin miners, which are facing strong headwinds. First, the Bitcoin hashrate, a measure of network security, is near an all-time high, meaning miners need to marshal ever more computing power to earn new rewards. The Bitcoin halving, likely to occur in April, will cut the block reward in half, meaning there will be less to go around. Bitcoin Ordinals, referred to as “NFTs for Bitcoin,” are causing a rift in the community, so miners can’t rely on added fee revenue from these more novel implementations of the network."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8yNC9pbmRvbmVzaWFzLWNyeXB0by10YXgtcmV2ZW51ZS1mYWxscy02My1pbi0yMDIzLWRlc3BpdGUtYml0Y29pbnMtc3VyZ2Uv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDI0LzAxLzI0L2luZG9uZXNpYXMtY3J5cHRvLXRheC1yZXZlbnVlLWZhbGxzLTYzLWluLTIwMjMtZGVzcGl0ZS1iaXRjb2lucy1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Indonesia's Crypto Tax Revenue Falls 63% in 2023 Despite Bitcoin's Surge - CoinDesk",
        "content": "It’s worth noting that local exchanges have protested the high tax rates and blamed them for thinner revenues as users seek alternatives. Indonesia’s local exchanges had proposed that crypto transactions should only be subject to income tax, not VAT. The exchanges’ suggestion comes as the country’s Financial Services Authority (OJK) prepares to regulate crypto from January 2025. They believe this adjustment would classify crypto more as a security than a commodity."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3Qvd2h5LXRoZS1iaXRjb2luLWV0Zi1oYW5nb3Zlci13aWxsLWVuZC1zb29uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin's 'relentless' selling will end in weeks - DLNews",
        "content": "Bitcoin is down 20% since Wall Street launched its ETFs.\n\nAnalysts at K33 blamed a variety of factors for the slump, including CME futures unwinding and the FTX estate selling its GBTC shares.\n\nThese structural problems will soon subside, they said.\n\nBitcoin has tumbled almost 20% since BlackRock, Fidelity, and other firms launched their long awaited spot Bitcoin exchange-traded funds. Although, the cryptocurrency slightly recovered over the past 24 hours.\n\nAnalysts at crypto research firm K33 Research explain the reasons for the decline — and why market participants can expect the selling pressure to ease soon.\n\nStructural selling\n\nLess than two weeks after they launched, new Bitcoin ETFs have seen nearly $1 billion in net inflows — but that hasn’t been enough to keep Bitcoin’s price up.\n\nStructural factors, CME futures outflows, and spot selling are likely to blame, K33′s head of research Anders Helseth and senior analyst Vetle Lunde wrote in a report Monday.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nOpen interest at CME Group, the largest Bitcoin futures venue in the world, has declined by 28% among entities that haven’t issued a Bitcoin ETF, the report said.\n\nOpen interest reflects the total number of outstanding futures contracts held by market participants.\n\n“The market is experiencing structural selling,” K33 said.\n\n“CME traders unsurprisingly [reduced] exposure following the ETF launch” the firm said, and this could continue until it drops another 35% — back to its 2023 average.\n\nJoin the community to get our latest stories and updates\n\nBitcoin is also experiencing spot selling pressure, as traders who entered well ahead of the ETF launch are now taking profit, the analysts said.\n\nGrayscale’s GBTC — which converted into a spot ETF — is particularly relevant to current price action. The ETF has seen nearly $4 billion in outflows since January 11.\n\nThe report blamed some of these flows on the FTX bankruptcy estate, which likely exited its position, worth around $1 billion.\n\nMarket participants arbitraging GBTC are likely also closing their trades, the analysts said.\n\n“Outflows from GBTC are relentless but will, over time, dwindle,” they wrote. “Structural effects should play out with less intensity shortly, stabilising Bitcoin’s price as we enter February,” the analysts added. “Reduced exposure on CME will likely play out rapidly as we approach Friday’s January futures settlement.”\n\nBitwise’s chief investment officer Matt Hougan, who was previously CEO at ETF analytics firm ETF.com and chairman at events firm inside ETFs, echoed K33′s assessment.\n\n“This is an ETF expectations-led sell-off,” he posted on X. “The market front-ran the ETF approval by piling into both spot Bitcoin and Bitcoin derivatives. It expected larger net flows into ETFs than we’ve gotten so far, and is now unwinding that bet.”\n\n“Just as the market overestimated the short-term impact of ETFs, it is underestimating the long-term impact,” he added.\n\nCrypto market movers\n\nBitcoin is up 3.1% in the last 24 hours, trading at $39,960.\n\nEthereum rose 2.1% in the same period, now at $2,228.\n\nAvalanche and Solana are up 12% and 8%, respectively.\n\nWhat we’re reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zd2FuLWJpdGNvaW4tbGF1bmNoZXMtbWluaW5nLXZlbnR1cmUtMDQxMDU2NjMwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Swan Bitcoin Launches Mining Venture, Plans For Public Listing - Yahoo Finance",
        "content": "Swan Bitcoin Launches Mining Venture, Plans For Public Listing\n\nSwan Bitcoin, a Bitcoin-focused financial services firm, has disclosed the launch of its Bitcoin mining venture, Swan Mining, which has been operating in stealth mode since last summer. The company aims to expand its institutional offerings and is actively pursuing a public listing within the next 12 months.\n\nSwan's decision to establish a mining unit stems from its vision of becoming a “comprehensive” Bitcoin company. Swan emphasizes that its mining business operates independently, utilizing a debt-free funding model and maintaining legal segregation from its other business arms. The company intends to allocate its next Series C funding equally among its financial services, mining, and acquisitions ventures.\n\nSwan Mining has already achieved notable success, having mined 750 Bitcoin (BTC) with its current hash rate capacity of 4.5 exahashes per second (EH/s). The firm anticipates surpassing 8 EH/s in March upon the deployment of new mining equipment.\n\nSwan's CEO, Cory Klippsten, is actively working towards achieving a public listing within the next 12 months. He said:\n\n“Swan Mining is a great example of our company thesis playing out. With our exclusive focus on Bitcoin adoption and helping the industry grow, we continue to attract the talent, opportunities, and capital required to launch new business lines and grow them rapidly.”\n\nDespite the focus on its mining venture, Swan assures that its financial services unit remains healthy and continues to grow. The company claims to have generated $125 million in revenue over the last 12 months and doubled its staff count."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzI0L3Nob3VsZC15b3UtYnV5LXRoZS1kaXAtb24tYml0Y29pbi1taW5pbmctc3RvY2tzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy the Dip on Bitcoin Mining Stocks? - The Motley Fool",
        "content": "After posting stellar triple-digit returns in 2023, Bitcoin (BTC -4.31%) mining stocks are down across the board in early 2024. For example, Marathon Digital Holdings (MARA -7.46%) is down 32%, and Riot Platforms (RIOT -6.82%) is down 35%. Those sharply negative returns are all the more striking, given all the hype around Bitcoin and the new spot Bitcoin exchange-traded funds (ETFs).\n\nOn one hand, this could be a fantastic opportunity to buy the dip in Bitcoin mining stocks. On the other hand, there is likely a fundamental change in market outlook that's causing this sharp correction to the downside. Let's take a closer look.\n\nImpact of the Bitcoin halving\n\nNow that the Bitcoin ETF approval drama is over, the market is starting to wake up to the potential impact of the next Bitcoin halving, scheduled for April 2024. A Bitcoin halving occurs only once every four years and, as a result, is highly anticipated by the market. In three previous halving cycles, the price of Bitcoin has skyrocketed, and many investors are expecting the same pattern this time around.\n\nWhile the investment thesis is fairly clear for Bitcoin itself, it's a bit murkier for Bitcoin miners. The halving reduces the mining reward paid out to Bitcoin miners by one-half. Right now, every time a Bitcoin miner adds a block to the Bitcoin blockchain, they are paid a reward of 6.25 BTC, which is worth roughly $250,000 at today's prices. That might sound like a lot, but much of it goes to owning and operating Bitcoin mining rigs, which consume vast amounts of energy.\n\nIn April 2024, the \"mining reward\" will be slashed to 3.125 BTC. That might not seem like a big deal until you consider how it impacts both the top and bottom lines for Bitcoin miners. Think about it for a second. What would happen if your boss told you your \"paycheck reward\" would be slashed by one-half starting in April? Oh, and you're also expected to work the same number of hours and put in the same amount of work. If you're like most people, you'd probably start looking for new opportunities as soon as possible.\n\nAnd that's why I think there will be a shakeout in the Bitcoin mining industry this year. All other things staying the same, Bitcoin miners will have a much harder time breaking even in 2024. The growing consensus is that the new break-even point will be a Bitcoin price of $40,000. If the price of Bitcoin falls below that level, a lot of Bitcoin miners could go out of business.\n\nThe difficulty of picking winners\n\nIn 2023, all that really mattered was the number of mining rigs a Bitcoin miner could bring online. The more rigs, the more Bitcoin they could mine and the more money they could make. Very easy to understand. You just bought the biggest miners.\n\nBut all that changes in April. The competitive playing field will be stacked in favor of Bitcoin mining companies with the lowest costs, the greatest liquidity, and the least debt. While the absolute number of mining rigs will obviously still matter, the emphasis will be on getting production costs below that magic $40,000 mark. If you're running an entire fleet of highly inefficient machines gobbling up a lot of electricity, you lose.\n\nThat makes buying the dip on Bitcoin miners so risky right now. You really don't know who the new winners will be. There are a lot of factors to take into account. The current consensus is that Riot Platforms, due to its low cost base, will be among the winners.\n\nIs there an alternative to buying specific mining stocks?\n\nInstead of trying to pick winners, it might be easier just to invest in a diversified ETF, such as the Valkyrie Bitcoin Miners ETF (WGMI -6.86%). This fund holds approximately 20 different stocks related to the Bitcoin mining industry. There's no need to pick winners because, theoretically, you're letting a much smarter fund manager figure out the right portfolio blend for you.\n\nNo, you might not get the same type of upside as if you picked a single Bitcoin mining stock, but you also diversify away some of your risk. In theory, this ETF should have the highest allocations to the best Bitcoin miners. If you're expecting a lot of turbulence in the Bitcoin mining industry this year, as I am, this might be a safer way to play Bitcoin mining stocks. That said, the Valkyrie Bitcoin Miners ETF is down 30% to start the year, so it's certainly not without risk.\n\nThe investment narrative around Bitcoin continues to shift. Yes, Bitcoin mining stocks were a slam-dunk investment last year. But if you really dig into the economics of the upcoming Bitcoin halving event, it's easy to see how Bitcoin mining stocks come with much more downside risk this year. As for me, I'm avoiding direct exposure to Bitcoin mining stocks until after the next big miner shakeout."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdHdpc2Utc2hhcmVzLWJpdGNvaW4tZXRmLWhvbGRpbmdzLWFkZHJlc3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitwise publishes bitcoin ETF holdings address after on-chain sleuths uncover BlackRock's - Blockworks",
        "content": "Bitwise has publicly disclosed the address of its bitcoin ETF’s holdings.\n\nIn a post on X, the company said that sharing the address was the “first step toward increasing public transparency.”\n\nLoading Tweet..\n\nWhile the issuer is the first to make this type of announcement, that hasn’t stopped internet sleuths from tracking down the addresses for other issuers, including Grayscale and BlackRock.\n\nRead more: Let’s pour one out for the first-day spot bitcoin ETF investors\n\nOther sleuths have uncovered the addresses for VanEck, WisdomTree and Fidelity among others. Bitwise, prior to its public announcement, was also on that list according to a Jan. 22 post from Arkham on X.\n\nLoading Tweet..\n\nThe bitcoin ETFs had a rocky start following the much-anticipated approval from the Securities and Exchange Commission.\n\nGrayscale, in particular, has seen huge outflows. Though some, as Blockworks previously reported, may stem from the FTX estate unloading its GBTC holdings.\n\nGBTC has around $21 billion in assets, according to the firm’s website on Wednesday.\n\nRead more: SEC’s X account fell victim to SIM swap attack\n\nVolatility is no stranger to the bitcoin ETFs, which only received approval this month.\n\nPrior to the SEC officially paving the way for the launches, an attacker was able to access the SEC’s official X account and make a fake ETF approval post. SEC Chair Gary Gensler then confirmed, via his X account, that the post was not sanctioned or made by the SEC.\n\nThe bitcoin ETFs were then approved the next day.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMjUvdGhpcy1pcy13aGF0LXdhcy1iZWhpbmQtdGhlLWJpdGNvaW4tc2VsbC1vZmYtYW5kLXdoeS1qcG1vcmdhbi10aGlua3MtaXQtY291bGQtYmUtZW5kaW5nLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "This is what was behind the bitcoin sell-off and why JPMorgan thinks it could be ending - CNBC",
        "content": "The driving force behind the recent sell-off in bitcoin may have run its course, according to JPMorgan. Bitcoin rallied in the second half of 2023 as optimism around the approval of exchange traded funds grew, but their debut earlier this month has proven to be a \"sell the news\" event for the world's largest cryptocurrency. Bitcoin briefly traded above $49,000 shortly before the funds launched, but then fell more than 20% before seeming to stabilize around $40,000. BTC.CM= YTD mountain Bitcoin has retreated since the approval of bitcoin ETFs. JPMorgan strategist Nikolaos Panigirtzoglou said in a note to clients Thursday that the main source of the selling has come from the Grayscale Bitcoin Trust (GBTC) . The fund, which traded at a steep discount as an over-the-counter product before investors became confident that a conversion to an ETF would happen, has seen heavy outflows over the past two weeks. \"Profit-taking on previous GBTC investments, made at a discount to [net asset value] last year, has likely been a major driver behind bitcoin's correction; $4.3bn has thus far exited GBTC since its conversion to ETF,\" Panigirtzoglou said. Some outflows from GBTC were expected, given the prior discount and its high cost relative to other bitcoin ETFs. Panigirtzoglou, who had estimated $3 billion of outflows, said that the decline is likely profit taking rather than a sign that the cash is moving to other options, and that the outflows should slow from here. \"We conclude that GBTC profit taking has largely happened already. In turn, this would imply that most of the downward pressure on bitcoin from that channel should be largely behind us,\" Panigirtzoglou said. Even with the outflows from GBTC, the fund still has about $20 billion in assets under management. And some of the other bitcoin ETFs are seeing big inflows, with funds from iShares ( IBIT ) and Fidelity Wise Origin ( FBTC ) both surpassing $1 billion in inflows. The total inflows and decline in price of bitcoin have missed the optimistic estimates of some crypto bulls, but the dollar amounts are still large compared to other ETF launches."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI0L2dyYXlzY2FsZXMtZ2J0Yy1oYXMtbW92ZWQtbW9yZS10aGFuLTEwMGstYnRjLXRvLWV4Y2hhbmdlLXNpbmNlLXNwb3QtYml0Y29pbi1ldGYtbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "GBTC's Bitcoin (BTC) Sales Top 100K Since ETF Launch - CoinDesk",
        "content": "GBTC has seen this massive outflow for any number of reasons, but principally as Grayscale cut its management fee just 50 basis points to 1.50% following the conversion to a spot ETF. That's more than 100 basis points higher than the other nine competing bitcoin ETFs. Grayscale has now seen the departure of more than 10,000 bitcoin per day for several days running. The exit of bitcoin combined with the decline in the price of bitcoin has led to a fall in assets under management (AUM) by more than $1 billion each day this week."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2pwbS1ncmF5c2NhbGUtZ2J0Yy1vdXRmbG93c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "JPMorgan says GBTC outflows stemmed, bitcoin downside 'should be largely behind us' - Blockworks",
        "content": "JPMorgan analysts penned a market strategy note Thursday that profit-taking on Grayscale’s bitcoin ETF (GBTC) had likely concluded, thus “limiting any downside for bitcoin from here.”\n\nThe analysis from JPMorgan would amount to a reversal of fortunes for bitcoin and its largest spot ETF. It follows a Tuesday note from JPMorgan claiming that the ETF catalyst would “disappoint market participants.”\n\nNewly-approved spot bitcoin ETFs logged their single largest day of outflows Wednesday. Investors cashed out on $429 million worth of GBTC, bringing the product’s total outflows to roughly $4.4 billion in nine days of trading.\n\nBitcoin has spent much of the week trading below $40,000 after topping $49,000 in the immediate aftermath of the ETF approvals.\n\nRead more: Spot bitcoin ETF net outflows hit highest level yet on day 9 of trading\n\nJPMorgan previously estimated $3 billion would depart GBTC as investors took profit on the ETF trading below the value of bitcoin, the note said. The FTX estate was reportedly among the investors selling their GBTC.\n\nThe group of analysts, led by Nikolaos Panigirtzoglou, think the GBTC sell-off has concluded and “most of the downward pressure on bitcoin from that channel should be largely behind us.”\n\nThe note estimates another $1.3 billion shifted from GBTC to other spot bitcoin ETFs with lower fees. The analysts argue the shift in funds from GBTC to competing ETFs will likely continue if Grayscale fails to lower its fee of 1.5%, which is much higher than the 0.25% charged by competing offerings from Blackrock and Fidelity.\n\nThe note’s appendix shows upticks in open interest and bitcoin fund flows on Tuesday. Bitcoin open interest is up a little under 1% in the past 24 hours, according to data from Coinglass.\n\nEarlier this week, JPMorgan downgraded the stock of popular bitcoin ETF custodian Coinbase following underwhelming week one performance from the slew of spot ETFs.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyNC0wMS0yNS9hbmltb2NhLWJyYW5kcy1zaXUtb24tYml0Y29pbi12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Watch Animoca Brands' Siu on Bitcoin - Bloomberg",
        "content": "00:00\n\nThe. There's so many things I want to talk to you about. Why don't we start with a spot Bitcoin ETF? That pulled some money that arguably was outside the universe back in. But how does that affect you directly? Well, generally speaking, the excitement about sport ETF has sort of galvanized the entire market over the last two actually months. The entire industry has seen an incredible revival, you could say. And there's not actually so much necessarily just inflows into the market. It's confidence as well. It's validating the market. We also have to expect that now you have many thousands of basically sales agents in the U.S. going out, selling a Bitcoin related product, essentially a crypto product, which is again something that validates the space. And Bitcoin is somewhat the reserve currency of the metaverse and web3. Yeah. So as that value rises, basically the entire rest of the ecosystem goes up. So we're now at about $1.6 trillion from a market size, which is pretty amazing. And that sort of flow over hasn't just affected things in the sort of financial markets, but also in culture like with NFT, right? So in December, around the time actually NFT sales over the last month was $1.8 billion, which has been an incredible revival given where it was a year ago. So the entire industry has gone up since you mentioned NetEase. What is turnover, what has turnover look like since bitcoin prices started rebounding in terms of prices, prices and overall transactions? Because there was a really dark spot of last year, there was a dark spot generally speaking. I mean I think it's gone down, you know, at one point it was like something like 300 and $400 million a month in sales and now at $1.8 billion on sort of sales is actually really what's come up. A few things. The market has become also more diversified in the past. All of the NFT sales were very Ethereum focused and now with Bitcoin and Audible's, you have basically a new sort of phase of new type of digital collectibles and sort of digital cultural artifacts that are out there. But yeah, the values of many of these sort of assets, including some of ours, like the Winklevoss twins, have gone up over 600% over the last three months. So broadly speaking, it's been, you know, a really good time. And we think 2024 will also be a very strong year because when you think about last year, I think of 23 as a clean up year for our world, right? It was quite a scandal we had to take care of. And also, I think the sort of cloud over what was going to happen to finance was kind of taken care of. And now we know that kind of Binance is treated much like a big bank dealing with, you know, a penalty and now moving forward. Yeah. So I think that clarity is really what the market wants. So I think all of those together have created a really good platform for in 2024 for web3 and blockchains. Do you think that changes everything negative that's happened? And we're cleaning up your point. We're cleaning up right now and we've obviously had our episode specific episodes locally here. Do you think that's changed the way the government has that this overall blueprint of them looking to develop website? Has that changed in your view? Because you said I mean, I didn't know I went through sort of council. Yeah. And one of the things that's very clear is that Hong Kong has continued to stay steadfast in its direction to become a digital asset hub. And frankly, I think Hong Kong recognizes not only that it's here to stay and that it's the future, but also how does holding differentiate itself against all of these other major financial hubs? How does it say that it's different from a London or New York or a Singapore, for instance? And I think by being a digital assets leader, it's demonstrated that last year at FinTech Week, I know when Apex was here and so on, there was incredible energy and excitement around this. And, you know, I just came back from Davos and actually it was our office that was actually on stage talking about basically digital assets and crypto are probably one of the few government officials that was doing that Web three here in Hong Kong. What are the tangible developments which we should we can expect? Let's freeze it down. What we can expect to see. I mean, I think in the near term, many of the NFT projects in terms of culture and entertainment are continuing to rise. You know, it started off obviously with, you know, our sandbox, but now you've got many other projects here ranging from, you know, the multiverse, ranging from other projects, whether it's, you know, all of X or, you know, meme land with various projects that are see coming here from that angle. But of course, you know, nobody just wants to have you know, nobody wants a USB or the fund with a spot ETF. So expect a lot of smart ETF applications coming in to us for Bitcoin, but also for other token assets. You know, ETHEREUM'S probably next to probably other type of. Why would you say that? Because everyone says Ethereum is next. But yeah, tangibly is that because it's the second biggest or the second biggest? It has the most utility in terms of the ecosystem, but also I think because it's it's recognized as the second largest asset that is out there, but not every market necessarily will be looking at. You know, in the US, for instance, there's unclarity whether the FCC looks at Ethereum as a security or not. Right? Whereas I think in Hong Kong it's much more clearer. So there's an opportunity for markets like Hong Kong to actually be ahead of things like Etherium Spot ETF in comparison to the U.S. But, you know, we'll see how that plays out. Well, your very own, of course, which is sad. Do you is that is that somewhat of a northern north star for you to eventually get a spot ETF for San Juan? I mean, you know, the whole entire sort of crypto market when you think about tokens, $80 billion is traded roughly on a daily basis right now with tokens. There's a lot of liquidity in that space and that includes tokens such as sand or EB coin. Otherwise there is already, you know, with S.F. benchmarks, essentially a gaming index related to game utility tokens. So the next step for that becoming potentially an ETF in the future is, you know, absolutely something that could possibly be in the cards. It's not something that we ourselves will be. Launching, but we'd have to work with obviously financial partners to do that. But we totally expect that in the years to come that will happen. And of course, the other trend that's moving is of course, you know, basically RWA is basically people doing sort of, you know, taking real world assets and tokenizing that that's become very much of a sort of growing trend and will be something that we see developing in the near future. And I think Hong Kong could be one of the main hubs in the world that could be at the center of all this. You know, a fairly dominant theme since you brought up we're talking about Hong Kong is Hong Kong, Middle East. Yes, right. And there's a lot of presence from the Middle East here. I'm just looking around at some of the forums here. I know you guys just did a deal. When was that with Saudi, with Neal, with you in Saudi? When was that over? So that was. Yeah, that was a few months ago. Right close to you. So we've done the deal. Okay. And obviously it's pending closing conditions, but we were working together, doing a bunch of things. Have you received the money? We have not received the money That's been based on the closing conditions, but the process is ongoing and we're working very closely with them. The exciting thing is that, you know, Saudi Arabia in particular wants to become also, you know, with Vision 2030 has a very clear vision as to how the future will go in terms of its development. Gaming is a big, big narrative. And as you may know, Animoca Brands, as you know, has made lots of investments in growth in the gaming area, particularly with Wave three. You know, a population in Saudi is I think over 80% is under the age of 36 or 38. So very young population, active gaming market and neom is really in some ways sort of a parallel to sort of, I guess, the Guangdong sort of special economic zones that I'm thinking of or Shenzen economic Zone experiment, you could say, where they're trying to build an entirely new economy with its own sort of, you know, laws and so on, sort of citizenship. Almost all we can basically sandbox and build many of these sort of new sort of innovations, including web3 and blockchain. Right. So they can do much more easily in Neom than you could do, for instance, in Saudi as a country. Is there a direct revenue impact to your core businesses right now from that deal, or is that completely separate? We'll be able to talk to us about that. Well, I mean, first of all, Saudi generally or the Middle East is a major gaming market. Okay? When you look at not just actually what's happening in Saudi, but also UAE, Prince is a turkey. He's actually a major crypto hub, actually. And, you know, we expect revenue growth to be driven out of these markets. The other thing is, of course, the deployment of projects development, right? We're doing Metaverse projects, for instance, as you know, I can't announce what they are, but, you know, probably in a few months time you'll be seeing some news about some of the projects that we're launching together with Neom in Saudi. And these all have revenue impacts on our business. Talk about your business revenue growth you're targeting this year from last year. You work for the Wall Street Journal. You've been profitable. That's because, I mean, we're hoping to basically double our revenues from last year. Last year was a difficult year in comparison to the year prior. So obviously, you know, 23 was generally down. However, 24 is we expect much of an upswing. And, you know, the the entire sort of you know, our business is doing very well. Cash flow is generally very good. Right. So broadly speaking, you know, I would say that with 23 has sort of, I guess, solidified our position is probably one of the biggest, if not the leader in certainly Web three entertainment and culture. But also, broadly speaking, the exchanges out there have normally dominated the narrative. And in 23, I think a lot of that narrative has gone over to companies more like us or focus on culture and entertainment. So there's more attention on, you know, you know, awesome Uber Labs or anything around end of TVs and particularly gaming. Gaming has become a very strong narrative in terms of the adoption of what three. And one of the big reasons why gamers should be adopting office, because they're already dealing with virtual currency and they're really dealing with digital assets if they don't really own them. And that's basically what Web three can provide. Yeah. So that that that fit will thrive. And of course, we started out this conversation with spot ETFs. You know, certainly the you know, whether or not we do get a flood of institutional money in and you know, one thing that keeps coming up when they ask the question to traditional asset managers, large and wise, you know, with the spot ETF, do you now see yourself adopting or, you know, carving out a piece of your portfolio to that? What they say is I can't model it. So no, no, no, it's the answer. I can model it. What would the response be? Well, I mean, to me, this is the asset class of the future. I think one of the things that one has to understand is the macro of the world right now. But when you look at Web3 three, the opportunity, it is not only to be looked at in terms of the current sort of, you know, what's a cash flow revenue model. It's a new economics paradigm. It's the fact that, you know, what is the one way in which most of the world, particularly the ones who do not have access to, you know, new financial means, have a way in which it could be financially included. And actually web3 is the only way. I mean, even when you think about last year, a whole was the narrative actually who were the ones who got to participate in the growth of the narrative? VCs, investors, people could invest in, you know, companies like I, but everyone else was excluded. And this is basically why with three I think is so amazing because it can help include that Web3 is a people's movement. That's a difference. You know, the original Internet was a people's movement. Web two became more of a corporate movement, and I think people are trying to analyze it in this manner and web3 we're going back to essentially a people's movement."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzI0L2FyZS1zYXlsb3JzLXNhbGVzLWEtcHJlZGljdGlvbi1vZi1iaXRjb2luLXByaWNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Saylor's Sales: A Prediction of Future Bitcoin Prices? - The Motley Fool",
        "content": "MicroStrategy (MSTR -5.06%) founder and chairman Michael Saylor started selling stock in his own company in early January, culled from his portfolio of stock options. Astute investors may have noticed that the sales have been very consistent and are still going on today.\n\nEven keener observers, of course, saw this process coming from a mile away -- actually, from early November 2023. They also know how long Saylor's sales will go on, and why he is doing it.\n\nIn case you missed the early hints, here's why Michael Saylor is converting a massive lot of stock options into MicroStrategy shares, only to sell them immediately on the open market. Spoiler alert: Saylor has not lost faith in his data analytics business. He simply wants to buy some Bitcoin (BTC -4.26%) for himself.\n\nWhy Saylor is selling his converted stock options\n\nThis is not a guess. Saylor stated his plan to execute some of his stock options in 2024 and then sell the resulting shares on the grand stage of MicroStrategy's third-quarter earnings call in November:\n\nI was granted a stock option in 2014 with respect to 400,000 shares, which is going to expire next April if I don't exercise it by then. For almost a decade now at my request, the company has only paid me a $1 salary, and I've chosen not to be eligible for any cash bonuses. Exercising this option will allow me to address some financial obligations, as well as to acquire additional Bitcoin for my personal account.\n\nThose options were about to expire at the end of April anyway, so why not convert them into some cash and a lot of Bitcoin? After all, that's exactly what Saylor has been doing to most of MicroStrategy's cash in recent years.\n\nSaylor went on to explain his trading plan in some detail. As stated on that call and in the regulatory filings that followed, Saylor is converting 5,000 stock options into MicroStrategy shares on every day between Jan. 2 and April 25. This slow and steady approach minimizes Saylor's impact on MicroStrategy's daily trading patterns and volumes. It's a patient and responsible way to take advantage of the only significant compensation MicroStrategy has issued to Saylor in the last decade.\n\nThe story behind Saylor's stock option play\n\nIt should be said that Michael Saylor has a history of controversial business practices. The block of 400,000 stock options was set up to placate activist investor group Apex Capital in 2014. The firm argued that Saylor -- CEO at the time -- was spending too much time on his yachts and golf courses, paying insufficient attention to MicroStrategy's management.\n\nWith a strictly symbolic annual paycheck, no bonuses for the next decade, and a huge block of stock options to his name, Michael Saylor's objectives were strictly aligned with those of common shareholders. The only way to make money under this structure was to increase MicroStrategy's stock value over time.\n\nThis options-based structure wasn't looking good in 2020. By midsummer that year, MicroStrategy's stock price was down 5% from the start of 2014. Saylor's 400,000 stock options were worth a grand total of $47 million that summer. It's hardly a beggar's ransom, but also far from the stellar returns expected by the CEO of a successful software business over nearly seven years.\n\nLater that summer, Michael Saylor invested $250 million of MicroStrategy's cash in Bitcoin, calling the cryptocurrency \"a dependable store of value and an attractive investment asset with more long-term appreciation potential than holding cash.\" MicroStrategy's stock price more than tripled between July 1 and New Year's Eve, right alongside a similar surge in Bitcoin prices.\n\nBitcoin has been good to Michael Saylor over the years. At today's share prices, those 400,000 options are worth approximately $159 million. That should be more than enough to settle Saylor's golf club premiums, put a fresh coat of paint on every yacht, and boost his personal Bitcoin exposure significantly.\n\nBitcoin transformed Saylor's fortunes -- should you follow suit?\n\nMichael Saylor's stock-option settlement worked out in his favor thanks to a bold Bitcoin bet. The man looks like a genius when the largest cryptocurrency is on the rise, but not so much during crypto winters and other market downturns. If those options had expired one year earlier, forcing him to execute the conversion plan in the spring of 2023, MicroStrategy's and Bitcoin's average prices were about half of what they are today.\n\nMy takeaway from Michael Saylor's Bitcoin adventures is not that my entire net worth should be converted into Bitcoin today. Rather, I see the upsides of a successful crypto strategy next to the downsides of more challenging periods. If anything, I'm inspired to take my hands off the Bitcoin wheel for a while (apart from moving my Bitcoin ETF holdings into a different vehicle, as I disclosed last week) and wait for the next crypto winter before increasing my crypto bets.\n\nI respect the longtime Bitcoin advocate's deep devotion to the cause, but he isn't my favorite role model by a long shot. Saylor rides the Bitcoin roller coaster with gusto, but for those of us watching from the ground, it's a clear signal to diversify our tickets and enjoy a steadier ride.\n\nThat's why my Bitcoin investments are a small portion of my total nest egg, and why master investor Warren Buffett wouldn't touch the digital currency with a 10-foot pole."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGVzLWdidGMtbW92ZWQtbW9yZS0xMDBrLTE2Mzc0OTUyMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Grayscale's GBTC Has Moved More Than 100K BTC to Exchange Since Spot Bitcoin ETF Launch - Yahoo Finance",
        "content": "Grayscale's Bitcoin Trust (GBTC) moved more than 19,000 bitcoin [BTC] from its publicly known wallet Wednesday morning. Since the spot bitcoin ETFs opened for business on Jan. 11, Grayscale has now moved nearly 113,000 bitcoin from its wallet, the overwhelming majority of which was to Coinbase Prime in preparation for sale, according to data compiled from Arkham.\n\nThe Grayscale website Wednesday morning showed GBTC as holding roughly 537,000 bitcoin, down about 100,000 BTC since Jan. 11.\n\nAs Arkham noted, one caveat to the observed movement of bitcoin out of the Grayscale wallet is that not all of that may be related to redemption. \"The outflows are usually split between Coinbase Prime and new GBTC custody addresses,\" said Arkham. \"This means that not all of the BTC moved is being redeemed. The outflows appear to be settlements of trading activity for the previous day(s).\"\n\nDue to the input-output structure of its blockchain, Bitcoin transaction outputs are often split amongst multiple addresses.\n\n\n\nGBTC custody wallets frequently send to multiple addresses, most often a Coinbase Prime deposit and a fresh GBTC custody address. This means that some of… pic.twitter.com/Oml9IhLDMp — Arkham (@ArkhamIntel) January 24, 2024\n\nGBTC has seen this massive outflow for any number of reasons, but principally as Grayscale cut its management fee just 50 basis points to 1.50% following the conversion to a spot ETF. That's more than 100 basis points higher than the other nine competing bitcoin ETFs. Grayscale has now seen the departure of more than 10,000 bitcoin per day for several days running. The exit of bitcoin combined with the decline in the price of bitcoin has led to a fall in assets under management (AUM) by more than $1 billion each day this week.\n\nStory continues\n\nThe hopes of bitcoin bulls were momentarily buoyed earlier this week on a Monday CoinDesk report that the FTX estate had unloaded its 22 million share GBTC holding. With this non-economic whale seller out of the way, the bulls hoped there might be a slowdown in GBTC exits. To this point though, this hasn't happened, as evidenced by this morning's movement of 19,000 bitcoin to exchange.\n\nRead more: Crypto Whales Hunt for Bargains As Bitcoin Prices Slide, Data Shows\n\nUpdate (1/25/2024 14:50 UTC): Adds detail noting the decline in AUM is due a combination of reduced bitcoin in fund and lower prices. The original story didn't mention the lower bitcoin price as a contributing factor in the drop in AUM.\n\n\n\n"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2didGMtb3V0Zmxvd3MtY3VyYi1hc3NldC1hZHZhbnRhZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "As GBTC outflows continue, will the largest bitcoin ETF be dethroned? - Blockworks",
        "content": "Grayscale Investments’ bitcoin trust continues to see net outflows two weeks after converting to an ETF, shrinking the hefty asset advantage it has over rivals.\n\nStill, analysts believe it could be a while before the Grayscale fund relinquishes its title of the largest spot bitcoin ETF.\n\nThe Grayscale Bitcoin Trust ETF (GBTC) saw $515 million in net outflows on Tuesday, according to Bloomberg Intelligence data — bringing its net outflow total to nearly $4 billion since converting to an ETF on Jan. 11.\n\nRead more: Bitcoin ETF Tracker\n\nGBTC’s assets stood at about $21 billion at midday Wednesday, according to the firm’s website.\n\nMeanwhile, competing bitcoin ETFs by BlackRock and Fidelity had grown their asset bases to about $1.85 billion and $1.6 billion, respectively, as they have notched net inflows daily.\n\nSome foresaw GBTC’s asset bleeding given the fund’s 1.5% fee. The price point was reduced from 2% upon converting to an ETF, though remains significantly higher than competing offerings with expense ratios ranging from 0.19% and 0.39%.\n\nRead more: Why the planned fee for Grayscale’s bitcoin ETF is much higher than others\n\nMatteo Greco, research analyst at Fineqia International, said given GBTC’s pre-ETF structure — restricting redemptions to only allow selling shares on the secondary market at a significant discount — he expected the highest outflow activity to occur within the first few weeks of trading as an ETF.\n\nBut surpassing GBTC’s assets under management will be a “challenging feat,” he told Blockworks, adding that the pace of competitor inflows and GBTC outflows are likely to decelerate.\n\n“Given GBTC’s [public quotation] in 2015, boasting over eight years of competitive advantage, it is anticipated that GBTC will continue to dominate AUM for a considerable duration,” Greco said. “Dethroning GBTC could be a lengthy process.”\n\nThe fund officially launched two years prior in 2013. Grayscale’s court victory over the Securities and Exchange Commission last August served as a catalyst for the long-awaited approval of US spot bitcoin ETFs.\n\n“GBTC has already cemented its place as the go-to bitcoin ETF in the United States for investors who value market-leading liquidity, tight spreads and a decade-long track record of operational success,” a Grayscale spokesperson told Blockworks.\n\nThe fund’s trading volumes totaled nearly $11 billion after eight days of trading, accounting for more than half the volumes seen for such ETFs.\n\nJohn Hoffman, Grayscale’s managing director of sales and distribution, previously said that because large capital markets ETFs are used in a variety of investing strategies, “we anticipate GBTC’s diverse shareholder base will continue to deploy strategies that impact inflows and outflows.”\n\nWhy investors might remain in GBTC\n\nBryan Armour, a director of passive strategies research at Morningstar, said while he expects GBTC’s assets to continue to drop, there remains a portion of investors who are either unaware of other options or uninterested in switching.\n\nArmour added that because many are buying the nine other US spot bitcoin ETFs and selling GBTC, traders can sell those funds at a premium and buy GBTC at a discount via a process called pairs trading.\n\n“Traders will rely on GBTC less as markets normalize and assets grow in the new nine — especially the biggest ones like iShares and Fidelity,” he said. “GBTC will no longer be necessary once order flow becomes two-sided in the new ETFs.”\n\nOther investors are thinking about capital gains, analysts said, as some face large tax bills if they switch to another ETF.\n\nMost customers who bought GBTC in the past would realize a profit upon selling the shares, thereby initiating the taxable event, Greco explained.\n\nRead more: FTX estate sells majority of GBTC holdings: Reports\n\n“Consequently, even if these customers were to transfer their funds to a more cost-effective ETF, they would do so with a reduced amount of BTC, making the transfer less favorable,” Greco added.\n\nThe capital gains grow smaller as bitcoin’s price keeps dropping, Armour said, making it easier for investors to switch. Bitcoin (BTC) was at roughly $39,800 at 3:30 pm ET on Wednesday — down 6.6% in the last week but up 1.3% over the last 24 hours.\n\n\n\n“A declining bitcoin is extra bad for GBTC,” Armour said.\n\nA Grayscale spokesperson noted in a Wednesday statement that the firm lowered its fee — “as promised” — upon uplisting GBTC to NYSE Arca. Grayscale did not comment on whether it is considering decreasing its fee further.\n\n“I don’t expect them to cut their fee significantly because I think it’s too late to compete on price,” Armour said. “They can probably make more money by charging a high fee and riding out a declining asset base.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy50aGVibG9jay5jby9wb3N0LzI3NDQ3NC9kZXJpYml0LXNlZXMtaW5jcmVhc2UtaW4tYml0Y29pbi1mdXR1cmVzLW9wZW4taW50ZXJlc3QtZGVzcGl0ZS1kZWNsaW5lcy1vbi10aGUtY2hpY2Fnby1tZXJjYW50aWxlLWV4Y2hhbmdl0gGSAWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3NDQ3NC9kZXJpYml0LXNlZXMtaW5jcmVhc2UtaW4tYml0Y29pbi1mdXR1cmVzLW9wZW4taW50ZXJlc3QtZGVzcGl0ZS1kZWNsaW5lcy1vbi10aGUtY2hpY2Fnby1tZXJjYW50aWxlLWV4Y2hhbmdl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Deribit sees increase in bitcoin futures open interest despite declines on the Chicago Mercantile Exchange - The Block",
        "content": "Bitcoin BTC -7.18% futures open interest on the Chicago Mercantile Exchange has declined by more than $1 billion since its peak on Jan. 10, whilst derivatives open interest on Deribit has increased, according to Deribit Chief Commercial Officer Luuk Strijers.\n\n\"The decline in CME futures open interest for bitcoin contrasts with the relative stability observed in Deribit's BTC options or futures open interest. Bitcoin options open interest on Deribit is up 3% in contracts and futures and perpetuals open interest is up around $100 million since Jan. 10,\" Strijers said in an email to The Block.\n\nDifference in CME and Deribit open interest trends\n\nThe Deribit Chief Commercial Officer said the declining trend in open interest on CME could imply several underlying market movements.\n\n\"The decrease in CME futures open interest might suggest that investors, especially those from traditional finance sectors, are adapting their investment strategies. With the introduction of spot ETFs, these investors might find spot ETFs a more straightforward and efficient way to gain exposure to cryptocurrencies,\" Strijers said.\n\nHe added that the ease of trading and lower costs associated with ETFs, compared to futures contracts, could be a compelling reason for this shift in market behavior.\n\nMarket becoming less volatile\n\nTomorrow's end of January expiry date for outstanding options and futures contracts is particularly noteworthy, with around $3.7 billion in bitcoin options notional open interest set to expire and a max pain level at $41,000.\n\n\"As we approach tomorrow's options expiry, it's clear the market is steadily recovering from the initial shocks of the ETF introduction and the GBTC unwind,\" Strijers added.\n\nRELATED INDICES See crypto indices\n\nStrijers said that the Deribit Volatility Index for bitcoin has decreased significantly after witnessing a significant uptick after the launch of multiple spot bitcoin ETFs on Jan. 10.\n\n\"The volatility index has plummeted from over 70 during the start of the GBTC unwind and ETF launch, to now hovering around 45,\" he added. Another key metric that he highlighted was bitcoin annualized futures basis, which he said has seen a significant decline.\n\n\"Before the ETF launch, the annualized futures basis figure was over 20%, but it's now stabilized between 8-10%,\" he added. The basis is a rate between the bitcoin futures price and the BTC spot price.\n\nStrijers added that another factor at play in causing a decline in CME bitcoin futures open interest could be that investors are seeing more value in using options on Deribit as a tool for hedging, speculative purposes, and obtaining exposure in general. He added that the relative stability on Deribit suggests that investors outside of the U.S. are relying on options for their different risk profiles and strategic purposes."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvYmlnLXF1ZXN0aW9ucy1jYW4tYml0Y29pbi1wYXltZW50cy1tYWtlLWEtY29tZWJhY2sv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Big Questions: How can Bitcoin payments stage a comeback? - Cointelegraph",
        "content": "Bitcoin may not be the go-to digital currency for most of the world’s 8.1 billion population today due to scaling limitations, but there’s a hoard of developers out there hoping that one day it will.\n\nWhen Satoshi Nakamoto invented Bitcoin, it was meant to be a peer-to-peer electronic cash system. For a few years, that worked pretty well. But as the network grew larger and more valuable, most hodlers, which now include firms like MicroStrategy and BlackRock, just seem to want to hoard it all away.\n\nBitcoin payment naysayers point to the network’s slow transaction speeds and sky-high fees during periods of demand and note that its overall uptrend and volatility mean holders are more likely to salivate over future gains than spend their BTC.\n\n“The one issue I still have with Bitcoin, it was meant to always be a currency,” Bloomberg ETF analyst Eric Balchunas told X Hall of Flame recently. “This is a real currency, and it went away. The price is volatile, and it is more like a commodity; it’s like gold.”\n\nBut the big question is: How can Bitcoin payments make a comeback?\n\nBitcoin’s golden years for payments\n\nIn the early years, at least, there was an unmistakable movement toward Bitcoin payments. BitPay reported in 2012 that over 1,000 merchants accepted Bitcoin through their service. Just one year later, it had already ballooned to 10,000 BTC-accepting merchants.\n\nFor a time, it seemed as if everyone was jumping on the Bitcoin payments bandwagon. I remember attending an online gambling conference in 2013 where one of the sponsors, a Bitcoin solutions company, moved $1 million worth of BTC to an attendee’s newly created Bitcoin wallet and back again in seconds. The crowd that had gathered around the phone gasped when they saw the enormous sum arrive — and for a negligible fee.\n\nGold has a $14 trillion market cap with zero merchant adoption.\n\n\n\nSo why do people think Bitcoin can only have value if it’s used for coffee payments? — Dan Held (@danheld) September 12, 2023\n\nHowever, the wheels started to fall off around 2017 amid that year’s massive bull run. Bitcoin’s average transaction fee — the payment that incentivizes a Bitcoin miner to process and confirm a transaction — went from about $0.35 in January to nearly $55 in December 2017, according to data from BitInfoCharts.\n\nA Bloomberg report around that time found that Bitcoin merchant acceptance was “low and getting lower,” with a Morgan Stanley analyst explaining that Bitcoin owners were “reluctant to use the cryptocurrency given its rate of appreciation” and that it was “way easier to trade speculatively than convince new merchants to accept the cryptocurrency.”\n\nAttention shifted to an idea first proposed by Joseph Poon and Thaddeus Dryja in their 2015 white paper called The Bitcoin Lightning Network, a Bitcoin layer-2 network focused on scaling for payments.\n\nLightning Network scales to millions of TXs\n\nMany of the traditional arguments against Bitcoin payments were seemingly solved after the Lightning Network was launched in 2018. However, it has developed its own problems.\n\nThe network is a layer-2 solution for Bitcoin built on top of the Bitcoin blockchain to solve the scaling problem with lightning-fast transactions and low fees.\n\nSimilar to setting up a tab at your local bar, each small Bitcoin transaction is accounted for on the layer-2 network. The Bitcoin mainnet and its high fees only come into play when one party decides to “settle the bar tab,” so to speak.\n\n#Bitcoin Lightning payment at Faro Channelside Bar&Restaurant in Helsinki 🇫🇮 ⚡️ pic.twitter.com/L8wHgfu4s8 — Elina Vuorela (@elina_glow) February 19, 2023\n\nTo utilize the Lightning Network, a Bitcoin user must first deposit a certain amount of Bitcoin onto the network — though the process can be simpler through a centralized Lightning Wallet provider. After that, they can transact back and forth with other users as long as there are enough funds. Transactions are practically instant and cost cents, not dollars.\n\nDavid Marcus, CEO and co-founder of Lightspark — an enterprise gateway provider for the Lightning Network — believes that Bitcoin could become the “TCP/IP” for real-time value transport on the internet.\n\n“The opportunity to reinvent how trillions of dollars of value move every day and make it always-on, low-cost, open, and real-time is incredibly exciting.”\n\nAt @Lightspark, we believe #Bitcoin will become the TCP/IP for realtime value transport on the Internet. The opportunity to reinvent how trillions of dollars of value moves every day and make it always-on, low-cost, open, and realtime is incredibly exciting. — David Marcus (@davidmarcus) January 16, 2024\n\nLightning Network has millions of issues\n\nBut while Lightning is great in theory, it is not so great in practice.\n\nSome, including Bitcoin analyst and Ordinals proponent Eric Wall, argue that the complexity of the Lightning Network for ordinary users promotes the use of custodial wallets — particularly in a high-fee environment, which goes against the Bitcoin ethos of self-custody and decentralization.\n\nWell, agree to disagree. I think technically inept bitcoiners like yourselves (blind leading the blind) force-feeding the Bitcoin community a scaling solution that nearly everyone (even maxis on Nostr) chooses to use custodially is the attack on Bitcoin. Jpegs aren’t the problem pic.twitter.com/edf5rdShBK — Eric Wall | OP_😺 (@ercwl) January 6, 2024\n\nWall demonstrated exactly how difficult the Lightning Network could be in an excruciating thread over two days recently, in which Bitcoin evangelist Brad Mills, who’d lost a bet with Wall about ETH’s price, tried and failed numerous times to pay a simple Lightning invoice for $438.\n\nThe Lightning Network also suffers from a lack of merchant adoption and user awareness. Data from 1ML estimates there are currently 59,511 public payment channels and about 14,670 Lightning nodes on the network.\n\nAt present, there’s about $200 million in Bitcoin locked on the network (it hit an ATH of $234 million). In August 2023, prior to a big jump in the price of Bitcoin, just $78.2 million was publicly routed on the Lightning Network, according to financial services firm and Bitcoin tech company River. However, the 6.6 million transactions that month was a 1,212% increase over the same month in August 2021, so it is growing, albeit from a small base.\n\nBut to put the figures into perspective, credit card provider Visa averaged more than $1 trillion in payment volume per month last fiscal year, with over 4.3 billion cards issued worldwide.\n\nAnd although it can theoretically handle millions of transactions per second, the River report suggested it was only doing around 2.5 transactions per second, fewer than Bitcoin’s on-chain average.\n\n“The Lightning Network, despite its promise, faces capital inefficiencies and security concerns. These factors contribute to why, as we predicted, it’s not yet an effective payment layer for Bitcoin,” argues Eli Ben-Sasson, co-founder and president of StarkWare.\n\nPeople with 8+ years in bitcoin world are still struggling with lightning\n\n\n\nIts hillarious that its been nearly 10 years since the state channel started getting traction\n\n\n\nAnd its still useless\n\n\n\nThere are 0 good state channel apps\n\n\n\n0 after 10 years\n\n\n\nZero. https://t.co/McPhZ0u3VV — Juve (@notjuve) January 2, 2024\n\nInstead, Ben-Sasson believes zero-knowledge proofs (or validity proofs, as he likes to call them) are the missing piece of the equation.\n\nZero-knowledge Bitcoin can make payments happen\n\nBen-Sasson is a household name in Ethereum scaling but was a Bitcoiner before ETH even existed. He discussed scaling Bitcoin with ZK tech with former Bitcoin core devs Greg Maxwell and Mike Hearn at the San Jose Bitcoin conference in 2013.\n\nHe believes upgrading Bitcoin to use ZK-proofs could address network congestion and high fees on the Bitcoin blockchain.\n\n“Bitcoin has the potential to become a fantastic payment method, yet there is a big ‘but.’ It simply cannot achieve this unless it embraces the cryptography it needs to scale,” he argues.\n\n“For as long as it continues to resist scaling solutions, it won’t become a viable payment method.”\n\nA newly formed startup, ZeroSync — sponsored by StarkWare — has been developing ZK-proof-powered tools that allow users to validate the state of the Bitcoin network without downloading the blockchain or trusting a third party for verification.\n\nEli Ben-Sasson discusses SNARKs and STARKs at the BIU Cyber Center in 2019. (BIU Crypto)\n\nThere are also emerging Bitcoin L2 networks that have recently released white papers intending to scale Bitcoin using EVM and/or ZK tech. If they work out, it could certainly be a boon for Bitcoin payments.\n\nBut to scale Bitcoin properly with ZK-proofs would likely require a contentious hard fork to enable it to interact with the technology, and that seems unlikely to happen, says Ben-Sasson.\n\n“I’ve been discussing STARK proofs since 2013. We’re showing every day what they can do in terms of scaling Ethereum, and they could also scale Bitcoin for mass use, including as a means of payment. This isn’t happening because of ideological conservatism in the Bitcoin community.”\n\nHuman Rights Foundation chief strategy officer Alex Gladstein tells Magazine he doesn’t see this taking off either, noting that ZK technology is unlikely to gain the support of a critical mass of the Bitcoin community as it “hurts the ability to audit the supply of Bitcoin” and makes transactions larger.\n\nGladstein doesn’t “think base-layer Bitcoin ends up being used for small payments,” but he does expect people to use Bitcoin as a “savings account” and as a settlement layer for businesses, nations and large institutions.\n\n“For retail commerce or smaller payments, I think people make a tradeoff of some kind and use something like federated eCash, custodial Lightning, a neobank,” he adds.\n\nNo one would chose Argentine pesos over dollars as a savings and payments technology\n\n\n\nBut the result of this at the state level is a loss of sovereignty and the boosting of one government at the expense of the rest\n\n\n\nThis is why Bitcoin stands as such a compelling alternative 💡 — Alex Gladstein 🌋 ⚡ (@gladstein) November 20, 2023\n\nSo, if the Lightning Network is yet to take off and Bitcoiners aren’t keen on adding ZK-proofs, what other options are there?\n\nHal “Running Bitcoin” Finney had an idea\n\nEarly Bitcoin pioneer Hal Finney foresaw all of this happening and came up with his own solution. He postulated that “Bitcoin-backed banks” could issue their own digital currencies backed by Bitcoin.\n\n“Bitcoin itself cannot scale to have every single financial transaction in the world be broadcast to everyone and included in the blockchain. There needs to be a secondary level of payment systems which is lighter weight and more efficient,” said Finney on the Bitcointalk forum in December 2010.\n\nRunning bitcoin — halfin (@halfin) January 11, 2009\n\nHe saw Bitcoin becoming a reserve currency for banks, playing the same role as gold did between the mid-1940s and 1971. (Ever wondered WTF happened in 1971?)\n\n“Bitcoin backed banks will solve these problems. They can work like banks did before nationalization of currency,” he added.\n\nPile of gold bullion coins and bars from Canada, Australia, U.S. and Krugerrand and others. (Unsplash)\n\n“I believe this will be the ultimate fate of Bitcoin, to be the ‘high-powered money’ that serves as a reserve currency for banks that issue their own digital cash. Most Bitcoin transactions will occur between banks to settle net transfers.”\n\nBitcoin transactions between private individuals will be rare, added Finney, who sadly passed away in 2014 as a legend in the Bitcoin community.\n\nHowever, if the 10-year delay in approving spot Bitcoin ETFs, last year’s banking collapses and the much-discussed Operation Choke Point 2.0 in the United States are any indication, mainstream banks will face an uphill battle to even think about holding large swathes of Bitcoin.\n\nCaitlin Long’s Custodia Bank, which seeks to be a bridge between crypto and the U.S. dollar payments system, is engaged in a court battle against the Federal Reserve for denying it a Fed master account. Its case is supported by Wyoming’s attorney general, and a decision is expected around March.\n\nDoes anyone want to pay with Bitcoin anyway?\n\nIt’s entirely possible that in developed economies, efficient electronic payment systems have undercut the demand for Bitcoin payments. Two studies from the U.S. Federal Reserve and the Reserve Bank of Australia found that just 2% of adults actually paid for something using cryptocurrency in 2022; a fraction of those used PayPal, QR or even Buy Now, Pay Later services.\n\nBut there are encouraging signs in developing economies. El Salvador, which famously passed the Bitcoin Law, saw a slow start to Bitcoin payments.\n\nBut things are slowly changing. In November, Bitcoin wallet and API platform Blink partnered with Distribuidora Morazán to launch a pilot program that will onboard 1,000 merchants to Bitcoin payments in 2024.\n\nAnd a survey of 1,280 respondents by a researcher at the Central American University in El Salvador found that 12% of the local population used Bitcoin at least once in 2023 to pay for goods and services.\n\nAn eatery in El Salvador with a sign displaying it accepts Bitcoin. (@SalvaNakamoto)\n\nMeanwhile, recent data from BTC Map had recorded a 174% increase in Bitcoin-accepting vendors worldwide by the end of 2023, reaching 6,126 merchants.\n\nFormer Cointelegraph reporter Joe Hall, in a recent X post, noted there are pockets in the world, such as Cuba, where people prefer to deal in Bitcoin — volatility and all — rather than the local currency.\n\nCuba’s inflation rate was around 40%, while another pro-Bitcoin country, Venezuela, was as high as 439% in 2023. Keeping money in Bitcoin is a good alternative to fiat that’s rapidly losing value.\n\nCuban students being educated in the use, custody and movement of Bitcoin. (@Cuba_BTC)\n\nMaxwell Abbey, the public relations director of Wallet of Satoshi, tells Magazine that Bitcoin is more important than just a payment method to people hit by money printing and inflation.\n\n“The important thing is that Bitcoin was birthed, and the human race now has access to something that has never been possible before: base money whose issuance is outside of the control of any individual, group or nation.”\n\n“The irresistible temptation to debase the currency has been designed away and made impossible.”\n\nRise of the stablecoin\n\nThere are big threats to the adoption of Bitcoin payments in the form of stablecoin payments and central bank digital currencies. And poor people often turn to cheaper layer-1 blockchains like Tron. In emerging markets, Tether on Tron makes up 37% of stablecoin transactions.\n\nBut Gladstein sees stablecoins as only a temporary solution. “Ultimately, commerce, I think, will be denominated in BTC,” he argues.\n\nWhatever happens, Bitcoin is here to stay, whether as “digital gold,” the world’s reserve currency, or as the backing for bank-issued currencies. And it’ll be used to pay for things, but to what extent remains an open question."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V1cm9wZWFuLWJpdGNvaW4tZXRmLWZlZS13YXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Low US spot bitcoin ETF fees spark ongoing price decreases in Europe - Blockworks",
        "content": "CoinShares is the latest firm set to slash fees on its European bitcoin product in the weeks after the first spot BTC funds launched in the US.\n\nThe company said Thursday it would reduce the annual fee on its physically backed bitcoin exchange-traded product (ETP) from 0.98% to 0.35%. The change is slated to take place on Feb. 1.\n\n“We are confident that as the market for crypto assets continues to mature and expand, our assets under management will grow significantly,” Frank Spiteri, CoinShares’ head of asset management, told Blockworks in an email. “This growth in assets will, over time, more than offset the short-term impact of reduced fees.”\n\nRead more: Bitcoin ETF Tracker\n\nThe move matched that made by rival WisdomTree last week, when the company chose to reduce the fees on its bitcoin and ethereum ETPs from 0.95% to 0.35%. The firm also cut its fees on six other products, including reductions for its Crypto Market ETP and Crypto Altcoins ETP — from 1.45% to 0.70%.\n\nThe eight WisdomTree ETPs trade on Börse Xetra and the Swiss Stock Exchange known as SIX, as well as Euronext exchanges in Paris and Amsterdam.\n\nThe Securities and Exchange Commission’s landmark approval of funds that hold bitcoin directly has reignited discussions around retail and institutional demand for crypto, according to Alexis Marinof, WisdomTree’s head of Europe.\n\nThose US funds have notched net inflows of $824 million after nine days of trading. When excluding the heavy outflows endured by Grayscale Investments’ Bitcoin Trust ETF (GBTC), the combined net inflows amount to about $5.2 billion.\n\n“The launch of spot bitcoin ETFs in the US has captured a lot of attention in Europe, yet many investors aren’t aware that they’ve been able to access the same spot crypto exposure through physically backed ETPs since 2019,” Marinof said in a statement last week.\n\nLike WisdomTree, fund giant Invesco last week lowered the fee for its Physical Bitcoin ETP — from 0.99% to 0.39%.\n\nGary Buxton, Invesco’s head of Europe ETFs, told the Financial Times the drop came after issuers launching spot bitcoin ETFs in the US “worked to find the new equilibrium between supply and demand.”\n\nNine of those 10 US funds sport fees ranging from 0.19% to 0.39% — with Grayscale’s product being an outlier, at 1.5%.\n\nRead more: Investors are ‘the clear winners’ as bitcoin ETF fee battle comes into focus\n\n“The competitive levels of fees in recent US ETF launches have indeed played a part in our global strategy towards pricing,” Spiteri said. “It’s important to note, however, that our decision to lower fees on our ETPs in Europe was not solely a reaction to these trends.”\n\nWisdomTree and Invesco both offer a US spot bitcoin ETF in addition to their European offerings. CoinShares recently exercised its option to acquire the fund arm of Valkyrie Investments, which also launched a US spot bitcoin fund.\n\nThe WisdomTree Bitcoin Fund (BTCW) and the Invesco Galaxy Bitcoin ETF (BTCO) carry a fee of 0.30% and 0.39%, respectively. The Valkyrie Bitcoin Fund (BRRR) is priced at 0.25%.\n\nFranklin Templeton currently offers the lowest fee for a US spot bitcoin ETF, at 0.19%.\n\nA European bitcoin ETP by 21Shares has a management fee of 0.21% — though that product takes part in collateralized lending to achieve that price point.\n\nUpdated Jan. 25, 2023 at 4:05 pm ET: Added quote from CoinShares’ head of asset management.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9iaXRjb2luLWhhbHZpbmctY291bGQtcHV0LW1pbmVycy1vdXQtb2YtYnVzaW5lc3MtY2FuLW1hcmF0aG9uLXJpb3Qtc3Vydml2ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Halving Could Put Miners Out of Business – Can RIOT, Marathon Weather the Storm? - CCN.com",
        "content": "Key Takeaways\n\nIn April, Bitcoin mining rewards will shrink by 50%.\n\nPost-halving, less efficient mining companies might go out of business.\n\nEven the largest miners like RIOT platforms and Marathon would struggle to survive if a market downturn reduces their revenues further.\n\nIn April, the block rewards generated by Bitcoin miners will be slashed by 50% as part of the cryptocurrency’s 4-year halving cycle. In the short term at least, that means revenues for companies like Marathon Digital and RIOT Platforms will drop off a cliff.\n\nDuring the previous 2 halving events in 2020 and 2016, the consolidation of hash power among larger, more efficient setups essentially wiped out small miners, leaving only industrial operations able to compete. Now, as the next reduction in BTC rewards approaches, even the biggest players may not be able to survive.\n\nIs Bitcoin Mining Profitable?\n\nThe primary concern for firms like Marathon and RIOT is that even before the halving, Bitcoin mining is generally only profitable when the market is up.\n\nTo survive, miners need cheap electricity, and the industry is concentrated in places where it has the support of local governments and energy providers.\n\nBitcoin mining will be profitable above $38k post halving. pic.twitter.com/3bIywsTwQR — Tom Dunleavy (@dunleavy89) January 12, 2024\n\nIn the US, for example, firms have flocked to Texas to take advantage of the state grid’s dynamic pricing and supply model, which increasingly relies on facilities like RIOT’s Rockdale mine to soak up excess electricity during periods of low demand.\n\nYet even with these incentives, 24 years after the company was founded, RIOT is only now on the cusp of breaking even. Meanwhile, Mararthon’s path to profitability has been shorter, but volatile market conditions in the runup to April could still derail its progress.\n\nAmong publicly listed mining companies, many investors have reasoned that there are better-priced opportunities to be found among smaller firms with a value-to-sales ratio.\n\nRIOT “Overvalued” Claims Seeking Alpha\n\nIn a recent analysis, Seeking Alpha observed that “Bitcoin mining companies might not survive a 50% cut in Bitcoin mining revenue.” Given the expected hit to their income from April onward, the report concluded that many miners are currently overvalued.\n\nSpecifically, it pointed to RIOT’s current market capitalization of $2.12 billion, which has already fallen by around $900 million since peaking last year. In the coming months, the report predicted RIOT’s stock market valuation falling even further, highlighting the $1 billion mark as a recommended entry point for investors.\n\nThe Next Core Scientific?\n\nSeeking Altha drew a comparison between RIOT and Core Scientific, which was once one one the biggest publicly traded mining companies, but went bust last year after a dramatic reversal of its fortunes during 2022’s crypto winter.\n\nCore Scientific’s decline serves as an important lesson for miners today. No company is too big to fail in a highly competitive industry, where razor-thin margins can easily be erased by market downturns .\n\nEven Marathon, which by most measures is the world’s largest Bitcoin miner, could still struggle if the price of Bitcoin falls too low to support its operational costs.\n\nMarathon Digital Holdings is gearing up for the #Bitcoin halving by optimizing its mining operations with low-cost renewable energy, diversified mining sites, and a vertically integrated tech stack from the mining pool to the ASIC. pic.twitter.com/EGRzx5QXNY — Marathon Digital Holdings (NASDAQ: MARA) (@MarathonDH) October 20, 2023\n\nIn the run-up to the halving, Marathon has been doubling down on efficiency, scaling its operations and cutting costs. Nonetheless, market analyst Pollock Mondol recently observed that the company’s cost structure remains higher than many of its peers. Should Bitcoin prices dip below $30,000 post-halving, he concluded that Marathon’s profit margins would be wiped out, putting its entire business model in jeopardy."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9qcG1vZ2FuLXNheXMtd29yc3Qtb2YtZ3JheXNjYWxlLXNlbGwtb2Zmcy1tYXktYmUtb3Zlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Grayscale sell-offs cooling down will ease the 'downward pressure' on Bitcoin, JPMorgan says - DLNews",
        "content": "Grayscale endured another day of heavy ETF outflows on Wednesday.\n\nBut JPMorgan analysts say the worst may be over.\n\nGrayscale’s Bitcoin exchange-traded fund experienced another day of outflows on Wednesday, but the worst of the selling is likely over, according to JPMorgan analysts.\n\nInvestors pulled around $425 million from GBTC on Wednesday, slightly less than the $515 million of outflows on Tuesday.\n\nIt was also the lowest daily outflow figure since GBTC converted to a spot Bitcoin ETF earlier in January, following the US Securities and Exchange Commission’s approval of several such funds.\n\nMost of the GBTC profit taking has run its course, JPMorgan analysts said in a report on Thursday.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nBased on this “most of the downward pressure on Bitcoin,” from investors exiting GBTC positions should be over.\n\nBitcoin has fallen over 18% since its January $49,000 high, due in part to the Grayscale outflows as well as a bearish macroeconomic outlook.\n\nAround $1.3 billion has “shifted from GBTC to cheaper newly created spot Bitcoin ETFs, which is equivalent to a monthly outflow pace of around $3 billion per month,” JPMorgan analyst said.\n\nIt likely this pace of outflows continues over the coming months if Grayscale is “too slow in lowering its fees,” the report said.\n\nJoin the community to get our latest stories and updates\n\nBlackRock and Fidelity’s Bitcoin ETFs are the “two emerging competitors,” to Grayscale, according to JPMorgan’s report, mainly due to charging much lower fees — between 130 and 140 basis points lower than Grayscale’s 1.5% management fee.\n\nAdam is a markets correspondent for DL News. Have a tip? Contact him at adam@dlnews.com"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzI0L2JpdGNvaW4tbWluZXItaHV0LTgtaGl0cy1vdXQtYXQtc2hvcnQtc2VsbGluZy1yZXBvcnQv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjQvMDEvMjQvYml0Y29pbi1taW5lci1odXQtOC1oaXRzLW91dC1hdC1zaG9ydC1zZWxsaW5nLXJlcG9ydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Miner Hut 8 Hits Out at Short-Selling Report - CoinDesk",
        "content": "The mining firm's Nasdaq-listed stock fell from $9.17 on Jan.18 to $7 a little over 24 hours later after short-selling firm JCapital Research released a report claiming that Hut 8's merger with fellow miner US Bitcoin was a pump and dump waiting to happen."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vbnltYWcuY29tL2ludGVsbGlnZW5jZXIvMjAyNC8wMS9zYW0tYmFua21hbi1mcmllZC1pcy1zdGlsbC1tZXNzaW5nLXVwLWJpdGNvaW5zLWJpZy1jb21lYmFjay5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Sam Bankman-Fried Is Still Messing Up Bitcoin's Big Comeback - New York Magazine",
        "content": "Photo: Yuki Iwamura/Bloomberg via Getty Images\n\nThis was supposed to be bitcoin’s comeback season. On January 11, the Securities and Exchange Commission approved a new way (for the U.S., at least) to invest in the digital currency, bitcoin exchange-traded funds. BlackRock and Fidelity — collectively managing about $15 trillion — were among the 11 issuers who got the nod from the regulator to build a bitcoin-focused ETF fund, a popular and easy-to-use investment vehicle. These ETFs didn’t change anything about the nature of bitcoin, its extreme volatility, or its lack of any real-world usefulness. But that didn’t matter. This was something like bitcoin’s big IPO — the moment the cryptocurrency really became investible for Wall Street. This had long been the digital-golden dream of the crypto set: the ability to make bitcoin available to everyday investors who knew and trusted ETFs and could now put it in a retirement account. Bitcoin to $1 million? Sure — why not?\n\nSince then, among very high expectations of “number go up,” bitcoin has been doing little else but fall — hard. By Tuesday, it had fallen 20 percent from its recent peak, officially entering a bear market. Some of this could be chalked up to hype, but money has mostly been flowing into these new bitcoin ETFs — more than $10 billion altogether. Flowing into all them, that is, except one: the Grayscale Bitcoin Trust, which has been absolutely hemorrhaging money (and bitcoin) in the days since the ETFs began trading. The Grayscale Trust — a core part of the troubled Digital Currency Group — is one of the world’s largest holders of bitcoin, about as well known and respected as you can get in crypto world (which, to be fair, is grading on a pretty steep curve).\n\nThere are some wonky reasons that could partly explain why so much money is fleeing Grayscale — differences in fees, the vagaries of tax payments — but there’s one very big reason behind the collapse: convicted fraudster Sam Bankman-Fried.\n\nUpdate for the #Bitcoin ETF Cointucky Derby.\n\n\n\n$515 million came out of $GBTC yesterday for a total of $3.96 billion in outflows since converting to an ETF. Newborn 9 saw +$409 million flow in. Net outflows in total for yesterday were -$106 million. pic.twitter.com/gzymMHHua8 — James Seyffart (@JSeyff) January 24, 2024\n\nNo — Bankman-Fried is not trading bitcoin from jail, where he has apparently cornered the canned fish market. According to CoinDesk, what is left of FTX, Bankman-Fried’s crypto exchange, is selling off its assets in order to pay back people who have had their funds frozen on the defunct exchange for the past 14 months. When FTX collapsed in November 2022, that essentially froze about $3 billion worth of crypto that was being held on the exchange — including about $900 million worth of the Grayscale Bitcoin Trust. Since then, FTX’s new management has tapped Galaxy Digital, the hedge fund run by Mike Novogratz — the ex–Goldman Sachs trader with an unfortunate crypto tattoo — to sell off the Grayscale funds to give depositors back at least some of their money. And it makes sense that Galaxy would pick a time of maximum excitement to start selling. Not only do FTX customers need to get paid back, but the bankruptcy lawyers managing the company have racked up hundreds of millions of dollars in fees.\n\nThe ripple effect is not just limited to Bankman-Fried’s own companies, though. FTX was one of the more spectacular blowups of 2021, but it wasn’t the only one — and many of those companies held onto shares of Grayscale. “A lot of people were using it as collateral throughout 2021 — it was the widowmaker trade. It blew up Three Arrows Capital, BlockFi, Celsius,” said James Seyffart, an ETF analyst at Bloomberg. Another victim: Grayscale’s parent company. DCG’s lending arm, Genesis, went under in the wake of FTX’s collapse. That business was funded in large part by customers of the Winklevoss twins’ exchange, Gemini, who are still waiting to get their funds back. “DCG has a bunch of issues with Genesis in bankruptcy,” Seyffart said. It’s unclear how much DCG itself has been selling, he said, but it recently held as much as $1.4 billion in shares of the bitcoin trust.\n\nYou’d think that in crypto, where prices crash and surge as part of the normal course of events, this would all be met with a shrug. Instead, crypto Twitter (the center of crypto universe) is fearing the worst — maybe even expecting Grayscale’s demise. That would be yet another spectacular implosion in the crypto world, on the scale of the failures of FTX and Three Arrows in 2022. As The Wall Street Journal has pointed out, there are actually plenty of good reasons for someone to sell their Grayscale shares now, especially considering that they’re more expensive than those of its competitor funds. Since the SEC approved the ETFs, Grayscale has lost about $500 million a day, almost every day, Seyffart said.\n\nAs the price of bitcoin continues to fall, it’s going to make it only easier for Grayscale investors to sell, but it would have to lose the vast majority of its value before it went into an actual death spiral. With so much money going to Grayscale competitors, it’s hard to believe that would happen any time soon — but then again, runs on crypto companies have happened before."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjUvYml0Y29pbi1ob2xkcy1hYm92ZS00MGstYWhlYWQtb2YtdXMtZ2RwLTUyYi1jcnlwdG8tb3B0aW9ucy1leHBpcnkv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8yNS9iaXRjb2luLWhvbGRzLWFib3ZlLTQway1haGVhZC1vZi11cy1nZHAtNTJiLWNyeXB0by1vcHRpb25zLWV4cGlyeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Holds Above $40K Ahead of U.S. GDP, $5.8B Crypto Options Expiry - CoinDesk",
        "content": "Further adjustments may be seen later today following the release of the U.S. GDP at 13:30 UTC. The data is expected to show the world's largest economy's GDP at a 2% seasonally adjusted annualized pace in the final three months of 2023, retreating from the 4.9% in Q3 and the lowest reading since the second quarter of 2022, according to CNBC."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3QvdGhlLTEyOWItcmVhc29uLXdoeS1iaXRjb2luLXdpbGwtZmFsbC1ldmVuLWxvd2VyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "The $129bn reason why Bitcoin will fall even lower - DLNews",
        "content": "Bitcoin is acting as a forward-looking barometer for traditional market health, notably within the banking system, according to Arthur Hayes.\n\nHayes predicts a market bottom of $30,000 to $35,000 for Bitcoin following the expiry of a little-known lending programme come March.\n\nBitcoin’s decline following the launch of US spot exchange-traded funds is a signal of what’s to come for US financial markets, BitMEX co-founder Arthur Hayes wrote in a blog post on Wednesday.\n\nThe asset is down 6% this week to around the $40,000 mark after clawing back losses from Tuesday’s trading session that saw it reach a low of $38,500.\n\nThat contrasts with fresh all-time highs for the S&P 500 and Nasdaq 100 this week.\n\nReasons behind the move include Grayscale’s nearly $4 billion in outflows as investors seek out lower fees elsewhere, shifting dynamics as the ETF offers new alternatives to bet on the crypto market.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nHayes challenges this narrative.\n\nAccording to him, this view overlooks the net inflow of funds into newly listed spot Bitcoin ETFs, which offsets the GBTC outflows.\n\nOn Tuesday, roughly $515 million was withdrawn from GBTC, adding to the $640 million taken out on Monday.\n\nSince January 12, the total amount withdrawn from GBTC has reached over $3.96 billion, DL News previously reported.\n\nJoin the community to get our latest stories and updates\n\nOn Tuesday, the combined withdrawals from all 10 spot Bitcoin ETFs amounted to $106 million. It’s believed these ETFs have collectively seen net inflows of around $983 million since launch.\n\nA strain on smaller banks?\n\nInstead, Hayes points to the uncertainty surrounding the renewal of the US Bank Term Funding Program as a key factor influencing Bitcoin.\n\nThe BTFP, a central bank initiative, plays a critical role in providing stability and liquidity to financial institutions, particularly during financial turmoil, by offering favourable loan terms for short-term funding.\n\nThe Federal Reserve this week said the funding programme, created in the wake of the collapse of Silicon Valley Bank last year, will end in March.\n\nUntil then, the Fed will also immediately raise the interest rate on new loans from the programme.\n\nHayes speculates that the non-renewal of this programme could place a strain on smaller banks, possibly leading the Fed to lower interest rates or resume quantitative easing.\n\nAs of December 31, the total outstanding amount of all advances under the BTFP was about $129 billion, according to the Fed.\n\nThe total value of the collateral pledged to secure those advances was about $194 billion, which includes credit protection to the reserve banks from the Department of the Treasury.\n\nWhile the Fed doesn’t directly set these bond yields, its policies can influence them.\n\nHigher yields on government bonds can lead to an overall increase in borrowing costs, which can particularly impact smaller banks.\n\nThese banks may find it more expensive to borrow money, affecting their operations and financial health.\n\nThe hope is that if the Fed reduces interest rates, it might help in bringing down these bond yields to a more manageable level, ideally between 2% and 3%, easing the financial pressure on smaller banks, Hayes wrote.\n\nHe further suggests that the traditional market’s record run may be giving a false sense of security to policymakers, adding further justification to end BTFP.\n\nHayes predicts, “Bitcoin is likely to dip before the BTFP renewal decision on March 12, potentially finding a local bottom between $30,000 and $35,000.”\n\nAs for the S&P 500 and Nasdaq 100?\n\nHayes wrote they’re likely to dump come March, with Bitcoin bouncing back following a Fed rate cut and more money being pumped into the economy.\n\nCrypto market movers\n\nBitcoin is down 0.31% in the last 24 hours as of 3pm GMT, trading at $39,953.\n\nEthereum fell 1.13% in the same period, now at $2,208.\n\nAvalanche and Solana are down 2% and up 1.08%, respectively.\n\nWhat we’re reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip? Reach out at tcarreras@dlnews.com\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmcy1idXktMTAway1idGMtNy1kYXlz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "9 spot Bitcoin ETFs buy 100K BTC in 7 days after launch - Cointelegraph",
        "content": "Grayscale’s Bitcoin (BTC) exchange-traded fund (ETF) dumped more than 80,000 BTC in the days after its trading launch, but nine other spot BTC ETFs stacked over 100,000 BTC.\n\nNine spot Bitcoin ETFs, including BlackRock’s iShares Bitcoin Trust (IBIT) and Fidelity’s Wise Origin Bitcoin Fund (FBTC), purchased 102,613 BTC in the first seven days after their trading launches on Jan. 11, according to ETF data tracked by Cointelegraph. The amount is worth around $4.1 billion at the time of writing, according to CoinGecko.\n\nThe amount of Bitcoin purchased by spot Bitcoin ETFs in only seven trading days accounts for 53% of all Bitcoin amassed by the giant BTC investor MicroStrategy over the past three years. According to MicroStrategy’s most recent BTC acquisition report, the firm held an aggregate of 189,150 BTC as of Dec. 26, 2023.\n\nAfter starting to buy Bitcoin in August 2020, MicroStrategy crossed the 100,000 BTC mark in roughly 300 days, announcing it held 105,085 BTC in June 2021.\n\nNine #Bitcoin ETFs have amassed over 100,000 BTC in only 7 days of trading.\n\n\n\nSaylor spent 3 years accumulating about 190,000 BTC.\n\n\n\nDo not underestimate the power of the incumbent financial class.\n\n\n\nThey want you to part with your Bitcoin.\n\n\n\nWE ARE NOT FUCKING SELLING — The ₿itcoin Therapist (@TheBTCTherapist) January 23, 2024\n\nAccording to publicly reported data, BlackRock’s IBIT and Fidelity’s FBTC became the largest Bitcoin buyers among spot BTC ETFs since the trading launch, collecting 37,304 BTC and 29,232 BTC, respectively. The Bitwise Bitcoin ETF (BITB) and the ARK 21Shares Bitcoin ETF (ARKB) come next, with 16,451 BTC and 10,630 BTC, respectively.\n\nUnlike other Bitcoin ETFs, the Grayscale Bitcoin Trust ETF (GBTC) — the largest Bitcoin ETF by BTC holdings — has been actively selling Bitcoin since its trading launch, dumping 82,526 BTC. The amount is worth about $3 billion at the time of writing.\n\nRelated: Guessing game on GBTC bleeding stops helps push Bitcoin below $39K\n\nThe massive GBTC selling has triggered a significant drop in the price of Bitcoin, with the cryptocurrency plummeting nearly 20% from above $48,000 on Jan. 11 to as low as $38,700 on Jan. 23, according to data from CoinGecko. At the time of writing, Bitcoin is trading at $39,926, up 1.8% over the past 24 hours.\n\nBitcoin 30-day price chart. Source: CoinGecko\n\nSome industry observers linked GBTC selling to the estate of the collapsed FTX crypto exchange dumping $902 million in GBTC shares.\n\nMany analysts also suggested that GBTC’s high trading fees triggered the outflows. As previously reported, GBTC charges as much as 1.5% for trading fees without waivers, while other ETF sponsors set fees between 0.2% and 0.4%, also offering temporary waivers.\n\nMagazine: Coinbase fights SEC in court, SBF’s parents seek lawsuit dismissal, and Bitcoin ETFs: Hodler’s Digest, Jan. 14-20"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy90d28tdGhpbmdzLWxpa2VseS10by1kcml2ZS1hLWJpdGNvaW4tcmVjb3Zlcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "These two drivers will fuel Bitcoin's rebound: 'It's happened often before' - DLNews",
        "content": "Bitcoin has recovered slightly after dropping 20% on the back of 10 US spot Bitcoin ETFs launching.\n\nInterest rates and shifting market dynamics will drive a rebound, said analyst Noelle Acheson.\n\nBitcoin rebounded overnight after falling some 20% from its $49,000 high earlier in the month. Two things will drive the cryptocurrency’s recovery, according to analysts.\n\nNoelle Acheson, author of the “Crypto is Macro Now” newsletter and former head of research at Genesis, said on X that the drop experienced over the past two weeks will “likely to be short-term, as ETF-related buying will continue as GBTC exits wane, and as geopolitical tension pushes more savings into a ‘hedge’ asset.”\n\nThe slide in prices showed signs of subsiding overnight.\n\nHaving fallen below the $39,000 mark, Bitcoin is now back trading over $40,000 by 1 pm UK time, up 3% since Tuesday.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\non the BTC drop… I don’t think it’s just GBTC redemptions…\n\n\n\noften, BTC is a better indicator of liquidity sentiment than stocks, in that it is one of THE most sensitive assets to monetary conditions… over the past few days, we’ve seen a steep revaluation of rate cut… pic.twitter.com/qxmWDoL50r — Noelle Acheson (@NoelleInMadrid) January 22, 2024\n\nIn the meantime, “we’re seeing a glimpse of market sanity,” she said as mispriced rates outlooks are being corrected.\n\n“It’s happened often before, and given the tailwinds — ETFs, halving, currency turmoil — the market is likely to recover, especially as dip-buyers step in,” Acheson said.\n\nThe recovery follows the US Securities and Exchange Commission’s approval of 11 spot ETFs earlier this month, bringing Bitcoin exposure to American investors and institutions.\n\nIn the end only 10 of the issuers approved launched spot Bitcoin ETFs, as Hashdex decided not to convert its existing futures ETF into a spot fund.\n\nJoin the community to get our latest stories and updates\n\nThe halving refers to the process in which the network automatically, irreversibly halves the amount of Bitcoin miners can earn from appending blocks of verified transactions to the Bitcoin ledger.\n\nBased on current estimates, the next halving will happen around mid-April.\n\nSell the news\n\nSo why did Bitcoin wobble?\n\nThe arrival of spot ETFs followed “the old Wall Street adage of ‘buy the rumour, sell the news,’” said Chris Kuiper, director of research at Fidelity Digital Assets.\n\nOpen interest, the total number of futures contracts held by market participants, rose towards the end of 2023 in anticipation of ETFs, Kuiper said, and “the speculative fever could also be seen in the spike in perpetual futures funding rates.”\n\nHow long this continues is anyone's guess, but even if we go down from here it still wouldn't mean the long-term bull market trend has been broken. Furthermore, nothing in the core bitcoin investment thesis has been invalidated. — Chris Kuiper, CFA (@ChrisJKuiper) January 23, 2024\n\nThe recent spat of selling and downward trend in prices doesn’t suggest the “long-term bull market trend has been broken,” Kuiper concluded.\n\n“Furthermore, nothing in the core Bitcoin investment thesis has been invalidated,” he added.\n\nFidelity Digital Asset’s research chief had warned that volatility could spike just a week before ETFs were approved and Bitcoin began to drop.\n\nGrayscale’s GBTC has seen near $4 billion in outflows since the fund converted to an ETF, causing a drag on the price of Bitcoin, according to JPMorgan.\n\nInvestors had been locked into GBTC for years, including bankrupt firm’s such as FTX and BlockFi. The conversion to an ETF offered an off-ramp for firms in need of liquidity, and likely explains some of the selling pressure in recent weeks, according to JPMorgan.\n\nGrayscale’s is also feeling the heat from other firms — including Wall Street giants BlackRock and Fidelity — that charge investors a fraction of GBTC’s 1.5% management fee.\n\nBlackRock, the world’s largest asset manager, charges just 0.12%, 138 basis points lower than Grayscale.\n\nHow about interest rates?\n\nWhile the GBTC selloff has been labelled a drag on the price of Bitcoin, another factor was the changing macroeconomic outlook.\n\nIn December, the US Federal Reserve made several dovish signals, which traders took to mean that interest rate cuts were on the horizon. Consequently, the price of Bitcoin went up.\n\nThose hopes are now fading as traders change their outlook on rates. The market prices in a 75% chance of an interest rate cut in March just one month ago, this has since fallen to 50% on the back of hawkish statements from central bankers.\n\nLower interest rates benefit risk assets like Bitcoin as investors take more risk in search of returns.\n\nBitcoin’s 24/7 nature means it can often adjust to changes in outlook and sentiment ahead of other assets. It’s often “a better indicator of liquidity sentiment than stocks, in that it is one of THE most sensitive assets to monetary conditions,” said Noelle Acheson.\n\n“Over the past few days, we’ve seen a steep revaluation of rate cut expectations. Bitcoin is reacting to that, while stocks aren’t,” she said.\n\nEric Johansson is DL News’ News Editor. Adam Morgan McCarthy is a Markets Correspondent at DL News. Tyler Pearson is a Junior Markets Correspondent at DL News. If you’ve got a hot crypto tip, please reach out to us at eric@dlnews.com, adam@dlnews.com and ty@dlnews.com."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Utcy1wbGFucy10by1zZWxsLTEzMG0tb2YtYml0Y29pbi1zZWl6ZWQtaW4tY29ubmVjdGlvbi13aXRoLXNpbGstcm9hZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "U.S. plans to sell $130 million of Bitcoin seized in connection with Silk Road - CryptoSlate",
        "content": "The U.S. government has filed notice to sell $130 million of Bitcoin (BTC) previously seized connection with the Silk Road darknet marketplace.\n\nThe government said that it says that it intends to dispose of (ie. sell) two lots of Bitcoin in any manner that the U.S. Attorney general directs.\n\nThat will likely see the government sell both lots, including 2874.9 BTC valued at $129 million and 58.7 BTC valued at $3.3 million.\n\nThe text of the notice also allows for other individuals (except for defendants) to claim interest in the forfeited property through an ancillary petition within 60 days of Jan. 10. It also allows for petitions for remission or mitigation, which would pardon some or all of the seized Bitcoin from the forfeiture.\n\nBTC belonged to Xanax seller and U.S. agent\n\nThe Bitcoin previously belonged two individuals. The first lot was seized from Ryan Farace, a Maryland man who along with his father was convicted of a money laundering conspiracy involving darknet market sales of Xanax, and from Sean Bridges, a former U.S. Secret Service Special Agent involved in Silk Road investigations who stole Bitcoin that the U.S. government had previously obtained. The second, smaller lot was seized solely from Bridges.\n\nThe two lots were seized on Feb. 10, 2021 in Memphis, Tennessee, and on May 11, 2021, in Arlington, Virginia, respectively. A District Court in Maryland previously condemned and forfeited the Bitcoin to the U.S. government on Jan. 8, 2024.\n\nThose funds make up just a small portion of Silk Road-related seizures that the U.S. government has made to date. In addition to early seizures from Silk Road creator Ross Ulbricht circa 2013, the government seized $3.6 billion of Bitcoin from James Zhong in 2022 as well as $1 billion of Bitcoin circa 2020.\n\nAs of December 2023, the U.S. government held about $9 billion worth of Bitcoin, though this did not exclusively originate from Silk Road seizures."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmV0Zi5jb20vc2VjdGlvbnMvbmV3cy9nYnRjLWJpZ2dlc3Qtc3BvdC1iaXRjb2luLWV0Zi1hcnJpdmVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "GBTC: The Biggest Spot Bitcoin ETF Arrives - etf.com",
        "content": "The U.S. Securities and Exchange Commission approved ETFs that invest directly in bitcoin after the market closed on Jan. 10. And like that, the market wasted no time rolling out eight new products on Jan. 11. At $37.07 per share on Jan. 19, the Grayscale Bitcoin Trust (GBTC) had about $24 billion in assets under management. GBTC trades an average of more than 37 million shares daily and charges a 1.50% management fee.\n\nThe other seven ETFs that hold Bitcoin are:\n\nWhile the ETFs have different expense ratios, GBTC ranks as the most liquid product. Liquidity is critical for investors and traders as it provides the tightest bid-offer spreads and the most correlation to volatile bitcoin prices.\n\nGBTC vs Bitcoin Since Jan. 11\n\nThe day-to-day percentage gains or losses for bitcoin and GBTC from Jan. 12 through Jan. 18 were as follows:\n\nJan. 12: Bitcoin fell 0.1% lower, GBTC fell 0.7%\n\nBitcoin fell 0.1% lower, GBTC fell 0.7% Jan. 16: Bitcoin fell 0.9%, GBTC rose 1.0%\n\nBitcoin fell 0.9%, GBTC rose 1.0% Jan. 17: Bitcoin fell 0.1%, GBTC rose 0.6%\n\nBitcoin fell 0.1%, GBTC rose 0.6% Jan. 18: Bitcoin fell 3.5%, GBTC fell 2.9%\n\nWe should never expect the same daily results from bitcoin compared to GBTC as bitcoin trades around the clock, while ETFs are only available during stock market trading hours. Over the early days of the leading spot bitcoin ETF, GBTC has done an decent job tracking the cryptocurrency.\n\nBullish on Bitcoin\n\nBitcoin remains in a bullish trend despite the recent pullback.\n\nAfter the cryptocurrency's explosive move to its late 2021 high, an implosive plunge followed. Bitcoin found a bottom in November 2022 and has made higher lows and highs throughout 2023 and into early 2024.\n\nWhile the trend remains bullish, the leading cryptocurrency reacted to the SEC’s approval of spot bitcoin ETFs with “buy the rumor and sell the fact” price action.\n\nQualified Spot Bitcoin Approval\n\nSEC Chairman Gary Gensler did not throw his whole-hearted support behind bitcoin when approving the spot ETFs. The Chairman’s comments speak for itself:\n\n“While we approved the listing and trading of certain spot bitcoin [Exchange Traded Product] ETP shares today, we did not approve or endorse bitcoin. Investors should remain cautious about the myriad risks associated with bitcoin and products whose value is tied to crypto.\n\nThough we’re merit neutral, I’d note that the underlying assets in the metals ETPs have consumer and industrial uses, while in contrast, bitcoin is primarily a speculative, volatile asset that’s also used for illicit activity including ransomware, money laundering… sanction evasion and terrorist financing.”\n\nThe approval was far short of any endorsement.\n\nIs GLD a Model?\n\nMany investors and traders believe bitcoin is the new gold, and the highly successful SPDR Gold Trust (GLD) is a model for GBTC and other spot bitcoin products. GLD made gold investing more accessible for a vast swath of the addressable market. Since GLD’s introduction in November 2004, gold prices have made higher lows and highs in a rally that continues in 2024.\n\nMeanwhile, the SEC’s approval comes with an element of validation. The regulation will make more market participants comfortable owning bitcoin-related assets in standard equity accounts.\n\nHeeding Chairman Gensler’s cautionary message is critical. The potential for significant rewards in bitcoin and all cryptocurrencies comes with substantial risks. The explosive and implosive price history is why investors and traders should only invest capital they’re willing to lose.\n\nWhile a compelling case exists for global currencies that governments do not influence, remember that the most powerful aspect of governing is the control of purse strings. Governments and central banks worldwide often control the money supply and will refrain from surrendering it to cryptocurrencies any time soon.\n\nIf the market cap of the cryptocurrency asset class in jumps significantly, expect legislative bodies and leaders to increase regulation and in some cases restrict or even ban the use of cryptos.\n\nWhile the trend is always your best friend and remains bullish, the future remains uncertain, with as many detractors as supporters of this highly volatile asset class."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvaXRzLW9rLXRvLWhhdGUtYml0Y29pbi_SAURodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2l0cy1vay10by1oYXRlLWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "It’s OK to Hate Bitcoin - ETF Trends",
        "content": "Bitcoin has fallen below $40,000 after rising to just under $50,000 before the spot bitcoin ETF launch. Many investors expected this to be the beginning of a price rally that would be extended later this year through the halving event and take us to prices seen in 2021. With excitement far below expected levels, bitcoin continues to be a divisive topic. But here is why it shouldn’t be.\n\nBitcoin is divisive because many don’t understand it.\n\nWhen bitcoin was created in 2009, it was launched in the post-financial crisis era as an alternative to mainstream finance. Combining this asset with a mainstream financial instrument like an ETF has been a challenge. For example, the SEC was reluctant on approval. Then, JP Morgan’s CEO recently released negative comments on the cryptocurrency. Finally, Vanguard refused to let spot bitcoin ETFs trade on their platform.\n\nPossibly one of the biggest barriers is that mainstream financial analysts who are accustomed to analyzing stocks and bonds don’t understand the cryptocurrency. It is more difficult to predict its prices and volumes, but arguably stocks can have and do have all the same risks. While earnings and EBITDA are based on some level of fact, multiples are an art, and stock prices are a best guess. Bitcoin has also been associated with bad actors, but the stock market hasn’t been immune from that issue (e.g., Theranos, Enron, etc.). Still, it has been given a bad reputation when many of the same issues exist for other disruptive technologies.\n\nIts prices are more rational, which also means they are less exciting.\n\nA couple of years ago, we wanted the bitcoin ecosystem to mature and we wanted prices to behave rationally. It was known for its volatility and that’s why it was seen as unfit for many investors. Now that they’re showing some rational behavior, it seems like the hype has died down. And many are no longer interested. After months of anticipation starting with Grayscale’s court win, the ether futures launch, and the SEC X hack, most of the excitement from the spot bitcoin ETF launch was already priced in. I think that explains the lack of price movement. Additionally, investors who had been waiting for prices to recover may have sold their bitcoin holdings on the brief rally near the ETF launch. And lastly, many investors are exiting Grayscale ($4.0 billion of outflows—discussed more below), which has added to that price pressure (another rational event).\n\nDespite bitcoin prices falling, the launch was still significant for both crypto and ETFs.\n\nDespite the lack of price movement, spot bitcoin ETFs were still a milestone in the crypto industry. It helped legitimize it and brought it to the mainstream. It was also a milestone in the ETF industry by setting a precedent similar to the gold ETF launch.\n\nThe iShares Bitcoin Trust (IBIT) saw $1.9 billion in flows, while the Fidelity Wise Origin Bitcoin Fund (FBTC) earned a close $1.6 billion. There is a large gap between these products and the Bitwise Bitcoin ETF (BITB) and the ARK 21Shares Bitcoin ETF (ARKB), which have around $500 million in inflows. A fee war drove fees down to 0.0% before launch. In turn, investors turned to big names that can provide the liquidity needed for institutional investors and the name recognition needed for new retail investors who are hesitant about investing in an emerging asset class. Together, the nine new spot bitcoin ETFs had $5.0 billion in net inflows this month. Meanwhile, Grayscale saw $4.0 billion of net outflows ($2.8 billion in the past week).\n\nIt seems that Grayscale had somewhat of a first-mover advantage with assets and experience. But its fee stands out sorely among its peers with its 1.5% expense ratio. We have to give Grayscale credit. If it were not for Grayscale’s victory in court over the SEC, spot bitcoin ETFs would probably not have been approved yet. Or maybe even ever. While they were a key player in this fight, investors logically may be moving to cheaper products. Many large institutional investors also exited Grayscale including ARK in December. ARK then invested those assets in their own spot bitcoin ETFs and FTX’s estate.\n\nBottom Line:\n\nSpot bitcoin ETFs have played a large role in making crypto a more legitimate asset class. Flows ex-GBTC show that investors are interested in these products. But I expect not everyone will be a fan of Bitcoin. And that’s okay.\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vcHJvdG9zLmNvbS9kb2VzLWdyYXlzY2FsZS1oYXZlLWVub3VnaC1nYnRjLXRvLXNlbGwtYml0Y29pbi1pbnRvLW1hcmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Does Grayscale have enough GBTC to sell bitcoin into March? - Protos",
        "content": "Crypto asset manager Grayscale has come under fire after bitcoin saw a significant decline in the wake of the Securities and Exchange Commission’s (SEC) decision to green-light 11 spot bitcoin ETFs earlier this month.\n\nIt was hoped that the SEC’s decision would see a bitcoin price pump. However, Wall Street’s “buy the rumor, sell the news” adage was once again proved right and instead of pumping, bitcoin has sold off 15% since pre-approval highs.\n\nThe Grayscale Bitcoin Trust (GBTC) was the first scapegoat in sight. Once the world’s largest hoard, it consistently amassed bitcoin for a decade before it turned into a top bitcoin seller overnight.\n\nAccording to venture capitalist Adam Cochran, GBTC could theoretically sell bitcoin for weeks to come. Indeed, using a simple extrapolation of GBTC’s trailing rate of sales, Cochran noted that it could sell every day through mid-March.\n\nAt the current pace of selling, $GBTC still has enough assets to do this for another 60 days straight.\n\n\n\nWe're paying for that spread trade in blood. — Adam Cochran (adamscochran.eth) (@adamscochran) January 22, 2024\n\nHis prediction, of course, assumes that GBTC will sell all of its 536,694 bitcoin. As an ETF that must not only sell but also buy to track the USD price of bitcoin, this is highly unlikely.\n\nCochran also leaves unspoken the obvious truth that Grayscale is a passive, not active, manager of GBTC’s bitcoin. In other words, Grayscale’s traders don’t make discretionary choices about when or how much bitcoin to buy for GBTC. On the contrary, GBTC simply buys and sells sufficient bitcoin to match its promised ratio of 0.00089382 bitcoin per GBTC.\n\nThroughout the day, as investors choose to buy or sell GBTC shares, Grayscale simply makes daily bitcoin purchases and sales to maintain that ratio.\n\nIn other words, other investors are deciding to sell their GBTC shares, as well as their bitcoin at lower USD prices. Altogether, their choices force Grayscale as the passive fund manager to sell enough of GBTC’s bitcoin to maintain the ratio 0.00089382 bitcoin per GBTC.\n\nAll a big misunderstanding\n\nThis simple reality, however, earns few impressions on X (formerly Twitter). Instead of a pragmatic understanding of passive ETF management, claims about Grayscale’s role as a massive bitcoin seller take center-stage.\n\nGrayscale founder Barry Silbert hasn’t done anything to bolster his credibility by deleting a bunch of old tweets. Worse, a New York Attorney General lawsuit in October 2023 claimed that Silbert lied and schemed to defraud stakeholders in defunct crypto interest-earning program Gemini Earn.\n\nBitcoin has slumped from above $49,000 on January 11 to approximately $40,000 at press time. Many investors believed that the ETF approval would precipitate a windfall of retail and institutional purchases. Instead, existing bitcoin investors mostly just reshuffled between investment products.\n\nRead more: Grayscale bought bitcoin for a decade then became its #1 seller overnight\n\nNow that GBTC has been converted into an ETF, it’s required to have its bitcoin holdings track the value of outstanding shares as closely as possible by buying or selling bitcoin on spot markets. Grayscale swaps bitcoin for USD via Coinbase, for example. It’s unlikely to sell 100% of its bitcoin unless shares or bitcoin literally go to $0.\n\nIt’s somewhat irrelevant, therefore, that Grayscale could sell bitcoin at its current rate into mid-March. Far more relevant to investors is that Grayscale is a passive fund manager.\n\nIn all, Grayscale’s bitcoin sell-off was a convenient, albeit illogical scapegoat for angry bulls. In reality, Grayscale is a passive ETF manager and doesn’t make discretionary trading decisions. As such, it’s unlikely to have any causative effect on bitcoin’s USD price. It must simply buy and sell bitcoin to preserve its promised bitcoin/GBTC ratio.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9nb2xkLW91dHBlcmZvcm0tYml0Y29pbi0yMDI0LWJsb29tYmVyZy1hbmFseXN0LXByZWRpY3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Gold will outperform Bitcoin in 2024, Bloomberg analyst predicts - Cointelegraph",
        "content": "Bitcoin is likely to underperform the stock market on a risk-adjusted basis in 2024, while gold may come out ahead, believes Bloomberg senior commodity strategist Mike McGlone.\n\nDespite the bullish narrative around the recent approval of spot Bitcoin exchange-traded funds (ETFs) and the upcoming Bitcoin (BTC) halving, macroeconomic factors may prevent the largest cryptocurrency from reaching new all-time highs in 2024.\n\nIn particular, McGlone believes market expectations that the United States Federal Reserve will cut interest rates, which usually has a boosting effect on risk-on assets like Bitcoin, are largely misplaced.\n\n“The Fed will not ease with the ease it has in the past because of inflation it created with easing too much,” he told Cointelegraph in an exclusive interview.\n\nMcGlone expects the U.S. economy to finally enter a recession this year, which should drive the stock market down. Bitcoin, as a leading indicator for risk assets, Bitcoin is likely to suffer in such an environment.\n\n“When the stock market and beta goes down, Bitcoin goes down more,” McGlone said.\n\nAccording to the analyst, gold and long Treasury bonds will likely be the assets that will come out ahead in this environment.\n\nTo learn more about McGlone’s forecast for 2024, watch the full interview on Cointelegraph’s YouTube channel, and don’t forget to subscribe!"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJpc2tzLTMway1zdXBlcmNoYXJnZWQtaW5mbGF0aW9uLWFydGh1ci1oYXllc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin price risks $30K over 'supercharged' inflation — Arthur Hayes - Cointelegraph",
        "content": "Bitcoin (BTC) has a date with $35,000 or lower at the hands of fresh global macro turmoil, Arthur Hayes says.\n\nIn his latest blog post, “Yellen or Talkin’?” on Jan. 24, the former CEO of crypto exchange BitMEX makes a grim short-term BTC price forecast.\n\nHayes: Bitcoin appreciates 2024 inflation risk\n\nBitcoin may still be 75% up versus a year ago, but it faces a perfect storm of downside volatility catalysts this quarter.\n\nFor Hayes, these come in several guises: the Red Sea conflict between the United States and the Houthis with its impact on global shipping, the U.S. presidential election race and Federal Reserve policy.\n\nThe first of these has clear implications for inflation. Risk assets, including crypto, are looking for a “pivot” by the Fed as soon as March — lowering interest rates and attracting liquidity back to the market.\n\nHigher shipping costs, however, could mean a spike in prices later in the year — something the Fed and Chair Jerome Powell will be keen to mitigate, Hayes explains.\n\n“Due to weather and geopolitics, higher shipping costs could cause a surge in inflation in the third and fourth quarter of this year. As Powell is undoubtedly aware of these issues, he will do everything he can to talk a big game about rate cuts without having to actually cut them,” he writes.\n\n“What might be a mild increase in the rate of inflation due to increased shipping costs could be supercharged by rate cuts and the resumption of QE. The market doesn’t appreciate this fact yet, but Bitcoin does.”\n\nHayes touches on the second piece of the puzzle: the strength of the U.S. regional banking sector.\n\nAs Cointelegraph reported, since the meltdown of March 2023, the U.S. government has offered support in the form of the Bank Term Funding Program (BTFP) — a lifeline that is now due to expire.\n\nHayes thinks that this will come to pass despite the fact that banks’ financial predicaments have not gone anywhere. This and other questions over liquidity, however, depend on Treasury Secretary Janet Yellen’s next moves.\n\n“The only thing that trumps fighting inflation is a financial crisis,” the blog post continues.\n\n“That is why, to get the cuts, QT taper, and the possible resumption of QE the market believes is already in the bag come March, we first need a few banks to fail when the BTFP is not renewed.”\n\nBitcoin should “form support” below $35,000\n\nTurning to Bitcoin, the writing may be on the wall, with turmoil over liquidity and the BTFP, combined with geopolitical risk, meaning that the 20% BTC price dip is the tip of the iceberg.\n\nRelated: All eyes are on $40K Bitcoin price leading into Friday’s $4.5B BTC options expiry\n\n“A 30% correction from the ETF approval high of $48,000 is $33,600,” Hayes predicts.\n\n“Therefore, I believe Bitcoin forms support between $30,0000 to $35,000. That is why I purchased 29 March 2024 $35,000 strike puts.”\n\nHe adds that sub-$35,000 levels now represent an opportunity to buy the dip.\n\nBTC/USD hit $38,500 on Bitstamp on Jan. 23, its lowest since the start of December, before rebounding around $1,700 higher, per data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLWF0LW1ha2Utb3ItYnJlYWstbW9tZW50LTM4NTAwL9IBVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLWF0LW1ha2Utb3ItYnJlYWstbW9tZW50LTM4NTAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price At Make-Or-Break Moment, Key Levels To Watch - NewsBTC",
        "content": "Bitcoin price started an upside correction from the $38,500 support zone. BTC could gain bullish momentum if it clears the $40,500 resistance zone.\n\nBitcoin price is attempting a recovery wave from the $38,500 support zone.\n\nThe price is trading below $40,000 and the 100 hourly Simple moving average.\n\nThere is a major bearish trend line forming with resistance near $40,400 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair might struggle to recover above the $40,400 and $40,500 resistance levels.\n\nBitcoin Price Attempts Recovery\n\nBitcoin price extended its decline below the $40,000 support zone. BTC even spiked below the $49,200 level and tested the $38,500 support zone. A new weekly low was formed near $38,518 and the price started an upside correction.\n\nThere was a recovery wave above the $39,200 and $39,500 levels. However, Bitcoin is now trading below $40,000 and the 100 hourly Simple moving average.\n\nImmediate resistance is near the $40,400 level. There is also a major bearish trend line forming with resistance near $40,400 on the hourly chart of the BTC/USD pair. The trend line is close to the 50% Fib retracement level of the downward wave from the $42,260 swing high to the $38,518 low.\n\nThe next key resistance could be $40,500, above which the price could rise and test $40,850. It is close to the 61.8% Fib retracement level of the downward wave from the $42,260 swing high to the $38,518 low.\n\nSource: BTCUSD on TradingView.com\n\nA clear move above the $40,850 resistance could send the price toward the $41,500 resistance. The next resistance is now forming near the $42,000 level. A close above the $42,000 level could push the price further higher. The next major resistance sits at $42,500.\n\nAnother Drop In BTC?\n\nIf Bitcoin fails to rise above the $40,400 resistance zone, it could start another decline. Immediate support on the downside is near the $39,400 level.\n\nThe next major support is $38,500. If there is a close below $38,500, the price could gain bearish momentum. In the stated case, the price could visit the $37,000 support in the near term.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level.\n\nMajor Support Levels – $39,400, followed by $38,500.\n\nMajor Resistance Levels – $40,400, $40,500, and $40,850.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3doeS1wcmljZXMtZGVjbGluaW5nLWxlZC10by1hc3NldHMtdW5kZXItbWFuYWdlbWVudC1pbmNyZWFzaW5nLWZvci1iaXRjb2luLWV0ZnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Why BlackRock Bitcoin holdings increased as prices dropped - CryptoSlate",
        "content": "The Newborn Nine spot Bitcoin ETFs recently launched in the US have seen their combined assets under management explode to $5.1 billion in the nine trading days since their launch. However, throughout this period, the price of Bitcoin has fallen roughly 20%. The share prices for these ETFs have also fallen in line with Bitcoin. So, how do the ETFs continue to purchase more Bitcoin if the value of their shares is in decline?\n\nCommodity-shares ETFs are designed to represent exposure to the underlying asset. In the case of spot Bitcoin ETFs, the underlying asset is, of course, Bitcoin. When money flows into the funds, it is used to purchase Bitcoin at an equivalent rate. As demand increases, so does the value of the ETF shares. The value of the shares relative to the value of the underlying Bitcoin is called the ‘net asset value’ (NAV), and this is used as a barometer to assess whether the fund is over or undervalued relative to the Bitcoin it holds.\n\nCreation of ETF share baskets.\n\nNew shares in the ETFs are not created out of thin air when an investor decides to buy in. Instead, they are created in baskets by Authorized Participants (APs). BlackRock, for example, currently retains ABN AMRO Clearing, Jane Street Capital, JP Morgan Securities, Macquarie Capital, and Virtu Americas as APs for the iShares Bitcoin Trust.\n\nFor BlackRock, these five companies are the only entities able to create or redeem baskets of shares relative to the ETF. Baskets are groups of 40,000 shares, with each valued at around $906,365 as of press time. Each basket is equivalent to around 22.7 BTC, meaning whenever shares are created for the ETF, at least 22.7 BTC (1 basket) must be bought. When shares are redeemed, at least the same amount is sold for cash to give to APs. Under the current mechanisms, only cash can be used to create share baskets, meaning APs cannot give BlackRock Bitcoin in return for shares.\n\nTo meet liquidity needs, APs will often buy baskets of shares ahead of time to sell to the market. This process happens once per trading day and uses the CF Benchmarks Index rate for Bitcoin (New York variant) to ensure shares are issued relative to the price of Bitcoin. When the trading activity for an ETF is high, it means there’s a high demand for shares, and thus, there needs to be sufficient liquidity to handle the volume. Baskets of shares will be created in line with the volume, and these new shares will be used to report inflows into the ETFs.\n\nFor instance, if 7 million new shares are created, bringing the total outstanding shares to 70 million, and the NAV price for the ETF is $22, the AUM increases by $154 million to $1.54 billion. However, these shares have not necessarily been sold into the open market and in the hands of investors. The newly created shares may still be held by the APs, ready to be used as liquidity for the trading activity ahead.\n\nIf Bitcoin’s price declines, which leads to investors selling shares in the ETF, the assets under management do not necessarily decline at the same rate. While the AUM may reduce in dollar terms if Bitcoin becomes less valuable, the number of BTC held in the fund remains unchanged until the AP redeems shares.\n\nAuthorized Participants proxy investment in Bitcoin\n\nA reduction in ETF share price while its AUM increases due to additional Bitcoin purchases, therefore, could signal that the APs believe the underlying asset is undervalued. APs can hold onto outstanding shares without redeeming them if they believe Bitcoin will be worth more in the future. Each share is priced relative to the AUM when valued in dollar terms. Therefore, by not redeeming the shares if Bitcoin rallies in the future, the AUM will also increase, making each share more valuable.\n\nTherefore, given that both the Newborn Nine and the underlying Bitcoin have declined around 18% since launch. At the same time, the combined assets under management have grown by approximately $550 million per day, and it seems the APs are not redeeming shares.\n\nThe only ETF seeing outflows in terms of redemptions is Grayscale, with its imposing 1.5% fee and majority of investors in profit. All other ETFs, namely the Newborn Nine, are experiencing daily inflows via new share basket creations from APs.\n\nThere is around $1.5 billion in trading volume across the spot Bitcoin ETFs, which requires considerable liquidity to facilitate. Should this liquidity fall off, we may see some redemption activity.\n\nUntil then, the combined value of cash used by US institutions to facilitate share creation for Bitcoin ETFs is over $27 billion. Given that the price has declined while new share baskets have been created, it is reasonable to assume that some of this Bitcoin is essentially owned by APs such as JP Morgan and Jane Street Capital, among others.\n\nNow for the slightly ‘tin foil hat,’ full Bitcoin maxi part of the argument. If JP Morgan as a company were as bearish on Bitcoin as CEO Jamie Dimon, one might expect baskets to be redeemed as long as enough shares exist in the market to handle liquidity. Yet, from current data, it seems no share baskets have been redeemed for the Newborn Nine. Any shares that may currently be unallocated to investors belong to the APs who created the baskets.\n\nBitcoin ETFs highly liquid and actively traded.\n\nFor BlackRock’s iShares Bitcoin ETF (IBIT), 11.9 million shares changed hands on Jan. 24, with 77.2 million shares outstanding. This calculates to around a 15% liquidity rate.\n\nIn comparison, BlackRock’s iShares Core S&P 500 ETF (IVV) has 854 million shares and an average volume of around 5.5 million, indicating a volume of 0.6% of the float. For IBIT, this equated to roughly $270 million in volume, while IVV saw around ten times more at $2.7 billion. Thus, IVV has 10 times the volume, but IBIT has 25 times the liquidity.\n\nThe high liquidity for Bitcoin ETFs indicates strong, albeit potentially more speculative, interest in the financial products. IVV’s lower trading ratio indicates its stable position in the market, with far less speculative trading. However, the Bitcoin ETF may also be less sensitive to large trades, given the deep liquidity available.\n\nBy all accounts, the debut of spot Bitcoin on Wall Street has been an enormous success. The interest from investors is evident through the volume, and the institutional interest and belief can be seen clearly in the strong basket creation across the board.\n\nI’d even hazard to guess that if volumes decline, we will continue to see daily inflows into the Newborn Nine ETFs as long as Grayscale continues its outflows. Given how the Bitcoin price is calculated for ETFs, buying Bitcoin from Grayscale is an excellent method of averaging dollar cost into Bitcoin. This is especially true when, on paper, APs are giving cash to the world’s leading asset managers like BlackRock and Fidelity rather than custodying Bitcoin themselves. Further, there is no public exposure to this method of Bitcoin accumulation, meaning that the reputational risk is low.\n\nUnfortunately, unlike blockchain, TradFi is a closed book. There is no way to know how many outstanding shares are held with APs and how many are in investors’ hands. Future disclosures and reports may give snapshots of the situation, yet we are left mainly in the dark until TradFi adopts a more transparent blockchain-based infrastructure.\n\nIs JP Morgan using BlackRock to buy Bitcoin behind closed doors?\n\nThe answer is maybe. To address whether institutions such as JP Morgan and other APs could be using ETFs like BlackRock’s as a proxy to buy Bitcoin, I’ll end with this line from BlackRock’s prospectus;\n\n” An Authorized Participant is under no obligation to create or redeem Baskets, and an Authorized Participant is under no obligation to offer to the public Shares of any Baskets it does create.“\n\nThis is, of course, the standard language for such a document, but it does make you wonder. This flexibility could be significant. It implies that these institutions have the freedom to manage their involvement in the ETF in a way that aligns with their investment strategies, including how they want to expose themselves to Bitcoin.\n\nSo, if an institution believes that Bitcoin’s value will increase, it might create baskets to get more shares (and hence, more exposure to Bitcoin) without necessarily selling those shares to the public. On the other hand, if they’re less optimistic or want to reduce their exposure, they might choose not to create baskets.\n\nThis kind of strategy could be one way for institutions to indirectly invest in Bitcoin, using the ETF as a tool to manage their investment without directly buying or selling Bitcoin itself.\n\nUPDATE: Clarified iShares Core S&P 500 ticker.\n\nMentioned in this article"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXByaWNlLWRyb3AtY3J5cHRvLWRldXRzY2hlLWJhbmstMTI1MTI5MjQxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Investors expect bitcoin price to drop, Deutsche Bank survey reveals - Yahoo Finance UK",
        "content": "Bitcoin has fallen since the approval of multiple spot Bitcoin ETFs. (Travelstoxphoto via Getty Images)\n\nOver one-third of participants in a Deutsche Bank survey expect the bitcoin price to drop below $20,000. The recent poll also revealed that a majority of respondents expressed concerns about a potential cryptocurrency collapse.\n\n\"We conducted a survey among 2,000 consumers in the US, the UK, and Europe, and despite bitcoin prices hovering above $40,000 for several weeks now, over one-third of our respondents still hold the belief that bitcoin prices will dip below $20,000 by the end of this year,\" said the research analysts who compiled the survey.\n\nThe analysts said that survey participants had a high level of uncertainty when considering bitcoin's long-term prospects. \"39% of participants believe that it will bitcoin will remain in existence in the coming years, while 42% anticipate its disappearance,\" the analysts added.\n\nADVERTISEMENT\n\nRead more: Crypto live prices\n\nAn analysis of the survey results revealed a significant lack of understanding among participants regarding cryptocurrencies in general. \"Two-thirds of consumers possess minimal or no understanding of these digital assets,\" the analysts said.\n\nThe research also found that more than half of the respondents expressed concerns about a major cryptocurrency experiencing a collapse within the next two years. \"This sentiment may be attributable to past events, such as the collapse of FTX in 2022, as well as recent instances of depegging among stablecoins like the collapse of TerraUSD, and the depegging of TrueUSD on January 18,\" added the authors of the Deutsche Bank survey, which was conducted from the 15th to the 19th of January.\n\nBitcoin price volatility increases\n\nBitcoin's price has fallen by over 6% in the past week. The recent price fluctuations of the digital asset have resulted in substantial liquidations of leveraged BTC positions, following the approval of multiple spot ETF filings by the US Securities and Exchange Commission (SEC) on Wednesday, January 10.\n\nStory continues\n\nA spot bitcoin ETF is a financial product that investors hope will open the gateway for mainstream capital to flood the crypto market.\n\nRead more: Bitcoin ETF boom won't mimic previous rallies, says VC founder\n\nIn the past 24 hours, the digital asset has experienced large price swings that caused almost $23m in liquidations of leveraged bitcoin positions on cryptocurrency exchanges, according to Coinglass data. Of these liquidations, the majority, over $12m, consisted of short positions.\n\nAccording to CoinGlass data, the overall crypto market witnessed the liquidation of over $80m in leveraged positions in the past 24 hours. Liquidations tend to occur during volatile price swings, when prices rise or fall sharply. During these market conditions, there is either a rush to buy or sell.\n\nRead more: Bitcoin rally stokes $50k speculation over spot ETF anticipation\n\nFor most of the past week the price of bitcoin (BTC-USD) has traded below the $41,000 mark. The price of the largest digital asset by market capitalisation, as of the time of writing, is $40,167, according to Coingecko data.\n\nAccording to data from Coingecko, the global cryptocurrency market cap today is $1.64tn, a slight 0.7% decrease in the past 24 hours.\n\nThe market cap of bitcoin is at $787bn, with the world's largest digital asset holding a 48.1% dominance over the rest of the cryptocurrency market.\n\nWatch: Turning real assets into tokens on blockchain has $15 trillion market potential | Future Focus\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0MzU5L2JpdHdpc2UtcHVibGlzaGVzLWRpZ2l0YWwtd2FsbGV0LWFkZHJlc3Nlcy13aXRoLWJpdGNvaW4taG9sZGluZ3MtZm9yLXNwb3QtZXRm0gF1aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjc0MzU5L2JpdHdpc2UtcHVibGlzaGVzLWRpZ2l0YWwtd2FsbGV0LWFkZHJlc3Nlcy13aXRoLWJpdGNvaW4taG9sZGluZ3MtZm9yLXNwb3QtZXRm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitwise publishes digital wallet addresses with bitcoin holdings for spot ETF - The Block",
        "content": "Crypto-focused fund manager Bitwise said Wednesday that it became the first U.S. bitcoin ETF to publish the digital wallet addresses of its holdings.\n\nBitwise noted that the decision to publish the information stemmed from a priority of on-chain transparency.\n\n\"Now anyone can verify BITB's holdings and flows directly on the blockchain,\" the firm wrote in a Wednesday social media thread.\n\n\"Publishing on-chain addresses is a first step toward increasing public transparency,\" it continued. \"As infrastructure evolves, we hope to do more, such as working with firms like Hoseki to provide real-time cryptographic attestations.\"\n\nBitwise's spot bitcoin ETF\n\nRELATED INDICES See crypto indices\n\nAfter the Securities and Exchange Commission approved the spot bitcoin ETF applications of Bitwise and 10 others, Bitwise saw $238 million in inflows on its first day of trading, The Block previously reported.\n\nBitwise maintains 3.1% of spot bitcoin ETF marketshare and saw $49.8 million in daily volume on of Jan. 23, The Block's Data Dashboard shows."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYnVsbC12cy1iZWFyLXNob3VsZC15b3UtaW52ZXN0LXNwb3QtYml0Y29pbi1ldGZzL9IBXmh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYnVsbC12cy1iZWFyLXNob3VsZC15b3UtaW52ZXN0LXNwb3QtYml0Y29pbi1ldGZzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bull vs. Bear: Should You Invest in Spot Bitcoin ETFs? - ETF Trends",
        "content": "Bull vs. Bear is a weekly feature where the VettaFi writers’ room takes opposite sides to debate controversial stocks, strategies, or market ideas — with plenty of discussion of ETF ideas to play either angle. For this edition of Bull vs. Bear, Elle Caruso and Karrie Gordon debate the hottest topic in 2024 investing thus far: spot bitcoin ETFs.\n\nElle Caruso, staff writer, VettaFi: Hey, Karrie! I’m looking forward to discussing the investment case for spot bitcoin ETFs. Investors had been long awaiting the approval of these funds, which have the potential to be genuinely transformative for the ETF and broader investing industries.\n\nThe iShares Bitcoin Trust (IBIT), the Fidelity Wise Origin Bitcoin Fund (FBTC), the Bitwise Bitcoin ETF Trust (BITB), the ProShares Bitcoin Strategy ETF (BITO), and the Invesco Galaxy Bitcoin ETF (BTCO) have taken in a combined $3.1 billion year to date as investors flock to the space.\n\nIn a recent conversation with VettaFi, Invesco’s Kathy Kriskey said the ideal allocation to crypto is just 1% of the overall portfolio. This is such a small amount in a well-diversified portfolio that it’s hard to see any downside. The crypto exposure sits alongside other alternative investments and helps provide a diversified source of returns and significant growth potential.\n\nThe alternatives bucket in a portfolio, according to Kriskey, ideally holds commodities and crypto. Maybe a small amount of real estate, too, if you’re into that. Commodities will comprise the largest portion of this group, with investors ideally allocating 5-8% of their assets. Any more than 5-8% in commodities and 1% in crypto is unnecessarily risky.\n\nSpot bitcoin ETFs make it easy to get this exposure. Looking at it from a high level, I don’t see what’s not to like about these funds.\n\n‘That’s Likely All We Get for Awhile’\n\nKarrie Gordon, staff writer, VettaFi: I won’t lie; I’ve been enjoying watching the celebrations around the launch of the spot bitcoin ETFs. While it’s easy to get caught up in the hype, I think it’s important to mind the big picture. We need to step back and recognize the extremely significant hurdles digital assets still face.\n\nBlockchain technology, which powers cryptocurrencies like bitcoin, carries enormous potential to revolutionize segments of our increasingly digital world. However, it is also a nascent technology and, despite the hype and promise, may never gain broad adoption. You need to look no further than the disappointment of augmented reality to see one potential path for blockchain uptake.\n\nUnless you’ve intentionally avoided all crypto-related new in the last five years, you’ve likely seen the naysayers and fear-mongering around crypto and blockchain. For a not-insignificant percentage of the population, cryptocurrencies and blockchain technology have become synonymous with bad actors and criminal activity.\n\nWithout serious regulatory guardrails and oversight — something I might add that is antithetical to the entire premise of decentralization — digital assets are likely to remain a niche asset class. In the U.S., I wouldn’t hold your breath for any regulatory framework anytime soon. Our own Todd Rosenbluth, head of research here at VettaFi, agrees.\n\n“That’s likely all we get for a while,” he said, speaking of the recent approval of spot bitcoin ETFs in the New York Times. “The government remains uncertain about cryptocurrency in general.”\n\nIt makes for a muddied and muted outlook for the potential of bitcoin to remain anything other than speculative for investors.\n\nWithout Spot Bitcoin ETFs, Investors Will Invest in Physical Bitcoin\n\nCaruso: You bring up great points, Karrie. However, I think investors who want exposure to bitcoin will find it one way or another. With the recent SEC approval of spot bitcoin ETFs, investors can now compare the different products on the market and make prudent, smarter choices. The various spot bitcoin ETFs have different liquidity profiles and tracking errors, but they all provide safer access to bitcoin via a highly liquid, regulated product. This is something that should give investors and the larger community comfort.\n\nThis is also advantageous for financial advisors. Previously, advisors may not have had access to the funds that their clients were allocating to crypto. Clients wanted crypto exposure, and ultimately, advisors were losing clients due to their inability to deliver that desired exposure.\n\nHowever, spot bitcoin ETFs allow advisors to expose clients to bitcoin in a wrapper that advisors are comfortable with. The products enable direct ownership of bitcoin. But, as I mentioned above, they also offer the benefits associated with the ETF structure.\n\nIt’s Risk All the Way Down\n\nGordon: The SEC maintains its obstructive stance toward crypto in the U.S. in its ongoing refusal to create regulations for this new asset class. So where does that leave blockchain and bitcoin? A purely speculative venture based on a technology that has yet to prove its real-world mettle and worth. And as we all know, speculative investments carry inherently elevated risks.\n\nBitcoin prices reached all-time highs on November 9, 2021, peaking at $67,617. Prices were buoyed by the enthusiasm and optimism of approving the first bitcoin futures ETFs. One year later, prices had plummeted to $15,742 as of November 10, 2022.\n\nFast-forward to now. Bitcoin ETFs launched on January 11, with bitcoin prices spiking at $49,000. As of Tuesday morning, January 23, bitcoin traded at $38,711. All the investors who piled into spot bitcoin ETFs have lost 21% in less than two weeks.\n\nWhat’s more, there is genuine concern that because bitcoin is speculative (not directly linked to any real-world assets), an influx of investors into the space will only exacerbate the already significant volatility.\n\nIs Volatility in Spot Bitcoin ETFs Overplayed?\n\nCaruso: It’s true that bitcoin prices can be highly volatile. However, during the one-year period trailing January 11, there were 202 ETFs that had higher one-year volatility than bitcoin, according to Dave LaValle, Grayscale’s global head of ETFs.\n\nThere’s volatility in crypto, and the ETF wrapper won’t mitigate that volatility; however, it may be overplayed or misunderstood. This makes it imperative for investors to know what they own.\n\nI mentioned tracking error earlier, and I think that’s important to drill down on. Many investors are focused on the fees. However, a few basis points difference in fees has a smaller impact than a substantial difference in tracking error.\n\nIn the first week that the new spot bitcoin ETFs were trading, Fidelity and Invesco’s funds (FBTC and BTCO, respectively) were leagues ahead of the rest regarding minimizing tracking error. Although the data is still fresh, this is worth considering for investors looking to add exposure to the space.\n\nBitcoin Exacerbates the Climate Crisis\n\nGordon: It’s true that many bitcoin ETFs are tracking with minimal errors, which is extremely important for such a volatile asset class. I need to step past the trading mechanisms and look at bitcoin itself, however, for my last point. More accurately, I need to talk about how bitcoins are created.\n\nBitcoin mining has been in the public eye for a few years now for the intense energy drain that mining bitcoins requires. New bitcoins are minted using a proof-of-work model, which requires computers and massive server banks. The Digiconomist estimates that bitcoin uses 137.68 TWh of electricity annually, more than Colombia and Portugal’s 2022 energy use combined.\n\nImage source: Digiconomist\n\nThe vast majority of miners still rely on fossil fuels for energy sources. While increased awareness and efforts are needed to transition bitcoin miners to green energies, progress remains slow. What’s more, the bitcoin blockchain is consuming exponentially more water each year. The blockchain consumed 591.2 gigaliters (GL) in 2020, 1,576.7 GL in 2021, and estimates for 2023 are around 2,237 GL, according to recent research published in Cell Reports Sustainability. In a world of increasing water scarcity and climate crisis, the bitcoin token creation model only serves to tip the scales in the wrong direction.\n\nFor investors with an eye for climate, alternative assets, and opportunity, carbon offsets are an asset class to consider. Carbon credit markets offer similar nascence as crypto. For investors comfortable with a riskier volatility profile akin to that of bitcoin and cryptocurrencies, carbon credits are worth a look. Investors can gain exposure through funds like the Carbon Credits Strategy ETF (NTRL) and the KraneShares Global Carbon Offset Strategy ETF (KSET).\n\nIn a year rife with risk, investing in spot bitcoin ETFs seems counterintuitive to the security most investors seek. For those investors seeking more protections but alternatives to stocks and bonds, the regulated carbon cap-and-trade markets are an asset class to consider. Funds include the KraneShares Global Carbon Strategy ETF (KRBN) and the Carbon Strategy ETF (KARB).\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0MjU3L2NvaW5iYXNlLWluc3RpdHV0aW9uYWwtZXhlY3Mtc2F5LWNyeXB0by1jYW4tZ28tbWFpbnN0cmVhbS13aXRoLXNwb3QtYml0Y29pbi1ldGZzLW5vdy1saXZl0gGBAWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3NDI1Ny9jb2luYmFzZS1pbnN0aXR1dGlvbmFsLWV4ZWNzLXNheS1jcnlwdG8tY2FuLWdvLW1haW5zdHJlYW0td2l0aC1zcG90LWJpdGNvaW4tZXRmcy1ub3ctbGl2ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Coinbase Institutional execs say 'crypto can go mainstream' with spot bitcoin ETFs now live - The Block",
        "content": "The arrival of spot bitcoin ETFs in the U.S. has opened the door for crypto to reach a wider audience, according to two Coinbase Institutional executives.\n\n\"I think the most interesting bit that's getting a little bit drowned out by some desire to have headlines is it's the first time crypto can go mainstream,\" Head of Coinbase Institutional Brett Tejpaul told The Block in an interview, alongside Coinbase Head of Institutional Product Greg Tusar.\n\n\"And in all the years that Greg and I have been here trying to build the institutional business, this is like the very moment we've been waiting for. So, for us, it's the next chapter of this asset class,\" Tejpaul added.\n\nBringing in traditional asset managers\n\nEarlier this month, 11 spot bitcoin ETFs were approved and have since seen $20 billion in trading volume. Eight products are using Coinbase as a custodian, while traditional finance companies like JPMorgan, Jane Street, Cantor Fitzgerald and Macquarie Capital have been named as authorized participants.\n\n\"What's awesome about it is if you look at the quality of the names, both on the crypto first side, ranging through to more traditional names, you have this mix of asset managers, all of whom are saying they all have, quite significant client demand,\" said Tejpaul.\n\nTejpaul noted that the ETF approvals have reawakened interest in discussions, and everyone's asking the same question: \"Are the other guys thinking about deploying more capital?\"\n\nRELATED INDICES See crypto indices\n\nFocusing on a smooth launch\n\nExcluding Grayscale, the ETFs have grown to $4.4 billion in assets under management after seven days of trading. Including Grayscale, the products combined have seen a net outflow of $87 million. While this has come below some expectations, the Coinbase executives said the focus among all issuers was on ensuring a smooth launch above all else.\n\nTusar said Coinbase had spent a lot of time preparing for one set of operational procedures around an in-kind model, which then had to be pivoted toward the cash creation and redemption model — something the SEC requested in the final weeks, The Block previously reported. \"Despite all of that, I feel like, operationally, this all came off on the first day without a hitch,\" said Tusar.\n\nTejpaul concurred. “You can't underestimate the amount of effort and time that both Coinbase and all the clients were putting into the days and weeks leading up to the launch to make sure that everything went smoothly on both sides, to actually not just Coinbase ourselves, but also everyone working in concert with one another, including, market makers, service providers, etc,\" he said.\n\n\"I think everyone was wanting to de-risk the launch and make sure things were smooth, and then begin to progressively scale from there,\" he said.\n\nTusar added that he expects these products to gather a lot of assets but that it won’t happen overnight. Instead it might take months and even years."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy80LWNyeXB0b2N1cnJlbmN5LXN0b2Nrcy13YXRjaC1hbWlkLTEzNDMwMDA0OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "4 Cryptocurrency Stocks to Watch Amid a Dip in Bitcoin Price - Yahoo Finance",
        "content": "The cryptocurrency rally of 2023, which extended into this year, has somewhat come to a halt. Bitcoin (BTC) particularly has taken a hit over the past two weeks, or since Jan 10, when the U.S. Securities and Exchange Commission (SEC) gave the green light to 11 spot Bitcoin exchange-traded funds (ETFs).\n\nThe approval was anticipated and the decision added further fuel to the Bitcoin rally that saw it surpass the $49,000 mark. However, the price has been on a decline since then. The market fell more than 18% over the weekend and on Jan 24, Bitcoin hovered around $40,000, a new year-to-date low.\n\nThe SEC’s approval adds a new dimension to Bitcoin trading now. It is expected to boost the overall cryptocurrency market as it will now allow retail investors to trade Bitcoin without actually owning it. However, the rally has stalled.\n\nUnderstandably, Bitcoin has entered correction territory after the ETF approval. Experts see immense potential in Bitcoin, and the launch of an ETF is expected to contribute to the long-term growth of the market.\n\nPart of the recent selling pressure on Bitcoin has been linked to sales from the FTX bankruptcy estate. The estate has reportedly sold approximately 22 million shares of Grayscale's GBTC in the past few weeks, contributing to the downward pressure on the cryptocurrency, according to a CoinDesk report.\n\nAlso, several experts believe the fluctuations in Bitcoin's price to selling by Bitcoin holders, specifically short-term traders and large holders, who decided to cash in on profits following the surge in prices last year. They believe that the approval of the ETF might be seen as a \"sell-the-news\" event.\n\nNevertheless, the current correction phase is viewed as temporary, and the recent approval of 11 spot Bitcoin ETFs earlier this month is expected to have a positive impact on the overall cryptocurrency market.\n\nStocks in Focus\n\nNVIDIA Corporation NVDA is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence, and the mining or production of cryptocurrencies.\n\nStory continues\n\nNVIDIA’s expected earnings growth rate for the current year is 268.6%. The Zacks Consensus Estimate for current-year earnings has improved 2% over the last 60 days. Currently, NVIDIA has a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nCoinbase Global’s expected earnings growth rate for the current year is 92.5%. The Zacks Consensus Estimate for current-year earnings has improved 9.2% over the last 60 days. Coinbase currently has a Zacks Rank #2.\n\nBlackRock, Inc. BLK is one of the world’s largest investment managers and is publicly owned. BLK was one of the first companies from the traditional market to join the Bitcoin ETF race back in June 2023.\n\nBlackRock’s expected earnings growth rate for the current year is 4.3%. The Zacks Consensus Estimate for current-year earnings has improved 4.3% over the last 60 days. BlackRock presently carries a Zacks Rank #3 (Hold).\n\nRobinhood Markets, Inc. HOOD operates a financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds, options, gold, and cryptocurrencies. HOOD buys and sells Bitcoin, Ethereum, Dogecoin, and other cryptocurrencies using its Robinhood Crypto platform.\n\nRobinhood Markets expected earnings growth rate for the current year is 45.3%.The Zacks Consensus Estimate for current-year earnings has improved 1.5% over the last 60 days. Robinhood Markets currently has a Zacks Rank #3.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nRobinhood Markets, Inc. (HOOD) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2luc2lnaHRzL2JpdGNvaW4tZXRmcy1zZWUtbWlub3ItbmV0LW91dGZsb3dzLW9mLTEwMC1taWxsaW9uLWFzLWJsYWNrcm9jay1hY3F1aXJlcy00MDgwLW1vcmUtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs see minor net outflows of $100 million as BlackRock acquires 4080 more Bitcoin - CryptoSlate",
        "content": "Bitcoin ETFs in the U.S. saw inflows of around $409 million yesterday as BlackRock recorded a purchase of roughly $160 million Bitcoin by adding a further 4,080 coins to its balance.\n\nData shared by Bloomberg analyst James Seyffart last night, Jan. 23, revealed $515 million in outflows for Grayscale with $249 million inflow from the other Newborn Nine ETFs. Given the now-released BlackRock data, this confirms that Jan. 23 was a net outflow day for Bitcoin ETFs of around $100 million.\n\nCryptoSlate data below shows the inflows for BlackRock since inception, with 4,080 BTC added on Jan. 23. This brings its total assets under management to around $1.72 billion."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tbWluaW5nLWFybS1ib2xzdGVycy1pbnN0aXR1dGlvbmFsLW9mZmVyaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Swan Bitcoin purchasing miners to bolster institutional offering - Blockworks",
        "content": "Swan, a bitcoin-focused financial services company, announced Thursday that it has been building out a bitcoin mining arm since the summer of 2023. Swan also said it is eyeing a Series C, and is hoping to become publicly traded within the next year.\n\nSwan Mining will run under Swan Institutional, a recently-announced division that also plans to offer bitcoin-backed lending, advisor services, asset management, private equity and a bitcoin trust company.\n\nThe announcement comes at a turbulent moment for bitcoin mining companies. Mining stocks broadly surged in anticipation of spot bitcoin ETF approval but have fallen since. Valkyrie’s Bitcoin Miners ETF is down nearly 33% in 2024. Core Scientific recently managed to emerge from the bankruptcy it entered in December 2022 but saw its price plummet after being re-listed on the Nasdaq.\n\nAmong the major tailwinds for miners is the upcoming bitcoin halving, when rewards earned for mining will be cut in half.\n\nRead more: JPMorgan predicts bitcoin mining stock cooldown: CoinDesk\n\nSwan said in late 2023 it was generating $125 million in annualized revenue. CEO Cory Klippsten told Blockworks in an interview that at that time — as well as now — mining was Swan’s biggest source of top-line revenue.\n\nKlippsten said the firm’s goal is to have half of its mining rigs in the US and half abroad, but declined to disclose where most of its rigs are currently.\n\nIn a press release, Swan said that its miners were capable of producing 4.5 exahashes per second (EH/s). It hopes to raise that figure to eight EH/s by March.\n\nFor context, mining giant Marathon Digital said its hash rate reached 23.1 EH/s in November. Swan is more on par with Australian mining firm Iris Energy, which currently boasts six EH/s. At time of publication, the global bitcoin hashrate is roughly 532 EH/s, according to the hashrate tracker on CoinWarz. By the numbers, Swan contributes a little under 1% of all bitcoin mining power.\n\nSwan is looking to raise a Series C. Klippsten said the target amount for the raise is in flux, though he cited the company’s previous mention of $150 million.\n\nKlippsten said Swan’s bitcoin lending service should launch in February. The firm also plans to go public in the next year following a “ton of work with auditors and lawyers and bankers.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvdXMtZ292ZXJubWVudC10by1zZWxsLTEzMG0td29ydGgtb2YtYml0Y29pbi1mcm9tLXNpbGstcm9hZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "US Government to Sell $130M Worth of Bitcoin From Silk Road - Watcher Guru",
        "content": "According to a new filing, the US government is set to sell $130 million worth of Bitcoin (BTC) that was seized from the Silk Road. Indeed, the notice was issued from the United States District Court for the District of Maryland and relays its intention with the seized assets\n\nThe notice for the impending sale of the assets follows a court-approved forfeiture of 69,000 BTC in the Silk Road case. The initial judgment was made in August of last year but was finally cleared to take effect in December according to a subsequent court filing.\n\nJUST IN: 🇺🇸 US Government files notice to sell $130 million worth of #Bitcoin seized from Silk Road. January 25, 2024\n\nAlso Read: US Government Finalizes Forfeiture of 69,370 Silk Road Bitcoin\n\nUS Government to Sell $130M in Seized Siik Road BTC\n\nFor those within the digital asset market, the Silk Road has been well-established as one of the industry’s biggest crimes. A digital black market, the Silk Road marketplace was used for money laundering and illegal drug trades using Bitcoin. Subsequently, the United States has updated its intentions with the assets that were seized from its 2013 closure.\n\nThe most recent update has come in a new filing made by authorities. Specifically, the US government has filed a notice to sell $130 million worth of Bitcoin that was seized from the Silk Road case. Therefore, leading to more resolution to the outcome of the massive 144,000 Bitcoins that were seized from the platform.\n\nAlso Read: US Government to Sell 41,500 Bitcoin ($1.18 Billion) Connected to Silk Road\n\nBefore today’s notice, the most recent update had come at the tail end of 2023. Then, the government officially confiscated 69,370 BTC from the shutdown marketplace. Those assets were transferred to federal control and also included Bitcoin SV (BSV) and Bitcoin Cash (BCH)/.\n\nAt the time of the 2020 seizure, the collection of assets was valued at more than $1 billion. The website has been closed since 2013. Moreover, court proceedings would precede the eventual destination of the seized funds."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcmstaW52ZXN0LWNlby1jYXRoaWUtd29vZC0xMzQxMTU4OTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Ark Invest CEO Cathie Wood Calls Bitcoin \"1 of the Most Important Investments of Our Lifetime\" in Recent Interview ... - Yahoo Finance",
        "content": "Ark Invest CEO Cathie Wood doubled down on her views about the importance of Bitcoin (CRYPTO: BTC) this week. In a video interview with CNBC on Tuesday, she discussed the introduction of 11 exchange-traded funds (ETFs) based on Bitcoin's real-time spot price. The new funds have lost some value in the early going, but she said she expected as much.\n\nWood's words on Bitcoin\n\n\"This hasn't disturbed our point of view at all,\" Wood told CNBC. \"We think this is one of the most important investments of our lifetimes. This is a global, rules-based monetary system. It's a very big idea, and we think it's the biggest of all the crypto ideas out there.\"\n\nCathie Wood's Bitcoin engagement isn't new. She has been pounding the table about the largest and oldest cryptocurrency for years, suggesting lofty price targets such as $1.48 million per coin by the year 2030. Ark Invest's funds don't hold Bitcoin directly, relying on indirect investments such as mutual funds and crypto-oriented stocks instead.\n\nWood's diversified growth-stock funds have not rushed to invest in the new Bitcoin ETFs, but her team manages one of the 11 new names. The Ark 21Shares Bitcoin ETF (NYSEMKT: ARKB) is one of the larger funds early on, with $481 million of Bitcoin assets under management so far.\n\nWhat's the big deal with Bitcoin ETFs?\n\nThe establishment of these ETFs is a significant milestone in the integration of cryptocurrencies into the traditional financial system. Spot-price ETFs add a layer of regulatory and fund-management safety to the cryptocurrency, giving many individual and institutional investors a more comfortable on-ramp to the crypto sector.\n\nWood's commitment to Bitcoin through the Ark 21Shares Bitcoin ETF indicates a firm belief in its future value, and she restated her long-term expectations of a million-dollar Bitcoin future. In other recent updates, she pointed out potential catalysts such as the upcoming halving of Bitcoin mining rewards and favorable trading patterns in recent months. It remains to be seen how quickly Bitcoin can reach Wood's soaring price targets, but the potential for continued growth in the digital economy is quite inspiring.\n\nStory continues\n\nShould you invest $1,000 in Ark 21Shares Bitcoin ETF right now?\n\nBefore you buy stock in Ark 21Shares Bitcoin ETF, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Ark 21Shares Bitcoin ETF wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 22, 2024\n\nAnders Bylund has positions in Bitcoin. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a disclosure policy.\n\nArk Invest CEO Cathie Wood Calls Bitcoin \"1 of the Most Important Investments of Our Lifetime\" in Recent Interview. Time to Buy? was originally published by The Motley Fool"
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmtpdGNvLmNvbS9uZXdzL2FydGljbGUvMjAyNC0wMS0yNC93aHktYml0Y29pbi1kb3duLTIwLWdidGMtc2FsZXMtbXQtZ294LWZlYXJzLWFuZC1mdHjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin is down 20%: GBTC sales, Mt. Gox fears, and FTX - KITCO",
        "content": "Bitcoin (BTC) bulls are looking to reclaim some lost ground on Wednesday after the top crypto hit a low of $38,500 on Tuesday, which represents a 21.5% fall from its recent high of $49,100 set on Jan. 11, the day spot BTC exchange-traded funds (ETFs) launched on U.S. markets.\n\nData provided by TradingView shows that bulls have managed to push BTC price back to support/resistance at $40,000, and are now locked in a battle with bears for control of the price action.\n\nBTC/USD Chart by TradingView\n\nThe early gains on Wednesday resulted in February Bitcoin futures prices trading “firmer on a corrective bounce after hitting a seven-week low Tuesday,” according to Kitco senior technical analyst Jim Wyckoff, who said that “bears have the slight overall near-term technical advantage.”\n\nMultiple factors are aiding bears in their efforts to push Bitcoin’s price lower, with the most significant being sales by Grayscale, which has been liquidating large amounts of BTC since the ETFs launched as traders book profits or rotate into an ETF with a lower fee structure.\n\nGrayscale’s GBTC ETF currently charges a fee of 1.5% while the other asset managers charge fees of 0.2-0.3%. This has led many GBTC holders to request redemptions, forcing Grayscale to sell BTC on the open market to recoup the funds to send to clients. Many of these investors have reinvested other spot BTC ETF options, while others have kept the cash.\n\nAccording to Bloomberg Intelligence ETF analyst James Seyffart, at the end of trading on Tuesday, GBTC had seen a total of $3.96 billion in outflows since being converted to an ETF.\n\nUpdate for the #Bitcoin ETF Cointucky Derby.\n\n\n\n$515 million came out of $GBTC yesterday for a total of $3.96 billion in outflows since converting to an ETF. Newborn 9 saw +$409 million flow in. Net outflows in total for yesterday were -$106 million. pic.twitter.com/gzymMHHua8 — James Seyffart (@JSeyff) January 24, 2024\n\nData compiled by Arkham shows that Grayscale has moved a total of 113,000 BTC from its wallet, mainly to Coinbase Prime, in preparation for sale. As of Wednesday morning, Grayscale’s website showed GBTC as holding roughly 537,000 bitcoin, down about 100,000 BTC since Jan. 11.\n\nWhile the other products have made up for the majority of outflows from GBTC, they have not captured all the recent BTC sales, which has put negative pressure on Bitcoin’s price.\n\n\"The outflows are usually split between Coinbase Prime and new GBTC custody addresses,\" said Arkham. \"This means that not all of the BTC moved is being redeemed. The outflows appear to be settlements of trading activity for the previous day(s).\"\n\nBankrupt crypto exchange FTX has emerged as a major source of GTBC sales as the FTX estate dumped 22 million shares worth close to $1 billion in recent days, taking the firm’s GBTC ownership down to zero. The sales come as FTX is looking to distribute payouts to creditors as the bankruptcy process winds down.\n\nWhile many expected the selling to subside and Bitcoin’s price to stabilize after the FTX sales, a new threat to BTC emerged on Tuesday: the potential release of the Mt. Gox Bitcoins.\n\nThe Tokyo-based Mt. Gox exchange was once the largest crypto exchange in the world before it ceased operations and filed for bankruptcy in 2014 after a hack that resulted in the loss of 850,000 Bitcoins.\n\nAfter years of restructuring, the platform is now ready to start paying back its creditors, with some receiving funds via fiat, while others have elected to receive BTC payouts. On Tuesday, reports began circulating on social media that the exchange was sending emails to creditors verifying their BTC wallet address – a sign that the distribution of funds is about to commence.\n\nThis process is part of the civil rehabilitation plan that was approved by the Tokyo District Court in 2018. The repayment plan involves the distribution of the remaining 150,000 Bitcoins (worth approximately US$6 billion) to creditors.\n\nThe threat of large sales by Mt. Gox creditors has hung over the crypto market for years, and the distribution comes at a delicate time for the market, which is in correction mode following the substantial gains witnessed in 2023.\n\nWhile the Mt. Gox Bitcoins have yet to be distributed, it has been a long-running concern that recipients will dump their tokens on the open market to capture the price gains that have occurred since the exchange was hacked, when Bitcoin traded for $450. Additional selling at this point could see Bitcoin trade into the low $30,000s, some analysts have warned.\n\nBlockstream CEO Adam Back took to X on Wednesday to push back against these concerns, saying they were merely the latest FUD (fear, uncertainty, and doubt) trying to drive Bitcoin lower.\n\nand note @mtgox is paying out in BTC and kept the BTC (not sold for bankruptcy legal expenses), they did not sell them to USD unlike the US bankruptcy approach of @FTX_Official. or creditors would be even sadder with $450 *0.2 = $90/btc rather than 20% of bitcoin balance. — Adam Back (@adam3us) January 24, 2024\n\nNever ones to let a good conspiracy theory go unexplored, many in the crypto space have noted the confluence of factors that seem to be coalescing to drive Bitcoin’s price lower.\n\nNow everyone is turning bearish which is exactly what they want. The timing with FTX, GBTC now MT. Gox. I wouldn’t be surprised if the US gov announced they are selling their BTC. It’s all engineered so most of BTC switches hands to Blackrock and company at a discount. — Nacho Gerberg | Aston King (@Nachogerberg) January 23, 2024\n\nBut many experienced traders and crypto enthusiasts maintain the position that nothing goes up forever, and the ETF hype that pushed Bitcoin from around $24,700 in June 2023, when BlackRock filed their spot BTC ETF application, all the way to $49,000 on Jan. 11, would be followed by a notable correction.\n\nAccording to multiple analysts, Bitcoin is no stranger to 20-30% corrections during bull market run-ups, so this is nothing new for the crypto community, and could represent a good buying opportunity ahead of the next leg up for the crypto market.\n\n“The average ‘respectable’ correction in a bull market is 30%,” said Ran Neuner, founder of Crypto Banter. “We are 20% down already and there may be 10% left to go… You’re not going to catch the bottom and if you miss the run up you will kick yourself! My theory, start buying now. If we go down to $34k, buy all the way down. But don’t miss the pump!”\n\nThis sentiment was echoed by MN Trading founder Michaël van de Poppe, who posted the following chart highlighting a possible entry at the range low of $36,000."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmV0ZnN0cmVhbS5jb20vYXJ0aWNsZXMvY29pbnNoYXJlcy1mb2xsb3dzLWludmVzY28tYW5kLXdpc2RvbXRyZWUtaW4tY3V0dGluZy1iaXRjb2luLWV0cC1mZWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "CoinShares follows Invesco and WisdomTree in cutting bitcoin ETP fee - ETF Stream",
        "content": "CoinShares has cut the fee of its physically-backed bitcoin exchange-traded product (ETP) in response to heightened market competition following approvals of spot bitcoin ETFs in the US.\n\nThe issuer reduced the fee on the CoinShares Physical Bitcoin (BITC) – coming into effect on 1 February – from 0.98% to 0.35%.\n\nThe launch of cheaper spot bitcoin ETFs in the US has sparked a price war in Europe as issuers hope to capitalise on anticipated increased institutional demand.\n\nWisdomTree and Invesco both reduced the fees on their physical bitcoin ETPs last week, cutting them to 0.35% and 0.39%, respectively.\n\nCoinShares said the fee cut aimed to price the product more competitively within the digital asset investment sector.\n\nFrank Spiteri, head of asset management at CoinShares, said: “This change mirrors CoinShares' progressive approach towards the institutionalisation of digital assets, aiming for broader democratisation through regulated products like our crypto ETPs.\n\n“With this pricing structure, investing in a bitcoin crypto ETP through CoinShares becomes a more economical choice than purchasing bitcoin on many mainstream crypto platforms.”\n\nThe fee reduction places BITC closer to Europe’s cheapest physical bitcoin ETP – the 21Shares Bitcoin Core ETP (CBTC) – which has a total expense ratio (TER) of 0.21%.\n\nEurope’s cheapest bitcoin ETP is the Valour Bitcoin Zero SEK (BTC0E) with a management fee of 0%, though this is synthetically replicated.\n\nCrypto ETPs saw inflows of $2.3bn last year, up from $830m in 2022 – of which bitcoin made up 87% of new assets – boosted by investor sentiment surrounding a potential spot bitcoin ETF approval in the US.\n\nThe bitcoin price has tumbled since the ETF approvals by the Securities and Exchange Commission on 10 January."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8td2hhbGVzLWh1bnQtYmFyZ2FpbnMtYml0Y29pbi0wNzA4MzkwNDMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Crypto Whales Hunt for Bargains As Bitcoin Prices Slide, Data Shows - Yahoo Finance",
        "content": "Crypto whales, entities with ample token holdings, appear to be snapping up bitcoin [BTC] at cheaper prices as the leading cryptocurrency continues to slide in the aftermath of the recent U.S. spot ETFs debut.\n\nbitcoin has dropped nearly 19% to $39,770 since the spot ETFs began trading in the U.S. on Jan. 11, CoinDesk data show.\n\nThat has some crypto whales bargain-hunting bitcoin on digital assets exchange Bitfinex, one of the top 10 exchanges by trading volumes. Bitfinex whales are notorious for making waves in the market.\n\nData from TradingView shows that over the weekend, bitcoin traded at a premium of $100 on Bitfinex compared to the global average price. At the time of writing, the premium was near $70, notably higher than other exchanges, including Coinbase and Binance.\n\n“Someone on Bitfinex has been nonstop TWAP buying $BTC for 3 days straight now, which is why Bitfinex has been trading at a fat premium. About $50m spot accumulated so far is my estimate,” pseudonymous market analyst and trader Byzantine General said on X Sunday.\n\nTWAP, or trade-weighted average price, is an algorithmic strategy used for splitting up large orders over time, helping traders minimize slippage when buying or selling large orders. Slippage is the gap between the price at which a trading order is executed and the price at which it was requested.\n\nBTC traded at a fat premium on Bitfinex over the weekend. (TradingView)\n\nThe so-called TWAP buying continued Tuesday, as sales from the FTX bankruptcy estate and outflows from Grayscale Bitcoin Trust (GBTC) pushed prices below $39,000 for the first time since early December.\n\nThe dip demand is also evident from the renewed interest in bullish leveraged bets on Bifinex.\n\nThe chart shows the number of open BTC/USD longs, or bullish leveraged bets, has increased nearly 8% to over 73,000 contracts in one week."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRoaW5rYWR2aXNvci5jb20vMjAyNC8wMS8yNS9kZWJhdGUtZG9lcy10aGUtYXBwcm92YWwtb2Ytc3BvdC1iaXRjb2luLWV0ZnMtaGVscC10aGUtYXZlcmFnZS1pbnZlc3Rvci_SAXZodHRwczovL3d3dy50aGlua2Fkdmlzb3IuY29tLzIwMjQvMDEvMjUvZGViYXRlLWRvZXMtdGhlLWFwcHJvdmFsLW9mLXNwb3QtYml0Y29pbi1ldGZzLWhlbHAtdGhlLWF2ZXJhZ2UtaW52ZXN0b3IvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 25 Jan 2024 08:00:00 GMT",
        "title": "Debate: Does the Approval of Spot Bitcoin ETFs Help the Average Investor? - ThinkAdvisor",
        "content": "Bloink: Many investors may not have the knowledge to realize that these new bitcoin ETFs are actually likely to be a less efficient way for clients to invest in cryptocurrency generally. Clients should understand that the spot bitcoin ETF will trade only during market hours, as opposed to 24-7 trading options. The fees associated with the ETF can also reduce the value of the investment over time, even if the increased costs are relatively small in the short term.\n\nByrnes: The spot bitcoin ETF gives investors an alternative to direct ownership that has the potential to reduce risk yet still allow for a cryptocurrency component to the client’s investment portfolio. That’s likely to attract an entirely new class of investors to the crypto arena as this is a much more palatable and marketable way to access the value of bitcoin and other cryptocurrency.\n\nBloink: The ETF structure itself will lead to a situation where the price of the spot bitcoin ETF is different from the underlying price of the bitcoin asset. All in all, these issues should be discussed with clients and will likely discourage investment in the ETF version in some situations, especially for clients who are just considering jumping into the cryptocurrency market.\n\nByrnes: Spot bitcoin ETFs registered a trading volume of about $14 billion in the first week they were available to investors. These spot ETFs are a great way to actually avoid some of the costs incurred by existing bitcoin ETFs, which must roll over the underlying contracts into new contracts once the original contracts have expired. That itself creates costs that can weigh down the value of the fund and make it less attractive overall.\n\nBloink: Yes, these new spot bitcoin ETFs make it easier for everyday clients to invest in bitcoin in a more direct manner within their own brokerage accounts. However, even the SEC’s approval letter contained a stern warning for investors — reminding them that these bitcoin ETFs are entirely different from ETFs where the underlying assets are metals or other commodities with a physical use. These spot bitcoin ETFs must be thoroughly evaluated by advisors and clients before they make the investment decision."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvYml0Y29pbi1ob2xkcy1uZWFyLTQway1mb2xsb3dpbmctaW5jcmVhc2VkLWFjY3VtdWxhdGlvbi1hcm91bmQtZGlwLXdoYXRzLW5leHQtZm9yLWJ0Yy1wcmljZS_SAYUBaHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2JpdGNvaW4taG9sZHMtbmVhci00MGstZm9sbG93aW5nLWluY3JlYXNlZC1hY2N1bXVsYXRpb24tYXJvdW5kLWRpcC13aGF0cy1uZXh0LWZvci1idGMtcHJpY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Holds Near $40K Following Increased Accumulation Around Dip! What’s Next For BTC Price? - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nThe week began with Bitcoin’s price taking a bearish turn, causing panic among traders as it dipped below $40K, briefly touching lows near $38,500. This decline has raised critical questions about the market’s future direction. Traders now wonder if this signifies a decline in anticipation for the 2024 bull run or if it’s another chance to accumulate at more attractive prices. Despite the setback, Bitcoin has reclaimed the $40K mark, driven by rising accumulation, offering hope for renewed buying demand.\n\nBitcoin’s Netflow Becomes Negative\n\nThe recent decline in Bitcoin’s value can be traced back to a significant rise in GBTC outflows to Coinbase Prime, triggered by Grayscale. However, amidst this downturn, other ETF providers have capitalized on the opportunity to acquire substantial quantities of Bitcoin, a strategic move that many analysts are applauding as astute.\n\nOver the last 24 hours, the Bitcoin market witnessed a collective liquidation totaling around $45 million. This figure comprises roughly $10.8 million from buyers’ long positions and over $34.3 million from sellers’ short positions. This trend shows a robust battle between buyers and sellers within the $38K to $40K price range.\n\nAs per insights provided by IntoTheBlock, Bitcoin’s Netflow remains in the negative zone, implying that investors are actively accumulating BTC during this dip. Currently, the Netflow registers at -1.91K BTC, indicating that the outflow of Bitcoin surpasses the inflow.\n\nShould this trend of negative Netflow continue, it could potentially decrease selling pressure on exchanges. With a reduced supply of Bitcoins available for selling, the supply-demand trend might hint at a price surge, particularly if demand remains steady or rises. This scenario could increase the chances of a robust recovery for BTC price.\n\nWhat’s Next For BTC Price?\n\nRecently, Bitcoin has seen significant volatility as it rebounded from the low of $38,500 and surged toward $40K. The price was effectively defended near the low due to robust accumulation. Despite this, sellers remain active near resistance levels. Currently, Bitcoin’s price trades at $40,005, showing an increase of over 2.6% from yesterday’s figure.\n\nBuyers are now attempting to push Bitcoin’s value above the EMA20 trend line, although sellers are resisting at higher prices. A push above $40K, followed by momentum around $43K, could enhance buyer confidence, sparking new interest. This could potentially send Bitcoin’s price to the $46K-$47K mark.\n\nConversely, if support is established at $38K, there could be an immediate move towards a decrease to $36,400. Nonetheless, this level may also draw considerable buying interest.\n\nPresently, the ratio of long to short positions is undergoing a substantial surge, standing at a current value of 1.3821, signifying a bullish sentiment. This data implies that approximately 42% of positions are in the short category, anticipating a downward movement in the price of BTC. In contrast, 58% of positions belong to the long category, expressing confidence in a price increase."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzI0L3RoZS1uZXctYml0Y29pbi1ldGZzLWFyZS1hLW5vLWJyYWluZXItd2F5LXRvLWJ1aWxkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "The New Bitcoin ETFs Are a No-Brainer Way to Build Wealth, but Only If You Plan to Buy and Hold for the Long Term - The Motley Fool",
        "content": "It's been less than two weeks since the new spot Bitcoin (BTC -4.41%) exchange-traded funds (ETFs) started trading, but they already appear to be a resounding success. In fact, at least two of the new spot Bitcoin ETFs have attracted more than $1 billion in new investor money, and assets under management of these new ETFs are growing at a rapid rate.\n\nThe big question, though, is whether investors fully intend to make these new ETFs part of a long-term buy-and-hold strategy. Initial data appears to indicate higher-than-expected trading volume in these ETFs, and that could be a signal that investors are moving rapidly in and out of them in response to the changing price of Bitcoin.\n\nTo avoid falling into the trading trap, here are three things to keep in mind.\n\n1. Focus on Bitcoin's long-term performance\n\nWhile the new spot Bitcoin ETFs are often described as a way of buying Bitcoin, a more precise way of thinking about them is that they are a way of gaining exposure to the price performance of Bitcoin. If the price of Bitcoin goes up by 150% (as it did last year), then your ETF should also go up by 150%. That's what makes the new ETFs so attractive to many investors -- they make it easy to gain access to Bitcoin's potentially jaw-dropping returns without any previous knowledge or experience with crypto.\n\nIf you review the historical evidence, it's easy to understand Bitcoin's allure. In the decade from 2011-2021, Bitcoin was the best-performing asset in the world. And the same story was true in 2023, when Bitcoin outperformed every other asset class. Thus, while past performance is no guarantee of future performance, there's reason to think that the total return from your new Bitcoin ETF will be quite impressive a decade from now.\n\n2. Don't overreact to Bitcoin's volatility\n\nBut there's just one problem here: Bitcoin has not delivered reliable gains, year in and year out. In fact, there have been several years (including 2018 and 2022) when the price of Bitcoin absolutely cratered. Bitcoin remains a highly volatile asset, with wide price swings almost daily. So you really can't expect a nice, orderly upward march in the value of Bitcoin.\n\nAnd that's what has me concerned about the new Bitcoin ETFs. How will investors react to any plunge in Bitcoin's price, such as we're seeing now? In just the week after the new Bitcoin ETFs were available, the price of Bitcoin was down 12%.\n\nSo what happens if the price goes down (or stays down) for a prolonged period of time? Even longtime buy-and-hold investors might start feeling a sense of buyer's remorse.\n\nIf that leads to them to sell their ETFs, they could easily miss out on Bitcoin's long-term performance. Study after study has shown how hard it is to time the market consistently. Missing out on even a few days of Bitcoin's peak gains could doom your portfolio's returns to mediocrity. If you are selling every time there's a rough patch in the market, you will always be buying high and selling low, instead of buying low and selling high.\n\n3. Minimize your cost of owning Bitcoin\n\nThe new ETFs are designed to be the lowest-cost, most-efficient way of buying Bitcoin today. It's now cheaper to buy and hold a spot Bitcoin ETF for a year than it is to make a single trade on, say, Coinbase Global (COIN -7.17%), the world's second-largest cryptocurrency exchange. The expense ratios of the new Bitcoin ETFs are minimal -- as low as 0.20% of the assets in the fund.\n\nSo if you are trading your Bitcoin ETF, you are doing it all wrong. From a total cost of ownership perspective, all of those trading commissions and losses on bid-ask spreads are going to add up, and you will potentially be turning your low-cost asset into a high-cost asset. In the process, you will be losing out on the cost-efficient nature of the new Bitcoin ETFs.\n\nBuy and hold for the long haul\n\nJust keep in mind: The whole point of the new Bitcoin ETFs is to do all the hard work for you. For a minimal cost, you can now get exposure to Bitcoin. If you then hold onto that Bitcoin, you should be able to capture Bitcoin's long-term returns nearly 1:1. So if you are thinking about buying the new Bitcoin ETFs to build wealth, plan to buy and hold for the long haul."
    }
]