[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMDUvY3J5cHRvY3VycmVuY3ktaW52ZXN0b3JzLWVhZ2VybHktYXdhaXQtc2VjLXJ1bGluZy1vbi1iaXRjb2luLWV0ZnMuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDI0LzAxLzA1L2NyeXB0b2N1cnJlbmN5LWludmVzdG9ycy1lYWdlcmx5LWF3YWl0LXNlYy1ydWxpbmctb24tYml0Y29pbi1ldGZzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency investors eagerly awaiting SEC ruling on bitcoin ETFs - CNBC",
        "content": "Crypto investors are eagerly awaiting an imminent ruling from the U.S. Securities and Exchange Commission that will likely approve the trading of a spot bitcoin exchange-traded fund, more than a decade after initial attempts were rejected.\n\n13 companies have filed for a spot bitcoin ETF:\n\nGrayscale Bitcoin Trust\n\nArk/21Shares Bitcoin Trust\n\nBitwise Bitcoin ETF Trust\n\nBlackRock Bitcoin ETF Trust\n\nVanEck Bitcoin Trust\n\nWisdomTree Bitcoin Trust\n\nValkyrie Bitcoin Fund\n\nInvesco Galaxy Bitcoin ETF\n\nFidelity Wise Origin Bitcoin Trust\n\nGlobal X Bitcoin Trust\n\nHashdex Bitcoin ETF\n\nFranklin Templeton Digital Holdings Trust\n\nPando Asset Spot Bitcoin Trust\n\nHow the SEC will proceed\n\nThere are two components to the applications:\n\n1) A 19b-4 filing, which is a form used by exchanges to inform the SEC of a proposed rule change. In this case, a rule change is required under the Securities Exchange Act of 1934 because a spot bitcoin ETF is a new product, and the exchanges — NYSE, Nasdaq and Cboe — must provide rules to explain how the product will trade. The SEC must approve the rule changes before the product can trade. This is the filing that is facing a deadline of Jan. 10 for the Ark/21Shares Bitcoin Trust.\n\n2) Approval of S-1. This is a filing to register a new security with the SEC, in a document that provides information about the specific security. In this case, each company filing for the spot bitcoin ETF has differences in the way the product might be structured. In the case of the Grayscale Bitcoin Trust, an S-3 filing must be approved, which is a simplified security registration form for businesses that have met other reporting requirements.\n\nIt's widely anticipated that once the 19b-4 filings are approved, the SEC will separately approve the S-1 applications of all the ETF applicants at once. However, because the applications are different, that is not a slam dunk. The SEC may decide to approve some, but not all, of the S-1s.\n\nWide spread in fee\n\nWith 13 companies filing for a bitcoin ETF, all of which are similar products, there is substantial interest in what the fee structure will look like.\n\nFidelity's Wise Origin Bitcoin Fund has announced it will charge 39 basis points, or 0.39%. Invesco's Galaxy Bitcoin ETF has set its expense ratio at 59 basis points, which are waived for the initial six months and the first $5 billion in assets. Ark/21Shares and Valkyrie will charge 80 basis points.\n\nGrayscale Bitcoin Trust currently charges 2% but has said it's committed to lowering the fee once its application to convert to a bitcoin ETF is approved.\n\nOther applicants have not yet announced their fee structure.\n\nIt is unclear who the main regulator of the crypto industry is\n\nAll this happens against the backdrop of SEC Chair Gary Gensler's long-running fight with the crypto industry.\n\nGensler has fought several court battles against major crypto players, including a losing battle against Grayscale Bitcoin Trust, which won a case against the SEC last summer. In that case, the U.S. Court of Appeals for the D.C. Circuit ruled that the SEC had already approved a futures-based bitcoin product and that it failed to explain why it had refused to approve a spot-bitcoin product. The court said, in essence, the futures and the spot market are \"like\" products. If the SEC approved one, it logically had to approve the other.\n\nBitcoin has been ruled to be a commodity, but with the exception of ether, there are no such rulings on other cryptocurrencies. In the absence of clear federal rules, the SEC has taken to regulation by enforcement to demonstrate that many cryptocurrencies are securities, and it therefore has regulatory authority over much of the crypto industry.\n\nThere is an outstanding case against Coinbase , the largest U.S. crypto exchange, where the SEC alleges that the company violated rules requiring it to register as an exchange. In that case, the SEC has alleged that some of the crypto assets traded on Coinbase are securities and fall under the SEC's purview.\n\nThe SEC sued Binance and its founder Changpeng Zhao last June, alleging that Binance and Zhao \"engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law,\" according to Gensler.\n\nThe case is ongoing, but in November, the U.S. Department of Justice settled different charges against Binance and Zhao, wherein Zhao pleaded guilty to money laundering violations and agreed to pay a $50 million fine and step down from his role as the company's chief executive. Binance also accepted the appointment of a government monitor to oversee the business.\n\nARK Invest's Cathie Wood will be our guest on \"Halftime Report\" at 12:35 p.m. Monday, and on \"ETF Edge\" on Monday at 1:10 p.m.-1:30 p.m. ET on ETFEdge.cnbc.com."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDUvaWYtYS1iaXRjb2luLWV0Zi1pcy1hcHByb3ZlZC1oZXJlcy13aGF0LW1heS1oYXBwZW4v0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8wNS9pZi1hLWJpdGNvaW4tZXRmLWlzLWFwcHJvdmVkLWhlcmVzLXdoYXQtbWF5LWhhcHBlbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "If a Bitcoin ETF Is Approved, Here’s What May Happen - CoinDesk",
        "content": "Analysis of flows into the SPDR Gold Shares ETF (GLD), the first spot gold ETF in the U.S., which debuted in 2004, is informative. GLD amassed $1.9 billion in inflation-adjusted terms in its first four weeks, with the tally rising to $4.8 billion by the end of the first year, according to crypto exchange Coinbase. The ETF currently has $57.37 billion in total assets."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9iaXRjb2luLWZvdXItcmVhc29ucy13aHktdGhlLXByaWNlLXNob3VsZC1zdXJnZS1pbi0yMDI0LTIyMDU1N9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin: four reasons why the price should surge in 2024 - The Conversation Indonesia",
        "content": "The year 2023 will be remembered as turbulent for cryptocurrencies, with numerous important developments that ultimately helped to “clean up” the space to potentially make it more attractive to mainstream investors. Notably there was the conviction of FTX CEO Sam Bankman-Fried for fraud.\n\nTop exchange Binance also reached a US$4 billion settlement (£3.1 billion) with the US treasury department over money-laundering charges, which saw CEO Changpeng “CZ” Zhao agreeing to step down and pay a US$50 million fine.\n\nMeanwhile, regulators continued cracking down on other operators, but potentially lost one of their key cases against the industry after a US court ruled that the XRP token, one of the top ten cryptocurrencies, was not a security (meaning a tradeable financial asset like shares or bonds).\n\nThis means its creator, Ripple, did not break the law by selling it on exchanges. Viewed as a test case for the majority of cryptocurrencies, the US Securities Exchange Commission (SEC) is currently appealing.\n\nWhile all this was happening, the bitcoin price rose away from the lows of late 2022. It started the year at US$16,000 and ended comfortably above the US$40,000 threshold.\n\nSo what does 2024 look like for this sector and what key events are on the horizon?\n\n1. ETFs\n\nThe SEC may finally be about to greenlight a type of investment vehicle known as an exchange traded fund (ETF) for the general or “spot” bitcoin market. ETFs already exist for everything from oil to the FTSE 100 to even regions and countries. They track the underlying asset, creating an easy way for people to invest without having to buy the asset directly.\n\nUntil now, the only ETFs permitted for crypto in the US have been for the futures markets. These niche markets are concerned with where investors think crypto prices are heading in future.\n\nBitcoin price 2021-24\n\nA spot bitcoin ETF would likely encourage mainstream investors to buy exposure to this market, while potentially attracting banks to actively participate too. Bitcoin could be offered by financial advisors and there would no longer be a need for investors to hold the asset itself or face difficulties like crypto exchanges, coin storage and so on.\n\nThere are various reasons why many commentators think the SEC may now end its opposition to such an ETF. For one thing, the list of applicants includes Blackrock, the biggest investment house in the world, along with various other major players.\n\nAlso, digital asset group Grayscale won an important case against the SEC in 2023, which had been blocking its attempt to convert its US$17 billion bitcoin futures ETF, GBTC, into a spot version. This has forced the SEC to reconsider Grayscale’s application too.\n\nFurther, Hong Kong’s regulatory authority has announced it is open to spot bitcoin ETF applications and has laid down guidelines permitting several varieties. As well as the basic model that we may soon see in the US, where investors would buy into bitcoin ETFs with dollars, Hong Kong is open to a second variety known as “in-kind”.\n\nThis would make it possible to convert shares in a bitcoin ETF into bitcoin and vice versa, allowing more flexibility and potentially attracting more institutional investors into the space.\n\n2. Interest rates\n\nJerome Powell, chair of US central bank the Federal Reserve, has indicated that interest rates may have peaked, and that the Fed is likely to cut them during 2024. Similarly in the UK, leading mortgage lender Halifax has cut its lending rate in expectation of a Bank of England rate cut.\n\nIf interest rates are cut or even stabilise in 2024, it could make bitcoin (and other digital assets) more attractive to investors, since its limited supply makes it a hedge against traditional currencies losing value over time.\n\nMore generally, rate cuts prompt investors to look for higher investment returns, and cryptocurrencies have delivered here too.\n\nAsset class returns since 2011\n\nIn addition, the US and other economies may enter a recession in the later half of 2024 due to the lagged effects of the interest rate hikes.\n\nEqually, we saw a number of bank failures in 2023, predominantly in the US. In the event of a recession or more bank problems, governments may be forced to provide stimulus packages and print more money. This would further devalue currencies and make bitcoin still more attractive.\n\n3. The halving\n\nA big event for bitcoin in 2024 is the so-called “halving”. Bitcoin runs on an online ledger known as a blockchain, in which entries are validated by “miners” using arrays of computers to solve complex mathematical puzzles. Miners are paid in bitcoin for completing a set of transactions known as a block, and the protocol stipulates that their reward per block halves every 210,000 “blocks” (roughly every four years).\n\nThe reward began at 50 bitcoin in 2009 and is expected to fall from 6.25 bitcoin to 3.125 bitcoin around the middle of April 2024.\n\nThis decrease entails fewer bitcoin sold on the market, which tightens supply and may squeeze out the least efficient miners, significantly reducing the computer power used by the network. The three previous halvings have prompted dramatic bull runs, while also driving up the prices of digital assets more generally as investors take more risks in the space.\n\nHalving effects\n\n4. Blockchain developments\n\nThe bitcoin network saw a number of technological advancements in 2023. This has included enabling a new and a unique form of NFTs (non-fungible tokens) known as ordinals, and also a new standard called BRC-20 that makes it possible to create new cryptocurrencies on the network. Until now, NFTs and new cryptocurrencies have mostly been issued on other blockchains such as ethereum.\n\nWe are also seeing growing adoption of the Lightning network, a layer above the bitcoin blockchain that enables much faster transactions. All these changes are resulting in increased demand for bitcoin, which in turn may lead to higher prices.\n\nIn sum, there’s a strong case for being bullish about bitcoin’s price in the year ahead. Commentators’ predictions range from US$60,000 to US$500,000 by year end. Our own belief is that though the road may be bumpy, 2024 could well see increased adoption of cryptocurrencies, which will drive prices beyond the current US$40,000 mark."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTA0L2V4LWNpdGktZXhlY3MtcGxhbi1iaXRjb2luLWJ0Yy1zZWN1cml0aWVzLXRoYXQtZG9uLXQtbmVlZC1vay1mcm9tLXVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Citi Alumni Plan Bitcoin Securities That Don't Need SEC Approval - Bloomberg",
        "content": "As speculation about the upcoming approval or denial of spot-Bitcoin ETFs reaches a fever pitch, a group of former Citigroup Inc. executives is starting to offer securities backed by the oldest cryptocurrency that they say don’t need the blessing of US regulators.\n\nThe new offering, called Bitcoin depositary receipts, will be similar to American depositary receipts that represent foreign stocks. The startup, called Receipts Depositary Corporation, or RDC, said it plans to issue the first Bitcoin depositary receipts to qualified global institutional investors in transactions exempt from registration under the Securities Act of 1933."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2JldHRlcm1hcmtldHMub3JnL25ld3Nyb29tL3RoZS1zZWMtbXVzdC1mb2xsb3ctdGhlLWxhdy1hbmQtcmVqZWN0LXNwb3QtYml0Y29pbi1ldHBzLXdoaWNoLXdpbGwtaW5mbGljdC1tYXNzaXZlLWludmVzdG9yLWhhcm0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "The SEC Must Follow the Law and Reject Spot Bitcoin ETPs Which Will Inflict Massive Investor Harm - Better Markets",
        "content": "WASHINGTON, D.C.—Dennis M. Kelleher, Co-Founder, President, and CEO, issued the following statement on the filing of Better Markets’ Supplemental Comment Letter to the Securities and Exchange Commission (SEC) in response to multiple proposed rule changes filed by national securities exchanges seeking to list and trade shares in spot bitcoin exchange-traded products (ETPs).\n\n“The approval of spot bitcoin ETPs would be a historic mistake almost certainly leading to massive investor harm. The immense and unrelenting fraud and manipulation in the bitcoin market means that approving these products would expose millions of American investors and retirees to the very harms that the SEC exists to prevent. It would also undoubtedly lead the crypto industry to claim or imply that their products are now approved by the United States government. The crypto industry will almost certainly flood Americans with marketing propaganda suggesting that the SEC’s action legitimized crypto, giving false comfort to retail investors. The SEC must not facilitate the financial carnage that will follow if the crypto industry is allowed to repackage, add a veneer of legitimacy to, and widely disseminate a financial product that is little more than a socially worthless gambling chip.\n\n“Denying the proposed rule changes is required under the law. The statute clearly provides that the rules of an exchange must be designed to prevent fraudulent and manipulative acts and practices and protect investors and the public interest. The potential for fraud and manipulation in the spot bitcoin market is so great that an exchange cannot permit the listing and trading of a spot bitcoin ETP and still comply with those requirements. Moreover, the surveillance-sharing agreements proposed by the exchanges amount to window-dressing that cannot adequately detect or address the rampant fraud and manipulation in the bitcoin market.\n\n“As a result, it would be a profound legal error and a policy travesty for the SEC to approve the proposed rule changes. It would expose countless hardworking Americans to the risks inherent in investing in bitcoin. Those risks have not only been obvious over the last three years but have materialized repeatedly, resulting in billions of dollars of losses. The fact that the investment vehicle will be an ETP will not protect investors; if anything, the supposed protections related to the ETP will also provide false comfort to unsuspecting investors who fall for marketers’ claims that the SEC has approved if not endorsed the product. The value of their investment will be subject to the same risks of fraud and manipulation in the bitcoin market as investors who hold bitcoin directly. The SEC must not subject investors to these risks.”\n\nYou can find the full comment letter here.\n\n###\n\nBetter Markets is a non-profit, non-partisan, and independent organization founded in the wake of the 2008 financial crisis to promote the public interest in the financial markets, support the financial reform of Wall Street and make our financial system work for all Americans again. Better Markets works with allies—including many in finance—to promote pro-market, pro-business and pro-growth policies that help build a stronger, safer financial system that protects and promotes Americans’ jobs, savings, retirements and more. To learn more, visit www.bettermarkets.org."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL2ZpbmFuY2UueWFob28uY29tL25ld3MvdGhlLWNyeXB0by13b3JsZC1pcy1yZWFkeS10by10YWtlLWJpdGNvaW4tZXRmcy10by10aGUtbWFzc2VzLWl0LW5lZWRzLXRoZS1ibGVzc2luZy1vZi1hLWxvbmd0aW1lLWZvZS1maXJzdC0xNTM0Mjc4ODkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "The crypto world is ready to take bitcoin ETFs to the masses. It needs the blessing of a longtime foe first. - Yahoo Finance",
        "content": "The crypto world is betting its mainstream moment is here. That bet hinges on the blessing of Wall Street’s top cop.\n\nThe Securities and Exchange Commission is expected in the coming days to rule on whether 14 different money managers will be allowed to launch their own spot bitcoin exchange-traded funds.\n\nThese ETFs would allow everyday investors to get exposure to bitcoin (BTC-USD) without having to own it, trading it like they would a stock.\n\nThe approvals could also expand widespread acceptance of the world’s biggest cryptocurrency, making bitcoin a potential staple in 401(k)s, IRAs, and pension plans used by everyday people.\n\nThe applicants include some of the biggest names on Wall Street, from BlackRock (BLK) to Franklin Templeton (BEN), as well as a number of firms better known in the crypto world.\n\nJPMorgan Chase (JPM) and Goldman Sachs (GS) are among the giant banks that have offered to help some of these money managers create and redeem shares of their new funds.\n\nBlackRock, the world's largest money manager, is among the applicants seeking approval from the SEC to launch a spot bitcoin ETF. (Fatih Aktas/Anadolu Agency via Getty Images) (Anadolu via Getty Images)\n\nThe challenge before the industry is that the SEC has in the past denied such applications, arguing the products were vulnerable to market manipulation. The regulator is also the industry's most prominent adversary, having filed numerous lawsuits and enforcement actions against key players.\n\nThose in the crypto world say there are signs that the SEC won’t stand in the way this time around and will give the green light to all 14 applicants at once.\n\nSuch optimism helped bitcoin surge more than 150% in 2023 and start 2024 by rising above $45,000, its highest level in nearly two years.\n\nIt is also helping investors move past the memories of 2022, when some of the industry’s biggest names were wiped out as the values of digital assets collapsed.\n\n\"The bitcoin ETFs will be the official nail in the coffin on that prior crypto winter,\" Laurence Latimer, CEO and co-founder of crypto firm Dinara, told Yahoo Finance.\n\nA number of applicants — including Bitwise, Hashdex, and VanEck — have already released teaser video ads ahead of what they expect to be their potential launch.\n\nStory continues\n\n\"Bitcoin’s time has arrived,\" reads the tagline of the Hashdex spot.\n\nBut in a sign of how much is riding on these approvals, bitcoin tumbled nearly 10% earlier this week after one industry analyst floated a contrarian view of what the SEC may do.\n\nMarkus Thielen, head of research at crypto investment firm Matrixport, said in a note Tuesday that the SEC will reject all ETF applications this month and the products won’t get the green light until at least the second quarter. If that happens, bitcoin prices could fall by 20%, according to the note.\n\n\"While we have seen frequent meetings between the ETF applicants and staff from the SEC, which resulted in the applicants refiling their applications,\" the note added, \"we believe all applications fall short of a critical requirement that must be met before the SEC approves.\"\n\nSecurities and Exchange Commission chairman Gary Gensler has consistently voiced skepticism about the crypto industry. (Jonathan Ernst/REUTERS) (REUTERS / Reuters)\n\nThe note cited general skepticism from SEC chair Gary Gensler, who has led the agency’s larger crackdown on the crypto world.\n\nIt also came as bitcoin trading volume spiked to highs not seen since the collapse of regional lender Silicon Valley Bank in March 2023.\n\nA decade in the making\n\nThe crypto industry has been waiting more than a decade for this moment.\n\nThe first application to create a spot bitcoin ETF came in 2013 from crypto entrepreneurs and twins Tyler and Cameron Winklevoss, famous for their early role in the creation of Facebook. Since then, the SEC has denied more than 30 similar applications.\n\nEntrepreneurs Tyler and Cameron Winklevoss, who filed for approval of a spot bitcoin ETF in 2013. (Lucas Jackson/REUTERS) (REUTERS / Reuters)\n\nA key turnaround moment came last year in June when the world’s biggest money manager, BlackRock, filed for a spot bitcoin ETF. The interest from one of Wall Street’s biggest names sparked other asset managers to follow suit.\n\nAnother important development came last August when one of the ETF applicants, Grayscale Investments, won a key legal victory over the SEC. Grayscale had sued the SEC in 2022 after it wasn't allowed to convert its Grayscale Bitcoin Trust (GBTC) into a spot bitcoin offering.\n\nIts core argument was that the agency had already approved exchange-traded products that held bitcoin futures contracts and thus had \"acted arbitrarily and capriciously.\"\n\n​A three-judge panel of the District of Columbia Court of Appeals in Washington sided with Grayscale, saying the firm had \"advanced substantial evidence\" its product was similar to bitcoin futures ETFs previously approved by the SEC.\n\nThat forced the SEC to reconsider Grayscale’s spot bitcoin ETF application, along with others filed by rival money managers.\n\nThe SEC’s first deadline to consider these various ETFs is Jan. 10 for a joint offering from Ark Invest and 21Shares. Other deadlines are as late as April.\n\nLet the race begin\n\nETF issuers and analysts say they believe the SEC will choose to approve all applications that pass muster by the earliest January deadline, so as not to give any first movers an advantage over the rest of the industry.\n\nOne of the applicants, Ark Investment Management CEO Cathie Wood, told Yahoo Finance that the dominant providers of spot bitcoin ETFs will be those that take in the most money from investors right out of the gate.\n\nThe winners \"will be a few and it will be the most liquid,\" she said.\n\nCathie Wood, CEO of Ark Invest, is among the applicants seeking approval from the SEC to launch a spot bitcoin ETF. (Patrick T. FALLON / AFP) (PATRICK T. FALLON via Getty Images)\n\nHistorically, launches for other bitcoin products have sent bitcoin’s price on a wild ride.\n\nIt happened in 2017 with the launch of the country’s first bitcoin futures contracts and then in 2021 with the SEC’s approval of the country's first bitcoin futures ETFs. Prices soared and then fell by large amounts in the year following the launches.\n\nThis time around, \"there's good pent-up demand so you'll see good flows,” Sandy Kaul, Franklin Templeton's head of digital assets, told Yahoo Finance.\n\n\"But I think that the transformative flows are really going to come in about six months to a year when people start to see what these ETFs actually offer in terms of the portfolio performance.\"\n\nWhat is clear, she added, is that the approval of these products would offer \"a real affirmation of the crypto ecosystem being a legitimate investment opportunity.\"\n\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\n\nThe price of bitcoin rose more than 150% in 2023. A prior version of this article incorrectly reported the rise was 164% through January 1.\n\nClick here for the latest crypto news, updates, values, prices, and more related to bitcoin, ethereum, dogecoin, DeFi, and NFTs\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzIzNTZkMzJkLWY1ZDYtNDAxNy05MTc5LTU3ODdjZWQ2ODExONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs miss the point - Financial Times",
        "content": "Print this page\n\nThe writer is a former investment banker and author of ‘Power Failure: The Rise and Fall of an American Icon’\n\nThe cryptoworld has been abuzz in recent weeks about the likelihood that the Securities and Exchange Commission will soon greenlight a bitcoin exchange-traded fund.\n\nThe idea that such an ETF will soon be offered to hungry, if misguided, US investors has helped provide a year-end kicker to the remarkable rally in bitcoin from the depths of its latest “winter” in late 2022. It became one of the best performing investments of 2023, rising around 160 per cent over the past year to nearly $44,000.\n\nThat is quite a turnaround given the crypto world has been on the ropes reputationally often during the past year or so. Not only has there been the bankruptcy of crypto exchange FTX and the criminal conviction of its founder Sam Bankman-Fried, but also its chief rival Binance agreeing to pay $4.3bn in penalties related to money laundering and breaching international sanctions. That was one of the largest corporate penalties in US history. Binance founder Changpeng Zhao also pleaded guilty to failing to protect against money laundering and resigned from his position.\n\nBut if you think about it, there has already been a way for investors to play the bitcoin rollercoaster for years: by buying, or selling, the stock of enterprise software company MicroStrategy which has hitched its fortunes to bitcoin, rendering its sales of enterprise software somewhat irrelevant to its stock market valuation.\n\nUnder a strategy driven by the company’s 58-year-old, MIT-educated executive chair Michael Saylor, MicroStrategy has been buying bitcoin since 2020. “Due to its limited supply, bitcoin offers the opportunity for appreciation in value if its adoption increases and has the potential to serve as a hedge against inflation in the long term,” it said at the time. MicroStrategy is thought to be the largest listed holder of bitcoin in the world. The company owns 189,150 bitcoins, purchased over the years at an aggregate price of around $5.9bn, as of the end of December.\n\nMicroStrategy’s software operations have brought Saylor into the regulatory spotlight. In 2000, he agreed to pay $8.3mn plus a $350,000 penalty to settle SEC charges of materially overstating software revenues and earnings. But when bitcoin was riding high, say around November 2021, when its price hit $69,000, he drew a lot of attention. He even bedazzled Tucker Carlson for more than an hour about the wisdom of the cryptocurrency before the television anchor was defenestrated from Fox.\n\nSaylor is a true believer, and an articulate one at that. His interviews about bitcoin are lengthy and spellbinding. He speaks in complete paragraphs. You come away from listening to him convinced that bitcoin is the next great innovation in the financial world. And then, you step back, give it a thought or two and remember that Jamie Dimon, CEO of JPMorgan, said of cryptocurrency, “If I was the government, I’d shut it down.”\n\nMicroStrategy executive chair Michael Saylor: ‘We’re kind of like your nonexistent spot ETF’ © Bloomberg\n\nSaylor relinquished the role of the CEO of MicroStrategy in August 2022 to become executive chair after yet another bitcoin plunge. At the time, the company had reported cumulative impairment losses of nearly $2bn on its digital assets since acquisition.\n\nBut thanks to the run-up in the price of bitcoin in 2023, MicroStrategy’s hoard is now worth more than $8bn, giving the company a gain of some $2bn on its investment. Not surprisingly, MicroStrategy’s stock price also outperformed in 2023, up more than 330 per cent for the year. Its market value of around $8.8bn means that investors are valuing its software business at around $800mn. (That is still hefty given MicroStrategy made a small pre-tax profit of around £13mn on revenues of $371mn in the nine months to September 30, after taking into account share-based pay but excluding impairments on its digital holdings.)\n\nSo MicroStrategy is essentially a play on bitcoin and has been for years. In other words, there’s been no need to wait for the SEC to approve a bitcoin ETF, it seems to me. Saylor himself told CNBC: “We’re kind of like your nonexistent spot ETF.”\n\nThe problem with bitcoin isn’t that there hasn’t been a way to speculate on it. The problem with bitcoin is that it’s all about speculation. We don’t need new ways to speculate on the cryptocurrency. What we need, if bitcoin is going to be the saviour its advocates want us to think it is, is a use for bitcoin.\n\nWhen it can be used to buy and sell the things we want, as seamlessly as fiat currency, that’ll be the game changer. The real excitement for bitcoin won’t come from the SEC authorising new ways to speculate on it, but rather when there’s more to it than just speculation.\n\nThis article has been amended to correct the year in which MicroStrategy started buying bitcoin to 2020."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMDUvYml0Y29pbi1oYXMtc3VyZ2VkLTY3LXBlcmNlbnQtaW4tdmFsdWUtc2luY2Utc2VwdGVtYmVyLmh0bWzSAV9odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyNC8wMS8wNS9iaXRjb2luLWhhcy1zdXJnZWQtNjctcGVyY2VudC1pbi12YWx1ZS1zaW5jZS1zZXB0ZW1iZXIuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin has surged 67% in value since September—here's why - CNBC",
        "content": "Bitcoin hit a peak value of around $68,000 in November 2021. But by November 2022, it had lost more than 75% of that value following the collapse of FTX, the largest cryptocurrency exchange at the time. And now, it's bounced back up again.\n\nEven with a regulatory crackdown on cryptocurrency exchanges in the past year, the price of bitcoin rose steadily through most of 2023, and now sits at around $43,610 — a nearly $18,000 increase in value since September.\n\nOther popular cryptocurrencies have followed a similar trajectory in what has been a remarkable turnaround for an industry battered by scandal. But why now?\n\nInvestors have been buying cryptocurrencies ahead of the much-anticipated approval of the first U.S. spot bitcoin exchange-traded fund, which is expected later in January.\n\nPending approval, a slew of investment firms are expected to offer ETFs, most notably Blackrock, the largest asset management firm in the world.\n\nAn ETF is an investment fund that tracks the price of an underlying asset or index — in this case, bitcoin.\n\nThe advantage of a bitcoin or crypto ETF is that it would offer a way for investors to benefit from the price movements of bitcoin without owning the cryptocurrency directly.\n\nIf approved, cryptocurrency ETFs are expected to be traded on traditional SEC-regulated exchanges like the New York Stock Exchange or Nasdaq, according to CoinDesk.\n\nThat would open up the cryptocurrency market to a wider array of buyers who don't use cryptocurrency exchanges already. In anticipation of ETF approval, investors have been piling back into the market, which has driven up the price of bitcoin.\n\n\"It really opens the door for all kinds of demands. And if demand goes up, price goes up,\" says Douglas Boneparth, president of Bone Fide Wealth and a member of CNBC's Financial Advisor Council. Boneparth holds investments in bitcoin and other cryptocurrencies.\n\nThere are other factors at play, too. The Federal Reserve has signaled that its interest rate hike cycle is over, an encouraging sign for the economy as inflation continues to fall. This has made riskier assets like crypto more attractive to investors.\n\nAnother factor is bitcoin's \"halving,\" which is expected in April. Halving is a built-in mechanism related to bitcoin mining that periodically reduces token supply. Decreasing the supply of bitcoin is expected to further stoke demand.\n\nTo break it down, the factors behind the recent surge in bitcoin prices are \"60% bitcoin ETF, 20% halving and 20% economic conditions,\" says Boneparth.\n\nHowever, \"be mindful about the relentless upward [price] movement over the past few months,\" says Owen Lau, executive director at financial services company Oppenheimer & Co. \"A lot of the good news appears to have been priced in.\""
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8wNC93aWxsLTIwMjQtYmUtdGhlLXllYXItb2YtdGhlLWJpdGNvaW4tZXRmL9IBWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8wNC93aWxsLTIwMjQtYmUtdGhlLXllYXItb2YtdGhlLWJpdGNvaW4tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Will 2024 Be the Year of the Bitcoin ETF? - CoinDesk",
        "content": "\"I think many of the issuers believe that they don't want the introduction of a bitcoin ETF to be the thing that forces the SEC to update the rules and regulations for how broker-dealers handle bitcoin,\" they said. This isn't an insurmountable problem – the SEC could allow other intermediary businesses handle trading for in-kind creations and redemptions, for example."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDI0LTAxLTA0L2NvaW5iYXNlLXMtaHVnZS1yb2xlLWluLXByb3Bvc2VkLWJpdGNvaW4tZXRmcy1yYWlzZXMtYmlnLXF1ZXN0aW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Coinbase's Huge Role in Proposed Bitcoin ETFs Raises Big Questions - Bloomberg",
        "content": "In this issue of the Bloomberg Crypto newsletter, Michael P. Regan wonders what the SEC thinks about the huge role that Coinbase is poised to play in proposed spot-Bitcoin ETFs.\n\nWhen it comes to discussions about the US finally approving a spot-Bitcoin ETF or issuing more rejections, there’s a gorilla in the room that few seem to be acknowledging: Coinbase Global Inc.\n\n\n\nThe largest US crypto exchange – and the only one that’s a public company – is poised to play a major role as a middleman between the crypto market and the traditional equities market where the exchange-traded funds would trade.\n\n\n\nThe only twist? The Securities and Exchange Commission sued Coinbase in June, alleging that the company acted as an exchange, broker-dealer and clearinghouse without registering with the agency for any of those roles.\n\n\n\nAt the time, the company’s chief legal officer said it would fight the SEC in court while simultaneously pushing for a legislative solution on crypto regulations that the company hoped would advance in the House of Representatives by the end of the summer. That didn’t happen, of course, and anyone who’s been paying attention to US politics knows Congress can barely agree on a lunch order – or even to keep the government open, for that matter -- let alone pass major legislation like that. There was even talk at the time that the legal battle between Coinbase and the SEC could end up in the Supreme Court, yet the case hasn’t even gone to trial yet. And the US high court sort of has its hands full at the moment anyway with, you know, the whole future of American democracy and whatnot."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTA1L2JpdGNvaW4tYnRjLWV0Zi1pc3N1ZXJzLWNsZWFyLW1ham9yLWh1cmRsZS1mb3Itc2VjLWFwcHJvdmFs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Issuers Clear Major Hurdle on Path to SEC Approval - Bloomberg",
        "content": "Firms looking to launch spot-Bitcoin exchange-traded funds cleared a major hurdle this week on the path to gaining sign-off from US regulators in coming days.\n\nSecurities and Exchange Commission staff told several exchanges and issuers seeking to list the ETFs that they should submit a final version of a key document as soon as Friday, according to four people familiar with the matter who asked not to be named because the discussions are private. The staff had no additional feedback on the paperwork for several of the firms after the latest amendments, two of the people said."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDQvZmlyc3QtbW92ZXItYW1lcmljYXMtZXhwbGFpbmluZy1iaXRjb2lucy1zdWRkZW4tZHJvcC_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzA0L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWV4cGxhaW5pbmctYml0Y29pbnMtc3VkZGVuLWRyb3AvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "First Mover Americas: Explaining Bitcoin's Sudden Drop - CoinDesk",
        "content": "Bitcoin (BTC) traded just above $43,000 in European morning hours Thursday, recovering some losses after a leverage flush sent it down as much as 7% on Wednesday as markets reacted to analyst reports. Matrixport's out-of-consensus report served as a catalyst to unwind overleveraged positions leading to cascading liquidations, exacerbating the downfall. Nearly $560 million of leveraged long derivatives trading positions – bets on higher prices with borrowed money – had been wiped out through Wednesday, the highest amount in at least three months, CoinGlass data shows. CryptoQuant also attributed the decline to exceptionally high funding rates on the bitcoin futures market, adding selling pressure from bitcoin miners and high profit rates of short-term holders as contributing factors. Major tokens solana (SOL), ether (ETH) and Cardano’s ADA started to stabilize early Thursday after dropping more than 10% in 24 hours. The CoinDesk Market Index (CMI), a broad-based gauge tracking the market, slumped 6% in the same period, its steepest drop in recent weeks."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDI0LTAxLTA0L3B1dC10aGUtYml0Y29pbnMtaW4tdGhlLWJveNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Put the Bitcoins in the Box - Bloomberg",
        "content": "Programming note: Money Stuff will be off tomorrow, back on Monday.\n\nI began yesterday’s column by saying that I used to write a lot about crypto, but I am trying to do less of it these days. The main reason, I wrote, is that crypto used to be a laboratory for rediscovering central intuitions about finance: Crypto was building a brand-new alternative financial system from scratch, and crypto enthusiasts were discovering solutions to financial problems for themselves. Sometimes those solutions were better than the traditional solutions, and sometimes they were worse, and sometimes they just used new terminology to re-describe solutions that traditional finance discovered years ago, but in any case they were fun to write about. Better, or worse, or the same, they provided a lens through which to see traditional finance; seeing why crypto did something, and why it did or didn’t work, could help you understand why traditional finance does things the way it does."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8wNC9jcnlwdG8tbWFya2V0LWNhbi1lYXNpbHktaGFuZGxlLWJpdGNvaW4tZXRmLXRyYWRpbmctdm9sdW1lLXdoaWNoLWNvdWxkLWJlLXdvcnRoLWJpbGxpb25zLW9mLWRvbGxhcnMv0gGVAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzA0L2NyeXB0by1tYXJrZXQtY2FuLWVhc2lseS1oYW5kbGUtYml0Y29pbi1ldGYtdHJhZGluZy12b2x1bWUtd2hpY2gtY291bGQtYmUtd29ydGgtYmlsbGlvbnMtb2YtZG9sbGFycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs Could Spark Huge BTC Trading. The Market Appears Up to the Task - CoinDesk",
        "content": "APs create and redeem ETF shares, directing investor money into and out of the fund; while that may sound mundane, it's a vital part of ensuring the price of an ETF remains closely linked to the value of the fund's underlying holdings. With Grayscale's trust, shares cannot be redeemed. That can lead to there being an oversupply of trust shares, putting downward pressure on their price. And, indeed, the trust has wandered far below its so-called net asset value in recent years – part of why Grayscale wants to turn it into an ETF."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8wNC9jaXRpLWFsdW1uaS1mb3VuZGVkLXN0YXJ0dXAtdG8tb2ZmZXItYml0Y29pbi1zZWN1cml0aWVzLXRoYXQtZG9udC1uZWVkLWdyZWVuLWxpZ2h0LWZyb20tc2VjLWJsb29tYmVyZy_SAZcBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjQvMDEvMDQvY2l0aS1hbHVtbmktZm91bmRlZC1zdGFydHVwLXRvLW9mZmVyLWJpdGNvaW4tc2VjdXJpdGllcy10aGF0LWRvbnQtbmVlZC1ncmVlbi1saWdodC1mcm9tLXNlYy1ibG9vbWJlcmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Citi Alumni-Founded Startup to Offer Bitcoin Securities That Don't Need Green Light From SEC - CoinDesk",
        "content": "RDC aims to address the institutional desire for bitcoin investments that may not be satisfied by a spot exchange-traded fund (ETF). The SEC is expected to approve the listing of a spot BTC ETF in the U.S. in the very near future."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzU5YmI0MzBiLWE1YjEtNDQ2OS1iMDVhLTQ4MmI5NTExMDlhMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "My new year resolution is bitcoin - Financial Times",
        "content": "Print this page\n\nLet’s begin the year with a bang! By which I mean I’ve decided to allocate some money to a spot bitcoin exchange-traded fund (ETF) if one becomes available soon. Emails to the usual address.\n\nI made up my mind while running along the Exmoor coast last week, steep cliffs plunging into the surf. Many readers will say that’s where my retirement savings will end up. But, as I wrote last summer, it’s time to take more risk.\n\nAnd there is no bigger investment story right now. Google searches for “bitcoin ETF” have tripled over the past week. The world’s biggest cryptocurrency started 2024 by trading 7 per cent higher. Since October add a zero.\n\nThe catalyst is the expectation the Securities and Exchange Commission is about to give the green light to multiple spot applications (you can already buy ETFs holding bitcoin futures contracts). Bloomberg reckons there’s a 90 per cent chance approval will be given by January 10.\n\nThat’s almost as precise as my mate Chris. Before setting off on my jog he told me there was a 98 per cent chance of bitcoin prices doubling this year. Even if he is half right, you don’t need my second-year statistics course at Cambridge to know that’s a nailed-down 50 per cent return.\n\nI would be mad to miss out. And, besides, I’ve changed my view on the suitability of bitcoin ETFs for retail punters. It used to worry me that they seem to fail at least two SEC tests when it comes to investor protection and market integrity. It still does.\n\nTake safe custody. No one can “steal” an ETF, of course, and gangs don’t have a clue where you hide your “cold wallet” — if you prefer to hold bitcoins offline. The digital wallets ETFs will use are also secure.\n\nBut thieves can raid the biggest and most popular exchanges — and have done — undermining prices. Remember that the sole purpose of a spot ETF is to track a price. It therefore doesn’t matter if off-exchange coins are safe.\n\nThe more you think of bitcoin as an investment, whether in an ETF or not, its many flaws don’t differ hugely from most of the other regulated assets you own happily\n\nThe integrity of the whole system can be violated. It’s a bit like being comfortable that your Apple shares are secure with a custodian, even though Gru from Despicable Me can make the retail stores disappear with a ray gun.\n\nSpot bitcoin ETFs fail another crucial test too: whether the underlying market can be monitored to a sufficient degree to prevent fraud or manipulation. This is mainly why previous SEC applications were rejected.\n\nSure, blockchains are permanent ledgers. But bitcoin transactions are pseudonymous and can involve multiple addresses. It’s irrelevant that an ETF is transparent if the assets it holds are not.\n\nIn addition, so-called “whales” dominate ownership, with 0.25 per cent of addresses holding 80 per cent of total bitcoin supply, according to Bitinfocharts data. Whoever invented bitcoin is thought to own 1.1mn coins.\n\nThat’s roughly a 20th of the total supply to date — and there are at least five wallets holding around 100,000 coins each, according to Arkham Intel. The scope to move prices, it seems to me, is massive — and that’s before we even consider fraud.\n\nAll that said, the more you think of bitcoin as an investment, whether in an ETF or not, its many flaws don’t differ hugely from most of the other regulated assets you own happily.\n\nRegarding ownership concentration, bitcoin’s pales beside Bernard Arnault’s 48 per cent stake in LVMH, let alone his majority voting share. Mark Zuckerberg owns 13 per cent of Facebook, as does Elon Musk of Tesla. Those guys move prices each time they blink.\n\nAnother reason people say bitcoin has no place in serious portfolios is because it doesn’t exist — just ones and zeros with no intrinsic value. But I own plenty of invisible assets in my other funds that are only worth what others are willing to pay for them.\n\nFor companies in my FTSE 100 fund, for example, the tangible book value only accounts for 45 per cent of the total net asset value. In other words, the majority of the ETF doesn’t exist either — company brand names, goodwill and the like.\n\nThat bitcoin produces no income is also cited as a problem. It is therefore nothing more than a speculative asset. So what? Gold, vintage cars and undeveloped land are the same. By that definition, so is the house or flat you live in.\n\nWhat is more, a fifth of stocks in the S&P 500 did not pay out a dime last year either — some never do, including Facebook, Berkshire Hathaway and Amazon. Finance theory tells us we shouldn’t care about dividends anyway.\n\nThis relates to another concern I don’t share: that bitcoin is therefore impossible to value. You don’t need an income stream to value assets — ask any art dealer. With the same vertical supply curve as a one-off painting — 19.6mn of the maximum 21mn bitcoins are already circulating — demand sets prices.\n\nBesides, what isn’t hard to value? Analysts are routinely wrong about every asset class, while the majority of active fund managers underperform. In Europe, for example, more than 90 per cent of active equity funds now trail their benchmarks over a decade, based on S&P Dow Jones data.\n\nFinally, I like the fact that bitcoin’s correlation with the major asset classes is less than 0.25 — it’s going to be the mad uncle in my portfolio. Sure, it also has an annualised volatility approaching 50 per cent (don’t all relatives?) but as returns are so high, risk/adjusted returns remain attractive.\n\nSo come on SEC, have some fun why don’t you! Or at least be consistent — there are loads of ways my savings can crash into the sea that you already approve of.\n\nThe author is a former portfolio manager. Email: stuart.kirk@ft.com; Twitter: @stuartkirk__"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDQvZGVuaWVycy1hcmUtY3J5cHRvcy1mbGF0LWVhcnRoZXJzLWFzLW1hcmtldHMtZmxhc2gtODMtb2Rkcy1vZi1iaXRjb2luLWV0Zi1hcHByb3ZhbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Will a Bitcoin ETF Be Approved in the U.S.? Some 83% Say 'Yes' - CoinDesk",
        "content": "\"This market will resolve to 'Yes' if any spot Bitcoin ETF receives approval from the SEC by January 15, 2024, 11:59:59 PM ET. Otherwise, this market will resolve to 'No,'\" conditions of the bet say. \"The primary resolution source for this market will be information from the SEC, however, a consensus of credible reporting may also be used.\""
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy80LXN0b2Nrcy13YXRjaC1iaXRjb2luLXJhbGx5LTE0MjgwMDkzNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "4 Stocks to Watch as Bitcoin Rally Continues Into 2024 - Yahoo Finance",
        "content": "After a solid 2023, cryptocurrencies have started this year on a high. Bitcoin (BTC), the world’s most prominent cryptocurrency, has particularly been on a dream run over the past couple of months and the rally is set to gain pace in the coming months as multiple positive developments have given investors’ sentiment a boost.\n\nBitcoin rallied past $43,000 in December 2023, and on Jan 2, it surged past the $45,000 mark for the first time since April 2022. Although the cryptocurrency retreated from its 21-month high, it hovered around $44,200 on Jan 4.\n\nOver the past three months, Bitcoin has rallied more than 61%. The Federal Reserve didn’t hike interest rates in its last three FOMC meetings in 2023 after raising interest rates by 525 basis points, as its aggressive monetary tightening campaign has seen inflation decline sharply.\n\nCooling inflation has also raised hopes that the Federal Reserve will soon end its monetary tightening campaign and start cutting rates this year, which could be as early as in March. Higher interest rates have adverse effects on growth-focused sectors like technology, consumer discretionary and cryptocurrencies.\n\nAlso, investors are optimistic about the imminent approval of a Bitcoin exchange-traded fund (ETF) by the Securities and Exchange Commission (SEC). This approval is expected to have a significant positive impact, providing strong support to the cryptocurrency market.\n\nInvestors are currently looking forward to the potential approval of a spot Bitcoin ETF by the SEC as early as the first half of 2024.\n\nStocks to Watch\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nStory continues\n\nCoinbase Global’s expected earnings growth rate for the current year is 92%. The Zacks Consensus Estimate for current-year earnings has improved 16.7% over the last 60 days. Coinbase currently carries a Zacks Rank #2 (Buy).\n\nNVIDIA Corporation NVDA is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence, and the mining or production of cryptocurrencies.\n\nNVIDIA’s expected earnings growth rate for the current year is 268%. The Zacks Consensus Estimate for current-year earnings has improved 14.4% over the last 60 days. Currently, NVIDIA has a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nPayPal Holdings, Inc. PYPL provides digital wallet services that enable users to purchase, transfer, and sell various cryptocurrencies, such as Bitcoin, Ethereum, Bitcoin Cash and Litecoin. Through PYPL, users can use cryptocurrencies to pay for goods and services from online merchants. Additionally, PayPal’s mobile wallet platform, Venmo, also allows users to engage in cryptocurrency buying and selling activities.\n\nPayPal Holdings’ expected earnings growth rate for the current year is 20.6%. The Zacks Consensus Estimate for current-year earnings has improved 0.2% over the last 60 days. PYPL currently has a Zacks Rank #3 (Hold).\n\nBlock Inc. SQ is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ’s decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors.\n\nBlock has an expected earnings growth rate of 90% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 3.3% over the last 60 days. SQ currently carries a Zacks Rank #3.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\n\nBlock, Inc. (SQ) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjQvMDEvMDQvYml0Y29pbi1ib3VuY2VzLWJhY2stYWJvdmUtNDQwMDAtYW1pZC12b2xhdGlsZS1zdGFydC0yMDI0LWNuYmMtY3J5cHRvLXdvcmxkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin bounces back above $44,000 amid volatile start to 2024 - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin bounces back above $44,000 amid volatile start to 2024: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Ari Redbord of TRM Labs takes a look back at last year's court hearings and trials against some of the biggest names in the industry. He also discusses what to expect in 2024."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS9iaXRjb2luLWxheWVyLTJzLXdoYXQtdGhleS1hcmUtYW5kLWhvdy10aGV5LXdvcmvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Layer 2s: What They Are and How They Work - Ledger",
        "content": "Bitcoin Layer 2s: What They Are and How They Work\n\nBy Mohammad Musharraf\n\nBeginner\n\nSHARE\n\nKEY TAKEAWAYS: — Bitcoin is the world’s first, functional, and fully decentralized ‘peer-to-peer (P2P) money’, and now, the biggest blockchain by market capitalization.\n\n\n\n— To maximize security and decentralization, the network compromised scalability which has caused high fees and slow transaction times as more users joined the network.\n\n\n\n— Bitcoin Layer 2s aim to boost scalability while retaining the base layer’s decentralization and security standard, unlocking a better user experience, and new avenues for Bitcoin-powered innovations.\n\nSince its inception in 2008, Bitcoin (BTC) has captured the attention of individuals, governments, and traditional finance institutions alike. As the first decentralized cryptocurrency and the largest blockchain by market share, Bitcoin’s status as the flagship cryptocurrency is undeniable.\n\nHowever, Bitcoin’s growth has not been all smooth sailing, as the network’s increased popularity has led to severe network congestion. At peak times, excessive fees and high wait times have made BTC unsuitable for small day-to-day transactions. These issues have laid bare the dire need for a scaling solution for Bitcoin to accommodate the increased pressure on the network.\n\nIn this article, you will learn about what Bitcoin Layer 2s are, how they work, their key use cases, and some of the leading Bitcoin Layer 2 networks today.\n\nWhat is Bitcoin Layer 2?\n\nLayer 1 and Layer 2 are terms that help distinguish between different networks within a single blockchain ecosystem. A Layer-1 network – which can also be referred to as a “parent chain” or “mainnet” in different contexts – is the fundamental blockchain. By contrast, Layer 2 solutions are secondary networks built on top of Layer 1’s architecture.\n\nThe purpose of a Layer 2 solution is to reduce the load on Layer 1 by bypassing its technical limitations while taking advantage of its strengths. Thus Bitcoin Layer 2s are networks that run on top of the main blockchain, primarily to increase its capacity to process transactions, but they can also increase usability in some other ways.\n\nThink of Bitcoin as a professor with too many exams to grade (transactions to process. A layer 2 blockchain is an effective teaching assistant that does a bulk of the work grading the papers, before returning them to the professor to be officially logged.\n\nIn the same way, Layer 2 processes transactions off-chain, before sending them back to be added to the Bitcoin blockchain.\n\nWhy Do Bitcoin Layer 2s Matter?\n\nIncreasing Scalability\n\nThe Bitcoin network takes about 10 minutes to finalize a single set of transactions – only seven transactions per second (TPS) on average.\n\nThis clogs the network during peak traffic and spikes transaction fees. For instance, in April 2021, users paid over $62 per transaction. While this may not be an issue for large transactions, it quickly becomes impractical for micropayments and point-of-sale transactions.\n\nWhat’s more, scaling the Bitcoin blockchain itself is effectively not an option, as this would require a trade-off in security or decentralization, per Vitalik Buterin’s concept of the Blockchain Trilemma.\n\nIn essence, The Blockchain Trilemma is the idea that any blockchain network can only optimize for two out of three main pillars: decentralization, security, and speed/scalability. Therefore, as the Bitcoin network settled on the former two pillars, it had to compromise on scalability.\n\nThis wasn’t an issue when transaction volumes were low. But as more users worldwide adopted Bitcoin, the network’s inability to scale caused performance bottlenecks. Users experienced this network congestion in the form of high fees and long transaction times\n\nBitcoin Layer 2s improve scalability by processing transactions off-chain to unburden the Layer 1.\n\nIncreasing Utility\n\nGiven its purpose as a digital currency, Bitcoin’s design only caters to two specific use cases. Namely, it enables censorship-resistant, trustless P2P transactions, and it provides the tech stack for Bitcoin to remain a deflationary store of value.\n\nOf course, this limited core functionality is one of Bitcoin’s key features, not a bug. It is part of what makes the network so robust and tamper-resistant.\n\nOn the other hand, this lack of functionality can make it difficult for developers to innovate and build upon Bitcoin’s revolutionary technology stack by drastically expanding the functionality of the network, Bitcoin Layer 2s provide a viable way to unlock additional use cases. By utilizing Layer 2 networks, Bitcoin users can take advantage of web3 staples like smart contracts, DeFi services, and digital assets/NFTs\n\nSo that explains what benefits Layer 2s intend to offer Bitcoin users, but how exactly do they accomplish this?\n\nHow Do Bitcoin Layer 2s Work?\n\nWhile the overall purpose of Layer 2s is the same, they differ in the way they help the Bitcoin network process transactions\n\nState Channels\n\nThese are Layer 2 solutions that can help to enable users to bypass high transaction fees. In this method, users create end-to-end encrypted ‘channels’ to send and receive payments. These channels work as micro-ledgers that maintain records on all transactions that occur within them.\n\nState Channels keep all transactions within them off-chain, only reporting the opening and closing balance of participants to the main network when the channel closes. Thus, participants can make repeated transactions with individuals or businesses without having to pay high fees for every single transaction.\n\nRollup Chains\n\nBlockchain Rollups are a Layer 2 solution that takes numerous transactions off of Layer 1 onto a separate network, consolidates them into a single piece of data, and sends that single piece of data back to be added to Layer 1.\n\nIt’s important to note that there are two kinds of Blockchain rollups – Optimistic and ZK. In short, Optimistic rollups assume that all of the transactions bundled together are valid unless proven otherwise. In contrast, ZK rollups produce a single cryptographic proof called “validity proof,” which attests to the validity of the transactions bundled together.\n\nSidechains\n\nA sidechain is an independent blockchain with its own consensus mechanisms that connect to Layer 1 via a two-way bridge. This bridge is vital as it is what allows the transfer of assets between chains. Due to effectively being its blockchain, a sidechain can support other Layer 2 solutions on top of it.\n\nTop Bitcoin Layer 2s\n\nInnovators and developers in the Bitcoin ecosystem have developed several Layer 2 solutions over the years, exploring the concepts and avenues discussed so far.\n\nHere’s an overview of some of the best and most popular Bitcoin Layer 2s as of November 2023.\n\nThe Lightning Network\n\nLaunched in 2018, the Lightning Network uses ‘state channels’ to enable microtransactions on top of the Bitcoin Layer-1.\n\nTo use the Lightning Network, participants send and receive BTC payments through encrypted P2P channels that are essentially smart contracts. To illustrate, to send 0.1 BTC to your friend, , you’d create a channel with them and fund it with the required amount. And once all the transactions are complete, you can close the channel. The system stays efficient by only sending the channel’s opening and closing balances to the Bitcoin network.\n\nRootstock (RSK)\n\nRootstock (RSK) is a sidechain that pioneered smart contracts on the Bitcoin blockchain. It works through something called a two-way peg. To explain, when a user sends Bitcoin to Rootsock, it becomes a locked-up, smart Bitcoin on Rootsock (RBTC) in the user’s RSK wallet. Sending RBTC in the other direction allows the user to withdraw their Bitcoin from the regular network.\n\nRootstock claims to be able to process up to 300 TPS this way, a drastic improvement in Bitcoin’s transaction speed. The platform is also notable for its compatibility with Ethereum Virtual Machine (EVM). To clarify, EVM is a virtual computer responsible for executing smart contracts and updating the state of the Ethereum blockchain. In other words, Rootstock boasts compatibility with the entire ecosystem of Ethereum dApps.\n\nStacks Protocol\n\nStacks has become one of the top-performing Bitcoin L2s since going live on the mainnet in 2018 as Blockstack. The protocol enables self-executing smart contracts that you can deploy over Bitcoin without implementing a fork. To do this, the protocol uses microblocks for speed and a unique Proof-of-Transfer (PoX) mechanism to tie them to blocks on Layer 1. It provides an accessible, easy-to-use, plug-and-play method for running smart contracts and decentralized applications within the Bitcoin ecosystem.\n\nLiquid Network\n\nLiquid Network is a Bitcoin Layer 2 sidechain that runs on the open-source Elements blockchain platform. The network has its own native asset, Liquid (L-BTC), and is governed by a distributed federation of Bitcoin companies, exchanges, and other stakeholders.\n\nMuch like Rootstock, the Liquid Network uses a two-way peg to convert BTC to L-BTC and vice versa.\n\nRisks of Using Bitcoin Layer 2s\n\nAlthough most existing Layer 2s inherit a high degree of security and reliability, they are not as battle-tested as Bitcoin yet when it comes to robustness. As somewhat independent networks, they introduce a new set of risks and challenges.\n\nFor example, in 2022, Lightning users experienced a unique ‘unattributed payment routing’ failure due to a bug. They ended up interacting with faulty nodes as a result, without being aware of the problem for a long time.\n\nMoreover, Federated sidechains like the Liquid Network are still in their nascent stages of development and market adoption. Unlike Bitcoin, which has 1000s of miners worldwide, they have much fewer nodes (15, in Liquid’s case) signing and confirming transactions. That is to say that Bitcoin Layer 2s can often be more centralized than the main network.\n\nBTC Layer 2s: A New Way to Explore Bitcoin\n\nLayer 2 solutions take all the revolutionary benefits of Bitcoin technology and build upon it, drastically improving the network’s transaction processing capabilities. Though they certainly aren’t a perfect solution, they do address the problem at hand while retaining the decentralized security that has been instrumental to Bitcoin’s proliferation.\n\nSo what are you waiting for? The exciting world of Bitcoin Layer 2s is waiting to be explored. Thanks to Ledger Live, it’s never been easier to explore all that Bitcoin Layer 2 networks have to offer. As always, the industry-leading security of the Ledger ecosystem means that you can safely store your own private keys and have full access to both your Bitcoin and Layer 2 native tokens. Not to mention that you can now create an account on Stacks Protocol, directly from Ledger Live."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDUvYXJ0aHVyLWhheWVzLWZvcmVzZWVzLTMwLWJpdGNvaW4tY3Jhc2gtYW1pZC12aWNpb3VzLXdhc2hvdXQtaGVyZXMtd2h5L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDUvYXJ0aHVyLWhheWVzLWZvcmVzZWVzLTMwLWJpdGNvaW4tY3Jhc2gtYW1pZC12aWNpb3VzLXdhc2hvdXQtaGVyZXMtd2h5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Arthur Hayes Foresees 30% Bitcoin Crash Amid 'Vicious Washout.' Here's Why - CoinDesk",
        "content": "\"Bitcoin initially will decline sharply with the broader financial markets but will rebound before the Fed meeting,\" Hayes said. \"That is because bitcoin is the only neutral reserve hard currency that is not a liability of the banking system and is traded globally.\""
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDQvZXhwZWN0ZWQtZmVkLXJhdGUtY3V0cy1zdXBwb3J0LWJ1bGwtY2FzZS1pbi1iaXRjb2luLWJ1dC10aGVyZS1pcy1hLWNhdGNoL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDQvZXhwZWN0ZWQtZmVkLXJhdGUtY3V0cy1zdXBwb3J0LWJ1bGwtY2FzZS1pbi1iaXRjb2luLWJ1dC10aGVyZS1pcy1hLWNhdGNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Expected Fed Rate Cuts Support Bull Case in Bitcoin, But There Is a Catch - CoinDesk",
        "content": "\"This sequence often occurs because the Fed tends to overshoot by raising and maintaining high-interest rates for longer than necessary, inadvertently stifling economic growth. Rate cuts usually come into play only when the economy is visibly declining and unemployment is on the rise. By that point, a recession is typically inevitable,\" Piper Sandler said in a note to clients on Jan. 2."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcwNTQ4L21hcmF0aG9uLWJpdGNvaW4tcHJvZHVjdGlvbi1kZWNlbWJlci0yMDIz0gFRaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjcwNTQ4L21hcmF0aG9uLWJpdGNvaW4tcHJvZHVjdGlvbi1kZWNlbWJlci0yMDIz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Marathon's bitcoin production growth surges, bolstered by high fees - The Block",
        "content": "In a bitcoin production and mining operation update published yesterday, Marathon Digital Holdings announced that it produced a company-record 1,853 bitcoins ($81.2 million at current prices) last month.\n\nThe firm mined 12,852 bitcoins ($563.4 million) last year, more than tripling its mining output from 4,144 BTC in 2022. Marathon also increased its average operational hash rate by 18% month-over-month to 22.4 EH/s.\n\n“In December, we increased our energized hash rate 4% to 24.7 exahashes and extended our lead as the largest publicly traded bitcoin miner in North America,” Marathon’s chairman and CEO, Fred Thiel, said in a press release. “We continue to target 30% growth in energized hash rate in 2024 and with the recently announced acquisition of the two sites from Generate Capital, which is expected to close in January 2024, we expect to reach 50 exahashes in the next 18 to 24 months.\"\n\nMarathon attributes its production growth directly to higher transaction fees on the Bitcoin network. \"MaraPool collected more than 380 BTC in transaction fees or 22% of BTC production, up from 12% of production last month,\" the company noted.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nMarathon holds over 15,000 bitcoins as of Dec. 31, 2023."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nb2xkbWFuLWdzLWNvbmlkZXJlZC1wb3RlbnRpYWwtYXAtMTc0MjAwNjAxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Goldman (GS) Conidered as Potential AP for Spot Bitcoin ETF - Yahoo Finance",
        "content": "The Goldman Sachs Group, Inc. GS is being considered to become the authorized participant (AP) for the spot Bitcoin exchange-traded fund (ETF), which Grayscale and BlackRock Inc. BLK are planning to launch.\n\nApart from GS, JPMorgan Chase & Co. JPM is being considered as a potential AP for the ETF. This was first reported by Coindesk.\n\nBLK became the first asset manager to file for the spot Bitcoin ETF in June 2023, paving the way for a wave of filings by other asset managers like Fidelity, Invesco and WisdomTree, Inc. WT.\n\nThe U.S. Securities and Exchange Commission (SEC) is expected to announce its decision on the trading of spot bitcoin ETF’s latest by Jan 10, 2024. To date, the approved cryptocurrency ETFs in the United States are those that include future contracts on Bitcoin and Ethereum. The pending approval from SEC will provide investors direct exposure to the price of cryptocurrency without having to purchase them.\n\nBlackRock also filed for a spot Ethereum ETF named iShares Ethereum Trust in November 2023. The Ethereum ETF, if approved, will be the first of its kind in the United States.\n\nWhile BLK is expanding its cryptocurrency exposure, JPM has been undertaking measures to subdue them. In September 2023, JPM stated that its retail bank, Chase, in the U.K. had decided to restrict customers’ access to cryptocurrency-related transactions due to increased scams and fraud cases. Nonetheless, it has been exploring the concept of launching a blockchain-based deposit token for customers, provided it receives the required regulatory approval.\n\nJPMorgan and Goldman as APs for spot Bitcoin ETF would be entrusted with the responsibility of tracking the ETF share price with underlying assets of fund. The companies will be required to create and redeem the shares of ETF, thus supplying the required liquidity.\n\nBeside this, Goldman has been focusing on growth in its core strengths of investment banking and trading since it has been pulling back from its consumer lending business. Such growth moves by GS are necessary to support its top-line expansion.\n\nStory continues\n\nPer an internal memo circulated last year, GS had disclosed changes in its senior executives’ positions as it intended to expand its operations in the private credit space. It further aims to double the size of business targeting assets worth $110 billion under management over the medium term.\n\nFurther, it has been aiming to expand its offerings across the high growth countries. In December 2023, Bloomberg reported that GS was planning to enhance its credit business in India as it is one of the fastest-growing economies in the world. Per Sonjoy Chatterjee, chairman and chief executive officer of Goldman in India, the bank intends to broaden the range of its loan offerings in this country.\n\nThe firm also desires to obtain a license to boost its currency trading that would permit it to deal with counterparties like financial investors, equity customers or a corporate customer. This apart, GS believes that deal-making activity in the country is likely to receive a boost.\n\nGoldman’s shares have gained 16.9% over the past six months compared with the industry’s 11.3% growth.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nGS presently carries a Zacks Rank #4 (Sell).\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\n\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nWisdomTree, Inc. (WT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyNC0wMS0wNS9zcG90LWJpdGNvaW4tZXRmcy1jbGVhci1tYWpvci1odXJkbGUtdmlkZW_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Watch Spot Bitcoin ETFs Clear Major Hurdle - Bloomberg",
        "content": "00:00\n\nOnce this is approved by the SEC, how quickly will it take before we actually see these ETFs trading? So there's two big hurdles here. The first one, of course, which we've reported right now, is that the SEC has told filers and issuers to basically submit their final 19 before. Is that just one step you think we're still looking out for? Is the amended s ones basically that still has to be approved and of course these 19 before for need to be approved as well. But what we're hearing from our sources is that basically we're getting down to the finish line here, that they really don't have any substantial comments, any substantial feedback yet. So as James alluded to, what we could see in the next couple of hours is these final 19 before is being submitted. What's important to note here is that it's unclear whether basically all of the filers have heard this, whether we're talking about some whether we're talking about all 13, because this is a very crowded race at this point. It's a very crowded race. But at the same time, the SEC doesn't want to be playing favorites necessarily and giving any one issue or a, you know, lead an unnecessary lead. What is what does your reporting show in terms of how they're likely to approve all these applications? Exactly. That's exactly what we've heard as well, because that's what they did with the Bitcoin Futures ETFs. So it's launched a little bit over two years ago. Of course, remember, ProShares got the lead start there. They have .8 billion in assets, pretty much identical fund from Valkyrie launched a few days later. They have $34 million in assets, so they're trying to avoid a repeat of what we saw there. So again, the the thinking and the consensus in the market is that this is a common clock, that they'd like to approve everyone all at once here. Whether everyone will be ready in time, all of these issuers, is the outstanding question. Well, if you had to think about who would be ready and not ready, let's kind of go through the stack for a minute, because one matters maybe a little more than others, given there's already money in play that is gbtc, that is grayscale Bitcoin trust, the discount has narrowed to only 6%. James How much is at risk for their investors if they are not burst out of the gate? Honestly, I don't think much is at risk because even if they're not first out of the gate, ultimately they are going to convert and that discount is going to be gone. Obviously it's more at risk not for the investors but for grayscale themselves, because if they're out in the first wave, they're almost de facto going to be the leader. We'd like to look at this market as it tends to be winner take most, and the people with the most volume tends to be get more volume and dominate the space a little bit. Again, it's winner take most. So there's plenty of room for other people to be successful. But if they go out in the first day, they're at a pretty hefty head start at over 26 billion in assets. They trade over $350 million a day, both in assets and trading volume. They'd be in the top one 2% of ETFs in the U.S. if this were an ETF already. So that's as big of a head start as you could possibly get. So it's possible their their situation is a little bit different from every other issuer because of the way that they filed the lawsuit. And they're filing what's known as an S3 rather than S1. There's some slight differences. So if there is a difference, it might delay them a tiny bit, but I think they're likely to go out in the first day because if they're not out in the first day, or at least within a day or two of other ones launching, there's probably going to be another lawsuit. And James, what's curious here is just how much attention they're paying to every single filing, every single update turns into this market moving event. Is there any blueprint for that at this? Have you seen anything like this? I mean, we've had new asset classes come to the ETF wrapper before, but I can't remember when it has received this much attention. Yeah, no, nothing. This is a one of one situation. We've never seen this much interest from people that don't really know much about ETFs or traditional finance for that matter. People have become legal experts. I mean, I knew a lot of this stuff from a higher level. I knew some of it, but I've had to get way deeper in the weeks because our clients and just people in general are demanding to understand every step of the process of what's going on here. And it makes sense really. I mean, people have been trying to launch this thing for ten years. There's politicians involved, there's deadlines, there's billions of dollars at stake like this is this is a big deal. And there's a reason there's getting a lot of coverage and interest from both a media and asset allocation perspective. So once the FCC does approve the Bitcoin ETFs, and that's a, you know, when not if kind of question and we've been deliberating on the when, how do investors figure out which Bitcoin ETF they they want to buy? I mean, are we going to have a Super Bowl 2024 full of Bitcoin ETF commercials? I wouldn't count out Super Bowl commercials for sure. I mean, we've already seen a whole bunch of issuers with their own commercials. I mean, we have vaneck hashtags, bitwise. Everyone is doing different things to market their their own products. And like I said, it tends to be winner take most, not winner take all. So right now we're looking at 11 issuers. I don't know if there's room for 11 different spot Bitcoin ETF products, but there's definitely room for multiple. So some people are only going to care about the fee they want the cheapest fee. That's how they're going to get exposure. Are. Some are going to care about the brand name. There's undoubtedly going to be advisers out there that just trust BlackRock and that's what they're going to use or fidelity or what have you. Some people are going to stick with grayscale because they've been using them. Some might want a more crypto centric offering from somebody like Bitwise or Hashed X or Valkyrie. And then there's people in the middle like Vaneck and Invesco is partner with Galaxy, so there's no way to know how this is going to play out. One of the other things I'm focused on is the issue a bunch of the ETFs out there now, you don't actually see the on chain address, so you can't see exactly where the Bitcoin is. Maybe some of the bigger issuers aren't going to release those addresses. So you can check it yourself to see if the Bitcoin is there. But some of these smaller issuers, I, I'd be shocked if we don't see a handful of these ETFs just saying here you can double check where it whether or not we have this Bitcoin that we say we have because that's a huge concern in the Bitcoin world. They think it's going to be paper Bitcoin and not have it actually have exposure to bitcoin. But I can pretty much guarantee you some of these filers are going to publish their their Bitcoin addresses, so anyone in their mother can go on and look to make sure that Bitcoin is actually there when they say."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTA0L2JpdGNvaW4tYnRjLXJlc3VtZXMtYXNjZW50LXdpdGgtZXRmLWFwcHJvdmFsLWV4cGVjdGF0aW9ucy1yZWNvdmVyaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Resumes Ascent With ETF Approval Expectations Recovering - Bloomberg",
        "content": "Bitcoin has turned positive again during a roller-coaster start to the year, recouping a portion of losses from a flash crash Wednesday, with investors shaking off concern that US regulators won’t authorize exchange-traded funds to directly hold the digital-asset.\n\nThe largest cryptocurrency tumbled as much as 9.2% yesterday, or the most on an intraday basis since November 2022, after Matrixport analyst Markus Thielen wrote in a note that he expects the Securities and Exchange Commission to reject all Bitcoin ETF proposals this month. Bloomberg Intelligence analysts estimate that there is about a 90% probability the SEC will approve the ETFs by Jan. 10."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzA1L3ZhbmVjay10by1kb25hdGUtNS1vZi1wcm9maXRzLWZyb20tYnRjLWV0Zi10by1iaXRjb2luLWNvcmUtZGV2ZWxvcGVycy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8wNS92YW5lY2stdG8tZG9uYXRlLTUtb2YtcHJvZml0cy1mcm9tLWJ0Yy1ldGYtdG8tYml0Y29pbi1jb3JlLWRldmVsb3BlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "VanEck to Donate 5% of BTC ETF Profits to Bitcoin Core Developers - CoinDesk",
        "content": "While this is largely welcomed from the incumbent crypto community, there will also be friction in some quarters. Therefore providers like VanEck will be keen to demonstrate some commitment to the core Bitcoin industry by giving back to developers and others."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3Lm5lcmR3YWxsZXQuY29tL2FydGljbGUvaW52ZXN0aW5nL2JpdGNvaW4taGFsdmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Halving Explained - NerdWallet",
        "content": "NerdWallet, Inc. is an independent publisher and comparison service, not an investment advisor. Its articles, interactive tools and other content are provided to you for free, as self-help tools and for informational purposes only. They are not intended to provide investment advice. NerdWallet does not and cannot guarantee the accuracy or applicability of any information in regard to your individual circumstances. Examples are hypothetical, and we encourage you to seek personalized advice from qualified professionals regarding specific investment issues. Our estimates are based on past market performance, and past performance is not a guarantee of future performance.\n\nWe believe everyone should be able to make financial decisions with confidence. And while our site doesn’t feature every company or financial product available on the market, we’re proud that the guidance we offer, the information we provide and the tools we create are objective, independent, straightforward — and free.\n\nSo how do we make money? Our partners compensate us. This may influence which products we review and write about (and where those products appear on the site), but it in no way affects our recommendations or advice, which are grounded in thousands of hours of research. Our partners cannot pay us to guarantee favorable reviews of their products or services. Here is a list of our partners."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzJjZDQ1ZDRiLWMxYWUtNGYzMC1iOWFmLTg4ZjBiY2NhMjFmNdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Coinbase valuation rests on bitcoin ETF approval - Financial Times",
        "content": "Print this page\n\nCoinbase was the financial dark horse of 2023. The crypto trading platform’s near 400 per cent surge in stock price trounced tech peers, exceeding even Nvidia’s 249 per cent gain.\n\nMuch of that rise can be attributed to excitement about positive regulatory action. Speculation is rife that the US Securities and Exchange Commission will soon approve exchange traded funds that invest in bitcoin directly. Coinbase stands to benefit by acting as custodian of bitcoins held by ETF funds.\n\nBitcoin cheerleaders hope that such vehicles will broaden the investor base and fuel a price rise. Bitcoin prices rose 160 per cent in 2023. This week they climbed above $45,000 for the first time since April 2022.\n\nYet even as investors pile into Coinbase shares and bitcoin prices rise, trading activity on the platform remains relatively subdued. The number of monthly transacting users stood at just 6.7mn at the end of the third quarter, down from 8.5mn a year ago. Trading volume slid by more than 50 per cent over the period, while total transaction revenue was a fifth lower.\n\nFourth-quarter results, due in February, should show an uptick. But this has already been baked into Coinbase’s valuation. Despite seven consecutive quarters of losses, the company trades on 16 times revenue, up from 1.6 times a year ago. Larger and more profitable exchange operators Cboe and the London Stock Exchange are on 5 times and 6 times respectively.\n\nTo its credit, Coinbase has diversified its revenue. Half now comes from subscription and services, which include its custody services, interest-earning assets and staking. Still, its fortunes are tied to bitcoin’s wild swings and regulatory attitudes towards crypto — two factors outside its control.\n\nA decision on regulatory approval for spot bitcoin ETFs could be delayed. In the meantime, Coinbase is in its own fight with the SEC, accused of illegally running an unregistered securities exchange. It has failed to push the SEC to clarify whether digital assets are securities. Having enjoyed a surprising resurgence from a tumultuous 2022, Coinbase could struggle to hold on to its rich valuation this year."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zcGVjdWxhdGlvbi1zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFsLTA1MzY0MTcxNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Speculation on Spot Bitcoin ETF Approval Escalates on Potential January 5 Approval - Yahoo Finance",
        "content": "Speculation on Spot Bitcoin ETF Approval Escalates on Potential January 5 Approval\n\nRumors that the U.S. Securities and Exchange Commission (SEC) is set to approve a spot Bitcoin exchange-traded fund (ETF) on January 5 reached a high on social media, fueled by cryptic tweets and claims.\n\nA tweet from Grayscale's chief legal officer, Craig Salm, stating that he was \"just filling out some forms,\" and a widely shared tweet from TechCrunch crypto reporter Jacquelyn Melinek citing sources \"extremely close to the matter\" that multiple ETFs approval would happen on Friday have added to the excitement.\n\nThe hashtag #ETFBitcoin and the term \"Bitcoin ETFs\" are currently trending on Twitter. However, Bitcoin (BTC) dropped sharply from $44,700 to $43,200 after its strong recovery from the flash crash on January 3.\n\nSome analysts have cautioned against getting too excited, saying that approval is more likely to come next week. Bloomberg ETF analyst James Seyffart described the speculation around a January 5 approval as \"noise\" and said he still expects approval to arrive between January 8 and January 10.\n\nSenior Bloomberg ETF analyst Eric Balchunas says the SEC is currently providing final comments and that issuers will soon file their final 19b-4 and S-1 forms soon afterward. Both forms need to be approved by the SEC before an ETF can start trading, though an approved 19b-4 form is required for the spot Bitcoin ETF to be effectively approved.\n\nThe spot Bitcoin ETF will be the first in the United States, making its potential approval highly anticipated by crypto market investors and traders. There are a total of 14 issuers applying for a spot Bitcoin ETF, including BlackRock, Valkyrie, ARK Invest & 21 Shares, Bitwise and Fidelity.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMDQvYml0Y29pbi1yaXNlcy1hcy1pdHMtdm9sYXRpbGUteWVhci1jb250aW51ZXMtYWhlYWQtb2YtYW4tZXhwZWN0ZWQtZXRmLWFwcHJvdmFsLXNvb24uaHRtbNIBfGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDI0LzAxLzA0L2JpdGNvaW4tcmlzZXMtYXMtaXRzLXZvbGF0aWxlLXllYXItY29udGludWVzLWFoZWFkLW9mLWFuLWV4cGVjdGVkLWV0Zi1hcHByb3ZhbC1zb29uLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin rises as its volatile year continues ahead of an expected ETF approval - CNBC",
        "content": "Bitcoin rose on Thursday, recovering some of its losses from the previous day, when the cryptocurrency sold off on concerns about the potential of a bitcoin exchange-traded fund approval that many expect as soon as next week.\n\nThe flagship cryptocurrency was last higher by about 3% at $43,870.01, according to Coin Metrics. On Wednesday it fell as much as 6% as short-term traders speculated that a bitcoin ETF would not be approved by the U.S. Securities and Exchange Commission and liquidated overleveraged positions.\n\n\"This bitcoin bounce comes after a healthy wipeout of leveraged positions,\" said Sam Callahan, lead analyst at bitcoin services firm Swan Bitcoin. \"The bounce is likely related to investors positioning themselves for the imminent approval of multiple spot Bitcoin ETFs, which could be a large catalyst for bitcoin's price in 2024 and for many years to come.\""
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8wNS9maW5hbC1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbi1maWxpbmdzLWdldC1wb3N0ZWQtYnktbWFqb3ItdXMtZXhjaGFuZ2VzL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8wNS9maW5hbC1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbi1maWxpbmdzLWdldC1wb3N0ZWQtYnktbWFqb3ItdXMtZXhjaGFuZ2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Final Bitcoin ETF Application Filings Get Posted by Major U.S. Exchanges - CoinDesk",
        "content": "This filing \"is another important step towards uplisting GBTC as a spot bitcoin ETF,\" Grayscale spokeswoman Jenn Rosenthal said in a statement, referring to the company's bitcoin trust that it wants to turn into an ETF. \"At Grayscale, we continue to work collaboratively with the SEC, and we remain ready to operate GBTC as an ETF upon receipt of regulatory approvals.\""
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS90b3BpY3MvZWNvbm9taWNzLWFuZC1yZWd1bGF0aW9uL2JpdGNvaW4tc3BvdC1mdXR1cmVzLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Spot Vs Futures ETFs: What's the Difference? - Ledger",
        "content": "Bitcoin Spot Vs Futures ETFs: What’s the Difference?\n\nBy Gaurav Roy\n\nRead 8 min Beginner\n\nSHARE\n\nKEY TAKEAWAYS: — An exchange-traded fund (ETF) is a financial instrument that allows investors to gain exposure to a group of assets.\n\n\n\n— Though some types of ETFs exist for Bitcoin, the US Securities and Exchange Commission (SEC) has never approved a Spot ETF – an ETF that specifically tracks the current market price of Bitcoin.\n\n\n\n— Should the SEC approve one or more of the existing Bitcoin Spot ETF applications after the January 10th deadline, it would be a major milestone for Bitcoin, as many expect the existence of a Bitcoin Spot ETF to boost Bitcoin adoption in the traditional finance sector.\n\nIn June 2023, Blackrock – the world’s largest asset manager – shook up the world of cryptocurrency when it applied with the US Securities and Exchange Commission (SEC) to launch a Bitcoin Spot ETF.\n\nSince then, at least 12 other notable financial institutions have filed applications for their own Bitcoin Spot ETFs, including firms such as Grayscale Investments, Fidelity, and Invesco. The months following the news have seen Bitcoin’s price resurge, from hovering around $26,000 in June, to close to around $45,000 as of the first week of January 2024.\n\nWhile there are some Bitcoin ETFs currently available in the US market, there are key differences between those and a potential Bitcoin Spot ETF. This article will clarify the difference between a Bitcoin Futures ETF and a Bitcoin Spot ETF to help you understand the advantages, disadvantages, and key features of both, as well as explain why they are important for the future of Bitcoin and crypto at large.\n\nWhat is an ETF?\n\nAn Exchange-Traded Fund, or ETF, is a kind of financial instrument. Specifically, an ETF is a pooled investment fund that is tradeable on an exchange, hence the name. Think of an ETF as a single group of investments (stocks, bonds, etc) that tracks the performance of a group of assets. This allows an investor to gain exposure to certain kinds of assets, without having to trade individual assets.\n\nAs an example, take the Vanguard Total Stock Market Index Fund (VTI). This is an ETF that effectively tracks how the overall US stock market is doing. If an investor believed that the stock market as a whole was going to rise, they could buy shares of this ETF rather than individual stocks. This can save investors a ton on fees, while keeping their investment portfolios diverse, thus mitigating risk.\n\nWhat is a Bitcoin ETF?\n\nA Bitcoin ETF, as you might imagine, is an ETF that tracks the price of Bitcoin (BTC). In other words, when you invest in a Bitcoin ETF, you’re basically betting on whether Bitcoin’s price will rise or fall.\n\nBitcoin ETFs make it possible to get exposure to Bitcoin without actually having to buy it directly. This could be particularly advantageous to investors who are interested in Bitcoin but have previously abstained from buying, due to its questionable regulatory status and/or the complexity of buying Bitcoin and storing it securely.\n\nIn the U.S., you can already invest in what is called a Bitcoin Futures ETF. This class of ETF essentially allows investors to bet on the future price of Bitcoin. A Bitcoin Spot ETF would work differently, however, as it would instead focus on the current price of Bitcoin. This might not seem like an important distinction, but it is very significant for investors, which is why these Bitcoin Spot ETF applications have drummed up so much excitement in recent months.\n\nSo what exactly is the difference between the two kinds of ETF, how do they work, and what makes a Spot ETF a bigger deal than a Futures ETF to many investors?\n\nWhat is a Bitcoin Futures ETF?\n\nA Bitcoin Futures ETF tracks the price of Bitcoin futures contracts. To explain, a Bitcoin futures contract is an agreement to buy or sell BTC at a predefined price, at a later date. If more people expect Bitcoin’s price to rise, the value of the contract could be higher than BTC’s spot price. On the other hand, if more people are betting on the price of BTC to fall, the value of the futures contract could be lower than the spot price.\n\nNotably, the prices of bitcoin futures and the market price of Bitcoin tend to diverge based on the prevailing settlement of futures traders. In other words, if more people expect Bitcoin’s price to rise, the value of the contract could be higher than BTC’s real-time price on crypto markets. On the other hand, if more people are betting on the price of BTC to fall, the value of the futures contract could be lower than the market price.\n\nThe ProShares Bitcoin Strategy ETF became the first Bitcoin Futures ETF available in the US with its launch in October 2021. Other major Bitcoin Futures ETFs include those from VanEck and Valkyrie.\n\nAdvantages of a Bitcoin Futures ETF\n\nEliminates self-custody concerns\n\nBitcoin Futures ETFs give traders a degree of exposure to Bitcoin’s price movements without having to buy or manage the actual cryptocurrency. This means that the trader doesn’t have to concern themselves with opening accounts on exchanges or securing their crypto assets.\n\nWhat’s more, these products operate within a regulated environment, meaning they adhere to the standards set by financial regulatory bodies.\n\nEnables speculation on future price movements\n\nAs this kind of ETF invests in Bitcoin futures contracts, it allows investors to speculate on the future price movements of Bitcoin without ever having to own it directly.\n\nDisadvantages of a Bitcoin Futures ETF\n\nLess direct exposure\n\nThe biggest drawback of a Bitcoin futures ETF is that the fund issuing the ETF does not hold Bitcoin directly. Rather, the fund holds positions in the Bitcoin futures market. This means that investors in a Bitcoin Futures ETF merely own shares in a fund that invests in Bitcoin futures contracts.\n\nNot only might this make a futures ETF unappealing to those wanting direct exposure to Bitcoin, it also introduces counterparty risk. To clarify, because a Bitcoin futures contract is an agreement to trade Bitcoin at a later date, it is possible that when that time comes, the buyer or seller may fail to uphold their end of the deal.\n\nPrice divergence\n\nAdditionally, because the price of futures can diverge from the spot price, it can adversely affect the performance of the ETF. That is to say that the ETF may not always move in tandem with the price of BTC.\n\nReduced returns due to fees\n\nThere’s also the matter of additional management fees that could reduce your returns. This may make owning a Bitcoin Futures ETF more expensive than simply trading Bitcoin futures on a crypto exchange.\n\nFor some investors, these drawbacks have made investing in a Bitcoin futures ETF untenable. This is partly why there is so much excitement for a potential spot Bitcoin ETF which, as you will see, offers much more direct exposure to Bitcoin.\n\nWhat is a Bitcoin Spot ETF?\n\nA Bitcoin Spot ETF aims to track Bitcoin’s “spot” price. Basically, the spot price of an asset is the real-time price it is trading for in the marketplace. So, in effect, a Bitcoin Spot will be worth exactly what Bitcoin is trading for in crypto markets.\n\nA Bitcoin Spot ETF holds Bitcoin as its underlying asset. This means that, in contrast to a futures ETF, the fund manager who provides the ETF actually owns and manages a large pool of BTC. To do this, the fund may collaborate with a third-party crypto custodian to manage the asset securely.\n\nAll that is to say, when you buy shares in a Bitcoin Spot ETF, you’re essentially buying a slice of actual Bitcoin without directly holding the cryptocurrency yourself.\n\nAs mentioned previously, there are currently no Bitcoin Spot ETFs in the US market. However, they do exist in other countries. For example, Spot Bitcoin ETFs have existed on the Canadian Stock Exchange for years.\n\nSince Blackrock launched its application, at least 12 other applications have come under SEC review. These applications – Blackrock’s in particular – have garnered widespread attention in the crypto world for a few reasons.\n\nWhile the SEC has so far rejected all applications for cryptocurrency spot ETFs due to concerns over market manipulation, Blackrock has had an astounding 575 ETFs approved by the SEC. To date, only one of their applications has ever been denied.\n\nThe fact that an institution with the record and reputation of Blackrock is putting its weight behind Bitcoin Spot ETFs has many proponents confident that at least one if not several Bitcoin Spot ETFs will be approved by the SEC’s deadline of January 10th, 2024\n\nAdvantages of a Bitcoin Spot ETF\n\nThere are several reasons why the cryptocurrency industry has been a big proponent of a Bitcoin Spot ETF.\n\nDirect price tracking\n\nA spot ETF invests in Bitcoin at its spot price, meaning the fund holds BTC and directly tracks the price of the digital asset. This means the price of the ETF keeps in line with the actual BTC price.\n\nSimple On-Ramp\n\nBitcoin Spot ETFs allow institutional and individual traders to gain exposure to Bitcoin without actually buying Bitcoin themselves. Thus, it eliminates the process of signing up for an exchange and dealing with crypto wallets.\n\nNo self-custody concerns\n\nAs a Bitcoin Spot ETF circumvents the need to buy Bitcoin directly, investors can avoid the complexities of self-custody, such as understanding private keys and crypto wallets and storing your seed phrase. Securing crypto is a big responsibility, and some people prefer an approach that doesn’t require them to learn the ins and outs.\n\nRegulated environment\n\nAny approved Bitcoin Spot ETF would be regulated, meaning that both the ETF and the fund behind it are audited to ensure they operate fairly. For traders accustomed to the regulations of traditional finance (TradFi), this can be reassuring.\n\nDisadvantages of a Bitcoin Spot ETF\n\nPrice Fluctuation\n\nThe value of a Bitcoin Spot ETF fluctuates with the price of Bitcoin and, therefore, shares its potential to be volatile.\n\nMoreover, and in contrast to the crypto market being open 24/7, financial exchanges have rigid trading hours and don’t operate during weekends or through the night. This means that if there is considerable movement in BTC’s price overnight, Bitcoin Spot ETF investors cannot act on that price movement until the market re-opens.\n\nFees Involved\n\nETFs are more costly than buying Bitcoin on cryptocurrency exchanges. This is because of the management fees the fund manager charges. This fee, which is baked into the fund, could be as high as 2.5%, compared to crypto spot trading fees that are usually much lower.\n\nNo Actual Ownership\n\nWhen trading a Bitcoin Spot ETF, you do not own the asset but merely gain exposure to the underlying asset’s price. That’s it. This might not be an issue for institutional investors, but it certainly goes against the concept of self-custody that is important to so many Bitcoin proponents.\n\nFinal Thoughts on Crypto ETFs\n\nAll things considered, an approval of any Bitcoin spot ETFs would be a momentous occasion for Bitcoin and cryptocurrency at large. Indeed, many view this step as a kind of stamp of approval of Bitcoin by the world’s most powerful financial regulatory board, the SEC. After all, the mere talk of a spot Bitcoin ETF approval is what most pundits point to when discussing the notable resurgence of Bitcoin’s price in recent months.\n\nTo many long-time proponents, a Bitcoin spot ETF could be a watershed moment, bringing countless new people and traditional investors into the fold. And of course, with more investors and interest comes additional liquidity. That’s why the approval of these ETFs is so important. Simply, it could signify a change in the market, allowing more new people to enter the ecosystem than ever before. Spot ETFs further the potential for the market to grow: supporting the mass adoption of crypto and blockchain technology.\n\nOf course, if you too are excited about the future of Bitcoin, you don’t have to wait on the approval of a Bitcoin spot ETF. Thanks to Ledger’s ecosystem of devices and software, and vast library of educational resources, taking the steps to buy Bitcoin yourself and safely store your private keys has never been easier.\n\nTo be sure, investing in a Bitcoin spot ETF could be a great, low-friction way to start your journey. But when you understand the true benefits of crypto and why it exists, nothing beats the sovereignty and individual agency that comes with self-custody. When you’re ready to take the leap, Ledger devices are here to help ensure that only you can access your Bitcoin."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTA0L2JpdGNvaW4tc3RydWdnbGVzLXRvLXJlY292ZXItYWZ0ZXItbmVhci0xMC1kcm9w0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price (BTC) Struggles to Recover After Near 10% Drop - Bloomberg",
        "content": "Bitcoin struggled to rebound from a precipitous drop which sent the largest cryptocurrency falling as much as 9.22% earlier in the week.\n\nThe token was little changed on Thursday morning London time, trading at around $43,056 and marking a partial recovery from Wednesday’s low, but still 6.2% away from the year’s high."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzA1L21pY3Jvc3RyYXRlZ3ktYm9sZC1iaXRjb2luLWJldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "MicroStrategy's Bold Bitcoin Bet: Risks, Rewards, and Future Outlook - The Motley Fool",
        "content": "Business intelligence expert MicroStrategy (MSTR -5.06%) still runs a successful software business. I know, that's easy to forget in an era where founder and chairman Michael Saylor is leaning heavily into buying Bitcoin (BTC -8.48%) -- it makes sense to think of MicroStrategy as an alternative way to own the largest cryptocurrency.\n\nLet's take a look at MicroStrategy's Bitcoin business. Does the software division even matter anymore?\n\nMicroStrategy's Bitcoin focus\n\nSaylor isn't shy about the importance Bitcoin holds in MicroStrategy's operations. The recent third-quarter report started with two Bitcoin-related bullet points before moving on to traditional financial metrics such as revenue and growth trends on the software side. Searching that document, you'll find 28 mentions of \"Bitcoin\" and just 15 instances of \"revenue\" or \"revenues.\"\n\nFor instance, the company added 6,067 Bitcoins during the third quarter, boosting the total holdings to 158,400 coins as of Oct. 31, 2023. I'm sure there are more Bitcoins on that balance sheet by now; MicroStrategy just hasn't posted any updates since then.\n\nThe coins were acquired at an overall cost of $4.69 billion over a three-year period. MicroStrategy's Bitcoin holdings are worth $6.99 billion at today's market price.\n\nMichael Saylor looks like a genius in times like these, when Bitcoin's street price is higher than the average purchase price. You'll see it in MicroStrategy's stock price, too. The stock rose 355% over the last year, thanks to a 157% increase in Bitcoin's market price.\n\nMicroStrategy's stock: Riding the Bitcoin roller-coaster\n\nThe reverse is also true, of course. When Bitcoin is down, MicroStrategy reports financial losses and the stock price drops. Michael Saylor becomes a headline-writing punching bag under those circumstances.\n\nAll in all, owning MicroStrategy stock has been a solid proxy for holding Bitcoin directly since Michael Saylor's digital investment started. The price swings aren't always exactly aligned but the long-term relationship is pretty clear:\n\nMind you, the software operation serves as a solid foundation for this exploration of digital assets. MicroStrategy's software license sales rose 16% year over year in the third quarter, along with a 28% uptick in subscription service revenue.\n\nThere is clearly a robust demand for the company's business intelligence tools, which now includes a generative AI interface to help clients make the most of the underlying data analysis tools. MicroStrategy's platform is integrated with the leading cloud computing platforms and the customer list includes household names such as Sony, Walt Disney, and Visa. This Tableau rival is no joke.\n\nThe software business you forgot\n\nSorry about the whiplash risk, but here's another plot twist. Despite the healthy results in MicroStrategy's business intelligence software, the company is investing all of the resulting profits in more Bitcoin -- and then some.\n\nHere's one way to look at it. MicroStrategy generated $11.5 million of cash from operations in the first three quarters of 2023. The cash profits were culled from $372 million of top-line revenues in the same period.\n\nAnd Saylor's crew raised $824 million of extra cash by selling freshly printed stock shares. The number of issued shares rose by 35% over the last year, diluting the value of existing shareholder stakes by the same amount. These market-moving effects are accounted for in the price charts above, which goes a long way toward explaining how a company that keeps buying more Bitcoin effectively moves in tandem with the digital currency itself. MicroStrategy's cash-raising efforts undermine the benefits for stockholders.\n\nBut that's what it takes to keep the Bitcoin flow going. The company invested another $688 million in digital assets across the first three quarters of 2023.\n\nMicroStrategy's promising but risky stock\n\nThere you have it. MicroStrategy has become a Bitcoin wallet with a successful but hugely overshadowed software business. The rise and fall of Bitcoin's value dictates how MicroStrategy's business performs as a whole, and you already saw how that translates into a Bitcoin-synchronized price chart.\n\nSo if you expect big things from Bitcoin in the long run, but your brokerage only offers traditional asset classes like stocks and exchange-traded funds, MicroStrategy can serve as a substitute for the real thing. You might also expect the charting lines to separate in the long run as MicroStrategy's need to raise additional cash goes away -- a possible effect of sustained Bitcoin price gains.\n\nThen again, MicroStrategy's all-in tactics also add a lot of risk. This crypto winter may be thawing, but what if the next gets even colder and lasts longer? Or, even worse, what if Bitcoin never turns out to be the future of financial assets at all? MicroStrategy's balance sheet could collapse in a hurry.\n\nIn other words, MicroStrategy may look like a pound-for-pound Bitcoin alternative but both the potential upsides and the downside risks are highly amplified versions of the original cryptocurrency. Personally, I prefer owning actual Bitcoin tokens or a simpler alternative such as the Grayscale Bitcoin Trust. Feel free to dabble in MicroStrategy's stock, just be careful out there."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm1hcmtldHNtZWRpYS5jb20vZmlyc3QtYml0Y29pbi1kZXBvc2l0YXJ5LXJlY2VpcHQtbGF1bmNoZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "First Bitcoin Depositary Receipt Launches - Markets Media",
        "content": "From The Markets First Bitcoin Depositary Receipt Launches\n\nReceipts Depositary Corporation (RDC) announced the launch of the first ever Bitcoin depositary receipt (BTC DR). RDC expects to issue the first BTC DRs in transactions exempt from registration under the Securities Act of 1933 to Qualified Institutional Buyers (QIBs) in the coming weeks. BTC DRs are now available on an ongoing basis for issuance to QIBs.\n\nA DTC-ELIGIBLE BITCOIN SECURITY\n\nBTC DRs follow the same construction as American Depositary Receipts (ADRs), and like ADRs, BTC DRs operate within US-regulated market infrastructure and are cleared through The Depository Trust Company (DTC). BTC DRs have been issued a CUSIP number and an ISIN.\n\nAN ESTABLISHED, REGULATED FINANCIAL PRODUCT\n\nThe first ADR was created in 1927. Today, ADRs are used by over 6,500 global financial institutions, including multinational banks, brokers and hedge funds. These institutional investors collectively own over $1 trillion in traditional DR securities and use them to invest in, transact, clear and settle foreign assets in the United States as easily as domestic securities. BTC DRs enable QIBs to own Bitcoin using the same technology, workflows and counterparty relationships they use for traditional securities by leveraging their standard transaction, custody and settlement operations.\n\n“We are excited to provide qualified institutional buyers with the secure, regulated access to digital assets they have been waiting for via BTC DRs,” said Ankit Mehta, Co-Founder and CEO of RDC. “There are many benefits to using depositary receipts, such as their tried and true structure, providing direct ownership of the underlying asset and easy inclusion in institutional products. BTC DRs are universally fungible as QIBs can convert their Bitcoin holdings into DRs and vice versa.”\n\n“Depositary receipts are a simple solution to complex access problems for institutional investors,” said Matthew Taback, Senior Market Maker, GTS.\n\nDIRECT OWNERSHIP OF BITCOIN THROUGH AN SEC-REGULATED TRANSFER AGENT AND OCC-REGULATED CUSTODIAN\n\nBroadridge Corporate Issuer Solutions, LLC is serving as RDC’s SEC-registered transfer agent and Anchorage Digital Bank National Association, the first and only OCC-regulated and federally chartered digital asset bank, will provide custody in a bankruptcy remote structure. All Bitcoin represented by BTC DRs will be held at the custodian for the exclusive benefit of the BTC DR holders.\n\nRDC’s model requires that all BTC DRs are 100% backed by Bitcoin held in custody, which cannot be lent, re-hypothecated, or pledged. BTC DRs enable direct ownership of the underlying asset, are fully fungible and represent a direct claim on Bitcoin held in custody, while mitigating counterparty credit risk from the issuing depositary. BTC DRs leverage existing workflows and use the existing securities ecosystem to provide robust risk management and asset protection.\n\nDRs CAN BE USED FOR DIGITAL AND NON-DIGITAL ASSETS\n\nBTC DRs are RDC’s first offering, but RDC is available to create clearinghouse-eligible securities for other alternative assets. The company’s three founders, Ankit Mehta, Bryant Kim and Ishaan Narain, each spent nearly a decade at a leading DR business, where they worked closely with issuers and investors to evolve DR market structure.\n\n“The RDC team has some of the strongest talent available in the highly technical world of depositary receipts,” said Diogo Mónica, president and co-founder, Anchorage Digital. “They know the market extremely well and had the vision and ability to bring a well-established financial product to digital assets. And, with the underlying BTC safely stored via institutional-grade custody at Anchorage Digital Bank, we’re excited to help bring BTC to the securities ecosystem.”\n\nSource: Receipts Depositary Corporation"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTA1L2NyeXB0by1qb2JzLXBvc3RpbmdzLWRyb3AtbmVhcmx5LTYwLWluLWRlY2VtYmVyLXBlci1saW5rZWRpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Crypto Job Postings Drop Nearly 60% in December Despite Recent Bitcoin Rally - Bloomberg",
        "content": "Hiring in crypto isn’t heating up as fast as the recent rally the space has seen on expectations of an imminent approval of a US exchange-traded fund investing directly into Bitcoin.\n\nCrypto job postings on LinkedIn declined 57% year-over-year in December, less than the 71% year-over-year drop in November, according to the professional networking site. Between November and the end of the year, Bitcoin’s price rose 57%, according to data compiled by Bloomberg. At jobs board CryptocurrencyJobs.co, which charges for job posts, December was one of the best months of 2023 in revenue, said Daniel Adler, the website’s founder."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLXNlZWQtYnV5LWFsbC1idGPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Spot Bitcoin ETF capital: Could funds potentially buy up all BTC in circulation? - Cointelegraph",
        "content": "The long-awaited potential approval of a spot Bitcoin (BTC) exchange-traded fund (ETF) in the United States could mean the market sees Bitcoin supply suddenly drop as funds snap up as much as they can, some market observers have predicted. With prominent firms like Ernst & Young expecting U.S. Securities and Exchange Commission (SEC) approval to trigger massive demand from institutions, will the financial giants behind these ETFs leave any actual Bitcoin on the market for the rest of us?\n\nA U.S.-based spot Bitcoin ETF could bring up to $30 billion of fresh cash into Bitcoin, crypto entrepreneur and investor Lark Davis estimated in September 2023. In such a scenario, spot Bitcoin ETF issuers would buy up about 50% of all Bitcoin on crypto exchanges to back their ETFs, he projected.\n\nEstimates are that a spot Bitcoin ETF would bring 20-30 billion of fresh cash into Bitcoin. That would buy about half of all coins on exchanges at current prices.\n\n\n\nFor reference here is what happened to gold when it got its first ETF approved on US markets.\n\n\n\nHistory repeating? pic.twitter.com/CBNvZgMq18 — Lark Davis (@TheCryptoLark) September 4, 2023\n\nBut buying as much Bitcoin as possible would likely get tricky for anyone, several industry executives and analysts agree.\n\n“Theoretically, a company or government could attempt to buy a significant amount of Bitcoin, but acquiring all Bitcoin in circulation is highly impractical, and we still have a significant, unreleased supply of Bitcoin,” Valkyrie CEO Leah Wald told Cointelegraph. Wald noted that Bitcoin’s supply is capped at 21 million coins, from which 1.4 million BTC are yet to be mined. She added:\n\n“Bitcoin’s decentralized nature and the fact that many holders might refuse to sell at any price create a natural barrier against monopoly.”\n\nMatt Hougan, chief investment officer at Bitwise — another spot BTC ETF applicant alongside Valkyrie — also believes that no one could theoretically establish a monopoly on Bitcoin.\n\n“The scarcity principle — a well-established economic principle — tells us that the price of a scarce good will rise to meet demand,” Hougan said. “In other words, if someone tried to ‘corner Bitcoin,’ the price would rise and rise and rise as more and more reluctant sellers were met,” the exec added. However, Hougan conceded that someone could still corner a significant amount of Bitcoin.\n\nJan3 CEO Samson Mow echoed Hougan’s stance, expressing confidence that it would be difficult to buy all Bitcoin in circulation due to extremely high prices fueled by products like a spot Bitcoin ETF. “The price people are willing to sell increases when there are fewer coins available for sale,” he stated.\n\nAccording to Mow, BTC holders will have to think hard about whether they should sell their Bitcoin, given the depreciation risks of fiat currencies like the U.S. dollar or the euro. He said:\n\n“So as funds buy more BTC and increase their assets under management, it will become harder and harder to find willing sellers.”\n\nDespite high competition among potential spot Bitcoin ETFs, these funds are unlikely to try to buy all the Bitcoin in circulation, according to David Gerard, author of the book and crypto blog Attack of the 50 Foot Blockchain.\n\nRelated: ‘Likely rejection’ or smooth sailing? Experts weigh in on potential spot Bitcoin ETF\n\n“ETFs are part of using Bitcoin as a dollar derivative. The issuer doesn’t care about the cryptocurrencies at all; they care about the dollars they can get from them,” Gerard told Cointelegraph. He added:\n\n“Lots of holders have way more Bitcoin than there are actual dollars trying to buy — the markets are thin.”\n\nAlthough many industry watchers expect spot Bitcoin ETFs to fuel massive demand and thus positively affect the BTC price, some execs like BitMEX co-founder Arthur Hayes believe that successful ETFs could “completely destroy” Bitcoin. According to ARK Invest CEO Cathie Wood, some investors might “sell on the news” of spot Bitcoin ETF approval in the short term.\n\nMeanwhile, some believe that the potential approval of a spot Bitcoin ETF in the U.S. could have little to no impact on markets, as multiple spot Bitcoin ETFs have been trading for years in other parts of the world, such as Canada.\n\nHowever, the size of U.S. capital markets is so large that this comparison may be irrelevant, according to Bloomberg ETF analyst Eric Balchunas. The crypto market has never seen an injection of capital of this potential magnitude, as Balchunas and other analysts predict.\n\nSource: Eric Balchunas/X (formerly Twitter)\n\nMagazine: Lawmakers’ fear and doubt drives proposed crypto regulations in US"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctbXVjaC1pcy1iaXRjb2luLXdvcnRoLXRvZGF50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "How much is Bitcoin worth today? - Cointelegraph",
        "content": "Bitcoin's (BTC) price has been intensely scrutinized as investors and analysts watch for signs of its next major move.\n\nBitcoin ETF rejection fears mount\n\nAs of Jan. 5, BTC's price was stabilizing around $43,850 after a 4.75% drop from its local high, suggesting a cautious market awaiting decisive moves.\n\nThe drop appeared amid rumors of U.S. regulators rejecting a round of spot exchange-traded fund (ETF) applications, which have been a critical point of focus for the crypto community.\n\nBTC/USD daily price chart. Source: TradingView\n\nFor instance, Fidelity Investments’ registration of a Bitcoin fund as a public security raised expectations for an approved Bitcoin ETF, indicating institutional interest and a potential regulatory milestone.\n\nHowever, Bloomberg Intelligence analyst James Seyffart suggested that conclusive evidence of an ETF approval is still pending. Attorney Joe Carlasare and Senior Bloomberg ETF analyst Eric Balchunas reiterated this as well.\n\nSEC is giving final comments as we speak, then issuers will submit final 19b-4s and S-1s soon after. So I mean this is def as close to \"done\" as we've been but no official approval as far as I know. — Eric Balchunas (@EricBalchunas) January 4, 2024\n\nBitcoin price technical analysis\n\nOn the technical front, indicators such as the Relative Strength Index (RSI) and Moving Average Convergence Divergence (MACD) are nearing a reset, which is historically a precursor to significant price action, as shown below.\n\nBTC/USD daily price chart. Source: TradingView\n\nTraders have advised caution on short-term expectations, while others have pointed to current prices as a strong buying opportunity, implying potential for upside movement.\n\nRelated: Spot Bitcoin ETF capital: Could funds potentially buy up all BTC in circulation?\n\nIn summary, Bitcoin's price is currently in a consolidation phase, with the market's eyes fixed on regulatory developments and technical indicators signaling a possible trend reversal.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDQvYml0Y29pbi1yZWJvdW5kcy1hYm92ZS00NGstYXMtc3BvdC1idGMtZXRmLWFwcHJvdmFsLWxvb2tzLWluY3JlYXNpbmdseS1saWtlbHkv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8wNC9iaXRjb2luLXJlYm91bmRzLWFib3ZlLTQ0ay1hcy1zcG90LWJ0Yy1ldGYtYXBwcm92YWwtbG9va3MtaW5jcmVhc2luZ2x5LWxpa2VseS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Rebounds Above $44K as Spot BTC ETF Approval Looks Increasingly Likely - CoinDesk",
        "content": "Perhaps more interestingly though, the same survey showed 88% of those advisors see the spot ETF as a major catalyst and would be interested in buying bitcoin after approval. Bitwise is among those asset managers with spot bitcoin ETF applications awaiting word from the SEC."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lbG9uLW11c2std29uLXQtYmUtdGhlLXJpY2hlc3QtcGVyc29uLWlmLWJpdGNvaW4tZ29lcy1hYm92ZS0xbdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Elon Musk won't be the richest person if Bitcoin goes above $1M - Cointelegraph",
        "content": "Bitcoin (BTC) creator Satoshi Nakamoto is assumed to hold around 1.1 million BTC, worth $46 billion today. This means the world’s richest person and first trillionaire might not be Elon Musk if Bitcoin ever reaches the high six-figure range.\n\nMeanwhile, other prominent Bitcoin holders have also made billions from the rise in BTC price over the past 15 years. One of the most notable examples is MicroStrategy chairman Michael Saylor, who is up a whopping $2.6 billion on his Bitcoin investment.\n\nCan a Bitcoin billionaire dethrone Musk?\n\nSo, how high would BTC’s price be for a Bitcoin billionaire such as Saylor to become the world’s richest person?\n\nMicroStrategy vs. Tesla stock price (1-year chart). Source: TradingView\n\nSeveral factors must be considered to explore the possibility of Saylor overtaking Musk as the wealthiest person in the world with Bitcoin prices rising — namely, Saylor’s total Bitcoin holdings and Musk’s net worth, excluding his own possible Bitcoin and (likely) Dogecoin (DOGE) stacks for this theoretical exercise.\n\nRelated: Michael Saylor begins selling $216M in MicroStrategy stocks for more Bitcoin\n\nThe latest data shows that Saylor’s total Bitcoin holdings amount to 206,882 BTC (around $9 billion), including MicroStrategy’s 189,150 BTC and his own stash of 17,732 BTC, according to Forbes. Musk’s net worth, on the other hand, is approximately $219 billion.\n\nTo calculate the Bitcoin price necessary for Saylor’s net worth to surpass Musk’s, we need to find the price per Bitcoin that would value Saylor’s holdings past $219 billion.\n\nLet’s break down the calculation, which can be done using Cointelegraph’s price calculator:\n\nSaylor’s personal Bitcoin holdings: 17,732 BTC MicroStrategy’s Bitcoin holdings: 189,150 BTC Total Bitcoin holdings: 17,732 BTC (personal) + 189,150 (company) = 206,882 BTC (around $9 billion) Musk’s net worth: around $219 billion\n\nWe can now calculate the required price of Bitcoin for this scenario.\n\nSeven-figure Bitcoin price\n\nTo surpass Musk’s net worth of approximately $219 billion, the price of a single Bitcoin would need to reach approximately $1,054,000. This is a substantial 24x increase from current Bitcoin prices, but it would nevertheless align with numerous price predictions. At the same time, this reflects the remaining big gap in net worth between the two entrepreneurs.\n\nRelated: Ex-BitMEX CEO explains how Bitcoin will have hit $1 million by 2030\n\nIt’s important to note that this scenario is hypothetical and depends on various factors, including Bitcoin’s market dynamics, Musk’s fluctuating net worth (largely tied to his holdings in companies like Tesla and SpaceX), and Saylor maintaining his Bitcoin holdings.\n\nAdditionally, such a dramatic rise in Bitcoin’s price would likely have far-reaching implications for the cryptocurrency market and global financial systems.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLW1hcmF0aG9uLWRpZ2l0YWwtYnJlYWtzLWJ0Yy1wcm9kdWN0aW9uLXJlY29yZC1kZWNlbWJlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Marathon Digital breaks own record with 1,853 Bitcoin mined in December - Cointelegraph",
        "content": "Bitcoin miner Marathon Digital Holdings has notched itself a new production record, mining more Bitcoin (BTC) in December 2023 than any month before.\n\nAccording to a Jan. 4 press release, the Florida-based firm reported mining 1,853 Bitcoin in December, a 56% increase from November and a 290% increase from December 2022, claiming:\n\n“We believe this to be the highest monthly total ever recorded by a public Bitcoin mining company.”\n\nCore Scientific previously claimed that it had mined the most monthly Bitcoin in January 2023 after producing 1,527 BTC. Marathon’s recent figures surpass that by more than 300 BTC.\n\nMarathon Digital Holdings’ December 2023 #Bitcoin Production Update is here:\n\n\n\n- Record BTC Production of 1,853 BTC in December and 12,852 in 2023\n\n- Increased Average Operational Hash Rate 18% M/M to 22.4 EH/s\n\n- BTC Holdings Now Over 15,000, Total Cash & BTC of $1.0B as of… — Marathon Digital Holdings (NASDAQ: MARA) (@MarathonDH) January 4, 2024\n\nMarathon chairman and CEO Fried Thiel said the record-setting monthly production could be attributed to an 18.4% monthly increase in hash rate to 22.4 exahashes per second.\n\nOn Dec. 19, Marathon announced plans to purchase two mining centers for $179 million, which will see an additional 390 megawatts of mining capacity added to its existing 584-megawatt output.\n\n“We continue to target 30% growth in energized hash rate in 2024 and with the recently announced acquisition of the two sites from Generate Capital [...] we expect to reach 50 exahashes in the next 18 to 24 months,” added Thiel.\n\nRelated: Cipher Mining buys 16,700 new miners ahead of Bitcoin halving\n\nOn Dec. 28, Marathon briefly topped the charts as the most-traded public company among mid and large-cap firms on the United States stock market. The company witnessed a staggering $3.3 billion daily trading volume, beating out blue-chip market darlings such as Tesla, Apple and Amazon on the day.\n\nMarathon’s December performance comes amid a renewed push from Bitcoin mining firms to expand operations ahead of an expected approval of a spot Bitcoin exchange-traded fund as early as Jan. 8 and the Bitcoin halving in April.\n\nOn Dec. 5, competitor mining firm Riot Platforms acquired an additional $291 million worth of Bitcoin mining rigs, marking the largest increase in the hash rate in the firm’s history.\n\nMagazine: Terrorism and the Israel-Gaza war have been weaponized to destroy crypto"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9sYXllci0yLWNyeXB0by1qdXN0LXBhc3NlZC0xOTI2NTE2OTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "This Layer-2 Crypto Just Passed Ethereum on 1 Key Metric and Is Up 27% This Week - Yahoo Finance",
        "content": "Arbitrum (CRYPTO: ARB) is among the leading large-cap cryptocurrencies in the market this week. As of 1:45 p.m. ET, Arbitrum has surged 27.2% since last Friday's close and is one of the only top cryptos to have reached a fresh all-time high this past week.\n\nFor mega-cap cryptos, it's been a rather ho-hum week. Bitcoin (CRYPTO: BTC) and Ethereum (CRYPTO: ETH), for example, ended the week up 3.7% and down 3.4%, respectively. Hence, the outsize interest in names like Arbitrum.\n\nHere's what investors are watching closely when it comes to this Layer-2 Ethereum scaling solution right now.\n\nArbitrum passes Ethereum in decentralized exchange volume\n\nThe big headline that drove an incredible amount of interest in Arbitrum relative to other top cryptos over the past week is a surge in decentralized exchange (DEX) trading volume on the Arbitrum network. Earlier today, Arbitrum pushed past Ethereum to process a 24-hour trading volume of $1.83 billion, making this the leading platform in terms of daily DEX volume.\n\nArbitrum's surge in trading volume was very noticeable, with overall volume increasing more than 32% over the past week. Ethereum's corresponding volume dropped nearly 5% over the same period. Arbitrum's infrastructure, which includes using optimistic rollups to improve speed, scalability, and cost on its network, appears to be striking a chord with traders. In the highly competitive market for DEX market share, Arbitrum is not so quietly rising in the ranks.\n\nTo make things better, Arbitrum also announced record-high total value locked (TVL) metrics this week. The project's overall TVL surged past the $2.5 billion mark for the first time, surpassing Layer-1 network Solana (CRYPTO: SOL) in the process.\n\nAdditionally, Orbit (a Layer-3 project providing developers with the ability to build applications on Arbitrum) announced this week that ARC-20 tokens can now be used for transaction fees. This added benefit for Orbit's individual blockchains and corresponding decentralized applications appears to be spurring overall ecosystem growth for Arbitrum.\n\nStory continues\n\nWhat now?\n\nArbitrum appears to be firing on all cylinders. The network's lower-cost, higher-throughput ecosystem is clearly one developers are looking to build upon and users are flocking to. So long as these fundamental metrics continue to improve, this project could certainly continue to see momentum well into 2024.\n\nNow, some of Arbitrum's transaction volume surge can be attributed to a meme token-driven frenzy in recent months. Most conservative investors wouldn't bet the farm on that continuing, and at some point, I think the fuel this catalyst is providing will run out.\n\nThat said, Arbitrum's infrastructure and value as a scaling solution are being validated in a big way by the market. For those betting on growth within the Ethereum ecosystem (with the majority of the spoils in terms of volume going to scaling solutions like Arbitrum), this is a crypto to keep your eye on.\n\nShould you invest $1,000 in ARB right now?\n\nBefore you buy stock in ARB, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and ARB wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of December 18, 2023\n\nChris MacDonald has positions in Ethereum and Solana. The Motley Fool has positions in and recommends Bitcoin, Ethereum, and Solana. The Motley Fool has a disclosure policy.\n\nThis Layer-2 Crypto Just Passed Ethereum on 1 Key Metric and Is Up 27% This Week was originally published by The Motley Fool"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMDQvYml0Y29pbi1jb3VsZC1yYWxseS10by01MGstYXMtZ2Vuc2xlci1mYWNlcy1wcmVzc3VyZS10by1hcHByb3ZlLWV0Zi10cmFkZXJzLXNheS_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8wNC9iaXRjb2luLWNvdWxkLXJhbGx5LXRvLTUway1hcy1nZW5zbGVyLWZhY2VzLXByZXNzdXJlLXRvLWFwcHJvdmUtZXRmLXRyYWRlcnMtc2F5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Could Rally to $50K as Gensler Faces Pressure to Approve ETF, Traders Say - CoinDesk",
        "content": "\"I think it’s still likely that we see an approval from the SEC in January,\" Keily said. \"There is too much pressure and expectation from the world's biggest asset managers for Gary Gensler and the rest of the approval committee to keep kicking the can down the road,\" referring to the regulator's chairman by name."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTA1L2JpdGNvaW4tZWRnZXMtbG93ZXItYXMtdHJhZGVycy1hd2FpdC1zZWMtYml0Y29pbi1ldGYtbW92ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Edges Lower As Traders Await SEC Bitcoin ETF Move - Bloomberg",
        "content": "Bitcoin stumbled as traders braced for an upcoming decision by the US Securities and Exchange Commission on whether to approve an exchange-traded fund tied directly to the world’s largest cryptocurrency.\n\nThe token fell as much as 4.3% to $42,563 in New York on Friday, before paring the decline. Bitcoin had risen as high as $45,911 earlier this week, but crashed more than 9% on Wednesday as leverage built up in the market and investors grew nervous about the SEC’s impending decision. Other cryptoassets generally fared worst, with Ether, Solana’s SOL and Ripple’s XRP all down between 2% and 7%."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGwtbWFya2V0LW1ldHJpY3MtYWxtb3N0LXJlc2V0LWJ0Yy1wcmljZS1ob3ZlcnMtYXQtNDMta9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin bull market metrics 'almost reset' as BTC price hovers at $43K - Cointelegraph",
        "content": "Bitcoin (BTC) stayed lower into Jan. 4 as markets emerged from a 9% BTC price crash.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nAnalyst sees Bitcoin ETF decision “next week”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD circling the area around $43,000 before the Wall Street opening.\n\nStill down $3,000 from the week’s top, the largest cryptocurrency opted to tread water as mysteries continued over the fate and timing of the United States’ first spot Bitcoin exchange-traded fund (ETF).\n\nThe latest drop had accompanied an industry claim that U.S. regulators would reject the latest round of spot ETF applications, continuing a years-long struggle to launch them.\n\nNo specific evidence was provided, however, and commentators quickly brushed off the idea that the decision had already become known.\n\nSubsequent filings by would-be ETF providers further stoked intrigue. These included a securities registration by Fidelity Investments, which soon garnered claims that an approval had arrived.\n\nBreaking: @Fidelity just registered Form 8-A for their FIDELITY WISE ORIGIN BITCOIN FUND #Fidelity\n\n\n\n8-A means they are now a registered security that can be traded PUBLICALLY!!!!$FBTC ETF is approved.\n\n\n\nUpdate: Next will be the @CBOE listing of 315948109. Ill update when I… pic.twitter.com/N1QXDKKxgM — MartyParty (@martypartymusic) January 3, 2024\n\nReacting, however, James Seyffart, an analyst at Bloomberg Intelligence, again dismissed the documents as providing proof of an ETF greenlight.\n\n“I'm still looking towards next week,” part of comments on X (formerly Twitter) stated.\n\nRSI among indicators lining up rebound\n\nBitcoin markets thus faced little by way of coercive forces, either up or down.\n\nRelated: 15 years, 90K ‘Bitcoinaires’ — Bitcoin millionaire wallets jump 300%\n\nPopular trader Daan Crypto Trades eyed a return to a familiar BTC price range from December, telling X subscribers that they should “not expect too much” on short timeframes.\n\n#Bitcoin Back near the middle of the range after deviating above.\n\n\n\nGood to keep watching this range to watch for a potential break. Wouldn't expect too much as long as price hangs around the mid range. pic.twitter.com/rtRauKCkCO — Daan Crypto Trades (@DaanCrypto) January 4, 2024\n\nFellow trader Jelle was more optimistic, highlighting key levels that should soon come into play.\n\nAn X post on the day referenced both the relative strength index (RSI) and moving average convergence divergence (MACD) indicators being “almost fully reset” — a prerequisite that Cointelegraph reported on last week.\n\nPrice grinding up on the 25-day EMA, while the RSI & MACD are almost fully reset.\n\n\n\nETF news soon.\n\n\n\nGoing to be big week. #Bitcoin pic.twitter.com/TWeZgUoLYj — Jelle (@CryptoJelleNL) January 4, 2024\n\nThe day prior, Jelle described current prices as the “best buying opportunity in a long time” for both Bitcoin and altcoins.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0ZnMtYmVnaW4tMjAyNC12b2xhdGlsaXR5LTE0MDAwMDI3Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs Begin 2024 With Volatility as SEC Decision Looms - Yahoo Finance",
        "content": "2024 Bitcoin\n\nInvestors wanting to know how bitcoin may perform in 2024 received a taste of volatility in the first trading days of the new year.\n\nAs investors awaited a decision from the Securities and Exchange Commission (SEC) on a spot bitcoin ETF, BTC’s price fluctuated wildly as did existing bitcoin ETFs and other crypto-related funds.\n\nBTC concluded 2023 trading at roughly $42,300. But the largest cryptocurrency by market capitalization whipsawed to start 2024, jumping 8% to above 45,800, then dropping 10% to below 42,000 before rebounding midday Wednesday to its Dec. 31 end point.\n\nThe largest bitcoin futures ETF, the ProShares Bitcoin Strategy ETF (BITO), is now more than 5% below where it started the year and the crypto-related stock ETF, the Bitwise Crypto Industry Innovators ETF (BITQ), is now off its 2023 year-end price by nearly 3%.\n\nThe year’s poor start for capital markets didn’t end with bitcoin, as stocks and bonds both declined. The SPDR S&P 500 ETF Trust (SPY) and the iShares 20+ Year Treasury Bond ETF (TLT) each fell 0.6% Tuesday, which marked the first time both funds have declined that much to begin a calendar year since the bond market proxy began trading in 2002.\n\nBitcoin Spot ETF Approval, 2024 ‘Halving’\n\nAs noted in our 24 ETFs for 2024 series, ETFs that invest in crypto-related stocks, including BITQ, and bitcoin miner ETFs, such as the Valkyrie Bitcoin Miners ETF (WGMI), outperformed bitcoin in 2023. This was no easy feat, as BTC jumped by more than 150% in the year.\n\nMost of those price gains came in the final four months, as investor optimism soared that the SEC would approve a long-coveted spot bitcoin ETF. The agency is currently weighing 13 applications from such financial services powerhouses as BlackRock and Fidelity.\n\nThe price volatility for BTC, bitcoin futures ETFs and crypto funds to start 2024 stems from a combination of profit taking after 2023’s massive gains and investor doubts that SEC approval will occur by Jan. 10 as Bloomberg ETF analysts Eric Balchunas and James Seyffart have been predicting for weeks. On Wednesday, Markus Thielen, the head of research for crypto services provider Matrixport and a bitcoin bull predicted that the SEC would reject the various applications.\n\nStory continues\n\nGoing forward, investors may expect BTC to jump higher on SEC approval but drop dramatically in the short term if the regulator sends rejection letters, as Thielen maintains, requesting issuers to meet more critical requirements.\n\n\n\nStill, bitcoin gains could be in the offing, regardless of the outcome as investors focus on April’s bitcoin “halving” event, in which miners' rewards will decrease from 6.25 BTC to 3.125 BTC, in April. Previous halving events have preceded price gains.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzA0LzItY3J5cHRvY3VycmVuY2llcy10by1idXktaGFuZC1vdmVyLWZpc3QtaW4tamFudWFyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "2 Cryptocurrencies to Buy Hand Over Fist in January - The Motley Fool",
        "content": "After a huge rally in the crypto market in 2023, it's perhaps no surprise that many investors are now expecting a similar type of performance in 2024. While past performance is certainly no guarantee of future performance, there is definitely room for optimism as we enter the New Year.\n\nIn terms of overall growth prospects and the potential to skyrocket higher in 2024, Bitcoin (BTC -7.83%) and Solana (SOL 3.83%) particularly stand out. Here's a closer look.\n\nBitcoin\n\nIt's almost impossible to talk about the 2023 crypto market rally without also mentioning Bitcoin. For the year, Bitcoin was up more than 150%. Bitcoin recently topped $45,000, and is now trading at its highest levels since April 2022.\n\nThe key catalyst, of course, is the imminent launch of the first spot Bitcoin ETF for the U.S. market. There are now more than a dozen Wall Street firms that have submitted applications to the SEC, and regulatory approval of at least one of these is almost a certainty at this point. The new ETF potentially means new money flooding into Bitcoin, which should push up the price of Bitcoin over both the short term and long term. If big institutional investors decide to allocate just 1% of their multi-trillion-dollar portfolios to Bitcoin, the effect could be huge.\n\nEven if you think that an efficient market has largely priced in the effect of this spot Bitcoin ETF, there's a second, even bigger, reason to buy Bitcoin hand over fist in January: The Bitcoin halving. This halving event, scheduled for April 2024, is largely expected to kick off a major rally in Bitcoin.\n\nIn three previous halving cycles (in 2012, 2016, and 2020), Bitcoin skyrocketed in value. In the 2020 halving cycle, for example, Bitcoin eventually soared to a new all-time high of $69,000. While another huge incoming rally is hardly a slam dunk, Bitcoin could soar past the $100,000 mark by the end of 2024.\n\nSolana\n\nIn the final months of 2023, Solana gained tremendous momentum, and ended the year up nearly 1,000%. Thanks to this final year-end surge, Solana is now the fourth-largest cryptocurrency in the world.\n\nThe big question, of course, is whether this surge was driven by a huge speculative frenzy, or whether this rally was fueled by strong underlying fundamentals. After all, heading into 2023, Solana was pretty much left for dead. The crypto had lost more than 90% of its value, and the threat of \"FTX contagion\" made Solana toxic for many risk-averse investors.\n\nBut I'm firmly in the camp of investors who think that Solana has turned the corner over the past 12 months. Many key metrics used to evaluate a blockchain seemed to be trending in the right direction in 2023. By the end of the year, Solana was even showing signs of surpassing rival Ethereum (ETH -8.36%) in key areas such as non-fungible token (NFT) sales volume and decentralized exchange (DEX) trading volume.\n\nAnd that's why I'm so bullish on Solana -- it has emerged as a serious competitor to Ethereum. As Cathie Wood of Ark Invest pointed out on CNBC, Solana is basically a faster, more cost-effective version of Ethereum. As such, it has a legitimate shot at becoming the preeminent Layer 1 blockchain platform in the world. As more users and developers migrate over to Solana, that will have a huge effect on Solana's ability to show growth in everything from NFTs to decentralized finance (DeFi).\n\nIf you take a look at Ethereum's market cap ($284 billion) and then compare it to Solana's market cap ($47 billion), it's possible to calculate just how much higher Solana might soar in the coming years. A $284 billion market cap for Solana would imply a price of nearly $600. But some analysts are predicting even higher valuations. Investment firm VanEck, for example, has suggested a price closer to $3,200 might be possible by the year 2030.\n\nWhat to look for in 2024\n\nWhile the outlook for Bitcoin and Solana might appear very bullish right now, just keep in mind that the crypto market is notoriously volatile. Moreover, regulatory risk is always a factor. If regulators decide that they are not going to approve a spot Bitcoin ETF, for example, that might prove disastrous for the price of Bitcoin.\n\nThat being said, both Bitcoin and Solana have tremendous long-term growth prospects, and both seem to be riding a wave of positive sentiment from investors. If you are looking to turbo-charge the performance of your portfolio in 2024, Bitcoin and Solana could be worth a closer look."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3Lmt1dC5vcmcvZW5lcmd5LWVudmlyb25tZW50LzIwMjQtMDEtMDQvYml0Y29pbi10ZXhhcy1wb3dlci1lbGVjdHJpY2l0eS1ncmlk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Texan Bitcoin miners profit by using less electricity; advocates say all Texans should get the same chance - KUT",
        "content": "When the news broke that Bitcoin mining company Riot Platforms made $32 million by reducing — or being willing to reduce if needed — its energy use last August in Texas, the outrage was immediate.\n\nThe state’s grid operator had frequently asked Texans to conserve electricity during sweltering summer heat, and many saw their power bills soar as they tried to stay cool. Meanwhile the state grid operator and an electricity provider effectively gave millions to a company whose industry is notorious for using gobs of electricity.\n\nRiot made that giant sum of money because of how the state’s electricity market is designed. Companies that use large amounts of power, such as manufacturers or petrochemical plants, have long profited in similar ways.\n\nThere are two ways that large power users can make money on the state’s main power grid, according to industry experts. The Electric Reliability Council of Texas, which operates the grid, pays large industrial users that promise to reduce their power consumption as needed, giving ERCOT some wiggle room in case a power plant unexpectedly fails or power demand is higher than forecast.\n\nA company such as Riot also can profit by buying power at negotiated rates ahead of time — retail power companies allow big companies to lock in prices that way — then selling it back into the state market when energy prices soar during extreme heat or cold. In Riot’s case, when electricity prices soared during the summer heat wave, Riot sold power back to TXU, a Dallas-based electricity provider, which sold it back to the grid.\n\nIn a September statement that was later deleted from its website, Riot characterized its actions as helping to stabilize the grid.\n\nRiot’s windfall highlighted for everyday power consumers just how much the Texas market can benefit businesses. Critics saw particular problems with cryptocurrency.\n\nLee Bratcher, president of the Texas Blockchain Council, a group promoting cryptocurrency growth and innovation in Texas, said in an email that cryptocurrency operations can benefit the grid because they are able to reduce or completely shut down their operations quickly.\n\n“Bitcoin miners can use excess power overnight and on days where demand is normal, and they can turn off on very hot or very cold days when power is scarce and electricity prices are high,” Bratcher said in an email.\n\nBut Mandy DeRoche, deputy managing attorney in the clean energy program at Earthjustice, a nonprofit environmental law group, said crypto mining businesses shouldn’t be praised for reducing power on the grid when they are using so much to begin with.\n\n“I think that the rewards for their behavior are so lucrative and unfair,” DeRoche said, adding, “It’s like we’re bending over backwards to give money to the [crypto] miner for putting the strain on the grid and the system in the first place.”\n\nChina, which was one of the largest crypto mining hubs in the world, banned crypto mining in 2021, concerned about virtual currencies being used for criminal activity and disrupting financial systems. Cryptocurrency operations began opening in Texas, which as of March was home to five of the 10 largest Bitcoin mines in the U.S., according to an April investigation by The New York Times.\n\nSome industry experts have advocated for Texas residents to be able to reap the same sort of benefits for using less power at critical times. Called “demand response,” it’s a way for power companies to pay or credit customers who agree to reduce their power usage when demand is high, by adjusting their thermostats or timing their energy-intensive activities like charging electric vehicles or running pool pumps at times when power demand is low.\n\nElectricity providers such as Austin Energy and Reliant already have programs that pay customers to let the providers adjust their smart thermostats when necessary but the benefit is small. For residential customers, that typically translates to one-time bill credits that can range from $25 to $85.\n\nEd Hirs, a University of Houston lecturer and energy market expert, said he’s worried that more Bitcoin mines coming to the state will mean higher electricity prices for Texans.\n\n“Why can’t I get $5 a kilowatt an hour for shutting down my power?” Hirs said. “Why are these guys getting a sweetheart deal?”\n\nThis summer, one of the hottest in recorded Texas history, Fort Worth resident Terri Rimmer said she conserved because she feared power being cut altogether. Rimmer remembers losing electricity for five days during the deadly 2021 winter storm, when ERCOT called for power cuts to millions of Texans because power generators failed in the extreme cold and the remaining power sources couldn’t keep up with the high demand.\n\nRimmer said temperatures dropped as low as 25 degrees inside her home during the power outage. She bundled up in layers of clothing and blankets and shared her bed with her cat to stay warm.\n\nThat month, a Bitcoin mine that Riot Platforms acquired, Whinstone, received a $125 million windfall by selling power back to the grid, according to an investigation by the Tech Transparency Project.\n\nThis summer, when ERCOT warned of tight grid conditions because of unprecedented power demand, Rimmer, 57, turned off her air conditioning, closed her blinds and blackout curtains and put an ice pack on her chest to try to stay cool. Sweat glistened on her face.\n\n\"I wasn't like this before,” Rimmer said. “I didn't conserve until that winter storm hit. It's truly traumatizing. For me it changed how I do things.\"\n\nEarning more from the grid than from selling Bitcoin\n\nAccording to Bratcher, there are more than 20 industrial-scale Bitcoin mining operations in Texas that can collectively consume up to 2,300 megawatts of energy a day — enough to power about 460,000 homes during times of high demand in Texas. They house computers that run constantly to produce cryptocurrencies, decentralized digital currencies used as alternatives to government-backed, traditional currencies.\n\nCrypto miners essentially compete to solve complex math problems that, when verified, produce one Bitcoin or other cryptocurrency that the companies can either hold as an asset or sell. The more computers they have and the longer they run, the better their chances of solving the problem the fastest.\n\n“Essentially every miner is running the exact same algorithm, and it really is just a matter of luck,” said Samantha Robertson, a member of the corporate strategy team for Bitdeer, another Bitcoin company with an operation in Rockdale. “In order to increase your chances, it makes sense to have these computers running at scale.”\n\nBut if the value of Bitcoin is low and the cost of electricity is high, crypto companies can make more money selling power than mining Bitcoin. In August 2023, Riot reported selling 300 Bitcoins for a net proceeds of $8.6 million. Meanwhile, the company said it earned $24.2 million in credits to its electric bill for selling power back to the grid.\n\nIn September 2023, Riot said it earned $9 million in net proceeds from Bitcoin sales and $11 million in credits for selling power back to the grid.\n\nRobertson said Bitdeer and other cryptocurrency companies are not doing anything different than other industries by selling power back to the grid when demand and prices rise.\n\n“Quite frankly we’re just playing by those rules,” Robertson said.\n\nBecause of how much power cryptocurrency mines use and how quickly they can reduce their power consumption — which can help relieve stress on the grid when demand is high — it is important for ERCOT to work closely with them, ERCOT President and CEO Pablo Vegas said in a September interview.\n\n“I'm interested in their operating characteristics,” Vegas said.\n\nThe electricity-selling agreements between retail power companies like TXU and cryptocurrency businesses like Riot aren’t public, so it’s difficult to discover exactly how the companies are benefiting from the current ERCOT rules, said DeRoche, of EarthJustice.\n\n“There's very little regulation, there's no reporting standards,” DeRoche said during a September virtual press conference featuring cryptocurrency opponents from different organizations. “It makes it difficult to track and to get a complete picture of the total impacts.”\n\nEric Goff, a member of an ERCOT task force that was formed to help manage power demand from large industrial users, said ERCOT has proposed rules to have large power users such as Bitcoin mines register with ERCOT so it could track their impacts on the grid. The rules don’t have a specific deadline to be implemented, he said.\n\nEnvironmental advocates also argue that there is a less energy-intensive way, called proof of stake, to create Bitcoin that doesn’t require computers to run so many calculations. The Texas Coalition Against Cryptomining held a weeklong protest in October to oppose Riot’s plans to build a cryptocurrency operation near the Central Texas city of Corsicana. Coalition Founder Jackie Sawicky faulted crypto businesses for failing to reduce their energy use.\n\n“Why are we tolerating this?” Sawicky asked in an interview. “It’s insane.”\n\nThe potential of residential demand response\n\nIn Texas, at least seven electric providers, including Austin Energy, Reliant and CPS Energy, offer residential demand response programs that typically let the providers remotely adjust customers’ smart thermostats a few degrees during critical periods when energy demand is high. Customers have to sign up for the programs.\n\nOther companies such as OhmConnect are working with smart plugs in homes. Don Whaley, senior advisor to business at OhmConnect, said customers can plug devices such as refrigerators, lamps and other ordinary household electrical appliances into the smart plugs, allowing the company to adjust power consumption remotely when necessary.\n\nWhile tens of thousands of Texans do participate in programs where they agree to reduce energy use — Austin Energy said its program has 33,000 active smart thermostats, while Reliant said 100,000 customers are enrolled in its program — the amount paid to residential customers is small.\n\nMost companies give their customers credits that reduce their electricity bills. For example, Reliant and Direct Energy give out a one-time $25 credit for enrolling in the program, Austin Energy offers a $50 credit for enrolling and a yearly $25 credit for staying, and CPS Energy customers receive an $85 enrollment credit and an additional $30 for each year they participate.\n\nOther companies incentivize through point systems. OhmConnect customers can earn points or currency called Watts that can be traded in for real money, gift cards or to make a donation to charity. Gexa Energy’s Green Rewards program gives residential customers Active Saver Rewards points that customers can redeem as credits to lower their power bills.\n\nOctopus Energy, a Houston-based retail electric provider that has a startup-feeling office with exposed brick, said its Texas customers can sign up for programs that allow Octopus to adjust smart home thermostats and electric vehicle chargers based on power prices, which allows them to offer lower-cost power.\n\nERCOT is also running pilot projects in the Dallas and Houston areas that let people with Tesla Powerwall batteries sell their extra electricity onto the state grid when it’s needed. This concept is known as a “virtual power plant” and works by adding up lots of small power resources to create a meaningful amount of supply.\n\nTexas Public Utility Commissioner Will McAdams said in an August interview that ERCOT needed to use all available strategies to get power onto the grid.\n\n“It was now or never,” McAdams said. “We needed to get this off the ground and allow our very interested Texas consumers to better engage in the ERCOT system.”\n\nCritics such as energy consultant Doug Lewin say the Public Utility Commission needs to get to a point where it can expand the pilot projects and make the concept a permanent part of how the grid works. Lewin also urged the PUC to put regulations in place so all residential customers can benefit from reducing power use on the grid just like large customers do.\n\n“This is absolutely critical if we’re going to have either a reliable or affordable grid,” Lewin said.\n\nA study by the American Council for an Energy-Efficient Economy, a nonprofit research advocacy group, found that if Texas implements statewide demand response and energy efficiency programs for residential customers and businesses from 2024 to 2030, Texas could reduce peak summer electricity demand by 15 gigawatts and the peak winter demand by 25 gigawatts.\n\n“Residential load is a small thing.” Whaley said. “But if we start getting this general acceptance to where people go, ‘Oh okay yeah, I can go from 72 to 78 degrees for an hour because that’s what the grid needs,’ then you start seeing real reductions in the market, to start seeing real impact.”\n\nAlejandra Martinez contributed to this story.\n\nFrom The Texas Tribune\n\nThe Texas Tribune is a nonprofit, nonpartisan media organization that informs Texans — and engages with them — about public policy, politics, government and statewide issues.\n\nDisclosure: CPS Energy, Octopus Energy, Texas Blockchain Council, The New York Times and the University of Houston have been financial supporters of The Texas Tribune, a nonprofit, nonpartisan news organization that is funded in part by donations from members, foundations and corporate sponsors. Financial supporters play no role in the Tribune's journalism. Find a complete list of them here."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vdW5oZXJkLmNvbS8yMDI0LzAxL3RoZS1hZnJpY2FuLXZpbGxhZ2UtbWluaW5nLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "The African village mining Bitcoin - UnHerd",
        "content": "Bondo is a scattered cluster of villages in a remote region of Malawi near the border with Mozambique. It sits in the foothills of Mount Mulanje, where residents rely on their feet for transport and a few crops to feed their families. Yet unlike in most places in this impoverished country, when night descends they can now switch on lights, stoves and televisions in their homes.\n\nFor electricity has arrived in Bondo. Three turbines were installed in a micro-hydro scheme exploiting the fertile region’s rainfall. And the impact has been life-changing for the 1,800 homes so far connected to a mini-grid. Children can study after dark, so now have a better chance of passing the exams for secondary school rather than having to leave aged 11. Drugs and food can be stored in fridges, so villagers do not have to make the 12-mile trek to the hospital and can produce batches of food or drinks to sell at market. Cooking the evening meal is three times quicker — and far less destructive to the environment — without the need to collect firewood.\n\nOne group of women giggled when I asked if they had televisions and watched football in their homes. “Before, our husbands would say they were going off to watch football when they were really walking out with other women. Now they can no long claim they are going off for football,” Bertha told me. The senior chief told me they had never dreamed of having energy supplied to the villages, with a dozen maize mills, many small enterprises, schools, shops and churches also connected to the grid. “When you move around Bondo you see happy people — and that’s because of electricity.”\n\nYet the big surprise in Bondo is not simply the supply of energy to such an isolated community, in a country where only one in eight citizens has access to grid electricity and on a continent where almost half the 1.2 billion population still lack this life-changing supply. The real eye-opener is the stack of 32 computers inside the concrete pump shed. This innovative mini-grid — located more than two hours from Malawi’s second city of Blantyre along bumpy roads and tracks that can become impassable in a torrential downpour — is mining Bitcoin to fund its operation.\n\nIt is a smart idea. The computers used to create valuable new Bitcoin tokens and validate transactions consume around the same amount of energy as a medium-sized country such as Sweden would generate. Hence the stinging critique of how this cryptocurrency wastes the planet’s precious resources. This initiative flips that narrative by using Bitcoin mining to fund energy in parts of Africa that are too poor or remote to merit connection to grids, but which do have plentiful supplies of potential power sources. Mining soaks up the excess energy of these renewable plants. And this delivers not just electricity but a powerful jolt to to drive development in the local economy.\n\nThe concept comes from a Kenyan firm, Gridless, set up in 2022, whose backers include Twitter founder Jack Dorsey. There are four other sites in Kenya and Zambia and plans for scores more across the continent. Its aim is to demonstrate how Africa could play a central role in countering the conventional belief that Bitcoin, now 15 years old, is used simply for risky speculation and dodgy transactions. Instead, it backs those who claim it will lead to more inclusive financial systems as it usurps the control of dysfunctional governments and manipulative central banks.\n\nIt will also release the community from reliance on foreign handouts to survive. The Bondo power plants were built by Mount Mulanje Conservation Trust, a local group trying to protect the mountain region’s unique bio-diversity, and were initially supported by finance from aid and development agencies — but now Bitcoin covers the running costs. This offers a commercial incentive that does not rely on altruism or subsidies to deliver power to remote regions, while exploiting energy waste at times of low use such as overnight.\n\nMalawi, one of the world’s poorest nations, provides a powerful case study in the failures of aid. As former development minister Rory Stewart said in a lecture at Yale, Britain gave £4.5billion over half a century to this southern African country corroded by corruption and bad governance, yet it ended up “if anything, poorer than it was when we started”.\n\n“Bitcoin can prevent Bondo becoming the sort of white elephant that you see across Africa, built by aid groups and then abandoned,” said Erik Hersman, chief executive of Gridless. He admits that he is “not a big fan” of the sector. “They come in with low-cost loans and grants to finance all these schemes that they say will pay their way in 30 years but the sums never add up. This is a new way to finance development.”\n\nMalawi also demonstrates another reason why there is rising interest in Bitcoin in Africa: people are seeking a safer home for their cash than local currencies. Prices rose sharply after its currency was devalued two months ago by 44% against the US dollar — the second decrease in value of the kwacha in 18 months. Many African countries on the continent have suffered also from catastrophic inflation, while official currency conversion rates can be significantly lower than street rates.\n\nOne Kenyan entrepreneur told me she turned to the cryptocurrency after seeing her savings constantly eroded even in a country with lower than average inflation for the continent. “I was trying to save to buy a house but kept finding my sums declining. I wanted more stability so tried Bitcoin, and then found it had other uses,” said Marcel Lorraine, founder of Bitcoin DADA. Her clients include a trader of alternative health products in a Nairobi street market, who found it much cheaper to use than changing currencies after being introduced to it by a Nigerian customer and is now hoping it will provide a stable platform for building her business to obtain a shop.\n\nWhile Warren Buffet dismissed Bitcoin as “probably rat poison squared” and the economist Paul Krugman has compared it to a Ponzi scam fuelled by libertarian fantasies and “technobabble”, devotees see it as a liberating force due to the decentralised design created by its mysterious and pseudonymous creator, Satoshi Nakamoto. BlackRock, the world’s biggest asset manager, has even applied to launch a Bitcoin exchange-traded fund that may open up the market to the US wealth management industry.\n\nCertainly Bitcoin, for all its fluctuations, can seem comparatively reliable if you live in Africa — or indeed many other parts of the planet, from Argentina to Lebanon. “This is what I have seen everywhere,” said Peter McCormack, who travels the world for a Bitcoin podcast. “Here is an alternative to gold and property for a middle class that has some money and patience, but is seeing expenses and costs rise while savings decline in value. And a strong middle class helps build a strong economy by driving consumer spending, reducing reliance on the state and driving innovation and entrepreneurship.”\n\nBitcoin has also become a helpful tool for activists and journalists in dictatorships, since it makes it far harder to track funds. In Togo, a West African state run by one despotic family since 1967, it is used to channel cash to opposition and civil society leaders despite the freezing of bank accounts. Bitcoin has been instrumental in delivering donations to Alexei Navalny’s Anti-Corruption Foundation in Russia and the pro-democracy movements in Belarus and Myanmar.\n\nAlex Gladstein, chief strategy officer for the Human Rights Foundation and author of a book arguing that Bitcoin offers freedom from archaic monetary systems and political strife, believes the cryptocurrency is especially exciting for Africans, since they suffer “all kinds of financial repression”. He points out there are 45 currencies on the continent — with 15 still controlled by France — with high transaction fees on conversion deals that are largely processed by Western firms with heavily-fluctuating rates. “Bitcoin provides an escape and an alternative for Africans while its use is less limited than some people think,” he says. “Entrepreneurs there have figured out how people without the internet can use Bitcoin, which is frankly remarkable.”\n\nThis agility is typical of the technological innovation exploding across Africa, driven by a young, rapidly growing and increasingly well-educated population. “The beautiful thing about Bitcoin is that it is a bottom-up technology and its adoption has been genuine at all levels,” said one key figure at the second African Bitcoin Conference in Ghana at the end of last year.\n\nOnly time will tell if Satoshi’s invention will turn out to be a bubble with bad consequences or, as optimists believe, a driver of profound change in the world. The fraud conviction of Sam Bankman-Fried, who ran one of the world’s biggest cryptocurrency exchanges, and admission of money-laundering by the boss of another major exchange has hurt the reputation of cryptocurrencies for many in the West. But Bitcoin certainly seems to offer something positive in societies scarred by autocracy, colonialism, military coups and woeful governance — as seen with those computers in a concrete shed in rural Malawi turning water into streams of cash to fund electricity."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29udHh0by5jb20vZW4vY3J5cHRvY3VycmVuY2llcy9lbC1zYWx2YWRvcnMtaW5ub3ZhdGl2ZS1iaXRjb2luLWNpdHktYW5kLXZvbGNhbm8tYm9uZHMtbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "El Salvador's Innovative Bitcoin City and Volcano Bonds Launch • - Contxto",
        "content": "In the first quarter of 2024, El Salvador is all set to issue its pioneering Bitcoin bonds, a strategic move to further its commitment to cryptocurrency. Named “Volcano Bonds,” these instruments are integral to financing the “Bitcoin City,” which is to be powered by geothermal energy from the Conchagua volcano. The project reflects President Nayib Bukele’s vision of a tax-free zone dedicated to Bitcoin enterprises, aiming to attract substantial global investments.\n\nEl Salvador’s innovative stride began in 2021 when it became the first country to adopt Bitcoin as legal tender. This move, primarily aimed at easing remittances and enhancing financial inclusivity, set the stage for its subsequent ventures. The country’s journey continued with significant regulatory progress in November 2022, establishing a comprehensive framework for digital asset management and issuance through the “Digital Asset Issuance” law.\n\nThe “Volcano Bond,” projected to raise a substantial $1 billion, will be used not only for the establishment of the Bitcoin City but also for the development of a Bitcoin mining infrastructure. This endeavor is seen as a step towards a sustainable financial ecosystem, leveraging the country’s geothermal resources for eco-friendly Bitcoin mining. With an annual return of 6.5% and a pathway to expedited citizenship for investors, these bonds offer an attractive proposition to global investors.\n\nEl Salvador’s commitment extends to Bitcoin-driven foreign direct investments, with significant initiatives like the 241-megawatt Bitcoin mine by Volcano Energy, indicating a strong move towards sustainable energy practices. This project, significantly funded by commitments including those from Tether, promises to boost the country’s position in the global Bitcoin ecosystem.\n\nIn a groundbreaking move, El Salvador also introduced the “Freedom Visa,” a citizenship program that accepts a $1 million investment in Bitcoin or Tether. This program is designed to attract High Net Worth Individuals and contribute to the nation’s economic development and prosperity.\n\nDespite initial skepticism, El Salvador’s bold financial experiments have begun to pay off. Its bonds have seen surging interest and investments from major financial entities, reflecting a growing confidence in the country’s financial health and future. This success story is seen as an inspiring model for other countries considering innovative financial solutions and has sparked broader discussions on the potential for Bitcoin to reshape the economic landscape in Latin America and beyond."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2NyeXB0by93aG8tb3ducy10aGUtbW9zdC1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Who Owns the Most Bitcoin Now? (2024) - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9pbmR1c3RyeS9taW50LWV4cGxhaW5lci13aGF0LXMtYmVoaW5kLXRoZS1zdXJnZS1pbi1iaXRjb2luLXByaWNlcy0xMTcwNDM0NTk3NTkxNS5odG1s0gFyaHR0cHM6Ly93d3cubGl2ZW1pbnQuY29tL2luZHVzdHJ5L21pbnQtZXhwbGFpbmVyLXdoYXQtcy1iZWhpbmQtdGhlLXN1cmdlLWluLWJpdGNvaW4tcHJpY2VzL2FtcC0xMTcwNDM0NTk3NTkxNS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Mint Explainer: What’s behind the surge in bitcoin prices | Mint - Mint",
        "content": "After rising by more than 150% in 2023, the price of bitcoin surpassed $45,000 on the second day of 2024, to its highest level since April 2022. Bitcoin is the world’s first cryptocurrency and the largest by market capitalisation. Many analysts and industry experts expect the rally to continue in the current calendar year, with some expecting bitcoin to rise to $100,000 in the coming months. (Although the price fell nearly 11% on Wednesday before bouncing back to $42,200, as per CoinDesk data. On Thursday morning in India, bitcoin was at about $43,100.)\n\nBitcoin last rose to its all-time high of $68,789 in November 2021 and then fell to a low of $15,760 in December 2022 amid the collapse of FTX, the largest cryptocurrency exchange, and fraud charges pressed by the US Securities and Exchange Commission against its CEO Samuel Bankman-Fried, fears of worsening macroeconomic conditions and rising interest rates.\n\nThe latest rally was triggered by impending developments–the halving of bitcoin rewards and the potential approval for a spot bitcoin exchange-traded fund in the US. The US Federal Reserve signalling interest rate cuts in 2024 has also helped the rally. Mint explains the factors behind the recent rally.\n\nWhat is halving of bitcoin rewards and how does it affect the price?\n\nThe creators of bitcoin designed the cryptocurrency with a cap of 21 million to limit its supply, which they felt would create a scarcity as demand rises and thus push up its value. So far, 19.6 million have already been mined, and 900 bitcoins are added per day currently. Crypto miners are rewarded 6.25 bitcoins at present for every block they create and a new block is produced approximately every 10 minutes.\n\nThe code written by the inventors of bitcoin requires the rewards per block to be halved every time 210,000 blocks are added–which usually happens every four years. This halving of rewards is expected to happen in April-May, and the number of bitcoins rewarded per block created will drop to 3.125.\n\nThe number of bitcoins minted per block was 50 when it was created. The rewards were previously halved in 2020, and before that in 2012 and 2016. The final halving will happen around 2140, after which it will not be possible to halve the rewards. At that point, the number of bitcoins in circulation is expected to be about 21 million.\n\nThe halving of bitcoin rewards per block slows the increase in the supply of the cryptocurrency. As a result, bitcoin prices usually start to rise much before the halving event and usually soar after the halving takes place.\n\nFor instance, in the 12 months following the last halving in 2020, bitcoin gained about 560%. Similarly, in the 12 months after the first halving in 2012, bitcoin jumped more than 8,000%. If the same trends persist, bitcoin may soar to the levels projected by various industry experts and analysts.\n\nWhy are investors looking forward to spot bitcoin ETF?\n\nThe US SEC has until 10 January to approve proposals of asset managers to launch spot bitcoin exchange-traded funds. There are over a dozen applications before the markets regulator. It is widely anticipated that the SEC will approve the ETF proposals much before the deadline (it may come this week), even though it has not given any indications whether it will indeed approve the applications.\n\nA regulated product like an ETF could encourage a lot more people and institutions to invest in bitcoins. Some estimate that about $3 billion may flow into the ETF products in the US on the first day.\n\nAmong those that have filed applications to launch ETFs based on the spot prices of bitcoin are Ark Investment, Franklin Templeton, BlackRock, Invesco and Fidelity.\n\nUnlike the bitcoin futures ETF, which involves investment in futures contracts, spot ETFs invest in the cryptocurrency directly. Investors in the US can currently invest in bitcoin futures ETF, which were first launched in October 2021. Most of the asset managers who have sought SEC approval for spot bitcoin ETFs already run bitcoin futures ETFs.\n\nCan the easing of interest rates also boost bitcoins?\n\nRising interest rates affected cryptocurrencies like all other asset classes that are risky. When the Fed held rates steady at its December meeting, cryptocurrencies gained.\n\nMore significantly, investors have been increasing their exposure to cryptos after a rough 2022, when stablecoins Terra and Luna crashed and the FTX scam came to light. With the Fed signalling that rate cuts may begin sometime in 2024, investors will be willing to increase their investment in risky assets such as cryptos.\n\nWhile there is a lot of optimism around bitcoin at this point, another FTX-like bankruptcy or a scam can cause the cryptocurrency market to crash like it did in 2022. Most of these catch investors unaware, leading to deep losses."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vZ2l6bW9kby5jb20vaXMtYml0Y29pbi1nb2luZy10by1kaWUtMTg1MTE0MDc5NdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Wait, Is Bitcoin Going to Die? - Gizmodo",
        "content": "The price of Bitcoin crashed nearly 10% on Wednesday, falling from $45,000 to below $41,000 in mere hours, hurting crypto’s best bull run in a year. But what, or who, could have been the culprit behind the crash? The day before, CNBC’s host of Mad Money, Jim Cramer, directed his powerful investing advice towards Bitcoin.\n\nHe Tossed His Bitcoin, Now He Wants It Back CC Share Subtitles Off\n\nEnglish view video He Tossed His Bitcoin, Now He Wants It Back\n\n“You can’t kill it,” said Cramer on CNBC Tuesday, referring to the remarkable rally Bitcoin had last year. “It’s here to stay,” he said, just a day before the biggest crypto crash of the new year.\n\n\n\nAdvertisement\n\nAdvertisement\n\nAh, yes, the kiss of Inverse Cramer. The X account @CramerTracker has been calling out the CNBC host’s bets since 2021, and noting the curious tendency for the opposite to happen.\n\nAdvertisement\n\n“Bear Stearns is fine,” said Jim Cramer in March 2008, just one week before the financial giant failed during the Great Recession. “I think you’re pretty much a visionary,” said Cramer to Sam Bankman-Fried a year before FTX collapsed and was revealed to be nothing but a massive fraud. Naive viewers may assume that Jim Cramer is simply wrong, but true fans understand the CNBC host commands the opposite of what he says to come true. Whether his powers are some ethereal connection to the finance gods, or something else, the latest showing of his inverse powers on Bitcoin is no exception.\n\n\n\nThe price of Bitcoin has been propped up in recent months by speculation that a Bitcoin ETF may soon get approved by the SEC. Coindesk reports that major financial institutions like Goldman Sachs, JPMorgan, and others are investigating how to play a key role in Bitcoin ETFs, which would mark a significant win for the cryptocurrency industry. The ETFs in question would offer a safer way for folks to invest in Bitcoin and would require large institutions to buy up a ton of digital currency. That being said, there’s nothing set in stone for the financial vehicle’s approval just yet.\n\n\n\nAdvertisement\n\nAlso on Wednesday, Singapore-based digital asset firm Matrixport published a research report forecasting the SEC would reject all spot bitcoin ETF applications, according to CoinDesk. Several analysts refuted Matrixpoint’s argument, as a strategist told CoinDesk that approval for a Bitcoin ETF is “a matter of when, not if.” However, some suspect this negative sentiment in a bullish environment to be the cause of the crash.\n\n\n\nIt’s difficult to tell what truly caused the crash, as Bitcoin’s price is motivated by countless factors, and it rebounded in price to more than more than $44,000 Thursday afternoon. That being said, Inverse Cramer is a force to be reckoned with, and the cryptocurrency’s fate is still in question."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3Lm9ubWFub3JhbWEuY29tL25ld3MvYnVzaW5lc3MvMjAyNC8wMS8wNC9iaXRjb2luLWNyeXB0b2N1cnJlbmN5LWdyZWF0ZXItZm9vbC10aGVvcnkuaHRtbNIBY2h0dHBzOi8vd3d3Lm9ubWFub3JhbWEuY29tL25ld3MvYnVzaW5lc3MvMjAyNC8wMS8wNC9iaXRjb2luLWNyeXB0b2N1cnJlbmN5LWdyZWF0ZXItZm9vbC10aGVvcnkuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Is Bitcoin 21st century's prime example of 'greater fool' theory? - Onmanorama",
        "content": "Bitcoin had a spectacular 2023 – over the 12 months, its market cap went up from Rs 26,00,000 crore ($319 billion) to Rs 69,00,000 crore ($830 billion) For context, the latest quarterly Indian GDP is almost equal at Rs 71,00,000 crore and market cap of 30 Sensex stocks on BSE is twice that at Rs 142,00,000 crore.\n\n\n\nReliance Industries runs the largest crude oil refinery in the world, the third-largest telecom company in the world by subscriber count and the largest retailer in India by revenue. In COVID-hit 2020, the largest equity fundraising in the world was by Reliance at $20 billion. And its market cap is Rs 17,50,000 crore. What then is the contribution of Bitcoin to command a market cap four times that of Reliance? Nothing.\n\nLast year, India’s second richest man Gautam Adani had to face a short seller attack from Hindenburg, inquiry by a Supreme Court-appointed committee and probing by market regulator SEBI. It was also the subject of investigative journalism from the Financial Times and others. India’s largest airport and seaport and largest green energy producers are part of his group.\n\nAdani Group ended 2023 with a market cap of Rs 15,00,000 crore from Rs 21,00,000 crore at the start of the year. But what has Bitcoin done in 2023 to add Rs 43,00,000 crore to its market cap and be valued at 4.6 times the market cap of the Adani Group? Again, nothing.\n\nBitcoin has simply gained in value – without producing any product or service that we use, without giving any cashflows to its investors such as interest or dividend, without owning any real or financial asset like factories or bonds and without having any intrinsic value of a commodity such as water, crude oil or rice. So where does its value come from?\n\nBitcoin enthusiasts might say that it is a currency and it is valued differently. If so, how does Bitcoin compare with official national currencies such as the Indian rupee or US dollar? Official currencies are backed by assets held by the issuer. That is, a Rs 100 note represents a claim worth Rs 100 on the assets in RBI's balance sheet. And what are those assets? Gold, bonds issued by the Government of India, USA, etc. And the government bonds are backed by the monopoly taxation power of the respective governments. In other words, Indian sovereign bonds are backed by the productive capacity of the Indian economy and US treasuries by the productive capacity of the largest economy of the world. So what is Bitcoin backed by? For the third time, the answer is nothing.\n\nValue from scarcity?\n\nAnother argument offered in defence of Bitcoin is that its supply is capped and hence there is scarcity which leads to the continuing appreciation in value whereas national currencies can be issued without any limit and hence may result in inflation and hyperinflation. How true is this?\n\nImagine a city where no restaurants serve biryani since it is unknown in that city. Sensing an opportunity, someone starts a restaurant serving biryani and it becomes a huge hit. As the demand goes up, the restaurant owner comes up with an idea to increase profits – he caps the number of biryanis sold per day at 500 even when there is a demand for 1,000 or more. Thus each biryani can be sold well above cost and will fetch super-normal profits. It is better than increasing the supply to match demand and selling at reasonable prices. Will this strategy succeed? Certainly not as new suppliers will set up shop to fill the unmet demand and thus super normal profits will remain just a dream. Capping Bitcoin supply and creating artificial scarcity is also like this as new private currencies will emerge to meet the unmet demand as there are no entry barriers.\n\nIs Bitcoin digital gold?\n\nGold is special because water, air, fire and acid will not corrode it. Thus all the gold ever produced still exists as shiny as ever. Most importantly, gold has natural scarcity which helps it retain and grow in value. But Bitcoin? One among the thousands of private virtual currencies with the only uniqueness being the first private virtual currency – which may make it a collector’s item and nothing more.\n\nRepresentations of cryptocurrencies are seen in this illustration, August 10, 2022. REUTERS/Dado Ruvic/Illustration\n\nThe genesis of Bitcoin\n\nBitcoin was created shortly after the global financial crisis to solve two problems. One inflation – inflation could eat away the value of your savings held as currency when central banks print money without limits. And banks going bust – banks often lose money when reckless lending creates unrecoverable loans. Bitcoin sought to solve these problems by capping the supply and keeping the currency under the self-custody of the saver. Legitimate goals, though in practice Bitcoin delivered neither.\n\nBut current advocates of Bitcoin promote it for a different reason. Their theory goes like this – the entire world would ditch national currencies and shift to Bitcoin which would be the lone global currency. As Bitcoin supply is capped and 90% of the total supply is already in the market, there will be a mad rush to buy Bitcoin from current holders and thus current holders will make huge gains. But 8 billion people, 190-plus sovereign states and all the entities in these states simply accept Bitcoin as the global currency – such a scenario looks Utopian.\n\nFor a moment imagine that such an economy does come about. Who will get rich? Those holding the Bitcoin. At whose expense? Those who work, create and produce; those who solve our problems; those who take humanity forward. Thus owners contributing nothing prosper and doers contributing everything get impoverished – is that fair by 21st century standards?\n\nWhat then explains Bitcoin’s price?\n\nThere are plenty of true believers in Bitcoin Utopia and then there are those who know Bitcoin is worthless, yet buy it at absurd prices hoping there will be that greater fool who will buy it for a still higher price from them. Bitcoin seems to be the 21st century’s most enduring example of the greater fool theory.\n\nDoes that mean only national currencies will survive in this world? Currency on its own has no value. It is valued simply because it can be exchanged for goods, services and assets. Currency will be exchanged with goods, services and assets as long as everyone is confident that everyone else will accept it. Also, the currency should store value without much erosion. For this, the money supply should move in tandem with changes in economic output and the productive capacity of the economy. So far only national currencies have met both these requirements to a reasonable extent.\n\nWe may create algorithm-based currencies which pass both the confidence and money stock tests successfully. But that currency is certainly not Bitcoin. Where does that leave Bitcoin? It is nothing more than a speculative token whose prices can go up or down for no particular reason."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZGVjcnlwdC5jby8yMTE4NzYvYml0Y29pbi1zcG90LWV0Zi1hcHBsaWNhdGlvbnMtc2Vj0gFBaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMTg3Ni9iaXRjb2luLXNwb3QtZXRmLWFwcGxpY2F0aW9ucy1zZWM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs Take a Big Step Toward Approval, Analysts Say - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAnalysts are weighing in on what happens next as the financial world awaits the first Bitcoin ETFs to be approved by the U.S. Securities and Exchange Commission—especially as filings started to move forward late Friday.\n\n“Okay,” Bloomberg Analyst James Seyffart said on Twitter, “[BlackRock’s] 19b-4 amendment is in too. Expect to see 11 of these this evening.”\n\nThere's the first 19b-4 amendment filing! Here we go. https://t.co/dz01aborw7 — James Seyffart (@JSeyff) January 5, 2024\n\nAD\n\nAD\n\nSure enough, by 6 p.m. ET on Friday, all of the Bitcoin ETFs filed their 19B-4 forms with the SEC.\n\nOkay, done for the night. All 11 of these #Bitcoin ETF filers are still in the Cointucky Derby pic.twitter.com/6i8wFaWZVe — James Seyffart (@JSeyff) January 5, 2024\n\nOrganizations like stock exchanges or investment firms file 19b-4 with the SEC to propose rule changes. The form details the changes and reasons, undergoes public review, and awaits SEC approval.\n\n“We've been hearing that the SEC has been working with the issuers on their 19B-4s,” Bloomberg Senior ETF Analyst Eric Balchunas said in an earlier interview with Rug Radio. “They're going back and forth on drafts. So that's why we've seen S-1 get updated. But the 19B-4s edits have gone right to the SEC. They haven't been refiled.\n\n\"So when we see those refiled, we'll know that the SEC has signed off on them as being final,” he continued.\n\nAD\n\nAD\n\nDuring a Friday Twitter Spaces interview with Rug Radio Balchunas suggested that once the SEC begins approving Bitcoin ETFs, the asset class could be worth billions.\n\n“A couple of billion will be a solid New Year for any category, but I'd be a little more optimistic than that, like maybe $10 billion in year one,” Balchunas said. “It's the short-term that is hard to predict here. In the medium term, we do see this, maybe in the ballpark of [$30 billion] to [$50 billion] over three years. And then maybe it settles to where gold is at about $100 billion over five to ten years.”\n\nDriving Balchunas’ bullish statement was the number of high-profile investment companies filing Bitcoin ETF applications with the U.S. Securities and Exchange Commission, including the largest investment firm in the world, BlackRock.\n\n“This is where I think I'm more optimistic because Blackrock has these model portfolios. And they have well over $100 billion,” he said. “So if they put even 1% into this new ETF as an allocation, that's a billion dollars.”\n\nBitcoin ETFs track the current price of Bitcoin and should act in lockstep with Bitcoin's price swings, giving investors exposure without the need to buy and store the digital asset.\n\n“I would say the ETF is a long bridge between those those two worlds, which is again why it's so interesting and fascinating.” Balchunas said.\n\nBalchunas also noted the damage done to the market by the collapse of the cryptocurrency exchange FTX and the subsequent arrest, trial, and conviction of founder Sam Bankman-Fried.\n\n“While FTX scared smaller fish out of crypto, the bigger fish are in the lake, which is what these ETFs are,” Balchunas said, adding that big fish don’t bite right away. “They’re harder to please, and they sniff around the bait. You don’t get them right off the bat like you do the small fish, but when the bites come, they should be bigger and more substantial, but I don’t see a crazy feeding frenzy.”\n\nAD\n\nAD\n\nBalchunas predicted that in the future, cryptocurrency trading is expected to become more cost-effective and efficient, with significantly lower transaction fees. This fee reduction will starkly contrast with the higher commissions charged by current platforms like Coinbase.\n\n“Five to ten years from now, even two years from now, is you're gonna have a really cheap, very liquid [market], liquid meaning when you trade it, it's only one basis point, so that makes Coinbase commissions look like highway robbery.”\n\nBalchunas also highlight the potential gains from the anticipated involvement of reputable brands and the regulatory approval of the Securities and Exchange Commission (SEC), which he said will add credibility and trust, emphasizing the changing views of retail investors.\n\n“Retail investors don’t have the FOMO they did in 2021,” Balchunas said.\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vZXZlbnRzL29uZWZ1bmQtdGhlLWlzc3Vlci1vZi1jeWJlci1ob3JuZXQtc3AtNTAwci1iaXRjb2luLTc1LTI1LXN0cmF0ZWd5LWV0Zi1yaW5ncy10aGUtY2xvc2luZy1iZWxs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "ONEFUND, the Issuer of CYBER HORNET S&P 500® and Bitcoin 75/25 Strategy ETF, Rings the Closing Bell - Nasdaq",
        "content": "Your symbols have been updated\n\nYou'll now be able to see real-time price and activity for your symbols on the My Quotes of Nasdaq.com.\n\nContinue"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tbG9uZy10ZXJtLWhvbGRlcnMtc3RhbmQtc3Ryb25nLWRlc3BpdGUtcmVjZW50LWNyeXB0by1tYXJrZXQtc2VsbG9mZi_SAWVodHRwczovL2NvaW5nYXBlLmNvbS9iaXRjb2luLWxvbmctdGVybS1ob2xkZXJzLXN0YW5kLXN0cm9uZy1kZXNwaXRlLXJlY2VudC1jcnlwdG8tbWFya2V0LXNlbGxvZmYvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 04 Jan 2024 08:00:00 GMT",
        "title": "Crypto Market: Bitcoin Long-Term Holders Stand Strong Despite Recent Crypto Market Selloff - CoinGape",
        "content": "In the face of a recent sell-off in the crypto market triggered by concerns over the SEC’s potential rejection of Spot Bitcoin ETFs, Bitcoin’s long-term holders, appear unfazed. Yonsei Dent, a prominent crypto trader and verified author at CryptoQuant provided a unique perspective on the market dynamics, revealing intriguing insights into how both short-term and long-term investors reacted to the recent ETF-related news.\n\nBitcoin Long-Term Holders Maintain Position Despite Market Volatility\n\nProminent crypto trader Yonsei Dent analyzed the BTC market upheaval on January 3rd, triggered by negative news on the spot Bitcoin ETF. Despite the price plunge from $45,000 to $40,000, current levels stabilize around $43,000.\n\nadvertisement\n\nMeanwhile, the analysis, shared by CryptoQuant on the X platform, delves into investor behavior using the SOAB (Spent Output Age Bands) and USD indicators. Notably, short-term holders (STH) in the 1 day-6 month range spent nearly $1 billion, while exiting near Breakeven, the analysis showed.\n\nOn the other hand, the 1 month-3 month cohort, who bought BTC at the range of $26,000-$42,000, consumed approximately $550 million, realizing profits amid volatility. However, the 3M-6M cohort showed minimal movement.\n\nSurprisingly, the analysis showed that the long-time holders (LTH) in the 6M-12M range sold $7.6 billion, anticipating a stronger market decline. In contrast, the 1 year-5 year group displayed little reaction, indicating resilience among investors “who endured the 2019-2022 cycle”.\n\nAlso Read: Terra Luna Classic Proposal To Burn 8 Million USTC Officially Rejected\n\nThe Recent Crypto Market Sell-off\n\nThe crypto market has witnessed a hefty selloff on January 3, amid hovering market uncertainties. Meanwhile, almost all the major cryptos have experienced significant declines, reflecting the downturn momentum witnessed in the market yesterday.\n\nMeanwhile, adding to the crypto community’s concerns, Matrixport’s forecast on Bitcoin’s price and the SEC’s potential rejection of Spot Bitcoin ETFs has created ripples. The prediction anticipates a rejection of all Spot Bitcoin ETF applications in January, possibly leading to a sharp decline in Bitcoin’s value to as low as $36,000.\n\nSimultaneously, this forecast has fueled anxiety, contributing to a significant liquidation of over $700 million in the crypto market over the last 24-hour time frame yesterday, with almost $500 million liquidated in just one hour.\n\nAlso Read: Crypto Enthusiasts Fire Back At IRS’s Controversial $10K Reporting Rule"
    }
]