[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMTYvaW52ZXN0aW5nLWV4cGVydC1uZXctYml0Y29pbi1ldGZzLWtleS1taWxlc3RvbmUuaHRtbNIBWGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDI0LzAxLzE2L2ludmVzdGluZy1leHBlcnQtbmV3LWJpdGNvaW4tZXRmcy1rZXktbWlsZXN0b25lLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "New bitcoin ETFs are a 'key milestone,' says investing expert—what they mean for your money - CNBC",
        "content": "As of Thursday, the Securities and Exchange Commission has approved a batch of 11 spot bitcoin exchange-traded funds for trading in the U.S. Cryptocurrency investors had been eagerly awaiting this moment. In anticipation of the ruling, traders bid up the price of bitcoin 155% in calendar year 2023, to more than $42,000. On the first day of trading, $4.6 billion worth of shares of the new ETFs changed hands, according to investing research firm CFRA. \"This is a key milestone in the ETF industry,\" says Todd Rosenbluth, head of research at VettaFI. \"For a generation of investors who have been embracing ETFs as their go-to investment vehicle, this opens the door for them to get exposure to this emerging asset class.\" In other words, these funds are a big deal. Here's why, and what you should know about them.\n\nBitcoin ETFs aren't new, but these are different\n\nIf you thought you'd seen a bitcoin ETF before Thursday's announcement, you're right — kind of. The previous generation of ETFs were designed to track the price of bitcoin by holding bitcoin derivatives. In general, the managers of these ETFs continuously bought and sold bitcoin futures contracts to try to replicate movements in bitcoin's value. This imperfect process often resulted in investment returns that didn't accurately track fluctuations in bitcoin's price. \"It was a broken product that never really worked,\" says Stephane Ouellette, founder and CEO of FRNT Financial. \"Buying bitcoin products in most retail accounts was very difficult.\" The new slate of ETFs clears up that problem. So-called spot ETFs track the price of bitcoin by actually owning bitcoin. \"It's perhaps a cleaner way of getting exposure to the asset,\" Rosenbluth says.\n\nETFs are a convenient way to get crypto exposure\n\nUnlike many popular ETFs, which track the performance of a diverse array of investments, the new bitcoin funds track one thing: the price of bitcoin. Which raises the question: Why not just own bitcoin? The answer, for many retail investors, will be convenience. Bitcoin ETFs can be purchased directly through your brokerage account and can live on your portfolio dashboard right next to all of your other investments. \"The investor that's likely to find this appealing is the one who has already bought other ETFs, whether it's tied to the S&P 500 or emerging markets or bonds or what have you,\" says Rosenbluth. \"This is going to work just like any other ETF of yours. You buy and sell it on the market during trading hours, you get exposure to the underlying investment and you can sell whatever it is you want in a tax-efficient way.\" One drawback of owning an ETF rather than owning bitcoin directly in a separate account is that an ETF charges an annual management fee. Expense ratios on the 11 new funds range from 0.2% of your assets in the fund to 1.5%, though several firms are temporarily waiving or lowering their fees to get customers in the door. Notably, some popular crypto exchanges, such as Coinbase, charge investors fees for trading bitcoin and other digital currencies.\n\nMore ETFs are likely coming"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiH2h0dHBzOi8vOTliaXRjb2lucy5jb20vYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "What is Bitcoin? Bitcoin Explained for Beginners (Updated 2024) - 99Bitcoins",
        "content": "What is Bitcoin? A Complete Beginner’s Guide\n\nBy: Ofir Beigel | Last updated: 1/16/24\n\nWant to know all there is to know about Bitcoin? Here at 99Bitcoins, we translate Bitcoin into plain English, so even if you have no technical background, you’ll be able to understand everything!\n\nIn today’s post, I’m going to give you a simple, plain English explanation about what Bitcoin is and why it’s so revolutionary.\n\nDon’t like to read? Watch our video guide instead!\n\nWhat is Bitcoin Summary\n\nBitcoin is the first decentralized digital currency. All Bitcoin transactions are documented on a virtual ledger called the blockchain, which is accessible for everyone to see. Bitcoin gives you complete control over your money, unlike other assets you own, which are regulated by banks and governments. As Bitcoin gains more popularity, more and more places accept it as a payment method.\n\nIf you want a more detailed explanation of Bitcoin, keep on reading. Here’s what I’ll cover:\n\n1. What is Money?\n\nBefore we talk about Bitcoin, I need to take a moment and talk about money. What is money exactly?\n\nAt its core, money represents value. If I do some work for you, you give me money in exchange for the value I gave you. I can then use that money to get something of value from someone else in the future.\n\nThroughout history, value has taken many forms, and people used a lot of different materials to represent money. Salt, wheat, shells, and, of course, gold have all been used as a medium of exchange.\n\nHowever, in order for something to represent value, people have to trust that it is indeed valuable and will stay valuable long enough for them to redeem that value in the future.\n\nPaper Money\n\nUp until a hundred years ago or so, we always trusted in someTHING to represent money. However, something happened along the way, and we’ve changed our trust model from trusting someTHING to trusting in someONE.\n\nLet me explain.\n\nOver time, people found it too cumbersome to walk around the world carrying bars of gold or other forms of money, so paper money was invented.\n\nHere’s how it worked: a bank or government would offer to take possession of your bar of gold, let’s say, worth $1,000, and in return, that bank would give you receipt certificates, which we call bills, amounting to $1,000.\n\nNot only were these pieces of paper much easier to carry, but you could spend a dollar on a cup of coffee and not have to cut your gold bar into a thousand pieces. And if you wanted your gold back, you simply took $1,000 in bills back to the bank to redeem them for the actual form of money, in this case, that gold bar, whenever you needed…\n\nAnd so, paper began its use as money as an instrument of practicality and convenience.\n\nHowever, as time progressed, and due to macroeconomic changes, this bond between the paper receipt and the gold it stands for was broken.\n\nNow, the path that led us away from the gold standard is extremely complex, but suffice it to say that governments told their people that the government itself would be liable for the value of that paper money. Basically, we all said, “Let’s just forget about gold and trade paper instead.”\n\nSo, people continued to trade with receipts that were backed by nothing but the government’s promise.\n\nAnd why did it continue to work? Well, because of trust. Even though there is no actual commodity backing paper money, people trusted the government, and that’s how fiat money was created.\n\nFiat Money\n\nFiat is a Latin word that means “by decree.” This means that the dollars, or euros or any other currency for that matter, have value because the government orders it to. It’s what is known as “legal tender” – coins or banknotes that must be accepted if offered as payment.\n\nSo, the value of today’s money actually comes from a legal status given to it by a central authority, in this case, the government. And so the trust model has changed, from trusting someTHING to trusting someONE (in this case, the government).\n\nFiat money has two main drawbacks:\n\nIt is centralized – You have a central authority that controls and issues it. In this case, the government or central bank. It is not limited by quantity – The government or central bank can print as much as they want whenever needed and inflate the money supply on the market. The problem with printing money is that because you’re flooding the market with more money, the value of each dollar drops, so your own money is worth less. When you see prices rising throughout the years, it’s not necessarily that prices are rising as much as the purchasing power of your money is dropping. You need more dollars to buy something that used to “cost less.”\n\n2. Transitioning to Digital Money\n\nOnce fiat money was in place, the move to digital money was pretty simple. We already have a central authority that issues money, so why not make money mostly digital and let that authority keep track of who owns what?\n\nToday, we mainly use credit cards, wire transfers, PayPal, and other forms of digital money. The amount of physical money in the world is almost negligible and is getting smaller with each year that passes.\n\nSo, if money today is digital, how does that even work? I mean, if I have a file that represents a dollar, what’s to stop me from copying it a million times and having a million dollars? This is called the “double spend problem.”\n\nThe solution that banks use today is a “centralized” solution – they keep a ledger on their computer, which keeps track of who owns what. Everyone has an account, and this ledger keeps a tally for each account. We all trust the bank, and the bank trusts their computer, so the solution is centralized on this ledger in this computer.\n\nYou may not know this, but there were many attempts to create alternative forms of digital currencies. However, none were successful in solving the double spending problem without a central authority.\n\n3. Centralized Money\n\nWhenever you give anyone control over the money supply, you’re giving them enormous power, and this creates three major issues:\n\nCorruption\n\nPower corrupts, and absolute power corrupts absolutely. When banks have a mandate to create money or value, they basically control the flow of value in the world, which gives them almost unlimited power.\n\nA small example of how power corrupts can be seen in Wells Fargo’s scandal, where employees secretly created millions of unauthorized bank and credit card accounts in order to inflate the bank’s revenue stream without their customers knowing about it for years.\n\nMismanagement\n\nIf the central authority’s interest isn’t aligned with the people it controls, there may be a case of mismanagement of the money. For example, printing a lot of money in order to save a certain bank or institution from collapsing, as what happened in 2008.\n\nThe problem with printing too much money is that it causes inflation and basically erodes the value of the citizen’s money.\n\nOne extreme example of this is Venezuela, where the government has printed so much money, and the value of it has dropped so much that people are no longer counting money but are weighing it instead.\n\nControl\n\nYou are basically giving away all control of your money to the government or bank. At any point in time, the government can decide to freeze your account and deny you access to your funds. Even if you use only cold hard cash, the government can cancel the legal status of your currency, as was done in India a few years back.\n\nThis was the state of things until 2009. Creating an alternative to the current monetary system seemed like a lost cause. But then everything changed…\n\n4. What is Bitcoin?\n\nIn October 2008, a document was published online by someone calling themself Satoshi Nakamoto. The document, also called a whitepaper, suggested a way of creating a system for a decentralized currency called Bitcoin.\n\nThis system claimed to create digital money that solved the double spending problem without the need for a central authority.\n\nAt its core, Bitcoin is a transparent ledger without a central authority, but what does this confusing phrase even mean?\n\nWell, let’s compare Bitcoin to the bank. Since most money today is already digital, the bank basically manages its own ledger of balances and transactions. However, the bank’s ledger is not transparent, and it is stored on the bank’s main computer. You can’t sneak a peek into the bank’s ledger, and only the bank has complete control over it.\n\nBitcoin, on the other hand, is a transparent ledger. At any point in time, I can sneak a peek into the ledger and see all of the transactions and balances that are taking place. The only thing you can’t figure out is who owns these balances and who is behind each transaction.\n\nThis means Bitcoin is pseudo-anonymous – everything is open, transparent, and trackable, but you still can’t tell who is sending what to whom.\n\nLet’s explain this with an example. Below, you can see certain rows from Bitcoin’s ledger. We can see that a certain Bitcoin address sent 10,000 Bitcoins to another Bitcoin address in May of 2010.\n\nThis specific transaction is the first purchase that was ever made with Bitcoin, and it was used to buy two pizzas by a guy named Laszlo. Laszlo published a post back in 2010 asking for someone to sell him two pizzas in exchange for 10,000 Bitcoins. Well, someone did, and now the price of these two pizzas is worth well over 270 million dollars today.\n\nBitcoin is decentralized\n\nThere’s no one computer that holds the ledger. With Bitcoin, every computer that participates in the system is also keeping a copy of the ledger, also known as the blockchain. So, if you want to take down the system or hack the ledger, you’ll have to take down thousands of computers that are keeping a copy of it and constantly updating it.\n\nBitcoin is digital\n\nThis means there’s nothing physical that you can touch in Bitcoin. There are no actual coins; there are only rows of transactions and balances. When you “own” Bitcoin, it means you own the right to access a specific Bitcoin address record in the ledger and send funds from it to a different address.\n\nWhy is Bitcoin such big news?\n\nWell, for the first time since digital money came into existence, we now have an alternative to the current system. Bitcoin is a form of money that no government or bank can control.\n\nThink about the time before the internet and how centralized the flow of information was. Basically, if you wanted information, you could get it from a few major players like the New York Times, The Washington Post, and others like them.\n\nToday, thanks to the internet, information is decentralized, and you can communicate and consume knowledge from around the world with the click of a button. Bitcoin is the internet of money – it’s offering a decentralized solution to money.\n\n5. Bitcoin Compared to Banks\n\nHere is why Bitcoin is different than the current banking system.\n\nComplete control over your money\n\nWith Bitcoin, you and you alone can access your funds (how you actually do this will be explained in a later video). No government or bank can decide to freeze your account or confiscate your holdings.\n\nCutting the middlemen\n\nThis means that in many cases, Bitcoin is cheaper to use than traditional wire transfers or money orders. Also, unlike fiat currencies, Bitcoin was designed to be digital by nature. This means you can add additional layers of programming on top of it and turn it into “smart money,” but more on that in later videos.\n\nFree for all\n\nBitcoin opens up digital commerce to over a billion people around the world who don’t have access to the current banking system. These people are unbanked or underbanked because of where they live and where they were born.\n\nHowever, today, with a mobile phone and a click of a button, they can start trading using Bitcoin, no permission needed.\n\n6. Frequently Asked Questions\n\nWho accepts Bitcoin?\n\nToday, there are several merchants online and offline that accept Bitcoin. You can order a flight or book a hotel with Bitcoin if you like. There are even Bitcoin debit cards that allow you to pay at almost any store with your Bitcoin balance. However, the road toward acceptance by the majority of the public is still a long one.\n\nHow does Bitcoin work?\n\nIn a nutshell, Bitcoin works by updating a ledger of transactions (aka the blockchain). Each computer that participates in the Bitcoin network holds a copy of this ledger and verifies every transaction going through it.\n\nIt’s like we’re keeping tabs on each other, and each new transaction is announced to everyone so they can update their own copy of the ledger. If you want a detailed explanation with examples of how Bitcoin works under the hood, check out my post about Bitcoin mining.\n\nWhy does Bitcoin have value, and how is it determined?\n\nBitcoin has value simply because people are willing to trade money for it. This means somebody finds it valuable and decides to buy it from someone else. At that exact moment, Bitcoin gained value.\n\nWhenever people refer to Bitcoin’s “price,” they are actually referring to the price of the last trade conducted on a specific trading platform (e.g., Bitstamp, Binance, Coinbase).\n\nUnlike US dollars, for example, there is no single, global Bitcoin price that everyone follows. For instance, Bitcoin’s price in certain countries can be different from its price in the US since the major exchanges in these countries include different trades.\n\nGenerally speaking, as more people want to buy Bitcoin (i.e., demand rises), then the value of Bitcoin rises.\n\nIf fewer people want to buy Bitcoin (i.e., demand falls), then they won’t be willing to pay as much. In that case, Bitcoin’s value will drop.\n\nCan Bitcoin be converted to cash?\n\nYes. Several sites like HodlHodl will allow you to find sellers of Bitcoin who accept cash. Additionally, there are Bitcoin ATMs that accept bills and dispense Bitcoin in return.\n\nIf you’re looking to convert Bitcoin to fiat currency but not necessarily cash (i.e., coins and bills), you can find a variety of trustworthy Bitcoin exchanges online.\n\nHow do I purchase Bitcoin?\n\nGet a Bitcoin wallet Find a Bitcoin exchange Sign up and verify your identity Deposit money to the exchange Trade your funds for Bitcoin Withdraw the Bitcoin to your wallet\n\nThat’s it! If you want a detailed guide about the process, check out my guide on buying Bitcoin.\n\n7. Conclusion\n\nCongratulations, you now know more about Bitcoin than 99% of the people around you! That wasn’t so hard, was it? As you can see, above all, Bitcoin was designed with one thing in mind: To provide you with a secure and private way to gain back control over your money.\n\nIf you want to dig even deeper into how Bitcoin works, we have additional posts about Bitcoin mining, Bitcoin wallets, how to buy Bitcoin, and more. The revolution of money began in 2009, and these days, we are seeing it change money as we know it.\n\nIf you have any additional questions or comments, just leave them in the comment section below."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTcvYml0Y29pbi1zZWVzLWl0cy1maXJzdC1ldmVyLXdlZWtseS1nb2xkZW4tY3Jvc3Mv0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8xNy9iaXRjb2luLXNlZXMtaXRzLWZpcnN0LWV2ZXItd2Vla2x5LWdvbGRlbi1jcm9zcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Sees First Ever Weekly 'Golden Cross,' a Bullish Signal to Some - CoinDesk",
        "content": "The bullish interpretation could be challenged because averages are based on past data and tends to lag prices. In other words, averages represent what happened in the past, and the first golden cross on the weekly chart results from bitcoin rallying over 70% to $42,700 in four months."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzAxLzE1L3NlYy1iaXRjb2luLWV0ZnMteC10d2VldC1oYWNrLWdvdmVybm1lbnQtdGVjaG5vbG9neS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Opinion | Why was the SEC slow on bitcoin ETF? A hacked tweet tells the tale. - The Washington Post",
        "content": "Last week’s hack of the Securities and Exchange Commission’s X account is a real-life metaphor so deliciously apt, so perfectly on the nose, it tells you almost all you need to know about the conundrums besetting modern regulators. Wp Get the full experience. Choose your plan ArrowRight The hack involved the SEC’s then-pending decision on whether to approve exchange-traded funds that hold bitcoin. Fund managers have been trying to bring such funds to market, but the SEC has been dragging its feet for a decade — and not entirely without reason: As cryptocurrency markets evolved, they garnered an astonishing number of scams. Also, the main use for bitcoin seemed to be speculating on the future price of bitcoin.\n\nA few years back, the SEC did allow ETFs based on bitcoin futures products; unlike crypto, futures markets are already highly regulated. But while the fuddy-duddies at the SEC might have thought this made the ETFs entirely different from just holding crypto, the U.S. Court of Appeals for the D.C. Circuit disagreed, issuing a ruling that made it hard for the agency to continue denying Americans our right to pointlessly speculate on high-tech monopoly money. After all, not everyone lives within walking distance of a casino.\n\nAdvertisement\n\nAll this set the stage for what happened last Tuesday, when the SEC’s account on X (formerly Twitter) said bitcoin ETFs had been approved. The price of bitcoin rose, only to recede minutes later when SEC Chair Gary Gensler hastily sent a message from his own account, saying that no, no, the SEC’s account had been compromised and bitcoin ETFs hadn’t yet been approved.\n\nFollow this author Megan McArdle 's opinions Follow\n\nIn an apparently unrelated incident the following day, some users reported seeing an approval go briefly live on the SEC site, before disappearing, presumably because someone had accidentally posted it too early. After the market closed, the approval went up again. Bitcoin ETFs were finally a reality.\n\nThe parables here are rich enough to mine forever: These events seemed to vindicate some wariness about moving our entire lives into the digital realm where they can so easily be hacked. But, then again, why should the bitcoin decision have been made by people who had apparently not — according to the safety team at X — bothered to enable a common security feature known as “two-factor authentication” on the SEC’s official account? For IT folks, this kind of basic precaution is, as security technologist Bruce Schneier put it, “kindergarten stuff.”\n\nAdvertisement\n\nThis looked particularly bad given that the SEC claims oversight of cybersecurity incidents in the private sector, and will probably not accept “I forgot” as an excuse if a company’s poor security results in market-moving hacks. (Further delicious detail: they had to reopen comment on one of those proposed rules because, uh, the internet comment form broke.) Also, it turns out that the government has been working for years on switching over to two-factor authentication. In September, the SEC issued an impressive-sounding progress memo that included a lot of meeting, establishing and implementing but not yet clicking the two-factor authentication checkbox in their social media security settings.\n\nWhich makes this not just a funny mini-scandal but also a story about how much worse the government is at technical things than the private sector it purports to oversee.\n\nWe’ve already heard many reasons the government struggles to do technology well: Salaries aren’t high enough to compete for top tech talent, and dedicated civil servants (yes, there are many) have to navigate around unfireable incompetents. But if you want to fully understand the perverse incentives that the political system creates for people trying their best to give us what we want and need, read “Recoding America,” by Jennifer Pahlka, who founded the U.S. Digital Service during the Obama administration.\n\nAdvertisement\n\nAmericans are obsessed with making sure that no government employee, anywhere, ever gets away with anything on the taxpayer dime. So we’ve stripped away their discretion, laying out extraordinarily detailed procedures for every single thing they do — which many then hew to exactly, no matter how outdated the guidelines or absurd the results because they know that when anything does go wrong, they will be called to account by politicians who understand very little about their jobs. Their safest response when this happens is, “Look, I was following the letter of the law you guys wrote.”\n\nThus, procurement is a glacial process. Much of the technology we do buy doesn’t work as well as it should because it was selected to fit guidelines written years ago — often by well-meaning people who were mainly thinking about making politicians happy and keeping the inspector general at bay. Even when they’re trying hard, government technologists have to contend with the decades of accumulated bureaucratic cruft.\n\nThis system is fine for an agency that doesn’t want to do anything — which I guess describes the SEC in this case. But even the most hard-nosed libertarian sometimes wants the government to change with the times and make something happen, like, say, approve a bitcoin ETF. This can’t happen if every agency is mummified in red tape."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3Qvd2h5LWJpdGNvaW4tZmVsbC1ldmVuLWFzLWV0ZnMtc2VlLWJpbGxpb25zLWluLW5ldy1tb25leS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin is falling even as ETFs see billions in new investment - DLNews",
        "content": "Bitcoin’s price has continued to fall despite a strong showing from multiple US spot ETFs.\n\nSome experts say Bitcoin is getting hit is the result of redemptions taking place across Grayscale.\n\nThe world’s largest cryptocurrency extended losses into the weekend even as multiple US spot Bitcoin exchange-traded funds posted a strong debut.\n\nBitcoin is down more than 10% following Thursday’s peak around $48,000.\n\nSo what gives?\n\nOff-ramp\n\nBitcoin plunged 10% from its peak above $48,000 following SEC approval last week as investors used the event to book profits and exit long term bets.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nMarket observers say participants were likely selling the news, as the euphoria surrounding the approval of Bitcoin exchange traded funds subsides.\n\n“There was always a possibility of ‘sell the news’ pressure from speculators who were front-running approval,” even accounting for some $800 million in new inflows to the Bitcoin ETFs, macro analyst Noelle Acheson, author of the Crypto is Macro Now newsletter and former head of research at Genesis, wrote Friday.\n\nBitcoin's price slid following the launch of spot ETFs in the US. (TradingView)\n\nInvestors are also likely seeking redemptions from Grayscale’s Bitcoin ETF, analysts said.\n\nGrayscale’s bid to win approval for its own ETF was successful. With about $28 billion in assets under management, the ETF nod has helped creditors of high-profile bankruptcies like FTX.\n\nJoin the community to get our latest stories and updates\n\nNow, some investors are demanding their money back.\n\nSince the fund converted to an ETF, investors are able swap their GBTC shares one to one for the value of the Bitcoin they represent, giving them an off-ramp after years without a redemption function.\n\nMany GBTC investors appear desperate to cash in on their shares.\n\nGBTC, whose volume surpassed $2.3 billion on day one trading, has seen a total of $579 million flow out so far, although final data won’t be available until Tuesday due to a lag in settlement.\n\nThe market will likely have to absorb some of the GBTC outflows, Bernstein analysts Gautaum Chhugani and Mahika Sapra said in a note on Monday.\n\n“It is fair to assume new ETFs would continue to absorb GBTC redemptions. Thus, it might take longer for new incremental inflows to start impacting fresh demand and the price momentum on underlying Bitcoin,” Chhugani and Sapra said.\n\nStill, an exodus by investors could present new challenges for the 11-year-old firm as it fights to stay competitive in a low-fee environment.\n\nCrypto market movers\n\nBitcoin fell 0.3% since Sunday, trading around $42,600.\n\nEthereum was flat over the past 24 hours. It traded just above $2,500 by 1 pm London-time.\n\nWhat we’re reading\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3RyYWNraW5nLWJpdGNvaW4tcHJpY2UtdG8taGFsdmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin price tracking ahead of the past 2 halvings — now 3 months to go - Blockworks",
        "content": "Bitcoin ETFs haven’t yet summoned a tidal wave of fresh capital to crypto markets, but fret not. The next supposed price catalyst, the bitcoin halving, is right around the corner.\n\nLegend has it that bitcoin halvings are monstrously bullish. After all, the last three bull markets each began roaring only a few months after each event.\n\nThere have only been three halvings in Bitcoin’s history, in 2012, 2016 and 2020, and three is far too small a sample size from which to draw any meaningful conclusion.\n\nRead more: Bitcoin halvings are bull market things — Will this time be different?\n\nStill, fewer bitcoins released each day will lead to a supply crunch, believers would say, inevitably pushing bitcoin (BTC) skyhigh.\n\nTruth is, nobody really knows what will happen around the halving, but it’s the bitcoin miners who will feel its immediate effects.\n\nBitcoin distributes all new bitcoins directly to miners, who in about three months (around April 19) will suddenly earn 50% fewer block rewards: 3.125 BTC ($135,000) per block down from 6.25 BTC ($270,000).\n\nBitcoin self-regulates the time between blocks, keeping it around 10 minutes on average.\n\nMiners usually solve 144 blocks in a 24-hour period, which won’t change after the halving.\n\nBlock rewards currently add up to 900 BTC ($38.9 million) each day.\n\nMiners can sell the bitcoin they earn to cover overheads (mostly electricity and in some cases debt). Bitcoin users also pad out block rewards with transaction fees, and thanks to the popularity of Ordinals inscriptions, they’re forking out more than ever to use the network.\n\nUsers altogether paid about $500,000 per day in October but as much as $24 million in December, although miners have earned under $10 million per day in January so far.\n\nTransaction fees could bridge the revenue gap after the halving\n\nThat still works out to be about half the block rewards up for grabs after April 19. But bitcoin’s price would need to stay about the same until then, alongside consistent demand for inscriptions.\n\nBitcoin staying up would solve halving concerns\n\nAll this makes bitcoin’s price a very sensitive issue for the network.\n\nIt’s always possible that the price of bitcoin could drop so low that it would force miners to switch off their rigs lest they run at a loss — a common occurrence throughout the last two bear markets, leading to debt raises and a string of bankruptcies.\n\nRead more: Compute North’s business goes south\n\nOne estimate from Glassnode last September suggested that bitcoin dropping to $30,200 would “likely put the majority of the mining market into severe income stress.” Bitcoin trades for $43,000 right now, which would mean bitcoin miners could hypothetically withstand a 30% drop in bitcoin’s price around the next halving.\n\nGlassnode’s calculation was done weeks before Ordinals inspired a gigantic boom in fees, so it’s likely miners will have more breathing room than first anticipated.\n\n(There’s also far more hashrate on the Bitcoin network than ever before and its overall security is unlikely to be significantly impacted even if a large percentage of miners were to be switched off for any reason.)\n\nBlock rewards are paid in bitcoin and are unaffected by its US dollar value. So, the opposite scenario, in which the price of bitcoin pumps significantly around the halving is, of course, much better for miners and everyone else.\n\nThere’s no real price pattern around bitcoin’s halvings. Except it generally goes up\n\nAny concerns over whether block rewards will be enough to keep miners afloat after the halving could be properly put to bed if bitcoin’s price were to simply double.\n\nSo far, so good. Tracking prices 200 days out from the past three bitcoin halvings shows BTC already rallying by 50% until now, largely propelled by buzz around BlackRock and others’ bitcoin ETF bids.\n\nThat’s better than the lead up to the past two halvings. Bitcoin had jumped by less than one third by this point before the 2020 halving, and in 2016, bitcoin had fallen 3%.\n\nBitcoin’s performance around the first halving in 2012 blows the others out of the water. BTC rallied nearly 150% in the 200 days leading up to the event. Including the 200 days after stretches that number up to 4,500%.\n\nBitcoin is just as likely to map how its biggest fork, bitcoin cash (BCH), performed around its own halving.\n\nBCH tripled in the 200 days leading up to it and tripled again in the month after — but would go on to collapse by two-thirds over the following weeks.\n\nUpdated Feb. 5, 2024 at 4:21 am ET: Fixed scale on chart\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnRoZWJhbmtlci5jb20vTXVjaC1hbnRpY2lwYXRlZC10aGUtVVMtU0VDLWFwcHJvdmVzLWJpdGNvaW4tRVRGcy0xNzA1MzkzMzgy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Much anticipated, the US SEC approves bitcoin ETFs - The Banker",
        "content": "In a move widely anticipated, and eagerly awaited, by the industry, the US Securities and Exchange Commission has approved the first US-listed exchange-traded funds (ETFs) to track bitcoin. Many in the sector are calling this a watershed moment for the crypto industry.\n\nSome industry figures have been predicting this move by the SEC for some time. However, the sheer size and influence of the US market, combined with its reputation for being less than welcoming to the crypto-asset market, make this announcement significant. SEC chair Gary Gensler is considered a fierce critic of cryptocurrencies."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjQvMDEvMTUvYW5hbHlzdC1leHBsYWlucy1yZWFzb25zLWJlaGluZC1iaXRjb2luLXNlbGwtb2ZmLWZvbGxvd2luZy1ldGYtbGF1bmNoLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Analyst explains reasons behind Bitcoin sell-off following ETF launch - CNBC",
        "content": "In this video\n\nShare Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nAnalyst explains Bitcoin's sell-off following the ETF launch\n\nMarkus Thielen of 10x Research breaks down the price correction for Bitcoin following the SEC's approval for spot Bitcoin ETFs."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTYvYXJ0aHVyLWhheWVzLWJlbGlldmVzLWJpdGNvaW4tZXRmcy1jb3VsZC1icmluZy1pbi1iaWxsaW9ucy1mcm9tLXRyYWRmaS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzE2L2FydGh1ci1oYXllcy1iZWxpZXZlcy1iaXRjb2luLWV0ZnMtY291bGQtYnJpbmctaW4tYmlsbGlvbnMtZnJvbS10cmFkZmkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Arthur Hayes Believes Bitcoin ETFs Could Bring in Billions From TradFi - CoinDesk",
        "content": "Meanwhile, Hayes said earlier in January that he is bearish on bitcoin in the short term and expects prices to undergo a 30% correction . It’s a sentiment shared by several other traders, who expect prices to fall as low as $38,000 before the next leg up."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTYvZ3JheXNjYWxlLW1vdmVzLWFub3RoZXItOWstYml0Y29pbi10by1leGNoYW5nZS1pbi1wcmVwYXJhdGlvbi1mb3Itc2FsZS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzE2L2dyYXlzY2FsZS1tb3Zlcy1hbm90aGVyLTlrLWJpdGNvaW4tdG8tZXhjaGFuZ2UtaW4tcHJlcGFyYXRpb24tZm9yLXNhbGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Grayscale Moves Another 9K Bitcoin to Exchange in Preparation for Sale - CoinDesk",
        "content": "Following U.S. regulatory approval for a spot ETF last week, Grayscale's GBTC has seen net outflows as investors sold for any number of reasons, the elimination of the discount to net asset value and lower fees at competing ETFs among them."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyNC8wMS8xNS93aWxsLXRoZS1uZXh0LWJpdGNvaW4taGFsdmluZy1iZS1hbm90aGVyLWh5cGUtY3ljbGUv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDI0LzAxLzE1L3dpbGwtdGhlLW5leHQtYml0Y29pbi1oYWx2aW5nLWJlLWFub3RoZXItaHlwZS1jeWNsZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Will the Next Bitcoin Halving Be Another Hype Cycle? - CoinDesk",
        "content": "In fact, the current bitcoin mining difficulty is at historic highs, with computing power jumping over 100% in 2023. CoinShares predicts this to fall off after the halving with a “miner exodus.” The company also said the “average cost of production per coin” could normalize at just under $38,000 post-halving, given the complicated interrelation between hardware and electricity costs, difficulty levels and the cost structures that determine whether certain miners are making or losing money, which determines how many miners are on the network."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTUvYml0Y29pbi10cmFkZXJzLWV5ZS1zdXBwb3J0LWF0LTQway1hcy1ldGYtY29udHJhcmlhbi1iZXRzLXByb3ZlLXJpZ2h0L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTUvYml0Y29pbi10cmFkZXJzLWV5ZS1zdXBwb3J0LWF0LTQway1hcy1ldGYtY29udHJhcmlhbi1iZXRzLXByb3ZlLXJpZ2h0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Traders Eye Support at $40K as ETF Contrarian Bets Prove Right - CoinDesk",
        "content": "“However, while the ETF launches are exciting, we think they offer no advantage over self-custody. For long-term holders, the fee emissions will bleed a position substantially. It may take many years, but we expect demand for ETFs to dwindle as bitcoin adoption rises and self-custody becomes more common among institutions,” Robinson added."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyNC8wMS8xNi9hZnRlci10aGUtZXRmLWJpdGNvaW5zLWNvbWluZy1wb3dlci1zdHJ1Z2dsZS_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjQvMDEvMTYvYWZ0ZXItdGhlLWV0Zi1iaXRjb2lucy1jb21pbmctcG93ZXItc3RydWdnbGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "After the ETF: Bitcoin’s Coming Power Struggle - CoinDesk",
        "content": "But let’s now adjust for so-called dormant coins. It’s reasonable to assume that a decent number of bitcoins that have not moved out of their current address for more than five years won’t ever be moved – either because they are controlled by diehard HODLers or because their owners have lost the private keys. Those coins – currently representing around 30% of the total market cap, according to Glassnode – cannot be treated as an exact proxy for “dead coins,” but should be taken into account when estimating the size of the active Bitcoin ecosystem."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzE1L2pwbW9yZ2FuLXNlZXMtc2lnbmlmaWNhbnQtY2FwaXRhbC1mcm9tLWV4aXN0aW5nLWNyeXB0by1wcm9kdWN0cy1wb3VyaW5nLWludG8tbmV3LXNwb3QtYml0Y29pbi1ldGZzL9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzE1L2pwbW9yZ2FuLXNlZXMtc2lnbmlmaWNhbnQtY2FwaXRhbC1mcm9tLWV4aXN0aW5nLWNyeXB0by1wcm9kdWN0cy1wb3VyaW5nLWludG8tbmV3LXNwb3QtYml0Y29pbi1ldGZzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "JPMorgan Sees Significant Capital From Existing Crypto Products Pouring Into New Spot Bitcoin ETFs - CoinDesk",
        "content": "The bank says about $3 billion could exit the Grayscale Bitcoin Trust (GBTC) and migrate to the new spot ETFs as a result of investors taking profit after buying discounted GBTC shares in the secondary market in the last year. It also sees up to $20 billion from retail investors migrating from digital wallets held at crypto exchanges to the new ETFs.\n\n\n\nGrayscale’s high fees could also trigger outflows, and unless it lowers its rates toward the level set by Blackrock (BLK) and other providers, “a lot more capital, perhaps an additional $5 billion-$10 billion could exit GBTC relatively quickly to migrate towards cheaper spot bitcoin ETFs,” the bank added.\n\n\n\nInstitutional investors that hold their crypto in fund format could shift from futures-based ETFs and GBTC to cheaper spot ETFs, especially if GBTC is slow to cut its fees, the report added.\n\n\n\nRead more: Bitcoin ETF Approval Is Likely to Benefit Institutional Investors: Goldman Sachs"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcyNjc1L3RocmVlLXVuZXhwZWN0ZWQtcmlza3MtZnJvbS13YWxsLXN0cmVldHMtZm9yYXktaW50by1iaXRjb2lu0gFjaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjcyNjc1L3RocmVlLXVuZXhwZWN0ZWQtcmlza3MtZnJvbS13YWxsLXN0cmVldHMtZm9yYXktaW50by1iaXRjb2lu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Three unexpected risks from Wall Street's foray into bitcoin - The Block",
        "content": "Bitcoin BTC -6.08% has officially gone mainstream in the U.S. after the approval of 11 spot bitcoin ETFs. Products by issuers such as BlackRock, Fidelity and Bitwise debuted on Thursday and exceeded $7 billion in cumulative trading volume over the first two days of trading.\n\nFor years, the crypto industry has been waiting for this approval to bring a huge inflow of fresh funds into the market, which is now open to the largest legacy finance firms and crypto-curious retail investors who are not ready for the technicalities of crypto.\n\nHowever, bitcoin meeting Wall Street has its risks, too. Some long-time bitcoiners point at potentially increasing concentration of bitcoin ownership in the hands of a small group of institutions, potential rehypothecation and changes in the way the bitcoin community governs itself.\n\nA single point of failure\n\n\n\nThe most obvious concern noticed by many prominent crypto individuals is that all the bitcoins backing the ETF shares will be held by only a handful of assigned custodians. Most of the issuers listed Coinbase as their custodian, with exceptions of VanEck, who chose Gemini, and Fidelity with its own custody product.\n\nJameson Lopp, co-founder and CTO of a bitcoin custody firm Casa, points out that in such situation, the custodian becomes a single point of failure and there are “relatively few ‘doors’ that would need to be knocked upon by government agencies,” if they wanted to seize the bitcoin locked in the ETFs, he told The Block.\n\nJeffrey Ross, the founder and managing director of an asset management firm Vailshire Capital, believes this concern is “overblown.” Theoretically, there is a risk of a custodian to make a mistake and lose large amounts of clients’ bitcoin, but large finance firms like the current ETF issuers have measures in place to prevent such accidents from happening, he told The Block.\n\nAs for a potential government seizure, people draw analogies with the Roosevelt-era ban on gold ownership. However, back then, the U.S. dollar was backed by gold, making it an essential component of monetary policy, and bitcoin is not in the same position, Ross said. “There is no reason for the government to seize bitcoin from Americans,” he added.\n\nA new type of double-spending attack\n\n\n\nAnother potential concern can be the so-called financialization of bitcoin, or the transfer of practices from traditional finance into the bitcoin economy, which until now has been functioning more or less by its own standards.\n\n“The ETFs are a double-edged sword for the bitcoin ecosystem,” says Caitlin Long, founder and CEO of Custodia. “The big drawback is that new forms of leverage-based financialization of bitcoin will happen. The SEC did the right thing by prohibiting custodians from lending the bitcoin that backs the ETF units, but there will be commingling, collateral substitution and leverage on the layer above that,” Long told The Block.\n\nBitcoin-based securities will essentially create bitcoin IOUs (“I owe you”), says Casa’s Lopp. This means that with ETFs, instead of actual bitcoins stored in hardware and software wallets, people will own something that represents the value of bitcoin but has none of its essential properties like decentralization, permissionless nature and visibility on a public ledger.\n\n“Since you can't verify a company's balance sheet, you can't be sure that your IOU is redeemable for the asset it represents,” Lopp said in a blog post last year.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nAs Long points out in a post on X, there are examples of Wall Street firms artificially inflating the supplies of stocks by buying and selling non-existent shares. Now they can try and pull the same tricks with bitcoin.\n\nVailshire Capital’s Ross says the current design of the ETFs approved by the SEC does not allow the issuers to loan the bitcoin backing the ETFs. However, with time, more complex derivatives can be created on top of these ETFs — which could open the doors for more reckless behavior. Already, one of the bitcoin ETF issuers, Grayscale, has filed an application with the SEC for a covered-call ETF, which is designed to generate income from a position in its GBTC ETF.\n\n“You will have to trust that the SEC is monitoring that, but the SEC also has a track record of not monitoring things well,” Ross said. He is both pessimistic and optimistic about this concern. The transparency of public blockchains mean that companies could chose to make their holdings public. But companies are unlikely to provide this information unless the public demands it. And it will only demand it, Ross argued, if someone screws up.\n\n“In 2025-2026, there will be some Wall Street rug pull related to bitcoin,” Ross reckons.\n\nGovernance wars\n\nYet another concern being discussed is that the ETF issuing and trading institutions, which will accumulate a lot of bitcoin and gain some authority in the bitcoin community, wil start trying to influence how the bitcoin protocol is maintained going forward.\n\nFor instance, if the bitcoin blockchain is forked into two significant camps, this could be problematic for ETF issuers who are currently forced to disregard the proceeds from any forks (or airdrops) — potentially leaving them with a less valuable asset underlying their ETFs. They may be incentivized to dampen momentum for any such forks.\n\nCasa’s Lopp believes this idea is far-fetched. In the bitcoin “blocksize war” of 2016-2018, mining and crypto service companies became a voice in favor of forking bitcoin and increasing the maximum block size. However, they did not prevail and the bitcoin community opted to keep the block size as it was.\n\nThe difference between now and then is that, unlike companies that became active in the bitcoin scaling debate of the past, the ETF issuers won't be making many on-chain transactions and interacting with the bitcoin protocol as such. “So hopefully they will be less incentivized to become activists in the area of protocol development,” Lopp said.\n\nRoss, however, expects a new governance war to erupt some time after 2025. “[ETF issuers] will definitely try to make changes but that won’t matter,” Ross said. “They will probably try to switch to proof-of-stake or to change the fixed supply [of bitcoins] but there is almost no chance the true bitcoiners will allow this to happen,” he added.\n\nThe silver lining is, bitcoin ETFs are only a temporary fix for the transition phase, during which most people will switch from traditional financial instruments to bitcoin, Ross believes. The baby boomer generation currently owns the most wealth, but their children will not need an intermediary between them and bitcoin.\n\n“The longer people own bitcoin the more they will be incentivized to learn what bitcoin actually is. The younger generation will inherit the wealth of their parents and they will sell these ETFs and buy bitcoin,” said Ross."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTE1L2NvaW5iYXNlLWNvaW4tYXQtY2VudGVyLW9mLWJpdGNvaW4tYnRjLWV0Zi1tYWNoaW5lLXJhaXNlcy1jb25jZXJuc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Coinbase (COIN) at Center of Bitcoin (BTC) ETF Machine Raises Concerns - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzE2L3RoZS0zLXNwb3QtYml0Y29pbi1ldGZzLWlkLWNvbnNpZGVyLWJ1eWluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Decisions, Decisions: Discover the 3 Spot Bitcoin ETFs I'd Consider Buying - The Motley Fool",
        "content": "In a historic decision, the Securities and Exchange Commission (SEC) approved 11 applications to create a spot Bitcoin exchange-traded fund (ETF) on Jan. 10. Sponsored by high-profile investment firms including BlackRock, Fidelity, Invesco, Ark Invest, and several others, these ETFs allow investors to gain exposure to Bitcoin without having to directly buy and hold the cryptocurrency.\n\nAll of the ETFs accomplish the same goal, but they do so with some minor -- yet important -- differences. For investors looking to add some Bitcoin (BTC -6.67%) exposure to portfolios, here are the ones I'd consider.\n\n1. Bitwise\n\nNo. 1 on the list of candidates is Bitwise. Known for offering innovative crypto-related financial products like its Web3 Index Fund and Bitwise 10 Crypto Fund, Bitwise has become a leader in blending cryptocurrencies with traditional finance.\n\nAlready well-versed in the crypto world, Bitwise naturally jumped at the opportunity to join the spot Bitcoin ETF race, and it might be winning. Bitwise's Bitcoin ETF (BITB -5.80%) offers the cheapest exposure to Bitcoin since it has waived all management fees. This does come with a stipulation, however.\n\nOnce the ETF has reached $1 billion in assets under management or six months have passed, a 0.2% fee will be tacked on. Even once this waiver passes, Bitwise will still have the lowest fees on the market.\n\nFurthermore, Bitwise gets some kudos because it plans on donating 10% of profits to fund the development of Bitcoin. Given its roots in crypto, low fees, and dedication to Bitcoin philanthropy, Bitwise should be the top choice for investors.\n\n2. Fidelity\n\nComing in at No. 2 on the list is Fidelity with its Wise Origin Bitcoin Fund (FBTC -5.85%). As one of the first asset managers to test the crypto waters, Fidelity boasts a proven track record in traditional finance and experience with digital assets.\n\nAs a testament to its embrace of crypto, the company began mining Bitcoin in 2014. By 2018, it launched its own institutional crypto-custody service. And in March 2023, Fidelity unveiled a cryptocurrency exchange.\n\nBeing the third-largest asset manager in the world and with more than 80 years of experience in the finance sector, Fidelity's familiarity with crypto is rare. With this knowledge, Fidelity crafted a one-of-a-kind Bitcoin ETF. Rather than opting to outsource custodial responsibilities to another company, Fidelity will serve as the sponsor and the custodian for the ETF. Beyond managing the fund and its records, in other words, Fidelity also handles the actual trading and safekeeping of Bitcoin assets while most of the new ETFs outsource that function.\n\nBy overseeing the management of the underlying Bitcoin assets, Fidelity can maintain control over the security infrastructure, operational processes, and risk management related to its Bitcoin holdings. While it doesn't offer a grace period during which fees are waived, the slightly higher fee of 0.25% seems worth it, knowing that the firm directly manages its Bitcoin.\n\n3. VanEck\n\nRounding out the list is VanEck's Bitcoin Trust (HODL -5.85%). Similar to Fidelity, the firm has proven experience in the crypto world. In 2021, it launched a Bitcoin Strategy ETF (a fund that tracks futures contracts and is less accurate than the new spot ETFs) as well as its Digital Transformation ETF, which holds dozens of companies at the forefront of crypto innovation.\n\nVanEck stands out among the 11 approved spot ETFs for three reasons. First, it boasts one of the lowest-cost structures at just 0.25%. Second, before launch, the firm raised $72.5 million in initial capital, the most of any ETF issuer. With greater amounts of capital from the onset, this signals confidence from institutional investors in the ETF's investment strategy and potential. Not to mention, with more funds in the ETF, it could lead to lower fees in the future.\n\nLast but not least, VanEck is promising 5% of the profits it makes to fund Bitcoin development. The company has been adamant that it is devoted to expanding Bitcoin's potential to become \"the most important financial freedom technology of the internet age.\" A round of applause to VanEck.\n\nA final note\n\nBefore buying any of these ETFs, I would implore readers to consider the differences between achieving Bitcoin exposure via the stock market versus actually owning Bitcoin itself. To own the actual Bitcoin, investors must purchase it off a cryptocurrency exchange like Coinbase Global.\n\nIn doing so, investors have direct ownership and control over their holdings, thereby increasing security as the Bitcoin can be sent to cold storage wallets. When choosing the ETF route, you entrust a third party to manage the underlying Bitcoin. Make sure that's what you want before making this leap."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcmdlbnRpbmEtc2Vlcy1maXJzdC1iaXRjb2luLXJlbnRhbC0xMzE5NTA5MjcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Argentina Sees First Bitcoin Rental Agreement - Yahoo Finance",
        "content": "Argentina Sees First Bitcoin Rental Agreement\n\nIn a first for the country, a rental agreement denominated in Bitcoin was registered in Rosario, Argentina's third most populous city, according to local media reports on January 11, 2024.\n\nThe contract stipulates that the tenant will pay the equivalent of $100 in BTC per month to the landlord. Fiwind, a national cryptocurrency exchange, will be used to determine the exchange rate and execute the payments.\n\nThis type of rental agreement became possible following the executive order issued by President Javier Milei last year, which opened the door for contracts denominated in cryptocurrencies. While Bitcoin has been used in real estate sales before, this appears to be the first instance of its use in an Argentine rental contract.\n\nSpeaking on the executive order last month, Foreign Minister Diana Mondino clarified that lease agreements can now be settled not only in Bitcoin but also other cryptocurrencies and assets. However, the order faces legal challenges and could still be rejected by Congress."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTYvZmlyc3QtbW92ZXItYW1lcmljYXMtYmluYW5jZS10cmFkZXJzLWxlZC1zZWxsLXRoZS1mYWN0LXB1bGxiYWNrLWluLWJpdGNvaW4v0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8xNi9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaW5hbmNlLXRyYWRlcnMtbGVkLXNlbGwtdGhlLWZhY3QtcHVsbGJhY2staW4tYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "First Mover Americas: Binance Traders Led “Sell-The-Fact” Pullback in Bitcoin - CoinDesk",
        "content": "Bitcoin (BTC) has come under pressure since spot exchange-traded funds (ETF) began trading in the U.S. last Thursday. Data tracked by Paris-based Kaiko shows the selling pressure has been concentrated on Binance, the leading crypto exchange by trading volumes, OKX, and Upbit. Bitcoin, the leading cryptocurrency by market value, changed hands at $42,700 at press time, representing a 12% drop from the high of $48,975 reached Thursday. The price drop seems to have stemmed from traders taking profits on long (buy) positions initiated in anticipation of ETFs’ debut. An indicator called the cumulative volume delta (CVD) shows traders from Binance led the so-called “sell-the-fact” pullback in bitcoin. The CVD tracks the net difference between buying and selling volumes over time, offering a total of net bullish/bearish pressures in the market. Positive values indicate excess purchase volume, while negative values suggest otherwise."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzE1L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWJpdGNvaW4tcHVsbHMtYmFjay10by00MmstdmVuZXp1ZWxhLXNodXR0ZXJzLXBldHJvLWNyeXB0by1wcm9qZWN0L9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzE1L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWJpdGNvaW4tcHVsbHMtYmFjay10by00MmstdmVuZXp1ZWxhLXNodXR0ZXJzLXBldHJvLWNyeXB0by1wcm9qZWN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Pulls Back to $42K; Venezuela Shutters Petro Crypto Project - CoinDesk",
        "content": "Bitcoin (BTC) contrarian bets were seemingly proven right as the much-awaited approval of a spot exchange-traded fund (ETF) turned out to be a “sell-the-news” event, one that analysts previously warned was possible given the token’s rapid price appreciation in the past months. “Sell the news” is a well-known term in capital markets and describes how asset prices, leverage and sentiment run-up in the lead-up to a bullish event, only for prices to tumble shortly after. BTC pulled back to as low as $41,500 early Monday before recovering after briefly hitting its two-year high above $49,000 as the first-ever spot bitcoin ETFs in the U.S. started trading last Thursday. The approval of spot bitcoin ETFs in the U.S. was much anticipated and well priced, so the event will likely be a short- to mid-term top for the price, analysts at Japan-based crypto exchange bitBank told CoinDesk in an email."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZXhhbWluaW5nLXRocmVlLW9mLXRoZS1uZXctc3BvdC1iaXRjb2luLWV0ZnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Examining Three of the New Spot Bitcoin ETFs - Nasdaq",
        "content": "Last week, the Securities and Exchange Commission (SEC) finally granted a long-standing wish of cryptocurrency market participants and exchange traded funds (ETFs) user by approving spot bitcoin ETFs. To be precise, the commission approved 11 such products.\n\nThe news has been a good news/bad news scenario. Last year, bitcoin more than doubled in anticipation that related spot bitcoin ETFs would finally come to life in the U.S. That set the stage for a “buy the rumor, sell the news” and that’s exactly what’s happened. However, much of the digital currency’s retrenchment in recent days is believed to be attributable to investors selling the Grayscale Bitcoin Trust (GBTC), which was converted from an index fund to an ETF.\n\nOn the other hand, the good news is that spot bitcoin ETFs are finally here and these products could expand the universe of advisors and investors accessing cryptocurrency.\n\nOne caveat: With rookie ETFs with the same investment objective coming to market at the same time, end users have some homework to do to determine which spot bitcoin is best for them. I’ll help with some of that homework here.\n\nVanEck Bitcoin Trust (HODL)\n\nThe VanEck Bitcoin Trust (HODL) likely takes the take for best ticker among the new spot bitcoin ETFs as it adopts the acronym for “hold on for dear life,” which is often used in crypto parlance. HODL was seeded with more than $72 million, good for one of the largest tallies among the 11 spotcoin funds. While an ETF’s seed capital is just a small part of its story, that sturdy sum highlights VanEck’s commitment to this product.\n\nThat figure has since grown to $81.74 million, indicating HODL is off to a solid start and could soon surpass the $100 million assets under management range that is often important in the ETF space. Each 1,000 shares of HODL represents 1.132 bitcoin and its 0.25% annual expense ratio is the second-lowest among the 11 spot bitcoin ETFs. Plus, HODL has enviable DNA.\n\n“VanEck was the first established ETF issuer to prioritize this type of product. And it has taken more than six years to get to this launch today. As an experienced asset manager with significant crypto expertise, we’re in a unique position to help investors who have been waiting for this kind of vehicle to begin their own bitcoin journey,” said VanEck CEO Jan van Eck in a statement.\n\nValkyrie Bitcoin Fund (BRRR)\n\nThe Valkyrie Bitcoin Fund (BRRR) is sponsored by Valkyrie Digital Assets and comes with an expense ratio of 0.25% per year and that’s being waived for the first three months. That could be an attractive proposition for cost-conscious investors that are taking a long-term view of bitcoin.\n\n“The investment objective of the Trust is for the Shares to reflect the performance of the value of a bitcoin as represented by the CME CF Bitcoin Reference Rate - New York Variant (the “Index”), less the Trust’s liabilities and expenses. The Shares are designed to provide investors with a cost-effective and convenient way to invest in bitcoin,” according to the issuer.\n\nValkyrie offers several other crypto-related ETFs that preceded BRRR and that competency, along with the debut of BRRR, could have been a factor in CoinShares’ recent decision to move forward with an acquisition of Tennessee-based Valkyrie. With that, BRRR and the other Valkyrie ETFs could, at some point, bear the CoinShares name.\n\nFidelity Wise Origin Bitcoin Trust (FBTC)\n\nThe Fidelity Wise Origin Bitcoin Trust (FBTC) also charges 0.25% annually, but that fee is being waived until July. Additionally, Fidelity is one of the most recognizable brands in the spot bitcoin ETF arena and its distribution capabilities and advisor platforms could propel FBTC to rapid adoption among the registered investment advisor (RIA)/wealth management community.\n\nThat’s the opposite approach of rival Vanguard, which is barring clients from transacting in the new spot bitcoin ETFs. This isn’t a new approach for Fidelity. The fund giant has been involved with crypto for a decade and last year, its Wealthscape platform used by wealth managers added Fidelity Crypto. In fact, the issuer is framing FBTC as the go-to spot bitcoin ETF for RIAs.\n\n“FBTC offers a familiar investment structure, standard reporting, and transparent pricing for easy incorporation into client portfolio,” notes Fidelity.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzE2L2JpdGNvaW4tbWluZXItY29yZS1zY2llbnRpZmljLXRvLWVtZXJnZS1mcm9tLWJhbmtydXB0Y3ktcmUtbGlzdC1zaGFyZXMtdGhpcy1tb250aC_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjQvMDEvMTYvYml0Y29pbi1taW5lci1jb3JlLXNjaWVudGlmaWMtdG8tZW1lcmdlLWZyb20tYmFua3J1cHRjeS1yZS1saXN0LXNoYXJlcy10aGlzLW1vbnRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Miner Core Scientific to Emerge From Bankruptcy, Re-List Shares This Month - CoinDesk",
        "content": "The miner continues to expect to keep its pole position among peers when it emerges from its bankruptcy, according to a recent presentation, anticipating 182,000 mining rigs for its own operation this year, and ramping those up to almost 1.1 million in 2027. Core also expects to see nearly $600 million in annual revenue in 2024 and up to almost $1 billion by 2027."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luc2hhcmVzLWJpdGNvaW4taGFsdmluZy1zcXVlZXplLW1pbmVycy0wNDU2MDI4MjguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "CoinShares: Bitcoin Halving to Squeeze Miners' Margins - Yahoo Finance",
        "content": "CoinShares: Bitcoin Halving to Squeeze Miners' Margins\n\nAs the next Bitcoin halving event approaches, mining firms are bracing for significant cost increases. CoinShares has analyzed the impact of the halving and identified the companies best positioned to weather the storm in a recent report. The halving event, scheduled for April 2024, will reduce the block reward given to miners by half, slowing down the rate of new Bitcoin creation. This will likely lead to an increase in the cost of production and cash costs for miners.\n\nCoinShares predicts that the average cost of production and cash costs will increase from approximately $16,800 and $25,000 per Bitcoin in the third quarter of2023 to $27,900 and $37,800, respectively. The analysis suggests that Bitcoin mining firms Riot, TeraWulf, and CleanSpark are best positioned to navigate the halving event due to their cost structure and long runways. However, all miners will face challenges if the Bitcoin price falls below $40,000.\n\nCoinShares points out that while most miners are improving their fleet efficiency, the direct cost structure is not improving since they will need to increase their power draw and energy consumed to mine the same amount of Bitcoin. Electricity costs per Bitcoin pre- and post-halving form about 68% and 71% of miners' total cost structure, respectively.\n\nThe analysis also highlights the challenges faced by Core Scientific, which recently closed an oversubscribed $55-million equity financing round in an effort to return to solvency. Overall, the Bitcoin halving event will likely squeeze miners' margins, and only the most efficient and well-positioned firms will be able to remain profitable.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tZXRmLXRyYWRpbmctZGF5LTPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Spot bitcoin ETF trading volumes hit $1.8B on trading day 3 - Blockworks",
        "content": "Spot bitcoin ETFs have notched trading volumes of roughly $10 billion in their first three days on the market, with funds by Grayscale Investments and BlackRock continuing to lead competitors in that category.\n\nGrayscale’s newly converted Bitcoin Trust ETF (GBTC) notched Tuesday trading volumes amounting to about 25 million shares, or $970 million, a Blockworks review of Yahoo Finance data found.\n\nThat came after GBTC’s volumes were about $2.3 billion and $1.8 billion on Thursday and Friday, respectively.\n\nRead more: Bitcoin ETF Tracker\n\nHigh trading volumes for GBTC did not signify a net influx of funds. It saw net outflows of $579 million last week, as highlighted in a CoinShares report released on Monday. Recently, GBTC converted to an ETF format. Though recently converted to an ETF, the trust launched in 2013 and has roughly $27 billion in assets under management.\n\nSegment observers told Blockworks last week they expected GBTC to see outflows over time, in part because of its high fee compared to competitors, at 1.5%.\n\nRead more: Spot bitcoin ETF debut week inflows lagged 2021 BTC futures launch: CoinShares\n\nBlackRock’s iShares Bitcoin Trust (IBIT) saw trading volumes amounting to nearly 15 million shares, or roughly $370 million, on Tuesday. Meanwhile, there were about 8.2 million shares of the Fidelity Wise Origin Bitcoin Fund (FBTC) — worth about $310 million — traded on the day.\n\nBloomberg Intelligence analyst Eric Balchunas said in an X post that BlackRock’s IBIT was on its way to be the fund “most likely to overtake GBTC as liquidity king.”\n\nIndustry watchers labeled liquidity — tighter bid-ask spreads and capacity for large trades without much price impact — as a key factor certain investors would weigh when deciding which spot bitcoin ETF to buy.\n\nThe spot bitcoin ETF by Ark Invest and 21Shares, as well as one by rival firm Bitwise, had Tuesday trading volumes of about $124 million and $52 million, respectively.\n\nOther similar offerings by Invesco, VanEck, Franklin Templeton, Valkyrie and WisdomTree each had $10 million in volumes or less.\n\nLoading Tweet..\n\nBitwise initially led in net flows for spot bitcoin ETFs. However, BlackRock and Fidelity, traditional finance giants, surpassed the crypto-focused firm after the second day, as indicated by Bloomberg Intelligence data.\n\n21Shares President Ophelia Snyder told Blockworks the initial trading volumes reflect pent-up demand, noting she expects “a second wave of activity in the coming weeks and months as this becomes more mainstream.”\n\nRead more: Short-term view on spot bitcoin ETFs ‘a mistake’ says 21Shares president\n\nBut focusing on short-term flows into such funds is “crazy short-sighted and largely not the point,” she added.\n\n“It’s going to ramp over time,” Snyder said. “So I think the short-term view is a mistake.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vdGhlaGlsbHRvcG9ubGluZS5jb20vMjAyNC8wMS8xNi9uZXctYml0Y29pbi1ldGYtc29saWRpZmllcy1jcnlwdG9jdXJyZW5jeS1hcy1tYWluc3RyZWFtLWFzc2V0LWNsYXNzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "New Bitcoin ETF Solidifies Cryptocurrency as Mainstream Asset Class - The Hilltop Online",
        "content": "Depiction of bitcoin. (Photo Courtesy of The Economic Times)\n\nThe financial system and retail investing market landscape have undergone many changes throughout the years. Innovation continues to create new opportunities for institutional and retail investors in the progressing integration of technology and finance. Now, we may be seeing monumental changes to the asset class of cryptocurrencies, a security that has faced mixed sentiments since its inception.\n\nThe spot bitcoin exchange-traded fund (ETF) is an investment vehicle that allows ordinary investors exposure to the price moves of bitcoin in regular brokerage accounts. BlackRock, Fidelity and Bitwise are among the 11 money managers granted to release the product on their platform, according to CNBC.\n\nThese spot bitcoin ETFs provide cheaper access to investing in bitcoin by purchasing through the asset manager’s platforms versus purchasing them directly through a crypto exchange. Another benefit is that it eliminates the process of maintaining a cryptocurrency wallet and offline cryptocurrency storage to protect the investment.\n\nOn January 10, the Securities and Exchange Commission (SEC) approved the listing and trading of a number of spot bitcoin exchange-traded product (ETP) shares. This decision came after countless filings were disapproved by the commission, due to the SEC’s belief that the products would be exposed to market manipulation. However, the US Court of Appeals for the District of Columbia stated that the SEC failed to adequately explain its reasoning for disapproving Grayscale’s application for its spot bitcoin ETF in June 2022. The argument in this case was that the proposal did not meet anti-fraud and investor protection standards.\n\nBitcoin was the first cryptocurrency. It was launched in 2009 by a group of computer programmers under the pseudonym Satoshi Nakamoto. By the end of 2011, the price had grown past $1, peaking at $29.6 by mid-year. Fast-forward a decade to January 2021, and the price had surpassed its subsequent record price, peaking at $63,558 later that April.\n\nAn increasing number of institutions, platforms and countries have accepted bitcoin as a form of currency. The adoption of bitcoin has benefited nations such as Ukraine and Iran. On the other hand, countries like China and Saudi Arabia have made it illegal to use Bitcoin because of the fear of its volatility, decentralized nature and threat to monetary systems.\n\nIn the release, SEC Chair Gary Gensler said, “If the issuer of a security and the listing exchange comply with the Securities Act, the Exchange Act and the Commission’s rules, that issuer must be provided the same access to our regulated markets as anyone else.” However, bitcoin has continued to receive pushback and warning from Gensler.\n\nAdvertisement. Scroll to continue reading.\n\n“Investors should be aware that the underlying asset is a highly speculative, volatile asset and amongst its use cases is really for illicit activity… Money laundering, sanctions, ransomware, and alike,” he said.\n\nThese issues can pose a major risk to the legitimacy of the markets and the safety of others.\n\nAn example can be found in the United States Department of Justice (DOJ)’s investigation of Iranian firms bypassing US sanctions by processing billions worth of transactions through the crypto exchange Binance.\n\nLarry Fink, CEO of BlackRock, was originally not a supporter until a couple of years ago and is now a big believer in the movement. When asked about the long-term value proposition of Bitcoin, Fink supported that it would be an asset class that protects investors.\n\nAn asset like bitcoin has seen drastic price increases and decreases, but if volatility remains down over time and the value rises, investors will see it as a much more attractive asset to maintain.\n\n“If people are fearful of geopolitical risk or their own risk, it is no different than what gold has represented for thousands of years,” Fink said. “What we are trying to do is offer an instrument that can store wealth.”\n\nAdvertisement. Scroll to continue reading.\n\nIf the value of Bitcoin itself surges, investors buying into these newly released ETFs could come out as big winners moving forward. Ark Invest CEO & CIO Cathie Wood is confident that the asset will have a major price increase within the next few years.\n\n“Our base case is in the $600,000 range and our bull case is $1.5 million dollars by 2030,” she said.\n\nCopy edited by Jalyn Lovelady"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjczMDE0L3Byb3NoYXJlcy1maWxlcy1mb3ItZml2ZS1sZXZlcmFnZWQtYW5kLWludmVyc2UtYml0Y29pbi1ldGZz0gFjaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjczMDE0L3Byb3NoYXJlcy1maWxlcy1mb3ItZml2ZS1sZXZlcmFnZWQtYW5kLWludmVyc2UtYml0Y29pbi1ldGZz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "ProShares files for five leveraged and inverse bitcoin ETFs - The Block",
        "content": "ProShares on Tuesday filed prospectus materials for five leveraged and inverse bitcoin exchange-traded funds, just days after spot bitcoin ETFs began trading.\n\nThe names of the funds are ProShares Plus Bitcoin ETF, ProShares Ultra Bitcoin ETF, ProShares UltraShort Bitcoin ETF, Proshares Short Bitcoin ETF and ProShares ShortPlus Bitcoin ETF.\n\nOne of the funds \"seeks daily investment results, before fees and expenses, that correspond to two times (2x) of the daily performance of the Bloomberg Galaxy Bitcoin Index,\" according to the prospectus materials.\n\nTwo of the funds don't directly invest in bitcoin, and three do not directly short bitcoin, ProShares said in the filing.\n\nProShares' filing comes days after the Securities and Exchange Commission approved 11 spot bitcoin ETFs, which began trading on Jan. 11 and has since generated billions of dollars in trading volume.\n\n\"Quickly getting wild,\" Nate Geraci, president of investment advisor The ETF Store, said, commenting on ProShares' prospectus on Tuesday in a post on X. \"Vanguard definitely won't have these on their platform.\"\n\nVanguard has said it won't offer spot bitcoin ETFs on its brokerage platform, citing concerns over bitcoin's high volatility.\n\nRELATED INDICES See crypto indices\n\nOthers file parallel spot bitcoin products\n\nThe New York Stock Exchange, meanwhile, filed a 19b-4 to allow for the listing and trading of options \"on Commodity-Based Trust Shares.\"\n\nBloomberg Intelligence senior ETF analyst Eric Balchunas said the filing is for being able to list options on spot bitcoin ETFs.\n\n\"All three exchanges had to file a 19b-4 (here we go again lol). Earliest approval in 2mo-ish,\" Balchunas said on Tuesday in a Twitter post.\n\nGrayscale Investments filed for a so-called covered call ETF that seeks to generate income from a position in its converted GBTC last week."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3doeS1ldGZzLWFyZS1ub3QtaGF2aW5nLXBvc2l0aXZlLWVmZmVjdC1vbi1iaXRjb2luLXByaWNlLXlldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Why ETFs are not having positive effect on Bitcoin price, yet - CryptoSlate",
        "content": "Despite the influx of substantial capital into these new spot Bitcoin ETFs, with CoinShares reporting $1.18 billion in inflows into digital asset ETFs globally last week, the expected positive impact on Bitcoin’s price hasn’t materialized. This raises questions about the underlying mechanics of these ETFs and their influence on Bitcoin’s value.\n\nLet’s first ensure we correctly frame the situation. The recent price run-up picked up steam when BlackRock announced their filing for a spot Bitcoin ETF on June 15, 2023. At that time, Bitcoin’s price was around $25,000. Subsequently, there was a 70% increase to around $42,000, where it essentially traded sideways.\n\nAs the ETFs launched, Bitcoin spiked to $49,000 but sold off rapidly to around $42,000. Looking at the chart, it’s rational to suggest that perhaps Bitcoin was overbought at above $44,000 for this point in the cycle.\n\nWith that in mind, let’s look at how Bitcoin purchases work in relation to the recently sanctioned spot Bitcoin ETFs.\n\nHow Bitcoin is valued for ETF purposes.\n\nThe operation of spot Bitcoin ETFs is more complex than it appears. When individuals buy or sell shares of an ETF, like the one offered by BlackRock, Bitcoin is not bought or sold in real time. Instead, the Bitcoin that represents the shares is purchased at least a day earlier.\n\nThe ETF issuer creates shares with cash, which is then used to buy Bitcoin. This indirect mechanism means that direct transfers of Bitcoin between ETFs do not occur. Therefore, the impact on Bitcoin’s price is delayed and does not reflect real-time trading activity.\n\nEssentially, with an ETF like BlackRock’s, the share price on any given day is meant to represent the average price for Bitcoin across standard trading hours, not the live price of Bitcoin at any given time. Most ETFs use ‘The CF Benchmarks Index’ to calculate the price of Bitcoin for any given day; the CF Benchmarks website describes it as;\n\n“The CME CF Bitcoin Reference Rate (BRR) is a once a day benchmark index price for Bitcoin that aggregates trade data from multiple Bitcoin-USD markets operated by major cryptocurrency exchanges.”\n\nIt uses an average price across Bitstamp, Coinbase, Gemini, Itbit, Kraken, and LMAX Digital. According to CF Benchmarks, this is what the price of Bitcoin looks like. Notice its recent high was $47,525 on Jan. 11.\n\nHere is the same period and Y-axis scale using CryptoSlate data on a 1-hour timeframe. As of press time, Bitcoin is worth $42,594.27, according to CF Benchmarks, while CryptoSlate has it at $42,332.35 in real-time. This suggests the spot ETF, which is not available today as it is a public holiday in the U.S., is trading at a discount to spot Bitcoin ETFs.\n\nI’ll be honest: I didn’t think this was what would happen when the ETFs launched. I humbly believed that the ETFs would actually track the price of Bitcoin, and institutions would buy and sell BTC relative to the traded ETF shares. How wrong and naive I was.\n\nI read through the S1 filings in depth but did not consider that the underlying Bitcoin would be bought potentially days later via closed-door trades for average prices. I took it for granted that the CF Benchmark Index price would be a live aggregate price. Notably, that does exist, and it’s called the BRTI. However, this is only used for ‘reference’ purposes, not to calculate trade prices.\n\nHow Bitcoin gets into an ETF.\n\nThis is how Bitcoin is generally traded across the different spot Bitcoin ETFs.\n\nAuthorized Participants such as Goldman Sachs, Jane Street, and JPMorgan Securities place their creation orders for baskets of shares with a ‘Transfer Agent, Cash Custodian, or Prime Execution Agent’ by a set time on any standard business day. This is 2 pm for Grayscale, whereas BlackRock has a 6 pm cut-off time.\n\nFollowing this, the Sponsor (ETF) is responsible for determining the total basket Net Asset Value (NAV) and calculating any fees. This process is typically completed as soon as practicable; for example, with Grayscale, it’s 4 pm; for BlackRock, it’s 8 pm, New York time. Precise timing here is essential for ensuring the accurate valuation of the baskets based on the day’s closing market data.\n\nYou may have seen terms such as T+1 and T+2 floating around concerning ETFs. The term “T+1” or “T+2” refers to the settlement dates for these transactions. “T” stands for the transaction date, the day the order is placed. “T+1” means the transaction will be settled the next business day after the order is placed, while “T+2” indicates settlement occurring two days later.\n\nWith the spot Bitcoin ETFs, a liquidity provider transfers the total basket amount in Bitcoin to the Trust’s vault balance on either the T+1 or T+2 date, depending on the specific prospectus. This reportedly ensures the transaction aligns with standard financial market practices for settling trades.\n\nThe execution and settlement of the Bitcoin purchase and its transfer into the Trust’s trading wallet typically happen on T+1, not when the ETF shares are purchased.\n\nOTC Trading and its implications\n\nA crucial aspect of this mechanism is the Over-The-Counter (OTC) trading involved. Trades are conducted between institutional players in a private setting, away from public exchanges. While not directly influencing market prices, these transactions set a precedent for exchange prices.\n\nSuppose institutions, such as BlackRock, agree on a lower price for Bitcoin during these OTC trades. In that case, it can indirectly influence the market price if that information becomes available to the public or market makers. It does not, however, affect the live price of Bitcoin as these trades aren’t added to the global combined order book. They are essentially peer-to-peer private trades.\n\nFurther, based on the CF Benchmark Index pricing methodology, if Bitcoin were to trade at, say, $42,000 all day but then rally into close to $50,000 in the closing minutes of the day, the CF index price would likely be well under the current spot price depending on volume (and other complicated calculations made by CF Benchmarks.)\n\nThis would then mean the NAV would be calculated based on a lower price than the spot price, and any creations or redemptions for the following day would occur OTC, aiming to be as close to NAV as possible.\n\nAny market makers who have access to these OTC desk trades are then unlikely to want to trade Bitcoin at the current spot price of $50,000, potentially removing liquidity at these higher prices and thus bringing the spot price back in line with the NAV of the ETFs. In the short term, the ETF NAVs could play a much more significant role in defining the spot Bitcoin price and, therefore, reduce volatility toward a smoother average price.\n\nHowever, these trades must still occur on the blockchain, necessitating the transfer of Bitcoin between wallets. This movement, especially among institutional wallets, will become increasingly significant for market analysis.\n\nFor example, Coinbase Prime’s hot wallet facilitates trades, while institutions’ cold storage wallets are used for longer-term holding and can be analyzed on platforms like Arkham Intelligence.\n\nI believe the more transparent these OTC trades can become, the better for all market participants. However, the visibility of these activities is currently somewhat opaque, something the SEC seemingly believes is ‘best’ for investors."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tb24tcmVjb3ZlcnktcGF0aNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin on the recovery path? Ether remains the ETF winner - Blockworks",
        "content": "Cryptocurrencies were back in the green Tuesday while stocks traded sideways as bitcoin ETFs kicked off their third day of trading.\n\nBitcoin slid further over the holiday weekend in the US, before recovering slightly. It traded just under $43,000 Tuesday — around 1.5% higher over 24 hours — shortly after the open.\n\nBitcoin (BTC) is now down around 8% in the past week and has lost more than 11% since spot bitcoin ETFs hit the market Thursday. Ether (ETH), on the other hand, has surged on the bitcoin ETF news, gaining 12% in the past week and up close to 2% Tuesday.\n\nRead more: Bitcoin ETF Tracker\n\nThe S&P 500 and Nasdaq Composite indexes were mostly flat Tuesday after the open, losing around 0.2% and 0.1%, respectively. It’s a move that signals traders may not be as tied to interest rates as analysts had initially thought.\n\nAfter a disappointing inflation print last week — prices are currently 3.35% higher year-over-year — and hesitancy from Federal Reserve officials around the timeline for rate cuts, equities are faring better than expected, analysts say.\n\n“Despite those negatives and decidedly mixed earnings on Friday, stocks rallied and that begs this question: Do markets really care if the Fed cuts in March or not?” Tom Essaye, founder of Sevens Report Research, said. “The short answer is ‘no,’ they don’t. If the Fed does not signal a March rate cut, that will be a negative influence on stocks and bonds, but not a substantial one.”\n\nCrypto investment products saw inflows of $1.18 billion last week, according to data compiled by CoinShares. While impressive, this is not a record, CoinShares analysts noted.\n\nRead more: BlackRock bitcoin ETF is outperforming bitcoin\n\nWhen bitcoin futures ETFs launched in October 2021, crypto investment products saw inflows of $1.5 billion during the first week. The first futures ETF hit the market on a Tuesday, while spot products started trading on Thursday.\n\nGrayscale’s Bitcoin Trust, which converted to an ETF last week and no longer operates on a lockup period, saw outflows of nearly $580 million during its first two days of trading. Bitwise’s product has emerged as an early winner, with its bitcoin ETF drawing $238 million in inflows on day one.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcyNTgzL2JpdGNvaW4tbG9uZy1zaG9ydC1yYXRpby1oaWdoLWJpbmFuY2XSAU1odHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzI1ODMvYml0Y29pbi1sb25nLXNob3J0LXJhdGlvLWhpZ2gtYmluYW5jZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin long-short ratio hits multi-month high on Binance - The Block",
        "content": "The ratio between longs and shorts for bitcoin on Binance Futures has risen to a multi-month high. This metric is considered a barometer of investor anticipation, with a high long-short ratio indicating that more investors have a positive expectation for the bitcoin price.\n\nIn the past 24 hours, the long-short ratio has increased sharply to 2.86, according to The Block's Data Dashboard — despite BTC -6.08% retracing gains made since multiple spot bitcoin exchange-traded funds were approved. The present reading is relatively high, considering that if an equal number of traders were positioned long and short, the reading would be 1.\n\nLast week, before multiple spot bitcoin ETFs were approved, the long-short ratio was at a low of 0.86. However, after approval, the ratio rose, as traders speculated on the asset's appreciation.\n\nCoinglass data also concurs with that from The Block, showing that more trader positions are long rather than short. The crypto derivatives data analysis platform puts the current long-short ratio for bitcoin positions on Binance Futures at 2.63.\n\nOpen trades show higher bullish sentiment\n\nAccording to Coinglass, a high long-short ratio suggests bullish market sentiment, while a low ratio suggests bearish market sentiment.\n\nRELATED INDICES See crypto indices\n\nThe current bitcoin sentiment on Coinglass is weighted towards bullish bets. The distribution of long positions compared to short positions in the last 24 hours indicates that 42% of traders have adopted a bullish stance, whereas only 22% have taken a bearish position. The remaining percentage comprises neutral positions.\n\nBull sentiment could become exhausted\n\nContrarian traders might analyze the current market structure and observe that many have already taken long positions. This cohort of traders might anticipate that the momentum of bullish sentiment is beginning to slow down or level off.\n\nContrarian trading strategies often involve going against the crowd, assuming that a crowded trade might be nearing exhaustion. These times of crowded trading, such as a relatively high or low long-short ratio, could be followed by a cascade of liquidations if the bitcoin price suddenly swings in a particular direction.\n\nThe price of the world's largest cryptocurrency by market capitalization declined by over 0.3% in the past 24 hours, falling to $42,602 at 7:50 a.m. ET, according to The Block's Price Page."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzE2L2hvdy1tdWNoLTEwMDAtaW4tYml0Y29pbi1ncmV3LWluLTUteWVhcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "If You Invested $1,000 in Bitcoin 5 Years Ago, This Is How Much You'd Have Now - The Motley Fool",
        "content": "Index investing is a great approach, but you can do even better with specific stocks or cryptocurrencies from time to time.\n\nLet's say you invested $1,000 in an index fund tracking the S&P 500 (^GSPC -0.29%) index 5 years ago. The SPDR S&P 500 ETF (SPY -0.20%) is one popular option with minimal management fees and a stellar history of reflecting its chosen index.\n\nIf you reinvested dividends into more shares of the exchange-traded fund (ETF) over time, you would have doubled your money by now. That's an average annual return of 15% -- well above the 10-year average at 12% or the 10% annual returns since the ETF was introduced 41 years ago.\n\nIt's easy to see why The Motley Fool recommends holding a diversified stock portfolio for a long time, in the spirit of index-fund pioneer John Bogle and master investor Warren Buffett. I mean, good luck finding a savings account with a stable 10% interest rate, not to mention the higher gains in recent years. Diversified investing is a proven strategy for building and protecting your wealth in the long run.\n\nBut what if you picked up $1,000 of Bitcoin (BTC -6.67%) tokens five years ago? The largest cryptocurrency was in the middle of another crypto winter back then, hampered by hacking scandals and regulatory crackdowns with no support to speak of from large banks and other financial institutions. The $19,345 record price of the Bitcoin boom in 2017 felt like a distant memory, melted down to $3,644 per token.\n\nBitcoin's rocky five-year gains\n\nAs it turns out, that was a solid buying window for investors looking to commit their funds over a five-year span. A $1,000 Bitcoin investment on Jan. 15, 2019, was worth $11,540 at the time of writing exactly five years later:\n\nIt hasn't been a smooth ride, but there's no denying the general upswing over five years. In this period, Bitcoin investors faced more crypto-exchange hacks, the coronavirus health crisis, a global inflation surge, and other challenges. Bitcoin prices fell more than 10% in August 2023, not to mention six single-month drops of that magnitude in 2022. The preceding chart includes all of these headwinds and crashes.\n\nThe road ahead: Bumpy but hopeful\n\nStill, Bitcoin is back on its digital feet with more gains than losses in recent months and a robust slate of upcoming catalysts for further gains.\n\nThe next Bitcoin halving -- a regularly scheduled increase of the computing power required to mine new Bitcoins -- is scheduled in April 2024. These events are typically followed by a strong bull run in Bitcoin prices over the next couple of years.\n\nAmerican regulators recently approved 11 applications for ETFs based on spot-market Bitcoin prices. The approval did not result in a sharp price boost, but having easy access to Bitcoin-based investment vehicles such as the ARK 21Shares Bitcoin ETF ARKB -5.69% ) iShares Bitcoin Trust IBIT -5.82% )\n\nThe regulatory picture is starting to clear up, driven by renewed public interest in the crypto space and progress in important legal cases such as the U. S. Securities and Exchange Commission vs. Ripple XRP -7.28% )\n\nThe general long-term trend tends to leave traditional stock market indices like the S&P 500 far behind. Furthermore, that bullish market tenor should continue over the next couple of years due to the technology, market, and regulation events listed above -- with the caveat that there may be dramatic price drops along the way for a myriad unforeseen reasons.\n\nSo Bitcoin isn't a magic ticket to automatic investment gains, with a significant risk of sudden downswings and long periods of stalled or negative returns. Sticking with a market tracker like the SPDR S&P 500 ETF may be a better choice if you're not ready for the volatility and technical quirks of Bitcoin investing.\n\nStill, it's a robust digital currency with an unpredictable yet promising future, and I think a modest position in Bitcoin (or one of the Bitcoin-based ETFs) would be a healthy addition to a diversified portfolio."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3QvYmxhY2tyb2NrLWFuZC1maWRlbGl0eS1sZWFkLXNwb3QtYml0Y29pbi1ldGYtcmFjZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "BlackRock and Fidelity are dominating the 'two-horse race' for Bitcoin ETF billions - DLNews",
        "content": "BlackRock and Fidelity have emerged as clear winners within the first days of Bitcoin ETF trading.\n\nGrayscale Bitcoin Trust saw the largest daily volumes, but was plagued by $580 million in outflows.\n\nInvestment powerhouses BlackRock and Fidelity have emerged as the two frontrunners in the spot Bitcoin exchange-traded fund race just days after US regulator approval.\n\nThat’s according to new research from investment advisory firm Bernstein, which calculated that the funds generated about $11 billion in trading volume and approximately $800 million in inflows in the first two days of trading,\n\n“So far, it seems a two-horse race” between Fidelity and BlackRock to be the market leader, analysts led by Gautam Chhugani at Bernstein said.\n\nBlackRock and Fidelity garnered $498 million and $422 million respectively in total flows over the first two days of trading, following the US Securities and Exchange Commission greenlight for 11 spot Bitcoin ETFs last week.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nHowever, Bitwise and Ark were not far behind, securing $238 million and $105 million respectively over the same period.\n\nCharts included in the Bernstein report listed ProShares as one of the spot Bitcoin ETFs, despite it being a futures Bitcoin ETF.\n\nWithout ProShares, the listed volume over the first two days was more like $7.9 billion — closer to the $7.8 billion estimated by Bloomberg Intelligence analyst Eric Balchunas.\n\nGBTC discount\n\nBernstein suggested the disparity between the $800 million inflows and the substantial $11 billion trading volume could be attributed to market makers capitalising on liquidity in leading funds — and potentially arbitraging between GBTC discounts and premiums on other ETFs.\n\nJoin the community to get our latest stories and updates\n\nWhile GBTC leads in trading volumes at $4.3 billion, the firm experienced net outflows of $580 million.\n\nFinal volumes on the first two days have yet to come out as settlement times can add to a lag in data.\n\n“We would expect the GBTC redemptions towards other ETFs to continue, while new inflows to ETFs would stabilise more gradually,” Bernstein wrote.\n\nGrayscale’s flagship product has historically tracked the price of the Bitcoin, but didn’t offer users the option to redeem shares over the past few years.\n\nAs a result, there was a disparity — or a discount — between its share price and the spot price of Bitcoin.\n\nSince GBTC has converted to an ETF this disparity is expected to shrink.\n\nThe GBTC discount stood at 1.17% while the other ETFs traded at premiums ranging between 0.13% to 0.5% during the first two days of Bitcoin ETF trading — enabling market makers to profit from the price difference.\n\nBernstein forecasts Bitcoin may experience temporary weakness, potentially finding a local bottom in the $38,000 to $42,000 range.\n\nSebastian Sinclair is a markets correspondent for DL News. Have a tip? Contact Seb at sebastian@dlnews.com."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzE2L2Nhbi1jcnlwdG8tZGV0aHJvbmUtdXMtZG9sbGFyLWRvbWluYW5jZS1oZXJlLWlzLW1vcmdhbi1zdGFubGV5cy10YWtlL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzE2L2Nhbi1jcnlwdG8tZGV0aHJvbmUtdXMtZG9sbGFyLWRvbWluYW5jZS1oZXJlLWlzLW1vcmdhbi1zdGFubGV5cy10YWtlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Can Crypto Dethrone U.S. Dollar Dominance? Here Is Morgan Stanley's Take - CoinDesk",
        "content": "The dominance of the U.S. dollar as the linchpin of the international financial system is being increasingly questioned due to shifting geopolitical currents and the country’s growing twin deficits , Wall Street giant Morgan Stanley (MS) said in a report last week.\n\n\n\nEnter cryptocurrencies, which, while still in their early stages, have the potential to both erode and reinforce the dollar’s dominance in global finance, the bank said.\n\n\n\n“The recent growth in interest of digital assets such as bitcoin (BTC), growth of stablecoin volumes and the promise of central bank digital currencies (CBDCs), have potential to significantly alter the currency landscape,” wrote Andrew Peel, Morgan Stanley's head of digital asset markets.\n\n\n\nU.S. monetary policy, combined with the use of economic sanctions, have forced some countries to look for alternatives to the dollar, Peel said, adding that a “clear shift towards reducing dollar-dependency is evident, simultaneously fueling interest in digital currencies such as bitcoin, stablecoins, and CBDCs.”"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTE2L3RyYWRlcnMtZmxlZS1ncmF5c2NhbGUtYml0Y29pbi1ldGYtZ2J0Yy13aXRoLTU3OS1taWxsaW9uLWluLW91dGZsb3dz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Grayscale Bitcoin ETF (GBTC) Sees $579 Million in Outflows - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyNC0wMS0xNS9jb2luYmFzZS1jZm8taGFhcy1vbi1iaXRjb2luLWNyeXB0by1yZWd1bGF0aW9uLWRhdm9zLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Coinbase CFO Haas on Bitcoin, Crypto Regulation: Davos - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lmpkc3VwcmEuY29tL2xlZ2FsbmV3cy9zZWMtYXBwcm92ZXMtc3BvdC1iaXRjb2luLWV0ZnMtYnV0LTM5MTkyOTcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "SEC Approves Spot Bitcoin ETFs But Gensler Still Disapproves of Crypto - JD Supra",
        "content": "On January 10, 2024, the U.S. Securities and Exchange Commission (“SEC”) approved eleven applications for spot exchange-traded funds (“ETFs”) tracking Bitcoin. This landmark moment for the crypto asset industry has been over 10 years in the making. Many retail investors can now add Bitcoin exposure to their existing investment portfolios with the click of a button and just as easily as they purchase shares in an ETF tracking the S&P 500 – no crypto wallets or exchanges necessary.\n\nThe SEC’s approval of the Bitcoin ETF applications comes on the heels of an August 2023 decision by the U.S. Court of Appeals for the District of Columbia that held that the SEC failed to adequately explain why it disallowed the listing and trading of a proposed Bitcoin ETF. The Court’s decision was the culmination of a decade-long battle between the SEC and those applying to launch Bitcoin ETFs, dating back to July 2013, when the first application for a Bitcoin ETF was filed. The SEC denied that application in March 2017, generally concluding that the crypto asset market and regulatory oversight regarding crypto assets were not sufficiently mature. In the face of these early SEC denials, innovators in the crypto asset space continued to explore alternative paths to provide retail investors with access to Bitcoin through various means, including investment trusts, Bitcoin futures products, and spot ETFs in other countries.\n\nThe SEC’s approval of the eleven Bitcoin ETF applications can only be described as reluctant. In Chairman Gensler’s statement immediately following the approvals, he said as much, explaining that “the Commission disapproved more than 20 exchange rule filings for spot bitcoin ETPs,” and that this round of applications was similar to the previously doomed applications. Gensler acknowledged, however, that the circumstances were different after the Court of Appeals’ August 2023 ruling, such that approving the applications became “the most sustainable path forward.” This change in circumstances for the Bitcoin ETF applications does not mean, however, that the SEC’s overall view on crypto assets has softened. As Gensler emphasized, “[w]hile we approved the listing and trading of certain spot bitcoin ETP shares today, we did not approve or endorse bitcoin.”\n\nIf any question remained whether the SEC’s approval of the Bitcoin ETF applications might signal that the SEC was softening its stance on crypto, Gensler’s post-approval statement answers that question with an emphatic “no.” Even in announcing the approval of a financial product where the underlying asset is Bitcoin, Gensler warned the public that “investors should remain cautious about the myriad risks associated with bitcoin” and that Bitcoin is “primarily a speculative, volatile asset that’s also used for illicit activity including ransomware, money laundering, sanction evasion, and terrorist financing.”\n\nGensler’s statement also suggests that attempts to launch ETFs based on other crypto assets will meet fierce SEC opposition. His statement emphasizes that the SEC’s approval “is cabined to ETPs holding one non-security commodity, bitcoin” and that the approval “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.”\n\nBeyond offering a renewed sense of legitimacy to an industry whose reputation has recently been marred by scandal and unease, the SEC’s approval has the practical effect of allowing more risk-averse retail investors to gain exposure to Bitcoin without actually holding Bitcoin, itself. Indeed, the new Bitcoin ETFs would operate in much the same way as traditional ETFs, which investors can access through their brokerage accounts and on smartphones with the click of a button. This newfound availability on SEC-regulated financial exchanges means more investors can gain Bitcoin exposure without the hassle of buying the crypto asset itself. That said, some large financial institutions may have reservations about offering Bitcoin ETF access to retail customers from a “suitability” or “best interest” perspective, and the SEC and other regulators may closely scrutinize the institutions that do.\n\nThe SEC’s decision on Wednesday in granting approval for Bitcoin ETFs should be seen by crypto enthusiasts and retail investors alike as a major milestone in the push for crypto assets to become more institutionalized, more recognized as an independent asset class, and more widely available to retail investors. Despite the exciting news for investors, the decision should not be interpreted as a sea change in crypto asset regulation – at least from the SEC’s perspective. It will, however, likely signal an influx of applications to launch ETFs with crypto assets other than Bitcoin (Ethereum or Ripple, for example). The approval of such products will likely face an even longer road to approval than Bitcoin ETFs, given Gensler’s frequent distinction between most crypto assets that he believes are “securities,” and Bitcoin, which he has characterized as a “commodity.”\n\n[View source.]"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvdXMtYml0Y29pbi1ldGZzLWZhaWxlZC1vbi10aGUtZXhwZWN0YXRpb25zLTItZGF5LW5ldC1pbmZsb3dzLWF0LTgxOS1taWxsaW9uL9IBf2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvdXMtYml0Y29pbi1ldGZzLWZhaWxlZC1vbi10aGUtZXhwZWN0YXRpb25zLTItZGF5LW5ldC1pbmZsb3dzLWF0LTgxOS1taWxsaW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "US Bitcoin ETFs’ Failed on the Expectations, 2-Day Net Inflows at $819 Million - Finance Magnates",
        "content": "Bitcoin experienced a substantial correction following the approval and listing of the much-hyped 11 spot Bitcoin exchange-traded funds (ETFs) in the United States. At one point on Friday, the cryptocurrency's value decreased by approximately 10 percent, falling from the previous day's peak of $49,000 to below $42,000. However, it has since rebounded and is currently trading at around $42,700 at the time of writing.\n\nDisappointing Demand for Bitcoin ETFs\n\nWhy did the market go in the other direction despite the massive anticipation for Bitcoin ETFs? Even experts previously anticipated that the ETFs would ease the entry barrier for retail and institutional investors to get crypto exposure directly from their brokerage accounts.\n\nPrice movement of Bitcoin, Source: Coinmarketcap.com\n\nAlthough it has been only two days since the 11 Bitcoin ETFs have traded on the US exchanges, the numbers have been disappointing.\n\nThe ten newly listed Bitcoin ETFs attracted only $1.4 billion in new funds within two days. Despite the anticipation surrounding their launch, none of the recently introduced Bitcoin ETFs achieved top rankings among US ETFs based on their initial success.\n\nKeep Reading TradingView Enhances DeFi Tools on Polygon via QuickSwap Partnership\n\nAlong with the poor inflows, Grayscale’s Bitcoin ETF, which was converted from the Grayscale Bitcoin Trust, witnessed an outflow of $579 million, and the previously existing BITO futures ETF endured $151 million in outflows. Considering these figures, the two-day net inflows in the Bitcoin ETFs are only $652 million, while the net spot Bitcoin ETF inflows was at $819 million.\n\nInflows into the 10 new bitcoin ETFs hit +$1.4 billion over 2 days.\n\n\n\nSubtracting GBTC's outflows of -$579m we get a net inflow of +$818.9m into the 10 new vehicles.\n\n\n\nPeople rotating out of GBTC into the others & Grayscale selling BTC are behind the price dump despite the inflows: pic.twitter.com/L29Vp3QecP — Joe Consorti ⚡ (@JoeConsorti) January 13, 2024\n\nThe Hype Could Not Pump New Monies\n\nAlthough the industry created the hype around the US Bitcoin ETFs, such instruments were already available in several other countries. However, the capital market size of those countries is not comparable to that of the US.\n\nCanada launched the Purpose Investments Bitcoin ETF in February 2021, and within the first two days of trading, the Canadian Bitcoin ETF accumulated assets under management (AUM) totaling $421 million. Meanwhile, the Bitcoin ETFs launched by the two financial giants, BlackRock and Fidelity, currently boast AUMs of $498 million and $422 million, respectively.\n\nInterestingly, the Canadian Bitcoin ETF charges 1.5 percent in fees, while the US one is taking an economical approach, with the lowest fees being 0.2 percent (excluding conditional fee waivers).\n\nAfter the two performances of the US Bitcoin ETFs, the long-term predictions of the inflows appeared to be long-shots. Bloomberg predicted a $4 billion inflow on the first day and $50 billion by the year's end, while analysts at Standard Chartered were more bullish, eying $100 million by the end of 2024.\n\n@BlackRock may break the first-day flow record with a possible $2 billion asset injection on the first day of trading for its US spot Bitcoin ETF, according to BI's senior ETF analyst @EricBalchunas Seed funding could combine with grassroots interest to give it momentum in a… pic.twitter.com/cjUoSzsqgt — Bloomberg Intelligence (@BBGIntelligence) January 10, 2024\n\nMeanwhile, the stock price of the largest US Bitcoin exchange, Coinbase, is plunging about 30 percent from December’s peak. On last Friday’s trading session alone, Coinbase stock declined 7.35 percent, shedding one more percent-point in after-hours trading."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tYnV5LWJpdGNvaW4tZXRmc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "How to buy Bitcoin ETFs - Cointelegraph",
        "content": "Approval of the first-ever batch of spot Bitcoin (BTC) exchange-traded funds (ETFs) by the United States Securities and Exchange Commission (SEC) has raised the spirits of the crypto community globally. The agency has given the green light to 11 applications, including from BlackRock, ARK Invest, Fidelity, VanEck and Invesco.\n\nThe watershed moment is expected to be a game-changer for Bitcoin, enabling institutional and retail investors to invest in the largest cryptocurrency by market share without directly holding it. Rather than buying Bitcoin on a crypto exchange, such as Binance or Coinbase, investors can buy the Bitcoin ETF to get exposure to BTC.\n\nHolding Bitcoin ETFs vs. Bitcoin\n\nWith ETFs, investors can buy a product that tracks the price of an associated commodity or security through the same mechanism already in place for index funds. BTC ETFs simplify things for investors as they can manage their holdings without maintaining a crypto wallet or arranging cold storage.\n\nBitcoin ETFs provide registered investment advisers (RIAs), retirement funds and other institutions with access to Bitcoin. Entities and regular people restricted from accessing this asset class or who had reservations about investing in digital assets can now hold BTC.\n\nThe term “spot” in spot Bitcoin ETF refers to the actual holding of assets, not some derivative contract. Each investor will own a piece of Bitcoin. Investors could also buy Bitcoin futures ETFs, which means agreeing to buy or sell BTC at a specific price on a predetermined date, regardless of the market price. Investors can buy and sell Bitcoin ETFs as often as they like during trading hours.\n\nApproved Bitcoin ETFs\n\nThe SEC approved spot Bitcoin ETFs on Jan. 10 from major fund managers. The approved ETFs are the Grayscale Bitcoin Trust (GBTC), BlackRock’s iShares Bitcoin Trust (IBIT), the Bitwise Bitcoin ETF (BITB), Fidelity’s Wise Origin Bitcoin Trust (FBTC), the ARK 21Shares Bitcoin ETF (ARKB), the Invesco Galaxy Bitcoin ETF (BTCO), VanEck’s Bitcoin Trust (HODL), Franklin Templeton’s Franklin Bitcoin ETF (EZBC), the WisdomTree Bitcoin Fund (BTCW), the Hashdex Bitcoin ETF DEFI and the Valkyrie Bitcoin Fund (BRRR).\n\nThe approved spot Bitcoin ETFs will be listed across several stock exchanges in the U.S., including the New York Stock Exchange (NYSE), the Chicago Board Options Exchange (CBOE) and the Nasdaq.\n\nIn October 2021, the SEC gave the go-ahead to Bitcoin futures ETFs that track agreements to buy or sell BTC at a pre-specified price. The first Bitcoin-linked ETF that received approval from the SEC was the Proshares Bitcoin Strategy ETF (BITO), which is listed on the New York Stock Exchange.\n\nThe advantage of the usual ETFs is that they roll out a diversified basket of assets. However, A Bitcoin ETF is linked to just one cryptocurrency, i.e., Bitcoin, so it is likely to experience the same volatile swings as BTC.\n\nWhat are the various ways to buy Bitcoin ETFs?\n\nThere are several ways to buy Bitcoin ETFs:\n\nOnline brokerage accounts\n\nThe brokerages usually have a search tool that allows users to search for the fund by its name or ticker symbol and trade it. After the approval of spot ETFs in the U.S., one can buy these funds with brokerages such as Charles Schwab, Fidelity, Robinhood and Interactive Brokers, among others.\n\nCryptocurrency exchanges\n\nWhile crypto exchanges are still grappling with a fast-changing regulatory ecosystem, they have plans to roll out ETFs. Kraken’s ETF trading services are expected in 2024. Coinbase, another crypto bigwig, is acting custodian for eight of the ETFs approved by the SEC.\n\nFinancial advisers\n\nAccording to the Bitwise 2024 benchmark survey, financial advisers in the U.S. generally expressed interest in crypto equity ETFs. The results showed that 19% of advisers can buy crypto in client accounts. The survey also highlighted that 98% of advisers who currently have an allocation to crypto in client accounts plan to maintain or increase that exposure in 2024.\n\nRobo-advisors\n\nRobo-advisors like Wealthfront and Betterment can facilitate the purchase of Bitcoin ETFs by providing an easily accessible, low-cost, automated investing platform. By permitting investments in cryptocurrency-related ETFs with comparatively low minimum balance requirements, they serve novice and experienced investors.\n\nTypically, robo-advisors offer automated portfolio management customized to the investor’s objectives and risk tolerance. This includes asset allocation, investment selection and portfolio rebalancing.\n\nTraditional banks\n\nTypically, an individual who wants to purchase Bitcoin ETFs through a traditional bank would open a brokerage account with the bank’s investment division. After funding and activating their account, traders can look for the preferred Bitcoin ETF.\n\nThe person can purchase shares of the ETF after determining what it is, in the same way as they would any other stock or ETF offered through the bank’s brokerage services. However, availability and direct access to Bitcoin ETFs may differ based on the client’s region and the bank’s particular offers.\n\nFurthermore, the regulatory landscape for cryptocurrencies is still evolving, which may lead to some delay before traditional banks begin offering Bitcoin ETFs as an investment option to their customers.\n\nDirectly from ETF issuers\n\nInvestors can go directly to the ETF issuer portals and buy the product. However, one may require an account with a broker to purchase an ETF. For instance, when visiting the Hashdex website, customers are asked to select one of the brokers the issuer works with.\n\nHow to buy Bitcoin ETFs\n\nHere is the process to buy BTC ETFs via brokerage services:\n\nStep 1: Open a brokerage account\n\nDownload a brokerage services app such as BlackRock or Robinhood or open their web portals, complete the Know Your Customer checks and log in.\n\nStep 2: Fund the account\n\nThe trader must fund their brokerage account using their linked bank account, checking or savings. They could make a wire transfer, deposit a check or transfer funds from another broker.\n\nStep 3: Conduct research on available Bitcoin ETFs\n\nInvestors considering a Bitcoin ETF should be mindful of key aspects such as the issuer and the expense ratio associated with the ETF. The expense ratio is the fee charged by the issuer for managing the ETF, which can impact the overall returns of the investment.\n\nStep 4: Select preferred Bitcoin ETFs\n\nInvestors can delve into a range of Bitcoin ETFs, selecting those that align with their investment preferences and goals. This process involves evaluating various funds to identify the ones that best meet their criteria.\n\nStep 5: Place an order\n\nIn this step, one can place an order using funds in the account and buy the selected ETFs. This includes entering the selected Bitcoin ETF’s ticker symbol in the specific field provided on the trading or order placement interface of a brokerage account and specifying the number of shares one wishes to purchase. Depending on their trading strategy, the investor may choose a market, limit or stop order.\n\nAfter reviewing the order details to ensure accuracy, the investor can submit the order. The brokerage will then execute the order according to the specified terms, and the Bitcoin ETF shares will be added to the investor’s portfolio.\n\nStep 6: Monitor your investments regularly\n\nRegularly reviewing investments helps investors respond to market changes and nudge their investments in the right direction.\n\nThe door gets opened\n\nThe SEC’s approval of 11 spot Bitcoin ETFs is an opportunity for institutional and retail investors to invest in a more regulated environment. Several ETFs have slashed their fee for managing the products amid competition. BTC ETFs are expected to bring a massive inflow of funds into the crypto ecosystem. Subsequently, as other countries follow, Bitcoin may become integrated with the global financial mainstream.\n\nAlthough regulators have only given the green light to Bitcoin ETFs, there’s anticipation that ETFs for other major cryptocurrencies could eventually receive approval. While it remains uncertain when this might happen, the crypto community is optimistic, viewing the current approvals as a positive sign for the future of broader cryptocurrency ETFs.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvdmFuZWNrLWRhY3J1ei1pbnRlcmVzdC1iaXRjb2luLWV0ZnMtc3Bpa2Uv0gFXaHR0cHM6Ly93d3cuZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC92YW5lY2stZGFjcnV6LWludGVyZXN0LWJpdGNvaW4tZXRmcy1zcGlrZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "VanEck’s DaCruz: Interest in Bitcoin ETFs 'Only Going to Spike' - ETF Trends",
        "content": "With the SEC opening the floodgates to spot bitcoin ETFs last week, VanEck’s Director of Digital Assets Product Kyle DaCruz thinks that interest in cryptocurrency products and bitcoin ETFs is “only going to spike.”\n\n“I think from here on out, it’s going to just be continued interest and demand,” he said during a panel on VettaFi’s Cryptocurrency Symposium on Friday.\n\nDaCruz said that after a few issues in the market, including cases of fraud, interest in bitcoin “had been muted,” and “rightly so.” But “now that these regulated products have come to market, interest is only going to spike.”\n\n“As time goes on and as platforms continue to add access…we’ll start to see greater availability,” he noted. “There is some oversight and regulation in place.”\n\nSee more: “VanEck Asserts Itself in Spot Bitcoin ETF Fray With HODL”\n\nBlockchain: A Transformative Technology\n\nWhile many investors think of crypto and blockchain as potentially “dangerous,” DaCruz argued that “if used properly, it’s a technology that can keep us all honest.”\n\n“Blockchain can potentially be a transformative technology that solves a lot of the issues we’ve had in this space,” he commented. “It’s an educational barrier to overcome.”\n\nAnd based on the results of a poll conducted by VettaFi, advisors are most worried about volatility when investing in crypto, with 33% of respondents citing that as their top concern. Meanwhile, 27% of respondents cited crypto’s difficulty to value as their top concern.\n\nDaCruz thinks that bitcoin fits into a portfolio’s real-assets bucket. He cited research showing that a 1% “allocation to bitcoin in a 60/40 portfolio can actually improve not just the returns but the overall risk-adjusted Sharpe ratio.”\n\nThe Launch of HODL\n\nThe VanEck Bitcoin Trust (HODL) was one of the 10 spot bitcoin ETFs that launched last week. HODL came to market with $72.5 million in seed capital.\n\nHODL joins the issuer’s crypto funds including the crypto-correlated, equity-based VanEck Digital Transformation ETF (DAPP) and the VanEck Ethereum Strategy ETF (EFUT).\n\nDaCruz said that what sets VanEck apart is that the issuer has “been in crypto since 2017,” which provides “native experience” and can educate investors “on this emerging technology.”"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTYvYml0Y29pbnMtc2VsbC10aGUtZmFjdC1wdWxsYmFjay1jYW1lLWZyb20tYmluYW5jZS1va3gta2Fpa28v0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8xNi9iaXRjb2lucy1zZWxsLXRoZS1mYWN0LXB1bGxiYWNrLWNhbWUtZnJvbS1iaW5hbmNlLW9reC1rYWlrby9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's 'Sell The Fact' Pullback Came From Binance, OKX: Kaiko - CoinDesk",
        "content": "“The ETFs began trading last Thursday, with a strong surge in cumulative volume delta (CVD) across all major exchanges; a net of nearly 3k BTC was market bought on Binance in the hour surrounding market open in the U.S. However, as some had feared, sell the news took hold, and Binance’s CVD quickly fell into the negative, as did OKX’s,” Kaiko said in a weekly report published Monday."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMTYvYnV5LXRoZS1kaXAtaW4tdGhlc2UtYml0Y29pbi1taW5pbmctc3RvY2tzLW92ZXItdGhlLW5leHQtdHdvLW1vbnRocy1iZXJuc3RlaW4tc2F5cy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bernstein: Buy dip in these bitcoin mining stocks over next two months - CNBC",
        "content": "Bitcoin miners have tumbled since last Thursday, following the launch of spot bitcoin exchange-traded funds . However, for some mining stocks, any weakness in the coming weeks is an opportunity, according to Bernstein. The declines are in part due to the pullback in the bitcoin price, which is down roughly 6% in the same period. In a Monday note to investors, Bernstein also pointed to lower investor appetite for mining stocks as a bitcoin proxy now that ETFs have entered the market. However, Gautam Chhugani, lead crypto analyst at Bernstein, said the firm is still optimistic on high-quality miners, calling out Riot Platforms and CleanSpark . \"We feel confident about inflection in miner cashflows for the best-in-class miners that are consolidating capacity and seeing strong traction in revenues from higher bitcoin price and transaction fees,\" he said. \"Thus, miners would continue to offer higher beta trade to the next bitcoin inflection — in our view, post halving.\" RIOT YTD mountain Riot Platforms is down 25% this year Since spot bitcoin ETFs began trading in the U.S. last week, Riot and CleanSpark have each declined more than 20%. Marathon Digital has declined nearly 30%. Iris Energy and Cipher Mining are each lower more than 21%. The bitcoin halving — the event in which the reward for mining the cryptocurrency is cut in half — is approaching in the spring of this year. The halving also eats into bitcoin miners' revenues. Investors are watching the price of bitcoin, which was expected by some to rally after the Securities and Exchange Commission's decision to allow spot bitcoin ETFs in the U.S., but instead played out as a sell-the-news event. If bitcoin doesn't rise to the $50,000 to $55,000 range, less efficient, higher-cost miners may not have sufficient capital to grow and may have difficulty maintaining their operations. \"Just like bitcoin, the next two months offer dip buying opportunity in bitcoin miners,\" Chhugani said. \"To be cautious during [the] halving, some higher cost miners may struggle if bitcoin price remains flattish from here — hence, best to be exposed to low cost miners.\" Bitcoin miners were top performers in 2023, outperforming even bitcoin. Riot and CleanSpark gained 356% and 440%, respectively. Marathon swelled by 586%. Flagship crypto bitcoin finished up 157%."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmV1cm9uZXdzLmNvbS9uZXh0LzIwMjQvMDEvMTUvYXJlLXdlLXRyYWRpbmctYml0Y29pbnMtcHJpY2UtZm9yLWl0cy1jZW50cmFsaXNhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Are we trading Bitcoin's price for its centralisation? - Euronews",
        "content": "By Marc Taverner\n\nThe opinions expressed in this article are those of the author and do not represent in any way the editorial position of Euronews.\n\nWe can protect Bitcoin’s long-term value by diversifying how and where we invest in it and keeping a close eye on the custody practices and decentralisation (or lack thereof) of these financial products, Marc Taverner writes.\n\nADVERTISEMENT\n\nThe recent surge in the price of Bitcoin (BTC) has the market feeling more buoyant and positive than it has in some time.\n\nTraders and investors across Europe, the US and the UAE seem optimistic about the approval of exchange-traded funds, or ETFs, which could further propel its value — exciting even for those outside of the United States.\n\nHowever, while this development may be seen as positive for price growth, it raises concerns about the decentralisation of the market.\n\nAnd as the ETFs have been approved, soon we will know if they can attract more institutional investors, thus boosting liquidity and market stability. However, we must question whether this influx of external influence comes at a cost.\n\nYou win some, you lose some?\n\nNot everyone shared the optimism regarding the US Securities and Exchange Commission's (SEC's) approval. Prominent Bitcoin critic and gold advocate Peter Schiff has voiced concerns.\n\nHe cautioned that ETF approval could have a catastrophic impact on the price of Bitcoin, especially if the anticipated institutional demand fails to materialise.\n\nThis and some other perspectives challenged the general optimism, and they even created a temporary surge in Bitcoin’s price over the last weeks. But the answer is — no one has the answer to what will come next.\n\nA bitcoin symbol is presented on an LED screen during the closing ceremony of a congress for cryptocurrency investors in Santa Maria Mizata, El Salvador, November 2021 Salvador Melendez/AP\n\nThe BTC ETFs were approved by the SEC last week, but the question of the legitimacy and positive impact of external influence on crypto is still in the air.\n\nAmong the eight ETFs that were awaiting approval, only one of them utilises a decentralised custody solution (Fidelity). The remaining seven, including Coinbase, rely on centralised custody solutions.\n\nThis raises a crucial concern: are we overlooking the fact that ETFs, while supporting price growth, could undermine the core of Bitcoin’s decentralisation?\n\nCommand and control model at odds with Bitcoin's vision\n\nWhile ETFs may boost Bitcoin's price and bring more liquidity into the market, they could also promote the centralisation of accessing it.\n\nFor instance, investing in a Blackrock ETF imposes certain limitations on the investor. These limitations include individuals and investors being bound to a centralised custody solution that cannot be easily escaped.\n\nIt consolidates centralised control over a market and asset that was meant to liberate them.\n\nAn advertisement for Bitcoin cryptocurrency is displayed on a street in Hong Kong, February 2022 AP Photo/Kin Cheung\n\nThis shift towards centralisation resonates with a model of control and command that seems at odds with Bitcoin's original vision of empowering individuals through decentralisation.\n\nBitcoin was conceived as a tool to redistribute power from centralised authorities to individuals, but the advent of ETFs risks subverting this ideal. Investors need to consider the direction this journey is taking them.\n\nWould it not be more prudent to invest directly in Bitcoin, where they retain full control over their assets and are not subject to oversight by the SEC?\n\nKeeping a close eye on custody practices key\n\nGiven the potential risks posed by investing in a Blackrock ETF, it is worthwhile to consider alternative options that prioritise individual control and minimise regulatory oversight.\n\nBy supporting a system wherein investors have more autonomy to exit and operate outside the purview of regulatory bodies like the SEC, the market may be able to preserve its decentralisation vision while benefiting from the advantages offered by ETFs.\n\nADVERTISEMENT\n\nEurope has several of these products, which seem to get overlooked in the ETF hype cycle.\n\nEven after the ETFs are approved, investors must consider not just the financial implications but also the long-term impact on their investment from their investment.\n\nIt presents a paradox — while they may propel Bitcoin into the financial mainstream, they could also compromise the very decentralisation that makes Bitcoin such a valuable asset.\n\nUltimately, the decision regarding ETFs was in the hands of the SEC, and the decision was made. The market will witness the outcome in due course.\n\nStill, we can protect Bitcoin’s long-term value by diversifying how and where we invest in it and keeping a close eye on the custody practices and decentralisation (or lack thereof) of these financial products.\n\nADVERTISEMENT\n\nMarc Taverner is the CEO and co-founder of XEROF, a Swiss financial services provider specialising in cryptoassets.\n\nAt Euronews, we believe all views matter. Contact us at view@euronews.com to send pitches or submissions and be part of the conversation."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmV0ZnN0cmVhbS5jb20vYXJ0aWNsZXMvd2h5LWJpdGNvaW4tdWNpdHMtZXRmcy13aWxsLW5vdC1leGlzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Why bitcoin UCITS ETFs will not exist - ETF Stream",
        "content": "A painstaking decade of rejections may have concluded with 11 spot bitcoin ETFs being approved in the US; however, crypto assets are unlikely to find a home in European ETFs despite the continent’s leading role in wrapping digital assets.\n\nAccording to data from ETFbook, around $9bn is currently housed within crypto exchange-traded products (ETPs) in Europe, with a good portion of asset gathering and returns over the past year driven by news flow surrounding the anticipated approval of ETFs is the US.\n\nCrucially, though, these products are structured as exchange-traded notes (ETNs) – debt instruments – and are not awarded the European ‘gold standard’ UCITS label.\n\nNot an ETF as Europe would know it\n\nThe closest a product has gotten to achieving this was the Jacobi Bitcoin ETF (BCOIN) which launched last August\n\nWhile not an ETN, BCOIN is also not an ETF in the fashion European investors are familiar with.\n\nInstead, issuer Jacobi Asset Management worked with the Guernsey Financial Services Commission (GSFC) to engineer a ‘protected cell company’ (PCC), a unique structure wherein the PCC houses ‘cells’ such as BCOIN, behaving much as a sub-fund would on a conventional fund platform.\n\nWhile Jacobi AM notes the ETF structure it employs is subject greater regulatory scrutiny and may not be subject to the same counterparty risk associated with some ETNs, there are several functional overlaps.\n\nFor instance, much like physically backed crypto ETPs or ETNs, each cell is backed by a pre-determined physical quantity of the underlying asset, in this case bitcoin.\n\nAlso, BCOIN is targeted at institutional investors which need at least $100,000 assets to allocate. Like other crypto wrappers in Europe, it does not benefit from the same distribution passporting, investor protection or eligibility benefits as UCITS ETFs.\n\nLoopholes in UCITS\n\nHowever, although crypto ETPs are not themselves considered UCITS eligible, this has not stopped them – or other digital asset exposures – from appearing in UCITS funds on odd occasions.\n\nTownsend Lansing, head of product at CoinShares, previously told ETF Stream German regulator BaFin allows UCITS funds to buy crypto ETNs on the delta one exemption.\n\nThis is based on the same rationale as allowing funds to buy gold through exchange-traded commodities (ETCs), provided the vehicles are exchange-traded, transferable securities.\n\nElsewhere, WisdomTree noted Spanish regulator – the Comisión Nacional del Mercado de Valores (CNMV) – allows UCITS or equivalent collective investment schemes to have exposure to financial instruments with performance linked to crypto assets, provided they do not embed derivatives.\n\nA closing door\n\nUnfortunately for crypto-focused issuers, the most likely avenue for getting crypto UCITS ETFs over the line is likely disappearing.\n\nCrypto, like gold and other commodities, are not listed within the European Commission’s Eligible Assets Directive for UCITS funds.\n\nYet, broad baskets of more than 20 commodities currently tout the UCITS ETF badge, owing to the fact they meet diversification rules known at the ‘5/10/40’ or the ‘20/35’.\n\nHowever, a source familiar with UCITS and crypto ETPs told ETF Stream a sufficient range of crypto assets are already offered in wrapped crypto baskets and a crypto ETF meeting the quantitative rules for UCITS “could be launched tomorrow”.\n\nWhile diversification requirements may be met on paper, regulators including BaFin would be mindful of whether a crypto basket represents convincing risk diversification, spreading and management.\n\nAside from convincing the market highly correlated coins and tokens can be considered distinct assets, Shane Coveney, partner at Dillon Eustace, said the next question would be whether a reliable supply of centrally cleared and exchange-traded futures would be available to facilitate liquid trading of sufficiently broad crypto baskets.\n\nThe follow-up consideration would then be the roll costs involved in replicating such an index comprising niche crypto assets, which may lead to tracing error and wide performance dispersion, Coveney warned.\n\nThese considerations may just be academic, though, with the European Securities and Market Authority (ESMA) stating last year it would assess whether an update to UCITS rules was necessary to close the loopholes enabling specialist exposures a foothold in its fund regime, which is intended to place investor protection front-and-centre.\n\nKey authorities unconvinced\n\nAlso, as seen in the US, rejections and barriers will remain a way of life for crypto issuers looking to break into ETFs for as long as key regulatory stakeholders view the asset class as unsuitable for the broad investor base.\n\nLansing noted the interpretation of UCITS framework by watchdogs in Europe’s predominant fund domiciles – Ireland and Luxembourg – means they rule out direct exposure to digital assets within UCITS vehicles “on a prudential basis”.\n\nCoveney said: “The Central Bank of Ireland (CBI) has noted that such exposure can present significant risks including liquidity risk, credit risk, market risk, operational risk (including fraud and cyber risks), money laundering and terrorist financing risk and legal and reputation risks.\n\n“In assessing the suitability of such a product for a retail investor base, the CBI’s view is that retail investors would need to be able to appropriately assess the risks of making an investment in a fund which gives such exposures, something which has not been shown sufficiently to meet its requirements.”\n\nIn a similar vein, Luxembourg’s Commission de Surveillance du Secteur Financier (CSSF) said under its anti-money laundering and terrorist financing law, an entity investing in crypto “is not suitable for all kind of investors” and “UCITS, UCIs addressing non-professional customers and pension funds are therefore not allowed to invest directly or indirectly in virtual assets”.\n\nWhile some may note the language used by the CBI and CSSF strongly resembles the health warnings delivered by Securities and Exchange Commission (SEC) Chair Gary Gensler in his statement attached to spot bitcoin ETF approvals, the two-tiered UCITS ETF and then non-UCITS ETC and ETN split in Europe creates a clearer line in the sand that does not exist in the US.\n\nAthanasios Psarofagis, ETF analyst at Bloomberg Intelligence, stressed Europe’s approach is “more cut-and-dry”, with language to separate UCITS from “wonky stuff” in ETNs versus the “organised chaos” of the US, where “there is really no distinction”."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy50aGVibG9jay5jby9wb3N0LzI3Mjk0NS9ncmF5c2NhbGUtYmxhY2tyb2NrLWFuZC1maWRlbGl0eS1kb21pbmF0ZS1zcG90LWV0Zi1tYXJrZXQtd2l0aC1uZWFybHktOTAtb2Ytdm9sdW1lLW9uLXRoaXJkLWRheS1vZi10cmFkaW5n0gGSAWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3Mjk0NS9ncmF5c2NhbGUtYmxhY2tyb2NrLWFuZC1maWRlbGl0eS1kb21pbmF0ZS1zcG90LWV0Zi1tYXJrZXQtd2l0aC1uZWFybHktOTAtb2Ytdm9sdW1lLW9uLXRoaXJkLWRheS1vZi10cmFkaW5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Grayscale, BlackRock and Fidelity dominate spot ETF market with nearly 90% of volume on third day of trading - The Block",
        "content": "In a third day of trading, the top three spot bitcoin ETFs by trading volume have positioned themselves heads and shoulders above the rest by nabbing just about 90% of the burgeoning market.\n\nFunds offered by Grayscale, BlackRock and Fidelity are the clear leaders among the 11 spot bitcoin ETFs currently trading. After gaining approval, the new instruments began trading last week.\n\nAs Tuesday trading came to a close, the three top funds had generated about $1.6 billion of the $1.8 billion of total trading volume, according to data from Yahoo Finance compiled by The Block.\n\nThe third day of trading finished well below the $3.1 billion seen on Friday. On last Thursday, the first day of trading, the total volume came in at $4.6 billion.\n\nBlackRock may become 'Liquidity King'\n\nRELATED INDICES See crypto indices\n\nWhile Grayscale has been the clear leader in terms of volume among the new crypto-based instruments, the firm's ETF, which is a conversion of its flagship flagship GBTC fund, has experienced considerable outflows, according to Bloomberg Intelligence senior ETF analyst Eric Balchunas.\n\nGrayscale's spot bitcoin ETF has shed more than $500 million since it started trading last week, according to Balchunas, who posted data to the social media platform X on Tuesday. BlackRock's ETF is the \"most likely to overtake\" Grayscale as \"Liquidity King,\" he also said.\n\nThe funds offered by BlackRock and Fidelity have, in comparison, seen inflows over $400 million since they began trading.\n\nOverall, Balchunas said trading activity for the new funds was healthy. Cumulative volume over the first three days is now over $9.5 billion.\n\n\n\n\"About the same pattern dropoff rate as $BITO (which again was the most successful organic launch in ETF history),\" Balchunas added.\n\n(Updates with figures from market closing.)"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcyNjU4L2JpdGNvaW4tYWktcndhLWNyeXB0by1hZG9wdGlvbi1iaW5hbmNlLTIwMjTSAVNodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzI2NTgvYml0Y29pbi1haS1yd2EtY3J5cHRvLWFkb3B0aW9uLWJpbmFuY2UtMjAyNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, RWAs and institutional adoption among key themes for 2024: Binance Research - The Block",
        "content": "Binance Research analysts outlined eight areas they anticipate significant progress on throughout this year — including the Bitcoin BTC -6.10% ecosystem, artificial intelligence, real-world assets and institutional adoption.\n\nIn 2023, the crypto market witnessed a significant rebound, with a 109% increase in market cap, amid optimism surrounding spot bitcoin exchange-traded fund approvals and a favorable macro environment, the analysts wrote in a report published today. Bitcoin regained its dominance, and Layer 2 solutions saw a 321% rise in total value locked. The decentralized finance sector also grew notably, fueled by innovations in liquid staking tokens and the integration of real-world assets, they said.\n\nConversely, the global stablecoin market saw a 5.2% decline in market cap, with Tether's USDT maintaining a dominant position. Non-fungible tokens experienced a surge in the last quarter, led by Bitcoin NFTs. On-chain gaming activity doubled in active wallets by the year's end, reflecting a resurgence in this sector. Meanwhile, web3 projects attracted 1,173 investments, totaling $9 billion in 2023 — mainly in infrastructure — signaling the potential for ongoing recovery and growth in the ecosystem this year, the analysts added.\n\nBitcoin, AI, RWAs and institutional adoption\n\nFor 2024, Binance Research expects Bitcoin narratives to stay at the forefront, driven by developments like Ordinals NFTs and BRC-20 tokens, the liquidity injection of spot bitcoin ETF approvals recognizing bitcoin as a “legitimate asset” and the upcoming halving event — when the block reward for Bitcoin miners gets cut in half. While not a direct cause-and-effect relationship, halving events have often preceded substantial bull runs in the bitcoin market — with the next one potentially less than 100 days away.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe analysts also expect institutional adoption of crypto to accelerate this year, with the “entrance of reputable traditional asset management giants such as BlackRock and Fidelity into crypto during the bear market testament to their belief in the long-term potential of the industry.”\n\nArtificial intelligence's integration with crypto is another area poised for growth in 2024, catalyzed by the popularity of applications like OpenAI's ChatGPT. Such integration is still in the early stages but offers potential use cases in trade automation, predictive analytics, generative art, decentralized autonomous organization operations and decentralized storage for AI model training, according to the analysts.\n\nReal-world asset tokenization is another identified theme for 2024. RWA tokenization is gaining momentum due to its ability to bring off-chain assets onto blockchains, offering greater transparency and efficiency. Tokenized treasuries are likely to continue to be an attractive investment while interest rates remain elevated, the analysts said. “Additionally, alongside the accelerated institutional adoption of RWAs, developments in related infrastructures such as decentralized identity, oracles and interoperability solutions are also expected to gain momentum,” they added.\n\nOther themes Binance Research identified for the year ahead include a thriving on-chain liquidity landscape, continued emphasis on security improvements, ownership economy applications traction, such as decentralized physical network infrastructure (DePin) and decentralized social media, plus account abstraction gaining importance in simplifying and enhancing the user experience of blockchain technology."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMivwFodHRwczovL3JpYWJpei5jb20vYS8yMDI0LzEvMTcvdGltLWJ1Y2tsZXktaGF6YXJkcy1nZW4teC15LXotYmxvd2JhY2stYW5kLWNhdGNoZXMtdmFuZ3VhcmQtaW52ZXN0b3JzLW9mZi1ndWFyZC13aXRoLWxhc3Qtc2Vjb25kLWFudGktZmlkZWxpdHktcG9saWN5LXRvLWFjdGl2ZWx5LXN0ZWVyLWFzc2V0cy1hd2F5LWZyb20tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Tim Buckley hazards Gen X, Y, Z blowback and catches Vanguard investors off-guard with last-second, anti-Fidelity ... - RIABiz",
        "content": "Biz Briefs: The sorry scene at my local First Republic branch • Schwab launches new (smaller) lay-off round • Schwab hoovers pennies passing FINRA fee to clients • Gensler pleas for funds • Fidelity owner's private equity pres. retires • an Orion-Envestnet staff switcheroo • LPL dumps FutureAdvisor\n\nRange Rovers screeched in and drivers joined a grim queue to get their cash, and cookie • The Schwab-TDA deal cull count now stands at roughly 3.5% of its staff • FMR's hockey star president has stepped down • SEC chief wants more enforcers • An Envestnet executive proves joining a rival is good business • LPL now has an in-house robot."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8xNi9ibGFja3JvY2std2FudHMtdG8tZm9sbG93LWJpdGNvaW4tZXRmLXdpdGgtYW4tZXRoZXJldW0tZXRmLW1hcmtldGluZy1pdC1taWdodC1ub3QtYmUtc28tc2ltcGxlL9IBkAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyNC8wMS8xNi9ibGFja3JvY2std2FudHMtdG8tZm9sbG93LWJpdGNvaW4tZXRmLXdpdGgtYW4tZXRoZXJldW0tZXRmLW1hcmtldGluZy1pdC1taWdodC1ub3QtYmUtc28tc2ltcGxlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "BlackRock Wants to Follow Bitcoin ETF With an Ethereum ETF. Marketing It Might Not Be So Simple - CoinDesk",
        "content": "BlackRock Wants to Follow Bitcoin ETF With an Ethereum ETF. Marketing It Might Not Be So Simple\n\nLarry Fink has been talking up a spot ether ETF, but index provider CF Benchmarks sees a conundrum when it comes to selling that product.\n\nBy Ian Allison Jan 16, 2024 at 4:48 p.m. UTC"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1idGMtY3J5cHRvLXNlYy1ldGYtZGF2aWQtcm9zZW5iZXJnLWdhbWJsaW5nLWludmVzdGluZy1wb3J0Zm9saW8tMjAyNC0x0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Cryptos Closer to Lottery Tickets Than Investments: Rosenberg - Markets Insider",
        "content": "Veteran economist David Rosenberg says buying bitcoin is more like gambling than investing.\n\nStocks, bonds, cash, and commodities are much easier to value than cryptocurrencies, he says.\n\nBitcoin is volatile, as shown by its price move after the SEC decision last week, Rosenberg says.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin and other cryptos are so volatile and hard to value that buying them is closer to gambling than investing, David Rosenberg says.\n\nStocks are a claim on a company's future cash flows, bonds and savings accounts pay out interest, while commodities have industrial uses and demand for them can be modeled using economic data, the Rosenberg Research president said in a morning note on Monday.\n\n\"These things are real,\" Rosenberg wrote. \"You want to get rich by believing in crypto 'currencies?' Then barbell your holdings with lottery tickets. Seriously — let's get a grip.\"\n\nThe former chief North American economist at Merrill Lynch argued that bitcoin and other tokens are examples of the \"greater fool\" theory at work. In other words, people buy them not because they're intrinsically worth anything, but because they hope to sell them for a profit to someone even more foolish.\n\nAdvertisement\n\nRosenberg's diatribe followed US regulators' approval of nearly a dozen spot bitcoin ETFs last week. The veteran economist noted the most popular crypto tumbled in price from a two-year high of $49,000 last Thursday morning, to $44,000 by Friday evening.\n\n\"Who needs this degree of volatility in their lives?\" he queried. \"Not me, that's for sure.\"\n\nRosenberg's crypto-bashing echoes the critique he made to Business Insider last year. He underscored that token prices can swing 20% or 30% within weeks.\n\n\"Why introduce that to your portfolio unless you're a gambler?\" he questioned at the time.\n\nAdvertisement\n\nMoreover, he emphasized the difficult of gauging the worth of an asset that, unlike a business or a bond, doesn't yield a return for investors.\n\n\"I don't know how to value it,\" he said. \"Therefore, as they say on 'Shark Tank' — 'I'm out.'\""
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzE1LzEtdG9wLWNyeXB0b2N1cnJlbmN5LXRvLWJ1eS1iZWZvcmUtaXQtc29hcnMtMzAwMC1vL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "1 Top Cryptocurrency to Buy Before It Soars 3,000% or More, According to Cathie Wood - The Motley Fool",
        "content": "According to Ark Invest CEO Cathie Wood, the price of Bitcoin (BTC -6.56%) could soar to as high as $1.5 million by 2030. Given Bitcoin's current price of just under $50,000, that would represent a nearly 3,000% gain within a remarkably short period.\n\nAt first glance, this $1.5 million price target might strike you as outlandish. After all, in its entire 15-year history, Bitcoin has only reached a high of $69,000 -- and that was during the extremely frothy and speculative crypto bull market of 2020-2021. But, as Wood points out, two key catalysts could lead to Bitcoin skyrocketing in value. Let's take a closer look.\n\nThe new Bitcoin ETF\n\nThe obvious starting point is the new spot Bitcoin ETF product. Ark Invest is one of the investment firms that received approval for a spot Bitcoin ETF, so it's no surprise that Wood is extremely bullish on what this means for the long-term growth of Bitcoin. As she recently pointed out on CNBC, the SEC just gave the \"green light\" for both Wall Street and Main Street to invest in Bitcoin.\n\nConsidering that institutional investors have trillions of dollars in assets under management, it won't take a lot to move the needle. For example, if institutional investors such as pension funds and endowment funds decide to allocate just 1% of their portfolios to Bitcoin, the ramifications could be enormous. It could result in billions of dollars flowing into Bitcoin.\n\nAt the same time, wealth managers and financial planners could start advising their clients to consider allocating a portion of their portfolios to Bitcoin. That, too, could lead to an influx of new money flowing into Bitcoin. Most likely, this would occur over a longer period, and probably won't have as dramatic an effect as, say, BlackRock Inc. (BLK -2.08%) flipping the switch on $10 trillion in assets under management.\n\nBitcoin use cases\n\nMoreover, Bitcoin has an expanding array of use cases that make it valuable. Remember -- Bitcoin is not just a financial asset, it's also a technological innovation based on blockchain technology. The most obvious use case right now is acting as a store of value. Many crypto investors refer to Bitcoin as \"digital gold\" precisely because it appears to be a long-term store of value, similar to physical gold.\n\nBut there are a handful of other use cases for Bitcoin that you might not have considered. In Ark Invest's \"Big Ideas 2023\" report, the investment firm lays out eight different use cases for Bitcoin. For each of these use cases, the firm applies several different projections and estimates for just how big the market opportunity might become.\n\nFor example, the base case scenario in the Ark Invest report is for institutional investors to allocate 1% of their portfolios to Bitcoin. But the bull case scenario calls for institutional investors to allocate as much as 6.5% of their portfolios to Bitcoin. The more that institutional investors buy (literally) into the idea of Bitcoin, the higher Bitcoin could go in the medium to long term.\n\nWhat could possibly go wrong?\n\nBased on the above, Bitcoin would seem to be unstoppable. No wonder Cathie Wood recently doubled down on her $1.5 million price estimate for Bitcoin. But just keep in mind that Bitcoin is rarely predictable and often highly volatile. So while the long-term macro trend might be for Bitcoin to soar in value, there is sure to be plenty of turbulence along the way.\n\nOne of the primary risks to Bitcoin has always been regulatory risk. Simply stated, the SEC could decide to pull the plug on Bitcoin at any moment. The large-scale approval of so many different spot Bitcoin ETF products at one time would appear to signal that the SEC is finally OK with the idea of investors buying Bitcoin. But what if the new ETFs perform erratically, or there are major glitches in how Bitcoin trades in the crypto market as a result of so much new money entering the market so quickly?\n\nThat being said, I agree with Wood that a \"building block\" model for Bitcoin valuation -- in which all the use case projections for Bitcoin are summed up and then aggregated -- makes a lot of sense. And I agree that spot Bitcoin ETF approval is almost certain to lead to billions of new dollars flowing into Bitcoin. The big question, though, is just how long it will take Bitcoin to reach that mythical $1 million price target."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9ldGhlcmV1bS1mbGlwLWJpdGNvaW4tY2F0aGllLXdvb2RzLWJvbGQtcHJlZGljdGlvbi1uZXh0LWJ1bGwtcnVuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Ethereum to Flip Bitcoin: Cathie Wood's Bold Prediction for the Next Bull Run - CCN.com",
        "content": "Key Takeaways\n\nCathie Wood is bullish on cryptocurrencies, predicting a substantial growth of the entire crypto asset class.\n\nArk Invest is launching five separate crypto ETFs.\n\nEthereum is poised to outperform Bitcoin in the long run due to its multifaceted role in the evolving digital economy.\n\nCathie Wood, the CEO of ARK Invest, is known for her bullish stance on cryptocurrencies, particularly Bitcoin and Ethereum.\n\nIn a recent interview , Wood articulated her conviction in the potential of these digital assets, predicting a substantial growth of the entire crypto asset class from $1 trillion today to $25 trillion over the next five to seven years.\n\nWood Declares Confidence in Crypto with New ETF Launch\n\nARK Invest is launching five separate crypto ETFs , including a spot Bitcoin (BTC) ETF and a spot Ethereum (ETH) ETF. Wood’s enthusiasm started in the mid-2010s, when it had a market cap of about $6 billion. The involvement of economist Art Laffer , who praised Bitcoin for its rules-based monetary policy, significantly influenced her perspective.\n\nWood’s focus is particularly interesting when it comes to Ethereum. She acknowledges Ethereum’s burgeoning role in the world of decentralized finance (DeFi) and non-fungible tokens (NFTs), recognizing its ability to satisfy the unmet need for yield in the financial markets. This view is underscored by the current state of fixed income markets , where the search for yield has reached unprecedented levels.\n\nFurthermore, Wood emphasizes the importance of following the developers in the crypto space. By this metric, Ethereum stands out, with its ecosystem supporting a wide range of applications. Vitalik Buterin’s blockchain’s holds DeFi and NFTs, and attracts a large community of developers. This aspect of Ethereum, combined with its potential in empowering the creator community, contributes to Wood’s optimism about its future.\n\nCathie Wood expects #Ethereum will most likely outperform Bitcoin in the next Bull Run. pic.twitter.com/FEK9YAIZWo — Crypto Rover (@rovercrc) January 15, 2024\n\nWood’s bullish stance on Ethereum does not overshadow her confidence in Bitcoin. She sees both cryptocurrencies as having a bright future, highlighting the importance of investing during times of volatility, which she believes strengthens the credibility and investor confidence in these digital assets.\n\nWood also touches upon the broader economic context, discussing monetary policies and trust issues in traditional finance. She suggests cryptocurrencies, with their decentralized and transparent nature, offer a more trustworthy alternative in the current economic climate.\n\nEthereum Poised to Outperform Bitcoin\n\nIn terms of long-term predictions, ARK Invest’s “Big Ideas” presentations provide ambitious forecasts for both Bitcoin and Ethereum. In their 2023 presentation, they laid out three scenarios for Bitcoin, ranging from a bear case of $258,000 to a bull case of $1.48 million by 2030. For Ethereum, their 2022 forecast envisages a market cap that could exceed $20 trillion by 2032, potentially valuing each ETH at more than $166,000."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy90aGUtYml0Y29pbi1zcG90LWV0Zi1jb3VudGRvd24tdG8tYXBwcm92YWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Approval a ‘Sell the News’ Event - Brave New Coin Insights",
        "content": "Bitcoin ETF Approval a ‘Sell the News’ Event\n\nThe SEC's approval of 11 Bitcoin ETFs has proven to be a 'buy the rumor, sell the news' trading event. Will an Ethereum ETF be the same?\n\nAfter touching two-year price highs following spot Bitcoin ETF approvals in the US last week on Wednesday, the price of BTC dropped sharply to below US$42,000 on Friday. The +10% slide leaves BTC down ~2.2% in the last week.\n\nLast week, the Securities and Exchange Commission (SEC) approved 11 spot ETFs for the first time. Approved issuers include giants from the investing world, such as Blackrock, Fidelity, and Ark. Currently, Fees on the products range from 0 (many issuers are offering zero fees in the first few months post-launch) to 1.5% on the Grayscale Bitcoin ETF.\n\nOn Thursday, the spot ETFs opened with a strong market reaction. On the first day of trading, the eleven approved spot BTC ETFs recorded US$4.6 billion worth of trading volume across 700,000 trades. ETF analyst Eric Balchunas described Thursday as — “Easily the biggest Day One splash in ETF history.”\n\nInitially, the price of BTC jumped on news that the ETFs had been approved and the open was received with strong market demand. By Friday the price of BTC touched US$49,000 on some exchanges, cementing a two-year price high for the asset. This euphoria, however, was to be short-lived.\n\nThe price of BTC tanked over the weekend in what appeared to be a clear ‘buy the rumor, sell the news reaction.’ The classic maxim refers to traders making a buy based on speculation surrounding upcoming news events or releases, and then selling when it is clear the event has materialized. Traders buying into the speculation can purchase the asset or security before everyone else and then sell as soon as the influx arrives, capturing short-term profits and avoiding any potential risks that the news event is underwhelming or mishandled.\n\nA driver of the selling pressure was news that much of the ETF volume on Thursday was likely bearish. Half of the spot ETF volume on Thursday came from the converted Grayscale product, about US$2.3 billion. This surprised many and some suggested a chunk of this volume was selling. “Very easy argument to be made that a ton of this volume was the selling of [Grayscale’s fund] and buying of other ETFs for now,” Bloomberg ETF analyst James Seyffart said.\n\nGary Gensler Likely Cast The Deciding Bitcoin ETF Vote\n\nThe SEC’s ETF approvals, although expected due to legal and market pressure, still came as something of a surprise because of the agency’s historical wariness of crypto investments. Since taking office, SEC chairman Gary Gensler has been particularly vocal about the risks tied to investing in crypto and frequently connected the asset class to frauds and scams.\n\nDespite his public skepticism, Gensler was one of three commissioners to approve the spot BTC ETF offerings. Gensler was likely the deciding vote, with the approval being passed 3-2. Commissioners Hester Peirce and Mark Uyeda approved the ETFs alongside Gensler, while Caroline Crenshaw and Jaime Lizárraga dissented. This indicates how close the ETFs came to being rejected.\n\nIn a statement released after the ETFs were approved, Gensler was clear that the SEC does “approve or endorse” Bitcoin despite the approval. It appeared that a key factor in Gensler’s approval was a key win for spot ETF applicant Grayscale in a court case with the SEC. The agency did not appeal a recent court ruling that determined the agency had acted “arbitrarily and capriciously” in rejecting Grayscale’s proposal to convert its Bitcoin Trust (GBTC) into an Exchange Traded Funded (ETF). On Tuesday, August 29, 2023, the DC Circuit Court of Appeals made its ruling and ordered the SEC to review its decision and provide a clear rationale for its treatment of different types of Bitcoin-related products, including futures-based ETFs that it approved.\n\nThe SEC’s decision to not appeal the loss opened the door for spot Bitcoin ETFs to be approved. Gensler wrote in a statement post ETF approval — “We are now faced with a new set of filings similar to those we have disapproved in the past. Circumstances, however, have changed. The U.S. Court of Appeals for the District of Columbia held that the Commission failed to adequately explain its reasoning in disapproving the listing and trading of Grayscale’s proposed ETP (the Grayscale Order).” He said for this reason and others including the ETFs listing on regulated, national securities exchanges, the ETFs were approved.\n\nAn Ethereum ETF?\n\n\n\nWhile BTC has lost value because of event-based selling, Ethereum (ETH) has surged. A key factor in this momentum is an expectation that, following the approval of the spot Bitcoin ETF, a spot Ethereum ETF is next. Analysts at Bloomberg predicted that the odds of a spot Ether ETH being approved by May is 70%.\n\nMajor industry players including Vaneck, Blackrock, and Fidelity have all applied for spot Ethereum ETFs and these applications all have a final decision deadline of May 23rd. Some expect these to come sooner with several intermediary firms set for late January.\n\nIf we consider a similar ‘Buy the Rumor, Sell the News’ structure to the spot Bitcoin ETF cycle, ETH is still in the ‘buy the rumor’ and a price drop may occur when the expected approval does come. A factor in this confidence is asset manager Blackrock’s exceptional record of ETF application approval which currently sits at 576-1.\n\nEthereum and the altcoin market have historically outperformed BTC in January. Since 2017, the average monthly return for Ether is a 26.7% gain. For BTC it is a 4.8% gain.\n\nThe ETF Fee War\n\nLast week, U.S. Spot Bitcoin exchange-traded funds (ETFs) issuers finally disclosed their fees. There are now multiple Bitcoin Spot ETFs and the fees they charge are the primary way they compete with each other.\n\nMany of the issuers have continued to update their fees in the days leading up to approval, in a game of cat and mouse that has been described as the “ETF Terrordome”, a reference to the ruthless, take-no-prisoners approach required to succeed at the sharp end of the asset management business.\n\nCharging the least is crypto-savvy fund manager Bitwise, with a fee of just 0.20% after a 6-month waiver period of no fees. Ark21Shares is next with a fee of 0.21%. Franklin is at 0.29%. BlackRock, the world’s largest asset manager, has set its fee at 0.25%. This is much lower than many had predicted, given BlackRock’s brand power and market size.\n\nSource: Bloomberg\n\nBloomberg ETF analyst James Seyffart wrote on X that, “The Bitcoin ETF fee war has sharp elbows. These fees are sooo low and the ETFs will trade ABSURDLY tight (penny wide bid-ask spreads) and without any commissions on most platforms.”\n\nGrayscale, however, which plans to convert its Grayscale Bitcoin Trust (GBTC) into an ETF, has the highest fee at 1.5%. However, they have included a clause about the ability to waive fees. Plus, Grayscale already has $28 billion of assets under management (AUM) whereas the other applicants are starting from a position of zero.\n\nWhat’s clear is that the lower-than-expected Bitcoin ETF fees are good news for investors, and they will put pressure on crypto exchange fees. U.S exchanges such as Kraken and Coinbase will now be competing with the ETF providers, and for those wishing to invest in Bitcoin, the ETFs look very attractive indeed.\n\nA Wild Week of Mixed Signals\n\nIt has been a wild week in the lead-up to today’s Bitcoin ETF approval, with mixed signals, false reporting, an SEC hack, and a series of botched announcements by the SEC and the exchanges involved.\n\nPerhaps it is a sign of today’s hyper-connected, extremely online world, and the average person won’t have noticed, but the denizens of crypto twitter have ridden an emotional rollercoaster this week, as official announcements appeared and then disappeared on various websites and exchanges.\n\nThe SEC has fought hard to get its ducks in a row, but ultimately it was the wisdom of the market that proved correct. Bitcoin failed to move much on final revelation, showing that the market has indeed priced in the ETF approvals. For now, at least.\n\nIn a series of events yesterday that were memorably described as a goat rodeo, the official SEC X Account appeared to announce that Bitcoin Spot ETFs had been approved.\n\nHowever, 15 minutes later the SEC head Gary Gensler announced, “The @SECGov Twitter account was compromised, and an unauthorized tweet was posted. The SEC has not approved the listing and trading of spot bitcoin exchange-traded products.”\n\nThe price of Bitcoin surged quickly to $47,600 after the bogus announcement before dropping to around $45,500 after Gensler said “fake news.”\n\nWe’ll leave the final word on this to Edward Snowden.\n\nGary Gensler Sounds a Warning\n\nAlso this week, SEC Head Gary Gensler published a thread on X, stating that “Those offering crypto asset investments/services may not be complying w/ applicable law, including federal securities laws. Investors in crypto asset securities should understand they may be deprived of key info & other important protections in connection w/ their investment.”\n\nGensler wrote, “Investments in crypto assets also can be exceptionally risky & are often volatile. A number of major platforms & crypto assets have become insolvent and/or lost value. Investments in crypto assets continue to be subject to significant risk.”\n\nGensler’s thread concluded with “Fraudsters continue to exploit the rising popularity of crypto assets to lure retail investors into scams. These investments continue to be replete w/ fraud- bogus coin offerings, Ponzi & pyramid schemes, & outright theft where a project promoter disappears w/ investors’ money.”\n\nGensler is committed to being seen as the responsible adult in the room when it comes to protecting American investors.\n\nSpot Bitcoin ETFs: Unlocking Opportunities\n\nThe spot Bitcoin ETFs, which track the actual price of BTC rather than its derivatives like Bitcoin futures, represent a breakthrough for the U.S. market. While such ETFs have gained approval in Europe, Canada, and Brazil, the SEC has previously rejected applications due to concerns about potential market manipulation.\n\nThe approval of eleven spot Bitcoin ETFs in the U.S. is a milestone for crypto investors and an opportunity for financial advisors. These ETFs, renowned for their efficiency and popularity, could unlock a $50 trillion market across financial advisors, retail investors, and private banks, fostering market maturity and institutional investor confidence.\n\nWhile the underwhelming price action today shows that the market has indeed priced in the ETF approvals, what happens next could surprise.\n\nBIoomberg senior ETF analyst Eric Balchunas has reported that BlackRock may break the first-day ETF flow record with a $2 billion asset injection on the first day of trading for its spot Bitcoin ETF. That would be a strong catalyst for the Bitcoin market and suggest momentum is just getting started.\n\nNew Year, New Opportunity for Bitcoin Investors\n\nAs the crypto community celebrates the SEC’s decision to finally approve spot Bitcoin ETFs, the cryptocurrency market is poised for an extended bull run. The approval of Bitcoin spot ETFs coincides with a potential demand shock for Bitcoin with the April 2024 halving, offering investors a unique confluence of factors that historically result in favorable outcomes.\n\nThe question is, how will the market respond? As Bitcoin has already experienced a 61% rally since early October, driven in large part by heightened expectations of approval for spot Bitcoin ETFs, some market observers are forecasting a sell-the-news-induced pullback.\n\nComparisons are drawn to past market events, such as the debut of CME Bitcoin futures in December 2017, Coinbase’s Nasdaq listing in mid-April 2021, and the introduction of various futures ETFs, including BITO. Historical trends indicate that Bitcoin, following rallying periods during these events, experienced subsequent crashes in the weeks that followed.\n\nFor instance, the three days leading up to the SEC’s approval of the first futures ETFs saw Bitcoin surge by 15%. However, a month later, the cryptocurrency reached a record high of $69,000 before plummeting into a bear market that endured for over a year. Analysts caution that historical precedents suggest a potential post-ETF approval downturn, emphasizing the importance of monitoring market dynamics in the aftermath of regulatory decisions.\n\nOthers are more bullish, however, with the likes of Max Keiser and Samson Mow predicting billions of dollars of new flow into Bitcoin once the ETFs start trading. And of course, the rumored two billion in immediate inflows from BlackRock.\n\nAlso very bullish, is a new report from Standard Chartered Bank predicting significant inflows into the spot ETFs.\n\nThe bank predicts inflows of $50 billion to $100 billion this year, meaning that between 436,000 and 1.3 million bitcoins will be held in U.S. ETFs by the end of this year.\n\nAt that volume of new inflows, Standard Chartered said Bitcoin could reach US$200,000 by the end of 2025.\n\nNow that the ETFs are approved, expect a marketing war to begin, with the various asset managers competing to communicate Bitcoin’s narrative to an army of financial managers.\n\nIn the long term, nothing could be more bullish for Bitcoin."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ncmF5c2NhbGUtYml0Y29pbi10cnVzdC1ldGYtdHJhbnNmZXJzLWFub3RoZXItMzc2LW1pbGxpb24td29ydGgtYnRjLXByaWNlLXN0YWJpbGl6ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Grayscale Bitcoin Trust ETF transfers another $376M in BTC as price stabilizes - Cointelegraph",
        "content": "The Grayscale Bitcoin Trust (GBTC) transferred 8,730 Bitcoin (BTC), worth over $376 million, to Coinbase Prime deposit addresses on Jan. 16, according to data from blockchain analytics platform Arkham Intelligence.\n\nThe transfers imply that the fund may have been forced to sell some of its Bitcoin as its share price declined.\n\nGrayscale Bitcoin Trust outflows on Jan. 16. Source: Arkham Intelligence\n\nSome analysts have argued that outflows from the trust are weighing on Bitcoin’s price and are partially responsible for its decline over the past few days. Despite the outflows, the price of Bitcoin appears to have stabilized during mid-day United States trading hours on Jan. 16.\n\nBitcoin one-day price chart. Source: Cointelegraph\n\nThe Grayscale Bitcoin Trust is one of the world's largest single holders of BTC. Prior to Jan. 11, most investors in the fund could not redeem their shares for Bitcoin or a cash equivalent. But beginning on Jan. 11, the trust was converted into an exchange-traded fund (ETF).\n\nSince then, authorized participants have been allowed to buy up shares from investors and redeem them for the cash equivalent of the Bitcoin these shares represent. When they do so, the trust is required to sell off BTC to pay these recipients. This process generally only occurs when the price of GBTC is lower than the value of the BTC it represents.\n\nAccording to Arkham data, on Jan. 12 the trust transferred $41 million to a Coinbase Prime wallet, implying that the trust may have sold BTC. Some traders speculated that this outflow may have caused Bitcoin’s sharp price decline that day.\n\nAlso on Jan. 12, Bloomberg analyst Eric Balchunas claimed in a post to X (formerly Twitter) that the Grayscale Bitcoin Trust experienced a total of $95.1 million of outflows on Jan. 11 and $484.1 million on Jan. 12 by the close of trading. Balchunas cited Bloomberg Terminal as his source.\n\nRelated: Grayscale was key to BTC ETF approval — Crypto Mom\n\nBalchunas also claimed that other Bitcoin ETFs, such as the iShares Bitcoin Trust and Fidelity Wise Origin Bitcoin Fund, received inflows of nearly $1.4 billion over the course of these two days. After accounting for GBTC’s outflows, this implies that the U.S. spot Bitcoin ETF market experienced net inflows of more than $818 million over the first two days of its trading despite the broader Bitcoin market facing losses during the same period.\n\nOn Jan. 16, Arkham data showed further outflows of $376 million BTC from the Grayscale Bitcoin Trust by 7:17 pm UTC. The U.S. stock market closes at 9:00 pm UTC.\n\nSome traders blame the higher GBTC fees for the outflows. GBTC charges a 1.5% management fee, which critics say is higher than most of its competitors."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFkb3B0aW9uLXRocmVhdGVuLXVzLWRvbGxhci1kb21pbmFuY2UtbW9yZ2FuLXN0YW5sZXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's 'remarkable' growth and CBDCs threaten the US dollar — Morgan Stanley - Cointelegraph",
        "content": "A “paradigm shift” in the perception and use of digital assets such as Bitcoin (BTC) and central bank digital currencies (CBDCs) could threaten the dominance of the United States dollar as a global currency, warns Wall Street investment bank Morgan Stanley.\n\nWhile the U.S. dollar makes up roughly 60% of global foreign exchange reserves, a “paradigm shift in the global perception and use of digital assets” could challenge the dollar’s leadership, wrote Morgan Stanley’s head of digital assets, Andrew Peel, in a Jan. 12 investment note.\n\nPeel said the shift has now been significantly accelerated by the U.S. Securities and Exchange’s approval of several spot Bitcoin exchange-traded funds in the U.S., with weekly inflows into the new products topping $1.18 billion.\n\nAdditionally, Peel looked to Bitcoin’s “remarkable” global adoption over the past 15 years as evidence for its continual growth, noting that 106 million people around the world currently hold the cryptocurrency and added that there are now Bitcoin ATMs in more than 80 countries.\n\nMeanwhile, other countries’ CBDCs could also impact the dollar’s dominance, which would enable speedy cross-border payments without the need for a common currency.\n\n“[CBDCs] hold the potential to establish a unified standard for cross-border payments, which could diminish the reliance on traditional intermediaries like SWIFT and the use of dominant currencies such as the dollar.”\n\nAccording to data from the Atlantic Council CBDC Tracker, 130 countries — representing over 98% of global gross domestic product — are exploring or developing CBDCs, marking an outsized increase from just a few years ago.\n\n130 countries are currently in the process of exploring a CBDC. Source: Atlantic Council\n\nRelated: Spot Bitcoin ETFs secure record trading volume for crypto products: CoinShares\n\n“Furthermore, CBDCs can enable significant innovation in financial services, such as the use of smart contracts for automating payments, making the concept of programmable money a practical reality,” Peel added.\n\nWhile Bitcoin and CBDCs could impact U.S. dollar dominance, Peel noted that stablecoins could prove a more helpful addition to global finance, describing the largely fiat-pegged stablecoins as crypto’s “killer app.”\n\n“With their increasing importance, dollar-backed stablecoins are set to have a profound impact on the financial sector, potentially reshaping how money is moved across borders.”\n\nAsia Express: Hong Kong Bitcoin ETF FOMO, Thailand approves $14B airdrop"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tZGlwcy1iZWxvdy00MmstbGlxdWlkYXRlcy1tYWpvcml0eS1vZi1sb25nLXBvc2l0aW9ucy1hY3Jvc3MtZXhjaGFuZ2VzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin dips below $42k, liquidates majority of long positions across exchanges - CryptoSlate",
        "content": "Bitcoin (BTC) fell below $42,000 for the second time over the weekend after failing to break above $43,100 amid subdued trading volumes after the ETF hype at the end of last week.\n\nAs of press time, BTC was trading at $41,870 on most of the large exchanges. The price is still above the key support level of $40,250; however, sell pressure continues to mount before the Asian markets open for trading.\n\nThe flagship crypto experienced $23.68 million in liquidations over the past 24 hours, roughly 85% of which were longs — equating to $20.11 million, according to CoinGlass data.\n\nThe liquidations largely affected traders on prominent exchanges, with Binance and OKX bearing the brunt, witnessing liquidations of $7.51 million and $5.26 million, respectively.\n\nSell the news\n\nThe approval and launch of spot Bitcoin ETFs initially led to a surge in Bitcoin’s price, reaching around $49,000. However, following the excitement, there has been a notable downturn in the price, partly due to market reactions typical of “sell the news” events.\n\nThis kind of market behavior often occurs when there is a build-up of anticipation for an event (like the launch of ETFs), followed by a quick sell-off after the actual event.\n\nFrom a technical analysis perspective, Bitcoin was showing signs of buyer exhaustion and increased selling pressure. Analysts observing indicators like the Exponential Moving Average (EMA) noted that Bitcoin was trading at key resistance levels, suggesting a potential price correction.\n\nThese technical signals can often lead to a self-fulfilling prophecy as traders and investors react to them.\n\nETF issuers buying the dip\n\nMeanwhile, the ETF issuers have reportedly bought 23,000 BTC amid the downturn, with BlackRock accounting for 11,500 Bitcoin. It is unclear whether the interest in these products will continue to gain traction or if the weekend lull is a precursor to the coming days.\n\nExperts believe that if these institutions continue scooping up Bitcoin at similar levels, it will likely lead to a supply crunch within a few months and could push the price to new highs.\n\nHowever, the market has been wary of outflows from Grayscale’s GBTC ETF, whose holders have been underwater since 2022 and are likely looking for an opportunity to sell as they are made whole.\n\nBitcoin Market Data At the time of press 12:14 am UTC on Jan. 15, 2024, Bitcoin is ranked #1 by market cap and the price is down 2.04% over the past 24 hours. Bitcoin has a market capitalization of $822.13 billion with a 24-hour trading volume of $17.72 billion. Learn more about Bitcoin › Bitcoin $41,947.44 -2.04% Crypto Market Summary At the time of press 12:14 am UTC on Jan. 15, 2024, the total crypto market is valued at at $1.65 trillion with a 24-hour volume of $48.87 billion. Bitcoin dominance is currently at 49.71%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktaXMtYml0Y29pbi1wcmljZS1zdHVja9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Why is Bitcoin price stuck? - Cointelegraph",
        "content": "Bitcoin (BTC) price is stuck inside a range, reflecting uncertainty and indecision among market participants after spot Bitcoin ETF were approved last week.\n\nAs of Jan. 16, BTC's price has been confined between $41,550 and $43,000. This stagnation persists despite a previous attempt at a breakout earlier in the month, during which the cryptocurrency briefly surged to a high of over $49,000, only to fall back into its current range.\n\nBTC/USD daily price chart. Source: TradingView\n\nThe flatness in Bitcoin's price can be attributed to several factors discussed below.\n\nMuted response to Bitcoin ETF approval\n\nBitcoin's run-up to over $49,000 appeared in the wake of eleven spot BTC ETF approvals, including those of BlackRock and Fidelity, in the United States. Nonetheless, the price retreated around 10% since — a scenario that some analysts had anticipated.\n\n#Bitcoin - We got the \"Told you it wasn't a sell the news event\" tweets. Now we got the giant red candle and the \"Told you it was a sell the news\". Next stop, Twitter telling you to buy the dip even though somehow everyone was already all in. https://t.co/ZJRRb6pG38 — IncomeSharks (@IncomeSharks) January 12, 2024\n\nThis suggests that the approval was largely priced in by the market. There wasn't a significant rally post the ETF approval, indicating that investors had adjusted their expectations accordingly​.\n\nBitcoin dominance slides\n\nBitcoin's market dominance index has dropped from its local top of 54.56% to 51.14% in a week.\n\nBitcoin dominance index daily performance chart. Source: TradingView\n\nGains by Ether (ETH) is the major reason why Bitcoin's dominance declined, comprising 8.5% with other altcoins posting similar gains.\n\nThis suggests that traders likely rotated capital out of Bitcoin to the altcoin market following the ETF approvals, seeing better risk-reward elsewhere, particularly with an Ethereum ETF now on the table.\n\nRelated: Spot Ethereum ETFs now have a straight shot for approval — Analysts\n\nMixed fundamental outlook\n\nOne significant positive market indicator for Bitcoin is the increasing capital inflow into BTC investment funds, particularly amidst the growing excitement around spot Bitcoin ETFs.\n\nThese Bitcoin funds attracted $1.25 billion from institutional investors in the first two weeks of 2024, or almost 55% of the entire previous year. This influx highlights the strong confidence of institutional players in Bitcoin's long-term value and potential.\n\nBitcoin leads in terms of institutional capital inflows in January 2024. Source: CoinShares\n\nOffsetting this bullish fundamental, however, are miners.\n\nThere is a growing concern that the increased hash rate in Bitcoin mining could lead miners to sell their coins faster. Some anticipate that the cost of Bitcoin mining will jump after the halving in April 2024, potentially putting pressure on BTC price\n\nAs of late, Bitcoin miners have collectively transferred more than $1 billion worth of Bitcoin to crypto exchanges.\n\nKoreans buying, Americans selling\n\nThe current period of Bitcoin's sideways price behavior is occurring alongside a noticeable trend of increasing buying in South Korea to offset selling in the U.S.\n\nRelated: Bitcoin faces ‘very limited liquidity’ as BTC price pushed below $43K\n\nThe Kimchi Premium Index, a metric measuring the difference in Bitcoin prices between South Korean and global cryptocurrency exchanges, indicates that Bitcoin is trading at a 3-4% premium in South Korea.\n\nBTC/USD weekly price chart ft. Kimchi and Coinbase premium indexes. Source: CryptoQuant\n\nConcurrently, the Coinbase Premium Index, which compares the price of Bitcoin in USD on Coinbase Pro with its USDT price on Binance, has shifted into negative territory, suggesting more U.S. sellers than buyers.\n\nNeutral RSI\n\nFrom a technical perspective, Bitcoin's rangebound price movements coincide with its daily relative strength index's (RSI) return to its neutral zone.\n\nThese two conditions, when observed together, typically suggests that the market sentiment is reaching an equilibrium, wherein neither bulls (buyers) nor bears (sellers) are in control.\n\nBTC/USD daily price chart. Source: TradingView\n\nInvestors may wait for more information before making significant moves, resulting in lower volatility and less directional movement in prices.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vbmV3cy9kb2VzLXlvdXItZmluYW5jaWFsLWFkdmlzb3Itc3BlYWstY3J5cHRvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Does Your Financial Advisor Speak Crypto? - Investopedia",
        "content": "It’s almost impossible to avoid frequent headlines declaring that Bitcoin or some other new cryptocurrency is the gold standard of the new world of digital assets. Nobody wants to miss out on a gold rush, but Bitcoin isn’t gold, and neither are its rivals. However, just as with gold mining, crypto mining involves expending energy to acquire something that, depending on the coin’s inflation schedule, may have finite availability.\n\nIn early 2024, there were more than 9,000 active cryptocurrencies. What may be surprising is that in a 2022 study by Investopedia regarding financial literacy, 49% of adults, when asked how well they understood crypto, said they were “beginners.”\n\nWhere does this leave the individual who believes in the future of these crypto assets but can’t figure out how to invest in them? A modern financial advisor who is well-versed in crypto can help you make sense of this relatively new landscape.\n\nKey Takeaways Many financial advisors are not well-versed in crypto and hesitate to recommend it to clients.\n\nThere is no industry standard for crypto certification like there is with the Certified Financial Planner (CFP) designation.\n\nDespite crypto having a market capitalization in the trillions, many are wary of calling it an “investable asset” and consider it more gambling than an investment vehicle.\n\nAlmost half of American adults do not understand digital assets beyond a beginner level.\n\nPast performance is no guarantee of future results. This common saying should be on the mind of every crypto investor and advisor.\n\nIs Crypto Investing or Gambling?\n\nThere is no consensus (pun intended) on whether crypto is gambling or investing. It seems it can fill both roles, depending on who is buying it, how informed they are, and their strategy behind the purchase. Financial advisors are more likely to tell you it resembles gambling, but investors who have experienced growth using crypto might claim differently.\n\nHowever, even among investment advisors who like alternative assets that tend to move independently of the S&P 500 Index, you’ll be hard-pressed to find many willing to suggest putting a chunk of your portfolio into any of the cryptocurrencies. Most wealth managers are steering clients clear of crypto for two reasons, listed below.\n\nYour Advisor Is Skeptical\n\nSome advisors might not view cryptocurrency as an asset, something most of their clients should stay away from unless they have money that they can afford to lose—and don't mind losing.\n\nCryptocurrencies may be thrilling to watch, but an advisor could put their client in a bad position by recommending placing money in a new financial product without any real understanding of how it works—this really is gambling.\n\nYour Advisor Is Trying to Protect You\n\nAlthough an advisor may be deeply knowledgeable about crypto, the advisor may not provide any recommendations on whether to buy or sell any digital currency. The advisor is not alone in this way of thinking. The reason is that an advisor’s job is not to sell transactions but rather to manage their clients’ money and expectations.\n\nWanting to protect advisory clients, sometimes from themselves, the advisor screens out the noise in the market and steers them away from the many cryptocurrency scams that have cropped up. To put that in perspective, crypto scammers stole some $10 billion in 2021 and $5.9 billion in 2022. Crypto scams and crime are dropping, but millions of dollars in cryptocurrency are still being stolen.\n\nAdvisors Are Hesitant to Recommend Crypto\n\nMany clients ask how they can invest in crypto because they’ve heard how much money they could make. The problem with this thinking is that cryptocurrencies are so volatile that investing in them while the volatility continues is essentially gambling.\n\nA better way to think about cryptocurrencies is to focus on the technology behind them: the blockchain. The blockchain is more or less a distributed ledger. Bitcoin is the most well-known cryptocurrency because it was the first viable one and has the highest market cap.\n\nBlockchain technology was originally developed with payment processing in mind, but in reality, there are a lot of truly solid potential uses for it. Some possibilities include digital identity, data tokenization, data management, and secure audit trails.\n\nBe sure to keep track of your cryptocurrency passwords. If you lose them or don’t leave them to your heirs, no one can access the tokens you’ve acquired.\n\nCFP Board Cautious About Crypto Assets\n\nAs of December 2022, advisors are free to talk to their clients about cryptocurrencies. However, the influential Certified Financial Planner (CFP) Board of Standards urged any CFPs considering offering advice on cryptocurrency-related assets to do so cautiously.\n\nIn a Nov. 30, 2022 notice, which will have been closely read by CFPs and the wider financial advisor community, the entity responsible for overseeing professional standards stated that cryptocurrencies should be treated with greater scrutiny than more conventional financial assets as they “have particular attributes and present significant risks and uncertainties that warrant careful analysis.”\n\nAmong other things, the CFP Board noted that cryptocurrency-related assets are generally:\n\nDifficult to analyze\n\nHard to value\n\nAt risk of getting stolen and more susceptible to heavy losses\n\nSpeculative and volatile\n\nThe CFP Board mentioned that this update had been planned for a while, and interestingly, alongside laying out the risks, it chose to remind CFP professionals that they are not required or obligated in any way to provide financial advice about cryptocurrency-related assets. It’s likely that the CFP Board is aware that an increasing number of CFPs are asked by their clients about these types of investments and wanted to remind them to be extra careful before giving in to these requests.\n\nIn the end, this notice didn’t result in any rule changes for CFPs. However, it clarified the risks of crypto assets and possibly made financial advisors even more cautious about advising clients on these types of investments.\n\nWhat Your Financial Advisor Can Do\n\nIn an ideal world, you would turn to your financial advisor, ask about adding some cryptocurrencies to your portfolio, and discuss which ones and how much. In the real world, most advisors don't even recognize them as an investable asset class and don't bother researching or analyzing them. Therefore, many are not able to talk about them.\n\nSo, where can you go for real advice about investing in Bitcoin, Ethereum, or any other cryptocurrency you're considering? You can always fall back on the less-than-5% rule, a simple guideline that dictates not putting more than 5% of your portfolio into any high-risk category. Even then, at this point, you'll have to get a little creative in your quest for crypto investments if you're working with most financial advisors.\n\nDifferent Ways to Get in This Market\n\nHowever, there is more than one way to participate in cryptocurrencies, and not all of them involve buying the digital assets directly. Some knowledgeable advisors would rather take one of these indirect approaches instead of actually helping you own cryptocurrency.\n\nYour financial advisor might go for one or more of the following alternatives:\n\nRemember, like betting on a horse race, the amount of money you’re willing to risk on cryptocurrencies should be limited to the amount you can afford to lose. Of course, the high level of risk associated with crypto assets doesn’t automatically mean that they’re gambling and not an investment. There are plenty of so-called “real” assets that come with loads of risk as well.\n\nStill, if cryptocurrencies do take their place among conventional investments, then advisors will have to catch up with those who waded into the fray long before them.\n\nHow to Buy Crypto\n\nIf you’ve spent time studying blockchain technology and want to invest in it for what it is—instead of speculating and hoping for the best—you may have to do the heavy lifting and buy the cryptocurrency yourself. To do so, you need a digital wallet to store your cryptocurrency keys securely.\n\nTo convert any cryptocurrency into cash, look for an exchange that supports trading the currency you want to purchase, such as San Francisco-based Coinbase, one of the more well-known exchanges. This digital currency exchange lets you buy and sell Bitcoin, Ethereum, and other crypto products in your local currency.\n\nDoes Your Advisor Understand Crypto Exchanges?\n\nNot all digital exchanges support all cryptocurrencies and/or all fiat currencies (the technical term for dollars, euros, yen, and other government-issued currencies). Start with well-known names such as Coinbase, Kraken, or Gemini, and do your homework before investing any cash. However, even the best crypto exchanges are not entirely without a blemish. Examine each exchange’s history of freezing and closing accounts, outages, and close ties with some traditional banking establishments. Most importantly, look for an exchange that offers insurance coverage for any losses that are its fault.\n\nTo buy or sell cryptocurrencies, you only need to log into your account on the selected exchange, either in its mobile app or on its website. For maximum security, you may want to set up your own cryptocurrency wallet to hold the currency rather than use one provided through the site. Before starting, you’ll want to learn the safest ways to store your bitcoin and other cryptocurrencies.\n\nWhat Is a Crypto Advisor? A crypto advisor is an asset manager who understands the workings of cryptocurrency and the appropriate ways to invest in it. As professionals who stay abreast of the rapid developments in cryptocurrency and blockchain, crypto advisors may be registered as investment advisors, registered representatives, or hold a credential like Certified Financial Planner (CFP) or Chartered Financial Analyst (CFA).\n\nHow Do You Become a Professional Cryptocurrency Advisor? As of January 2024, no “official” way to be licensed as a professional cryptocurrency advisor exists. However, most U.S. states are requiring that businesses retailing cryptocurrencies get licensed as a money transmitter business (MTB). Crypto retailers fit this definition, requiring licensing from the states and the Financial Crimes Enforcement Network (FinCEN). Individuals are not required to get licensed to work at an MTB.\n\nWhy Might a Financial Advisor Recommend Cryptocurrency? Cryptocurrencies could be a good investment for those who believe in the future of digital currencies and those who wish to protect themselves in the online financial arena. Cryptocurrencies are also relatively immune to political manipulation. Finally, of course, if you have spare assets with which you want to speculate, then crypto is a great place to do it.\n\nHow Can You Find an Advisor Who Understands Crypto? Some advisors will list crypto on their website, but there is always the chance that they listed it strictly for marketing purposes. Feel free to ask them probing questions about blockchain or Bitcoin and see if they can engage in intelligent discussion. Some advisors wishing to be well-versed in crypto might pursue the Certified Digital Asset Advisor designation.\n\nThe Bottom Line\n\nThe rhetoric in this article will likely be adjusted continuously as the crypto landscape is still unfolding. New coins are added daily, and the once-niche concept of blockchain is gaining real-world traction and government attention.\n\nIt is becoming ever more important for financial advisors to understand the asset class, yet many are hesitant to do so, and even more will not recommend it. This makes finding an advisor well-versed in crypto difficult, but not impossible.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own cryptocurrency.\n\n"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1vdXRwZXJmb3Jtcy1iaXRjb2luLWJ5LTIwLWJ1dC1ob3ctbG9uZy1jYW4tZXRoLWhvbGQtdGhlLTItNWstc3VwcG9ydNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Ethereum outperforms Bitcoin by 20%, but how long can ETH hold $2.5K support? - Cointelegraph",
        "content": "Ethereum's native token, Ether (ETH), rallied 20% between Jan. 8 and Jan. 11 but struggled to sustain the $2,600 level. The subsequent 3.5% correction down to $2,560 on Jan. 16 may have disappointed some bulls, but Ether's price has outperformed Bitcoin (BTC) by 19.5% since Jan. 8. Such gaps are quite uncommon and last occurred in October 2022.\n\nEther investors question if the $2,500 level will hold, given that the most obvious drivers are not expected in the short term, namely the Ethereum spot exchange-traded fund (ETF) and the planned Ethereum network upgrades. From a bullish perspective, these events present an opportunity for Ether to further decouple from the remaining cryptocurrency market, but they also present a risk if it either backfires or is postponed.\n\nEther usually does not outperform Bitcoin by 15%\n\nThe price of Ether outperforming Bitcoin by 15% or higher in a week is not something common, at least in the past two years. Besides the high correlation between the two cryptocurrencies, 2023 was marked by disappointment with Ethereum's declining total value locked (TVL) and persistently high gas fees, paving the way for competing blockchains. Meanwhile, Bitcoin benefited from the anticipation of a spot ETF approval, especially after BlackRock joined the race in June 2023.\n\nIn fact, the latest instance happened 14 months ago as Ether's price rallied from $1,305 to $1,615 in the seven days leading to Oct. 29, 2022. After outperforming Bitcoin by 17%, the gap closed in the following 11 days as ETH crashed below $1,100 on Nov. 9, 2022.\n\nEther/USD (blue) vs. Bitcoin/USD (orange), October 2022. Source: TradingView\n\nA single past instance should not serve as guidance for prices, especially considering November 2022 marked the downfall of the FTX exchange after reports of customer funds mismanagement and a potential $8 billion shortfall. A counter-example includes the 31 days between July 13, 2022, and Aug. 13, 2022, where Ether's price outperformed Bitcoin by 63%.\n\nEther/USD (blue) vs. Bitcoin/USD (orange), August 2022. Source: TradingView\n\nETH rallied from $1,080 to $1,990 during the 31 days ending Aug. 13, 2022, and despite failing to break above $2,000, the gap relative to Bitcoin's price persisted in the following month. In essence, a much different type of price action from the short-lived outperformance in October 2022. More importantly, the gap continued even though the cryptocurrency market capitalization faced a correction, which is opposite from what one typically expects given Bitcoin's dominance.\n\nEthereum network activity signals strength and higher demand for ETH\n\nTo understand whether Ether has what it takes to hold the $2,500 support, one should analyze the Ethereum network activity, including its scaling solutions. Decentralized applications (DApps) are at the core of this smart contract-capable blockchain, thus diminishing use in terms of users and volumes is indicative of less demand for ETH.\n\nRelated: Spot Ethereum ETF not coming 'anytime soon,' says Mark Yusko\n\nTo assess network demand, one needs to analyze metrics related to DApp usage, as some projects including games, decentralized finance (DeFi), and nonfungible token marketplaces are not financially intensive, rendering the total value locked (TVL) metric irrelevant. Over the past 30 days, the top Ethereum decentralized applications (DApps) have seen an average 26% decrease in the number of active addresses.\n\nBlockchains ranked by 30-day DApp volumes. Source: DappRadar\n\nOver the past 30 days, Ethereum DApps experienced a 41% gain in volume fueled by increases in Uniswap, Balancer, ParaSwap, and Aave. Consequently, even if one excludes the activity in Ethereum rollups, the base layer holds a 6 to 1 advantage versus its largest competitor, BNB Chain. That shows how bears' criticism toward Ethereum high fees is exaggerated in terms of dominance in the DeFi industry.\n\nBesides the strong on-chain activity, Ether's price could benefit from the \"Dencun\" hard fork, an upgrade that aims to increase data availability and reduce costs for rollup transactions. The test implementations are expected to initiate on Jan. 17. Furthermore, Bloomberg ETF analysts hold 70% odds of an Ethereum ETF approval by May, reinforcing the bullish momentum and the strength of the $2,500 price support.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9idXktZGlwLWJpdGNvaW4tbWluaW5nLXN0b2Nrcy0yMTI2MDA3NzkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Buy the Dip in Bitcoin Mining Stocks? - Yahoo Finance",
        "content": "Bitcoin has become a hot topic again for investors. Last week’s stamp of approval from the SEC for a slew of spot Bitcoin ETFs was one of the most widely anticipated events in the history of cryptocurrency. It brought with it a great deal of volatility. Some viewed it as a “Sell the news” event with speculators pumping prices up ahead of the news.\n\nThe initial movement following that first morning has been to the downside. Bitcoin prices are off from nearly $49,000 to $43,000 intraday on January 16th, 2024. The selling has not been isolated to the underlying cryptocurrency. The selling also hit the Bitcoin miners pretty hard.\n\nHere in today’s Chart of the Day, we delve into the world of Bitcoin and the Bitcoin miners including Marathon Digital Holdings (MARA) and the Valkyrie Bitcoin Miners ETF (WGMI).\n\nIn his video, Bartosiak employs technical analysis techniques to break down Marathon Digital’s recent price movements. Here's a glimpse of how he dissects the chart:\n\nMoving Averages: Bartosiak starts by examining the stock's moving averages, such as the 50-day and 200-day moving averages. He points out the significance of crossovers and divergences between these averages, which can indicate potential trend changes.\n\nSupport and Resistance Levels: Bartosiak identifies key support and resistance levels on the chart. These levels act as barriers that the stock price must breach or hold above, providing traders with critical decision points.\n\nChart Patterns: He discusses chart patterns like head and shoulders, cup and handle, or flags, and their relevance in predicting future price movements. These patterns can offer valuable insights into potential bullish or bearish trends.\n\nTechnical Indicators: Bartosiak also utilizes technical indicators such as Relative Strength Index (RSI) and Moving Average Convergence Divergence (MACD) to gauge the stock's momentum and potential reversal points.\n\nVolume Analysis: He emphasizes the importance of volume analysis in confirming price trends. An increase in trading volume during a breakout or breakdown can validate the significance of a price move.\n\nStory continues\n\nDave Bartosiak's technical analysis approach adds depth to our understanding of Marathon Digital's stock chart. By paying attention to moving averages, support and resistance levels, chart patterns, technical indicators, and volume, he equips investors with a comprehensive toolkit for making well-informed decisions in the stock market. Remember, while technical analysis is a valuable tool, it's important to consider other factors like fundamental analysis and market sentiment before making investment choices.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMarathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report\n\nValkyrie Bitcoin Miners ETF (WGMI): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLXN0b3JhZ2UtYnRjLXZzLWV4Y2hhbmdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Spot Bitcoin ETF custody vs. exchange custody: What's the difference? - Cointelegraph",
        "content": "As 10 asset managers in the United States have started trading billions in spot Bitcoin (BTC) exchange-traded funds (ETFs), investors might wonder how these issuers ensure that the underlying asset of their products is safe enough.\n\nDespite cryptocurrency exchanges losing comparatively less money to hacks over the past few years with new security improvements, the community witnessed multimillion-dollar attacks on exchanges like Poloniex in 2023. Is there anything that makes a spot Bitcoin ETF safer than trading on an exchange like Poloniex as a retail user?\n\nBitcoin custody products used by spot Bitcoin ETF providers are “nothing like what retail gets access to” on crypto exchanges, according to Ophelia Snyder, co-founder of 21Shares and its parent firm, 21.co.\n\n“We’re using Coinbase as a custodian for a U.S. product. Me putting money on Coinbase as Ophelia Snyder and me putting money on Coinbase as 21Shares, the products are structurally different,” the executive said in an interview with Cointelegraph in early January.\n\n21Shares is one of the firms involved in the issuance of now-running spot Bitcoin ETFs in the United States, cooperating with ARK Invest on the ARK Invest and 21Shares spot Bitcoin ETF (ARKB). Based in Europe, 21.co and 21Shares also operate a wide number of crypto exchange-traded products (ETPs) in the region and are one of the largest crypto ETP providers globally.\n\nWhen someone puts assets on an exchange as a retail user, trading platforms like Coinbase often put client assets on omnibus accounts, where user assets like Bitcoin are pooled together without strict segregation. “It’s there with everybody else’s money,” Snyder noted, referring to such exchange accounts, adding that the spot Bitcoin ETFs by ARK and 21Shares uses strictly segregated accounts. She stated:\n\n“Our money goes into a specific wallet that belongs to us. In our case, actually multiple wallets, because we don’t want to have a single attack surface. That way, we actually split across multiple wallets.”\n\nSnyder mentioned that for its European products, 21Shares also diversified across custodians in order to provide better security.\n\nA spot Bitcoin ETF is also “a lot safer from a bankruptcy perspective,” according to Snyder. “If everybody at 21Shares disappears tomorrow, there’s a mechanism using a trustee to allow for the recovery of those assets directly from Coinbase,” the executive said. And even if Coinbase goes bankrupt, there’s still a way not to have those assets commingled, Snyder added.\n\nTo add another layer of security for its Bitcoin ETF, 21Shares also uses multiple authorization steps. “There’s no single individual that can actually move these assets within the organization,” Snyder stated. She said that such a level of security is reached by splitting the private key into multiple pieces and holding those parts in geographically distributed vaults.\n\n21Shares has been battle testing its implementation with custodians for five years, Snyder said in a session of X Spaces (formerly Twitter Spaces) on Jan. 10. “You can’t treat this like any other asset in the world,” the executive stressed, adding that Bitcoin ETF providers have to hold their Bitcoin offline in wallets that have never been brought into the internet.\n\nRelated: Spot Bitcoin ETF could result in ‘millions of unbacked BTC,’ analyst says\n\nThe long-awaited approval of the first spot Bitcoin ETF in the U.S. took place on Jan. 10, 2024, with the first BTC ETFs starting trading the next day. At launch, eight out of 10 spot Bitcoin ETF providers relied on Coinbase custody as institutions, with some issuers like Fidelity Investments opted for their proprietary custody solution, Fidelity Digital Asset Services.\n\nAnother Bitcoin ETF issuer, VanEck preferred to custody the underlying BTC with Gemini, a crypto trading platform Cameron and Tyler Winklevoss co-founded. As previously reported, the Winklevoss twins were the first-ever applicants for a spot Bitcoin ETF with the U.S. Securities and Exchange Commission back in July 2013.\n\nMagazine: 10 best long reads about crypto in 2023"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXJlbnQtYWdyZWVtZW50LWFyZ2VudGluYS1sYW5kbG9yZC10ZW5hbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin rent agreement: Landlord and tenant sign BTC contract - Cointelegraph",
        "content": "In Rosario, the third most populated city in Argentina, a local landlord and a tenant have sealed a rental agreement where the latter will pay monthly rent in Bitcoin (BTC). According to a report in the local newspaper Paginal 12 from Jan. 11, the contract is the first of its kind in Argentina, made possible by recent law amendments by the new presidential administration.\n\nThe monthly payment under the sealed contract will equal $100 in Bitcoin. The tenant will transfer the funds monthly through Fiwind, a local crypto platform. The report highlights that both counterparties to the contract are experienced crypto users.\n\nRelated: Who is Javier Milei, Argentina’s market-friendly president?\n\nArgentine rental law, along with other parts of the national legal system were amended by the newly-elected President Javier Milei, who won the general election in November 2023 amid rampant inflation across the country.\n\nIn December 2023, Diana Mondino, the minister of foreign affairs, international trade and worship, claimed that a decree aimed at economic reform and deregulation would allow the use of Bitcoin and other cryptocurrencies in the country under certain conditions.\n\nThe government has also eased the path to legalizing crypto holdings even if they’re overdue on tax declarations. Under the framework of a regularization scheme, taxpayers would pay a flat tax on assets of 5% if they declare holdings by the end of March 2024, 10% from April and 15% from July until the end of September.\n\nMagazine: MakerDAO’s plan to bring back ‘DeFi summer’ — Rune Christensen"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTUvYml0Y29pbnMtc2FmZS1oYXZlbi1hcHBlYWwtY291bGQtYmUtdGVzdGVkLXNvb24tdXMtYm9uZC1tYXJrZXQtc3VnZ2VzdHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's Safe Haven Appeal Could Be Tested Soon, U.S. Bond Market Suggests - CoinDesk",
        "content": "The normalization has gathered pace this month, with the spread rising from -38 basis points to -0.20, primarily due to bull steepening or the two-year yield falling more than the ten-year yield. The two-year yield has declined by 10 basis points to 4.14% this month, thanks to expectations for the Fed rate cuts, while the 10-year yield has risen by eight basis points to 3.94%."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyNC0wMS0xNi9iaXRjb2luLWV0ZnMtYS1uZXQtcG9zaXRpdmUtZm9yLWtyYWtlbi1zYXlzLWNlby12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs a 'Net Positive' For Kraken, Says CEO - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LnNvdXRoY2Fyb2xpbmFwdWJsaWNyYWRpby5vcmcvc2hvdy9zb3V0aC1jYXJvbGluYS1idXNpbmVzcy1yZXZpZXcvMjAyNC0wMS0xNi9iaXRjb2luLWFuZC10aGUtYmxvY2tjaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and the blockchain - South Carolina Public Radio",
        "content": "With Bitcoin all over the news lately, we thought it might be worthwhile to dig a little deeper into blockchain technology, how it works exactly, and what is the role of Bitcoin in a blockchain anyway? Mike Switzer interviews Ashton Lawrence, a certified financial planner with Mariner Wealth Advisors in Greenville, SC."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXJpcHBsZS1lZmZlY3QtMy1jcnlwdG8tMTk1NzE0NDA5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's Ripple Effect: 3 Crypto Stocks Eyeing 200% Gains in 2024 - Yahoo Finance",
        "content": "It’s likely that Bitcoin (BTC-USD) will come back stronger than ever in 2024. There are multiple reasons to be bullish on the cryptocurrency that has already surged in the last few quarters. A good alternative to Bitcoin investing is exposure to spot ETFs. Further, investors can benefit by considering exposure to some of the best crypto stocks to buy.\n\nSpecifically, the introduction of the Bitcoin spot ETF is a major catalyst that will translate into higher investor participation and wider crypto adoption. And, with Bitcoin halving this year, it’s likely that the cryptocurrency will rally after the halving event.\n\nAlso, the Federal Reserve’s potential rate cuts in 2024 will consequently support Bitcoin. Expansionary monetary policies would imply higher liquidity in the financial system and would support a rally in risky asset classes. Given the bullish outlook, let’s talk about three crypto stocks to buy for multibagger returns this year.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nRiot Platforms (RIOT)\n\nIn this photo illustration, the Riot Platforms (RIOT) logo is displayed on a smartphone screen.\n\nSource: rafapress / Shutterstock.com\n\nWith the recent retreat in Bitcoin, there has been a correction in Bitcoin miners. This seems like a good opportunity to accumulate, and Riot Platforms (NASDAQ:RIOT) certainly looks attractive. Once the cryptocurrency trends higher again, RIOT stock could skyrocket, considering the expansion plans.\n\nNotably, Riot has a strong balance sheet. With zero debt and $599 million in cash buffer (including digital assets), Riot is positioned to make large investments for accelerating growth. With swelling hash rate capacity and upside in Bitcoin, I expect strong upside in free cash flows in the next 12 to 24 months.\n\nSpecifically, Riot reported hash rate capacity of 12.4EH/s as of December 2023. By the end of this year, capacity is expected to increase to 28.8EH/s and further to 38.1EH/s by the end of 2025. Therefore, RIOT stock is poised to surge once Bitcoin trends higher after a breather.\n\nStory continues\n\nCoinbase (COIN)\n\nCoinbase (COIN), is an American company that operates a cryptocurrency exchange platform. Ethereum (ETH-USD) coin on the background of the Coinbase inscription.\n\nSource: Sergei Elagin / Shutterstock.com\n\nIn terms of closing highs, Coinbase (NASDAQ:COIN) stock traded above $350 in November 2021. Once the crypto winter ensued, COIN stock plunged.\n\nHowever, in the last 12 months, COIN has surged by 175% from oversold levels. The rally will probably sustain in 2024 and COIN stock can surge by 200% if Bitcoin trades above previous all-time highs.\n\nThe Coinbase bullish thesis is straightforward. As Bitcoin surges, the altcoin rally will follow. Further, there will be increased trading and speculation activity. This will translate into strong growth in brokerage income. Further, subscription revenue is likely to swell. Overall, the impact on revenue and EBITDA margin expansion is likely to be significant.\n\nInterestingly, Coinbase accelerated global expansion in 2023. This included an eight-week expansion drive in six continents. Also, the company is targeting the launch of crypto derivatives in the European Union. Therefore, as compared to the last bull market, Coinbase will have a bigger addressable market. This will translate into stellar growth and cash flow upside.\n\nBitfarms (BITF)\n\nBitcoin mining operation. Bitcoin mining farm. GREE stock.\n\nSource: Michal Bednarek / Shutterstock\n\nAmong penny crypto stocks to buy, Bitfarms (NASDAQ:BITF) looks attractive even after a rally of 141% in the last 12 months. Bitfarms is yet another Bitcoin miner with aggressive growth plans and a strong balance sheet. Further, the company has an attractive cost of Bitcoin mining, which would imply healthy EBITDA margin.\n\nIn terms of expansion, Bitfarms reported hash rate of 6.3EH/s as of November 2023. The company is targeting expansion to 17EH/s by the second half of 2024. With nearly tripling of mining capacity, Bitfarms is positioned for stellar revenue and EBITDA expansion.\n\nAnother important point is that Bitfarms ended 2023 with $84 million in cash and $34 million in Bitcoin. This implies a total liquidity buffer of $118 million. This provides ample flexibility for aggressive expansion plans. Additionally, BITF aims to be debt-free by February. Therefore, the penny stock represents a company with strong fundamentals.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe post Bitcoin’s Ripple Effect: 3 Crypto Stocks Eyeing 200% Gains in 2024 appeared first on InvestorPlace."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LnJvdGhzY2hpbGRhbmRjby5jb20vZW4vbmV3c3Jvb20vaW5zaWdodHMvMjAyNC8wMS93bS1zdHJhdGVneS1ibG9nLWJpdGNvaW4uZXRmcy1hLXRva2VuLWdlc3R1cmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs: a token gesture - Rothschild & Co",
        "content": "Something ‘big’ has just happened in cryptoland: the SEC, the US regulator, has approved the first US ‘spot’ Bitcoin ETF (in fact, nearly a dozen applications from various institutions). Bitcoin, volatile at the best of times, has responded in typically unpredictable fashion, down nearly a tenth since the announcement last week. Admittedly some of the ‘good news’ was likely in the price - the token surged 150% in 2023, in no small part due to a favourable US court ruling in October. But all of this follows a fall of nearly two-thirds in 2022 - at ~$43,000 today, Bitcoin is still well below its all-time 2021 high of $68,617. The ‘boom-and-bust’ cycle continues, it seems…\n\nIt’s important to note that exchange traded funds are not new to this space – the SEC approved applications for futures ETFs in 2021, to much fanfare. But these latest approvals pave the way for the first US product based on the underlying coin rather than a derivative (futures) contract linked to it.\n\nTo Bitcoin boosters this is an important milestone – and one that has been fiercely contested. The SEC’s approval is seen as legitimising and further propelling cryptocurrencies into the mainstream – particularly in the all-important US market. Indeed, many retail investors have been supposedly dissuaded by the clunky and lengthy transactional process – including registering a digital wallet, safely storing the irretrievable private keys, and finally converting fiat currency at cost. ETFs, which provide intraday liquidity, remove some of the major frictional challenges.\n\nOf course, whether this has any real significance and can continue to revive Bitcoin is a moot point. The wider crypto space has faced something of an existential crisis. From question marks about its aggressive energy consumption to the practical challenges of a sluggish decentralised ledger – as well as the threat posed by the arrival of the official CDBCs (Central Bank Digital Currencies), which would run in parallel with legal tender. Not to mention the sector’s damaged credibility in the wake of FTX’s collapse.\n\nTo those who have proclaimed this approval as a “proof of concept”, the SEC’s ‘capitulation’ is not an endorsement of Bitcoin. Ironically, the recent hacking of the SEC’s X account and the premature announcement of these latest approvals only serve to reiterate the SEC’s decade long resistance to such products – market manipulation remains a key risk.\n\nFor us on the strategy team, this does blur the lines between Bitcoin’s role as a currency and that of an investment. Bitcoin was conceived as a democratised and independent alternative to fiat currencies – the antidote to monetary debasement and (‘spying’) central authorities. Yet, the arrival of these ETFs further undermines its egalitarian and decentralised credentials, inasmuch as they strengthen its links to the established financial and fiat system.\n\nAnd while it may be more accessible as an investment, Bitcoin is a highly speculative one, and looks steadily less like a questionable medium of exchange. As Buffett once quipped about it: “You're just hoping the next guy pays more”. As a result, our crypto scepticism is unaltered: we still don’t believe that today’s digital currencies (including Bitcoin) are a credible asset class. They lack intrinsic value, and so are not a credible alternative to (for example) gold, and practical uses are in short supply.\n\nCryptocurrencies – and Bitcoin – remain an answer in search of a question."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lmpkc3VwcmEuY29tL2xlZ2FsbmV3cy9zZWMtYXBwcm92ZXMtZXhjaGFuZ2UtcHJvcG9zYWxzLXRvLWxpc3QtMzkzMDA4Ni_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "SEC Approves Exchange Proposals to List and Trade Spot Bitcoin Products. Are Ether Products Next? - JD Supra",
        "content": "The U.S. Securities and Exchange Commission (SEC) has approved proposals from three stock exchanges to list and trade shares of 11 spot bitcoin-based products (the “Spot BTC Approval”). Following the Spot BTC Approval, the SEC’s Division of Corporation Finance declared the registration statements for a number of these products to be effective, allowing the products to begin trading. Wilson Sonsini was part of the legal team for one of the spot bitcoin products approved.\n\nThe Spot BTC Approval marks the end of a long list of rejections of proposals to trade spot bitcoin products on national securities exchanges. Beginning in early 2017, the SEC had ruled that Section 6(b)(5) of Securities Exchange Act of 1934 (which requires, among other things, that a listing exchange’s rules be designed to “prevent fraudulent and manipulative acts and practices”) required the listing exchange to have a comprehensive surveillance sharing agreement with a regulated market of significant size for bitcoin. In its rejection orders, the SEC consistently concluded that bitcoin trading platforms were unregulated platforms and that surveillance agreements with such trading platforms therefore did not meet the requirements of Section 6(b)(5).\n\nDespite its repeated rejections of exchange proposals to trade spot bitcoin products, the SEC did approve two proposals to list and trade bitcoin futures products. Following these approval orders, the sponsor of a spot bitcoin product, Grayscale, approached the D.C. Circuit alleging that the SEC failed to treat like cases alike by denying the listing of Grayscale’s proposed spot bitcoin product while approving the two bitcoin futures products. The D.C. Circuit agreed with Grayscale, noting the close price correlation between the spot and the futures markets, and ruled that the SEC had failed to show why bitcoin futures products should be treated more favorably than spot bitcoin products.\n\nThe Spot BTC Approval refers to the D.C. Circuit’s ruling and notes that each exchange has a surveillance sharing agreement with a futures exchange that trades bitcoin (i.e., the Chicago Mercantile Exchange). The Spot BTC Approval reviews a study put forward in one of the proposals to conclude that bitcoin spot and futures markets are sufficiently correlated so that surveilling the bitcoin futures market would allow exchanges to identify fraud or manipulation on the bitcoin spot markets.\n\nSEC Commissioners Caroline Crenshaw and Jaime Lizárraga dissented from the Spot BTC Approval. Chair Gary Gensler, who voted to approve, issued a statement noting that while the bitcoin ETPs would include important protection for investors, the approval order “should in no way signal the Commission’s willingness to approve listing standards for crypto asset securities.” Chair Gensler closed by noting that the Spot BTC Approval was not an endorsement or approval of crypto and that “investors should remain cautious about the myriad risks associated with bitcoin and products whose value is tied to crypto.”\n\nAn open question in light of the Spot BTC Approval and the Chair’s statements is how the SEC may deal with the many pending proposals to list and trade spot Ethereum products. Several Ethereum futures ETFs began trading in October 2023, which may cause market participants to ask whether the SEC will be able to reject exchange proposals to trade spot Ethereum products, especially if a strong correlation between Ethereum futures and Ethereum spot markets can be established. Chair Gensler, however, has notably declined to express a view on whether Ethereum is a security, which may raise questions regarding the regulatory treatment of these products. Also notably, trading volumes for Ethereum futures are significantly smaller than volumes for bitcoin futures. Whether the SEC will consider these distinctions to be material remains to be seen—we are likely still months away from a decision on spot Ethereum products."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vbW9kZWwtcG9ydGZvbGlvLWNoYW5uZWwvYnRjdy1icmluZ3MtYml0Y29pbi13aWRlci1hdWRpZW5jZS_SAVlodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL21vZGVsLXBvcnRmb2xpby1jaGFubmVsL2J0Y3ctYnJpbmdzLWJpdGNvaW4td2lkZXItYXVkaWVuY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "BTCW Brings Bitcoin to Wider Audience - ETF Trends",
        "content": "Since its birth in 2009, bitcoin was intended to democratize and “futurize” finance. A case can be made that those objectives have been partially accomplished. But until recently, the audience of this digital currency’s investors has been somewhat small.\n\nThat’s expected to change with last week’s launch of 11 spot bitcoin ETFs in the U.S., a group including the WisdomTree Bitcoin Fund (BTCW). Perhaps surprisingly to some advisors and investors, New York-based WisdomTree is a seasoned veteran in the arena of cryptocurrency exchange traded products (ETPs). The firm launched its first such product more than four years ago.\n\nBack then, bitcoin hovered around $7,700. Its all-time high is around $69,000. It was trading around $42,830 as of late January 12. That speaks to the digital currency’s well-known volatility. But price movements along those lines highlight opportunity. And that could be accretive for BTCW over time.\n\nBTCW Credible Bitcoin Bet\n\nAs noted above, BTCW is far from alone in the new spot bitcoin field in the U.S. But it has avenues for setting itself apart from rivals. For example, the ETF’s annual fee is 0.30%, or $30 on a $10,000 investment. That’s toward the lower end of what’s found in this newly minted ETF segment. Plus, WisdomTree is waiving that fee for up to six months.\n\nAnd like its peers, BTCW offers advantages relative to futures-based bitcoin ETFs. Futures-based bitcoin ETFs are still relevant for short-term traders. But spot funds such as BTCW have the potential to catch on with a broader audience of fee- and return-minded advisors and investors.\n\nFinancial Services Ripe for Disruption\n\n“In the past, investors desiring bitcoin exposure tradeable on a platform either had to subject themselves to the possibility of widely moving discounts and premiums to net asset value OR to the changing shape—usually contango—of the bitcoin futures curve. Finally, a bitcoin ETF can provide exposure to the price of actual bitcoin,” noted WisdomTree Global Head of Research Christopher Gannatti.\n\nAdditionally, BTCW and its brethren could prove to be well-timed additions to the financial landscape. That’s because that realm is rapidly evolving. Increasingly sophisticated market participants view financial services as ripe for disruption at the hands of technology and transparency. Those are factors embraced by ETFs such as BTCW.\n\n“We recognize that much of banking was done with paper in the past. But if you were building a system today, there might be no reason to even consider including paper,” added Gannatti. “If you are seeking to send money, there is no reason why it cannot occur nearly instantaneously, except for the fact that banks have been slow to speed up their legacy systems. Bitcoin transactions occur on a public blockchain for all to see. And the speed with which a new block can be mined is the speed with which a transaction can be finalized.”\n\nFor more news, information, and analysis, visit the Modern Alpha Channel."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lmpkc3VwcmEuY29tL2xlZ2FsbmV3cy9iaXRjb2luLWZvci1pbnZlc3RtZW50LWFkdmlzZXJzLTY0NzEwMzMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin for Investment Advisers - Integrating Bitcoin into Client Portfolios - JD Supra",
        "content": "The SEC approved eleven spot Bitcoin ETFs on January 10, 2024. As a result, investment advisers may be curious about whether or how to integrate Bitcoin ETFs into client portfolios. This blog is intended to provide an update on the regulatory landscape and inform advisers how to fulfill their compliance obligations if they determine these assets should be integrated into client portfolios.\n\nPlease Note: This blog is not, and does not serve as, an endorsement of Bitcoin, or any other cryptocurrency. Advisers must separately educate their investment professionals and clients about cryptocurrencies prior to integrating crypto into client portfolios or assisting with a client directed purchase.\n\nSummary\n\nBitcoin is considered to be speculative. The SEC has been aggressively reviewing cryptocurrency investments during examinations. Depending upon the scope of an adviser’s assistance with/use of Bitcoin or cryptocurrencies (employing same as a courtesy/client directed accommodation vs. utilizing same as an asset class in client portfolios) both applicable clear and conspicuous ADV disclosure, and a separate Acknowledgment executed by the client, are strongly encouraged. We continue to assist our clients with such disclosures/acknowledgements.\n\nSpot Bitcoin ETF Approval\n\nOn January 10, 2024, the SEC approved eleven spot Bitcoin ETFs. The ETFs, from financial behemoths like BlackRock, Fidelity, WisdomTree, and Invesco, began trading on January 11, 2024. With approval of a spot Bitcoin ETF, investment advisers should be prepared to consider a spot Bitcoin ETF to client portfolios. However, doing so comes with compliance implications, and it is critical for advisers to conduct robust due diligence to ensure such integration is reasonable and suitable for clients.\n\nCompliance Program\n\nInvestment advisers registered at the federal and state level are required to maintain a robust compliance program. Advisers who want to integrate a spot Bitcoin ETF should update their policies and procedures manual to address the unique risks and challenges that these assets present, including:\n\nSuitability – prior to purchasing a spot Bitcoin ETF for clients, advisers should ensure that these assets are suitable for the client. Bitcoin is historically (and notoriously) volatile, and advisers should assess whether an investment in Bitcoin aligns with a client’s suitability, long-term objectives, and risk tolerance.\n\nDisclosures and Acknowledgements – advisers should provide clients with an acknowledgement form wherein the client acknowledges the risks associated with purchasing a spot Bitcoin ETF and that the asset class is currently considered speculative. Additionally, advisers may update Form ADV Part 2A to include language which similarly describes the risks associated with Bitcoin and how the adviser integrates it into a client’s portfolio (i.e., on a discretionary basis or at specific client direction). Stark & Stark remains available to assist with preparing the acknowledgement and, when necessary, appropriate ADV disclosure language.\n\nFiduciary Duty\n\nRegistered investment advisers are fiduciaries and are required to act in the best interests of their clients. With this power comes the responsibility to:\n\nConduct thorough due diligence, including understanding Bitcoin’s market dynamics, its correlation with other assets, and the technology behind it, and appropriately educate firm employees on these market dynamics; and\n\nEducate clients and ensure clients understand the risks and potential rewards of investing in Bitcoin.\n\nTransparency About Fees\n\nPurchasing a Bitcoin ETF may come with fees. For example, as of writing, spot Bitcoin ETFs have fees ranging from 0% to 1.50% based on various factors. If an adviser charges fees associated with the acquisition, management, or disposition of a Bitcoin ETF, it is crucial to be transparent. Advisers should clearly disclose any associated fees in their investment advisory agreement and ensure such fees are reasonable in light of the services provided.\n\nConclusion\n\nThe SEC’s approval of a spot Bitcoin ETF is a testament to Bitcoin’s growing legitimacy as an asset (however, as indicated above, this blog is not, and should not be construed in any manner whatsoever as, an endorsement of Bitcoin or any other cryptocurrency investment). As Bitcoin’s institutional legitimacy grows, integrating Bitcoin exchange traded products into client portfolios can put advisers at the forefront of the new financial revolution. However, integrating Bitcoin into client portfolios comes with compliance obligations. By adhering to a robust compliance framework, keeping abreast of regulatory changes, and educating themselves and clients on the benefits of Bitcoin, advisers can harness the potential of Bitcoin while fulfilling their fiduciary and compliance obligations."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8xNi92aXZlay1yYW1hc3dhbXktY3J5cHRvLWZyaWVuZGx5LXVzLXByZXNpZGVudGlhbC1jYW5kaWRhdGUtc3VzcGVuZHMtY2FtcGFpZ24v0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDI0LzAxLzE2L3ZpdmVrLXJhbWFzd2FteS1jcnlwdG8tZnJpZW5kbHktdXMtcHJlc2lkZW50aWFsLWNhbmRpZGF0ZS1zdXNwZW5kcy1jYW1wYWlnbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 Jan 2024 08:00:00 GMT",
        "title": "Vivek Ramaswamy, Crypto-Friendly U.S. Presidential Candidate, Suspends Campaign - CoinDesk",
        "content": "\"It’s nothing short of embarrassing that Gary Gensler, the SEC chair, couldn’t even confirm in front of Congress whether Ethereum is a regulated security,” he said during the December debate, referring to the debate inside the SEC on whether ether (ETH) is a security."
    }
]