[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMTMvdGhlLTMwLXRyaWxsaW9uLXdlYWx0aC1tYW5hZ2VtZW50LWluZHVzdHJ5LWNhbi1pbnZlc3QtaW4tYml0Y29pbi1ldGZzLmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyNC8wMS8xMy90aGUtMzAtdHJpbGxpb24td2VhbHRoLW1hbmFnZW1lbnQtaW5kdXN0cnktY2FuLWludmVzdC1pbi1iaXRjb2luLWV0ZnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs could open floodgates to $30 trillion wealth management market - CNBC",
        "content": "That changed on Wednesday after the Securities and Exchange Commission cleared the sales of spot bitcoin ETFs, allowing investors to access bitcoin the same way they purchase stock and bond index funds. SEC Chair Gary Gensler continues to issue stern warnings when it comes to crypto investments, but that's not holding back activity.\n\nWide swaths of the investment world missed out on the 2023 rally. According to VanEck CEO Jan van Eck , many fiduciaries, financial advisors and banks had been explicitly told in the past \"not to touch crypto,\" due largely to its unregulated nature.\n\nBitcoin rose as high as $49,000 on Thursday, reaching levels not seen since December 2021, before dropping Friday to around $43,000. It soared 150% last year following a brutal selloff in 2022.\n\n\"Bitcoin is beginning to become a benchmark asset for the younger generation,\" said Anthony Pompliano, founder of Pomp Investments. \"We know most investors can't beat benchmarks, so adding the new benchmark to your asset allocation is the only way to try to keep up.\"\n\nFor the $30 trillion advised wealth management industry, the floodgates could be about to open. Analysts at Standard Chartered anticipate fund inflows in the range of $50 billion to $100 billion in 2024.\n\nNow that bitcoin ETFs are trading across U.S. public markets, many large money managers that have been effectively locked out of crypto finally have a way to access the primary digital currency.\n\nFor its Hundredfold Select Alternatives Fund, mutual fund manager Advisors Preferred Trust is investing up to 15% of total assets for indirect bitcoin exposure through funds and futures contracts, according to a recent prospectus.\n\nPompliano says \"most passive funds are looking for ways to increase performance.\"\n\nBitwise Asset Management is one of the 11 issuers that were granted initial approval for a bitcoin product. Chief Investment Officer Matt Hougan said the Bitwise Bitcoin ETF, which is offering the lowest fee at 0.2% of holdings, is primarily targeting financial advisors and family offices.\n\n\"That includes RIAs [registered investment advisors] and includes, eventually, wirehouses — that is a many trillion dollar market,\" said Hougan, adding that advisors are \"increasingly carving out\" an allocation of 1% to 5%. \"We know that they're interested in crypto, and we know that they've been waiting for an ETF.\"\n\nIn a survey of financial advisors recently conducted in conjunction with VettaFi, a data-driven ETF platform, Bitwise found that 88% of advisors interested in purchasing bitcoin were waiting until after a spot bitcoin ETF was approved. Among advisors who already invest in crypto, large allocations (more than 3% of a portfolio) more than doubled to 47% in 2023 from the prior year.\n\n\"For the vast majority of people, a low-cost bitcoin ETF is going to be the easiest way to do that,\" Hougan said.\n\nAccording to data from Robinhood , 81% of bitcoin ETF trading volume in the first week was in individual accounts, with the rest in retirement accounts.\n\nEven before the SEC's announcement Wednesday, the 2022 CFA Institute Investor Trust Study found that 94% of state and local pension plans had some crypto exposure. The new products potentially offer more legitimacy and lower costs for retirement plans that want to increase allocation.\n\nFinancial firms are offering differing advice on how best to enter the space.\n\nIn a report on its website in October, Galaxy Digital said the \"strongest marginal improvement\" occurred when portfolios moved from a 0% to 1% bitcoin allocation. As far back as 2019, WisdomTree said that adding bitcoin to a portfolio that's traditionally 60% equities and 40% bonds \"can improve the risk-return profile\" and that from 2014 to 2019 \"even a one percent allocation led to an 8.3% outperformance versus the base portfolio.\"\n\nFidelity analyzed performance through mid-2022 and noted that \"bitcoin boosted a portfolio's returns during specific periods in the past, though it also came with substantial volatility.\" To date, the firm said, bitcoin has not held up well as a hedge against inflation, but it acknowledged that \"assessing this was challenging, given that inflation has been low throughout most of bitcoin's history.\"\n\nCastle Island Ventures founder Matt Walsh, who previously led a number of Fidelity Investments' blockchain and cryptoasset initiatives, said the types of funds quickest to jump into the market are likely to be those with a focus on high-growth tech stocks. But he also sees broader appeal.\n\n\"I think you could also see it in commodity-based portfolios, like gold-based funds that see this as a sort of digital gold,\" said Walsh.\n\nWATCH: SEC approves bitcoin ETFs"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMTUvYml0Y29pbnMtdGVjaG5pY2Fscy1zdWdnZXN0cy1kZWVwZXItcHVsbGJhY2stdG8tMzhrLWFuYWx5c3Qv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8xNS9iaXRjb2lucy10ZWNobmljYWxzLXN1Z2dlc3RzLWRlZXBlci1wdWxsYmFjay10by0zOGstYW5hbHlzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's Technicals Suggests Deeper Pullback to $38K: Analyst - CoinDesk",
        "content": "\"Grayscale is betting that investors will slowly switch out of their 1.5% annual management fee ETF offering (due to tax consideration) instead ofchoosing other reputable companies that offer 80% less in fees. There has been much negative news around the parent company DCG and Grayscale itself, notably charging a 2.0% management fee on a product that [at one point] traded at a 50% discount to its net asset value – therefore overcharging GBTC holders ($27bn market cap),\" 10x said."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzEzL3doeS1iaXRjb2lucy1idGMtcHJpY2UtcGx1bmdlZC10aGlzLXdlZWsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin's (BTC) Price Plunged This Week - The Motley Fool",
        "content": "On Jan. 10, the U.S. Securities and Exchange Commission (SEC) approved the market's first 11 Bitcoin (BTC -6.91%) exchange-traded funds (ETFs). Unlike previous \"Bitcoin ETFs,\" which were pinned only to future contracts or held shares of Bitcoin-related companies, these new funds directly hold Bitcoins. Over the long term, these ETFs should closely track the spot price of Bitcoin and represent a much easier way to invest in the cryptocurrency than stand-alone crypto wallets.\n\nThe SEC's approvals also represent a big vote of confidence in Bitcoin's future as a mainstream asset. But Bitcoin's price tumbled after the first batch of ETFs started trading on Jan. 11. As of Jan. 13, it trades at about $42,500 -- representing a near-10% decline in just five days. Let's see why its price dropped and where it might be headed over the next 12 months.\n\nWhy did Bitcoin's price decline?\n\nBitcoin's price is volatile and difficult to predict. It hit its all-time high of about $69,000 during the peak of the crypto rally in Nov. 2021 but dropped to just $16,000 by the end of 2022. That decline was caused largely by rising interest rates, which drove investors away from speculative investments, the failures of several high-profile tokens and exchanges, and concerns regarding tighter regulations for the crypto industry.\n\nBut in 2023, Bitcoin's price soared 154% to over $42,000. That rally was driven by slower rate hikes and the market's renewed interest in the crypto market. Many investors also expected the SEC to finally approve Bitcoin's first spot price ETFs.\n\nTherefore, Bitcoin's recent decline only erased its gains since the beginning of 2024. It seems like some short-term traders bid up the digital currency's price in anticipation of the recent ETF approvals and then quickly took profits as the euphoria faded.\n\nDon't ignore the long-term catalysts\n\nBitcoin's price could remain under pressure as it moves past the ETF approvals. However, three catalysts that could drive its price higher remain on the horizon.\n\nFirst, the ETF approvals will make it easier for large institutional investors to accumulate Bitcoin on the open market. Ark Invest's Cathie Wood, who oversees the recently approved Ark 21Shares Bitcoin ETF (ARKB -5.69%), believes the price of Bitcoin will hit $1.5 million as institutional investors buy more. Fidelity, the investment giant that just launched the Fidelity Wise Origin Bitcoin Fund (FBTC), claims Bitcoin's price will hit $100 million by 2035 and $1 billion by 2038.\n\nThose long-term estimates might be too bullish, but I think it's reasonable to assume the Bitcoin ETF approvals will set a floor under its volatile price. That stabilization could bring back big investors and drive Bitcoin's price back toward its all-time highs. According to Coin Price Forecast's more moderate estimates, its price might reach $240,000 by the end of 2035.\n\nSecond, Bitcoin experiences a \"halving\" every four years, which cuts the rewards for Bitcoin mining in half. That isn't great news for miners like Marathon (MARA -7.46%) and Riot (RIOT -6.82%) because it increases their mining costs, but it will likely drive Bitcoin's market price higher by reducing the available supply. The next halving will occur in the first half of 2024.\n\nLast but not least, persistent inflation could drive more investors to accumulate Bitcoin and gold as hedges against the devaluation of fiat currencies. More countries struggling with hyperinflation might even follow El Salvador's lead and adopt Bitcoin as a national currency -- which would further solidify its reputation as a safe haven asset.\n\nDon't let double-digit drops overshadow the triple-digit gains\n\nBitcoin will likely go through more wild swings and double-digit drops over the next 12 months. But over the next decade, it could generate triple-digit gains for investors who tune out all the near-term noise and focus on the long-term catalysts. Simply put, investors should consider its recent post-ETF approval pullback a good buying opportunity."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy50aGVibG9jay5jby9wb3N0LzI3MjUyMy9tb3JnYW4tc3RhbmxleS1zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFscy1hcmUtYS1wb3RlbnRpYWwtcGFyYWRpZ20tc2hpZnQtaW4tZ2xvYmFsLXZpZXctb2YtY3J5cHRv0gGJAWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3MjUyMy9tb3JnYW4tc3RhbmxleS1zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFscy1hcmUtYS1wb3RlbnRpYWwtcGFyYWRpZ20tc2hpZnQtaW4tZ2xvYmFsLXZpZXctb2YtY3J5cHRv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Morgan Stanley: Spot bitcoin ETF approvals are a 'potential paradigm shift' in global view of crypto - The Block",
        "content": "Fifteen years ago, Bitcoin was an idea on an internet forum. Now, as stablecoin volumes rival payment networks like PayPal and Visa, bitcoin's adoption by Wall Street in the form of spot Bitcoin ETFs may mark a \"potential paradigm shift in the global perception and use of digital assets,\" said Andrew Peel, head of digital asset markets for investment bank Morgan Stanley.\n\nIn a note to investors, Peel gave an overview of the current threats against the U.S. dollar's current reign as the world's reserve currency, as 60% of global foreign exchange reserve balances are held in dollars. In comparison, China's yuan, despite the country's recent efforts to boost its foreign trade, makes up only 2.5% of those balances.\n\nHowever, several \"de-dollarization\" threats may erode the greenback's place on top, Peel wrote, including Bitcoin's \"remarkable\" adoption worldwide, noting that 100 million people worldwide hold the cryptocurrency (there are Bitcoin ATMs in 82 countries, Peel claims) along with major companies like Tesla and a sovereign nation, El Salvador.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nStablecoins, however, may prove to be crypto's \"killer app,\" according to Peel, who notes that stablecoin trading volume has rivaled traditional digital clearinghouses like Visa and PayPal in recent years. Both Visa and PayPal have made steps towards adopting stablecoins themselves, with Visa's integration of USDC on Solana and PayPal's PYUSD stablecoin."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8xLTRiLWluZmxvd3Mtc3BvdC1iaXRjb2luLTA0MjAxMjEwMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "$1.4B Inflows Into Spot Bitcoin ETF After First Two Trading Sessions - Yahoo Finance",
        "content": "$1.4B Inflows Into Spot Bitcoin ETF After First Two Trading Sessions\n\nSpot Bitcoin exchange-traded funds (ETFs), which launched last Thursday, have already attracted a significant amount of investor interest in their first two days, with total inflows reaching $1.4 billion, according to Bloomberg ETF analyst Eric Balchunas.\n\nThe funds experienced a total of 500,000 trades, racking up trading volumes of around $3.6 billion. However, Balchunas noted that these numbers may be adjusted due to transactions awaiting accounting settlement. Grayscale's ETF, the Grayscale Bitcoin Trust (GBTC), experienced an outflow of $579 million during the period. After deducting the GBTC outflows, the net total inflows across all spot Bitcoin ETFs stood at $819 million.\n\nThe outflows from GBTC could be attributed to holders converting their shares following the U.S. Securities and Exchange Commission's (SEC) approval of the ETF through a ruling change. Some GBTC holders are reportedly switching to lower-fee options from other fund managers. Grayscale is charging 1.50% while other asset managers like BlackRock are charging 0.25%. GBTC is one of the largest holders of Bitcoin, managing over $27 billion worth of the cryptocurrency. Shares of GBTC have been traded since 2013 but were not redeemable for Bitcoin until January 11.\n\nAmong the spot Bitcoin ETFs, BlackRock's iShares Bitcoin Trust topped the performance with $497.7 million total flows, followed by Fidelity Advantage Bitcoin ETF with $422.3 million and Bitwise with $237.9 million.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbGVhcm4vaW52ZXN0aW5nLWluLWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:56:03 GMT",
        "title": "Pros and cons of investing in Bitcoin ETFs - Cointelegraph",
        "content": "The growing interest in cryptocurrency investments\n\nThe increased interest in cryptocurrency investments reflects a significant shift in the global financial scene. Cryptocurrencies like Bitcoin (BTC), Ether (ETH) and others have attracted tremendous appeal due to their potential for high returns and their position as a hedge against traditional financial market instability.\n\nThere are multiple reasons behind this growing interest. For instance, the decentralized nature of cryptocurrencies provides security and independence from conventional banking structures. Additionally, the growing acceptance of blockchain technology across industries emphasizes the potential of cryptocurrencies to revolutionize financial transactions and payment systems.\n\nFurthermore, the crypto market has attracted both experienced investors and beginners due to the prospect of rapid profits. But there’s a lot of risk and volatility, so cautious investing methods and in-depth market knowledge are required.\n\nEvolution of Bitcoin ETFs\n\nThe increasing popularity of cryptocurrency investment products such as cryptocurrency mutual funds and cryptocurrency exchange-traded funds (ETFs), including Bitcoin ETFs, indicates a dynamic shift in how people invest in digital assets.\n\nBecause of the volatility and regulatory uncertainty surrounding cryptocurrencies, traditional investment frameworks initially hesitated to include them. However, the creation and acceptance of these novel financial products is a direct result of the growing acceptability of cryptocurrencies by the general public.\n\nFor example, crypto ETFs have given investors a more regulated and familiar option to invest in cryptocurrencies without dealing with the hassles of managing real digital assets. The development of Bitcoin ETFs is noteworthy. Regulators have rejected spot Bitcoin ETFs several times, citing worries about volatility and market manipulation. These denials demonstrated how wary regulatory agencies are about exposing people directly to cryptocurrencies.\n\nNonetheless, the narrative shifted as the need for cryptocurrency exposure grew. The concept gained traction over time, and spot Bitcoin ETFs were eventually approved. This is a pivotal moment in integrating cryptocurrencies into the investment mainstream.\n\nDirect Bitcoin investment vs. other cryptocurrency investment vehicles\n\nDirect Bitcoin investment involves purchasing and holding Bitcoin itself, typically through a cryptocurrency exchange. This strategy exposes investors directly to fluctuations in the price of BTC.\n\nIndirect exposure is provided via other crypto investment vehicles, such as mutual funds, exchange-traded funds or futures. These financial instruments enable the purchase of crypto derivatives or a portfolio of cryptocurrencies, offering a diversified and frequently regulated method of investing.\n\nPros of investing in Bitcoin ETFs\n\nThere are several benefits to investing in Bitcoin ETFs, particularly for individuals who want exposure to the cryptocurrency without actually buying any of it. The key benefits of purchasing Bitcoin ETFs are explained below:\n\nEase of access\n\nBitcoin ETFs streamline the investing process by enabling investors to purchase shares using conventional brokerage accounts. This is especially helpful for people unaware of the subtleties of crypto exchanges. For instance, a stock trader with experience can add a Bitcoin ETF to their portfolio using brokerage platforms without comprehending the intricacies of private keys and digital wallets.\n\nRegulatory oversight\n\nThe fact that Bitcoin ETFs function within regulated financial systems improves investor protection. Moreover, it creates a secure investment environment by ensuring openness and adherence to financial regulations.\n\nOne significant development was the SEC’s 2021 approval of the first U.S. Bitcoin futures ETF, which provided investors with a regulated opportunity to participate in Bitcoin. Also, on Jan. 10, 2024, the SEC approved spot Bitcoin ETFs, a significant milestone in integrating cryptocurrencies into mainstream financial markets.\n\nDiversification\n\nWith a new asset class, Bitcoin ETFs provide a way to diversify investment portfolios. Including a Bitcoin ETF in a portfolio can aid in risk distribution because BTC frequently has a low correlation with conventional assets like stocks and bonds. For instance, the price of Bitcoin may fluctuate on its own when traditional markets are underperforming, possibly providing a hedge against market declines.\n\nLiquidity\n\nWhen it comes to cryptocurrency investments, ETFs typically offer more liquidity than direct investments. This implies that during market hours, investors can easily purchase and sell shares of a Bitcoin ETF at market rates. This liquidity is essential because it enables a quicker reaction to market fluctuations, particularly in volatile markets.\n\nTax efficiency\n\nInvesting in Bitcoin ETFs may be more tax-efficient than direct Bitcoin investments. This is due to the special tax treatment that ETFs frequently enjoy. For example, in some jurisdictions, ETFs have favorable tax rules that prevent the realization of capital gains until the investment is sold. In contrast, taxable events related to direct Bitcoin investments may arise from transactions such as selling or exchanging Bitcoin.\n\nCons of investing in Bitcoin ETFs\n\nInvesting in Bitcoin ETFs, while offering numerous benefits, also comes with certain drawbacks that investors should consider. Below are the various cons of investing in Bitcoin ETFs:\n\nVolatility\n\nExposure to the extreme price volatility in cryptocurrency markets is one of the significant disadvantages of Bitcoin ETFs. Bitcoin and its ETFs can experience sharp price fluctuations in a short amount of time. For example, it is not uncommon for the price of Bitcoin to change by more than 10% in a single day, which might disturb investors who are not used to such volatility.\n\nMarket risk\n\nPurchasing Bitcoin ETFs exposes investors to security and regulatory issues that are common in the cryptocurrency space. The cryptocurrency market is still in its infancy and is constantly changing. It also confronts regulatory and compliance challenges from many jurisdictions.\n\nAdditionally, the market is susceptible to security risks like hacking incidents. For example, regulatory crackdowns in major markets like China have historically led to significant market downturns.\n\nFee structures\n\nCompared to conventional ETFs, the fees of Bitcoin ETFs may be higher. The expenses incurred in maintaining and safeguarding the underlying cryptocurrency holdings are the justifications for these fees.\n\nFor example, an ETF that tracks Bitcoin may have an annual expense ratio (the annual percentage of assets deducted to cover management and operational costs) higher than an ETF that tracks stocks or bonds, which could eventually reduce investment returns. However, the approval of spot Bitcoin ETFs has sparked a fee war among issuers, leading to significantly reduced fees for some ETFs, with some as low as 0.20%.\n\nIndirect ownership\n\nInvestors who purchase Bitcoin ETFs do not directly possess any Bitcoin. Instead, they are investors in a fund that holds Bitcoin. As a result, individuals miss some of the advantages of having direct ownership of Bitcoin, such as the capacity to transact with it or keep it in their possession as an asset without needing an intermediary.\n\nTracking error\n\nThe performance of a Bitcoin ETF and the actual market performance of Bitcoin may differ from one another. This tracking error occurs due to factors including fund expenditures, how Bitcoin exposure is obtained (such as through futures contracts), and the interval between market trades and fund rebalancing.\n\nFor instance, an ETF based on Bitcoin futures would not always accurately reflect changes in the price of real Bitcoin, particularly in volatile markets.\n\nEssentially, tracking error measures the divergence between the performance of an investment portfolio or fund and its benchmark index, indicating the effectiveness of the fund manager in replicating the index’s returns.\n\nThe future of Bitcoin ETFs\n\nWith the recent approval of spot ETFs, the future of Bitcoin ETFs looks promising and is expected to develop significantly. The introduction of spot Bitcoin ETFs marks a crucial development, which gives investors direct exposure to BTC prices and brings them closer to the market performance of the cryptocurrency.\n\nThis development is anticipated to attract a broader range of investors, including individuals interested in the crypto market but who prefer regulated financial instruments. Additionally, these investment vehicles are more accessible and enticing due to the growing competition among ETF providers, which results in lower fees. Overall, the landscape for Bitcoin ETFs is evolving toward greater maturity and integration into mainstream investment portfolios.\n\nWritten by Guneet Kaur\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3Qvc2NhcmFtdWNjaS1zYXlzLWJpdGNvaW4tZGVjbGluZWQtYW1pZC1ncmF5c2NhbGUtc2hhcmUtc2FsZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Scaramucci says Bitcoin declined on sales of Grayscale shares, amid FTX unwinding - DLNews",
        "content": "Scaramucci analyses reasons for recent Bitcoin decline.\n\nUS Security and Exchange Commission explains hack, fake ETF announcement.\n\nVanguard rebuffs spot Bitcoin ETFs.\n\nScaramucci says Bitcoin fell partly on sales of Grayscale shares\n\nSkyBridge Capital founder Anthony Scaramucci told Bloomberg Television that Bitcoin has declined in value since its spot ETFs began trading on Thursday in part because of sales of Grayscale Bitcoin Trust shares.\n\n“There seems to be of lot of selling of Grayscale,” he said.\n\nScaramucci added: “The second thing we are seeing is the bankruptcy estate of FTX is unloading into the ETF announcement. There is a heavy volume of selling in Bitcoin right now. I do expect the supply overhang to be done in the next six to eight trading days.”\n\nFTX, which filed for bankruptcy last year, is in the process of selling off crypto assets.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\n“One last thing, there has been a quiet period. … Wall Street has not been able to market these ETFs and that will start in about eight days as well,” Scaramucci said.\n\nBitcoin hit a two-year high on Thursday, breaking through $49,000 before falling below $43,000 on Friday. At the time of writing, it was at $42,803.40.\n\nSEC explains hack of X account, fake approval of Bitcoin ETF\n\nThe SEC issued a statement explaining the hack of its X account Tuesday that resulted in a fraudulent claim it had approved a spot Bitcoin ETF.\n\nThe SEC said an unauthorised party gained control of the phone number associated with its @SECGov X.com account and was able to access it, posting the false announcement that the SEC had approved the Bitcoin ETF.\n\nJoin the community to get our latest stories and updates\n\nAbout 15 minutes later, officials posted on the @garygensler X.com account that the other account had been hacked and that the agency had not approved trading of spot Bitcoin ETFs. The unauthorised post was subsequently deleted and a new post on @SECGov X.com informed users the account had been compromised.\n\nThe SEC noted that it doesn’t use social media platforms to announce its actions to the public, but only to amplify those it has made on its website. The agency subsequently approved the spot Bitcoin ETFs on Wednesday, DL News reported.\n\nThe agency is working with federal law enforcement in its investigation of the hack, including the FBI and the Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency.\n\nIn a bipartisan move, senators Ron Wyden (D-Ore.) and Cynthia Lummis (R-Wyo.) asked SEC Inspector General Deborah Jeffrey’s office to investigate the lapse and report back by February 12.\n\nDL News also reported earlier that a group of Republican congressional representatives led by Patrick McHenry had requested a briefing from SEC Chair Gary Gensler by January 17 on how the security breach occurred and how he will prevent future occurrences.\n\nVanguard blocks clients from purchasing spot Bitcoin ETFs\n\nAsset manager Vanguard won’t allow customers to buy the new spot Bitcoin ETFs on its platform, CoinDesk reported.\n\nA Vanguard spokesperson told CoinDesk that crypto-related products were not compatible with building “a well-balanced, long-term investment portfolio.”\n\nVanguard also told Axios: “In addition to spot Bitcoin ETFs not being available for purchase on the Vanguard platform, effective immediately, Vanguard will no longer accept the purchase of cryptocurrency products, including Bitcoin futures ETFs.”\n\nVanguard had issued a statement in 2022 questioning the long-term sustainability and price volatility of crypto investments.\n\nCrypto market movers\n\n⋅ Bitcoin is up 0.07% today at $42,803.40.\n\n⋅ Ethereum is up 0.38% today at $2,531.54.\n\nWhat we’re reading\n\n⋅ How VanEck plans to compete with BlackRock for Bitcoin ETF billions — DL News\n\n⋅ Bitwise bitcoin ETF draws most inflows on first trading day, company says — Reuters\n\n⋅ Gary Gensler says SEC decision to approve spot ETFs isn’t an endorsement: ‘Bitcoin, itself, we did not approve’ — Fortune"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmZyZWVwLmNvbS9zdG9yeS9tb25leS9idXNpbmVzcy8yMDI0LzAxLzEzL2JpdGNvaW4tbWFrZXMtYmlnLW1vdmVzLW9uLXdhbGwtc3RyZWV0LzcyMjAwOTMyMDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin makes big moves on Wall Street - Detroit Free Press",
        "content": "Benzinga\n\nBitcoin took center stage this week when the Securities and Exchange Commission approved the trading of spot Bitcoin exchange-traded funds on a deadline that had investors on edge. This development officially brings the largest cryptocurrency to the attention of a wider audience of investors, who can now gain exposure to Bitcoin through an ETF.\n\nBitcoin ETF inflows\n\nOn their initial trading day Thursday, Bitcoin ETFs recorded inflows exceeding $4.3 billion, establishing an unprecedented milestone for exchange-traded fund products. Blackrock Inc.'s iShares Bitcoin Trust ETF attracted over $1 billion and the Grayscale Bitcoin Trust experienced inflows surpassing $2 billion.\n\nInflation rises again\n\nThe Consumer Price Index increased to 3.4% in comparison to December 2022, up from November’s 3.1% and exceeding the anticipated 3.2%. This unexpected increase in inflation may have significant implications for financial markets and Fed policies in the near future.\n\nMixed bank results\n\nJPMorgan posted robust earnings and raised its 2024 net interest income outlook but cautioned about economic risks. Bank of America saw a 10% revenue dip last quarter. Wells Fargo's 2023 profit rose by 9% due to higher interest rates but the bank anticipates lower revenue ahead. Citigroup had a challenging quarter with lower revenue and plans for substantial job cuts amid ongoing restructuring efforts.\n\nAI boost study\n\nA recent study by Cognizant & Oxford Economics predicts a potential $1 trillion boost to the U.S. economy through generative AI. The study also raises concerns about potential job disruptions as automation and AI technologies continue to advance.\n\nGoogle's mass layoffs\n\nGoogle has let go of more than 1,000 employees in a series of unexplained actions, raising questions about the motives and implications of these widespread layoffs. The circumstances surrounding these terminations remain shrouded in mystery, causing uncertainty and unease among both current and former employees.\n\nMicrosoft overtakes Apple\n\nMicrosoft briefly surpassed Apple to become the world's most valuable company this week, marking a significant shift in tech industry' leadership. This change reflects Microsoft's strong performance in the artificial intelligence business. Apple also experienced its third analyst downgrade in January, highlighting uncertainties in the market's assessment of Apple's future performance.\n\nTesla cuts China prices\n\nTesla has announced a price reduction for its entry-level electric vehicles in China, making them 6% cheaper. This move aims to enhance the company's competitiveness in the Chinese market and attract more customers to its electric cars.\n\nMore:IRS: 2023 income tax returns will be accepted starting Jan. 29\n\nMore:New FAFSA form now available 24/7 but soft launch glitches bring headaches\n\nBenzinga is a financial news and data company headquartered in Detroit."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMTMvd2h5LXNwb3QtZXRmcy1tYXktYmUtYS1nYW1lLWNoYW5nZXItZm9yLWJpdGNvaW4tLmh0bWzSAVlodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyNC8wMS8xMy93aHktc3BvdC1ldGZzLW1heS1iZS1hLWdhbWUtY2hhbmdlci1mb3ItYml0Y29pbi0uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Why spot ETFs may be a game changer for bitcoin - CNBC",
        "content": "The Securities and Exchange Commission's approval of 11 spot bitcoin ETFs this week could be a turning point for cryptocurrency investing.\n\nArk Invest CEO and Chief Investment Officer Cathie Wood is behind one of the new ETFs. Her firm partnered with 21Shares to launch the ARK 21Shares Bitcoin ETF.\n\n\"We really believe this is an important moment for us to help with the democratization of bitcoin access, giving more people access,\" Wood told \"ETF Edge\" on Monday.\n\nThe first-ever batch of spot ETFs began trading Thursday. Investor interest in bitcoin leading up to the historic ETF approvals has been on the upswing. As of Friday, the cryptocurrency is up more than 125% in the past 12 months.\n\nAs financial firms begin to get more exposure through the new instruments, Wood said, the impact on bitcoin prices will be noticeable.\n\n\"If institutions with trillions of dollars under management just put 0.2[%] or 0.5% in, that could really move the needle,\" Wood said.\n\nOphelia Snyder's firm 21.co is heavily involved in the cryptocurrency space. According to its website, the firm \"bridges traditional finance and decentralized finance for easy crypto access.\"\n\n\"It's also very much part of a new wave of disruptive technology,\" the firm's president and co-founder told \"ETF Edge.\"\n\nSnyder contended that bitcoin goes beyond being just a new asset class."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzE0L2J1eWluZy10aGUtbmV3LWJpdGNvaW4tZXRmLTMtdGhpbmdzLXRvLWtlZXAtaW4tbWluL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Buying the New Bitcoin ETFs? 3 Things to Keep in Mind. - The Motley Fool",
        "content": "With the approval of the first spot Bitcoin (BTC -7.03%) ETFs, the world of crypto investing just became much more interesting. While the new Bitcoin ETFs might not send the price of Bitcoin soaring immediately, they will certainly make crypto much more accessible to the average investor.\n\nHowever, buying a new Bitcoin ETF might not be the no-brainer you think it is. Here are three important points to consider.\n\nBitcoin ETF fees\n\nThe Securities and Exchange Commission (SEC) initially approved 11 different spot Bitcoin ETFs, and more could be on the way. To stand out in this crowded field, issuers are probably going to launch massive marketing campaigns based around low fees. The goal will be to get as big as possible as fast as possible. Thus, offering the lowest fees will be the primary way to land as much investor money as quickly as possible.\n\nAll of the major Bitcoin ETF issuers have released their initial fee structures, and it looks like expense ratios will be in line with what you'd expect from a traditional ETF. And it looks like BlackRock (NYSE: BLK), via its iShares Bitcoin Trust ETF, will have the inside track with investors due to its low 0.25% annual fees.\n\nSo far, so good. It seems like a no-brainer, right? Just pick the Bitcoin ETF with the lowest fees, and you're good to go. However, keep in mind that some ETFs are already promising fee waivers and fee discounts as a way of attracting new investors. So, if the new fees seem too good to be true, they probably are. When the fees go up after an initial promotional period, you might be regretting your choice.\n\nBitcoin ETF performance\n\nAnother point to consider is tracking error, which is one of the major risks of investing in ETFs. Tracking error is the difference between the performance of the underlying asset (in this case, Bitcoin) and the ETF itself. Theoretically, if the price of Bitcoin goes up by 150% in a single year (as it did last year), then the value of your ETF should go up by 150% as well. Otherwise, you're leaving money on the table.\n\nThe problem is that the first batch of Bitcoin ETFs sometimes suffered from tracking error. That's because they used financial derivatives (i.e., futures contracts) to track the price of Bitcoin. The new ETFs are supposed to cure this problem by holding Bitcoin directly (i.e., spot Bitcoin). Unlike traditional ETFs (which typically hold a diversified mix of stocks), these Bitcoin ETFs are going to hold only Bitcoin, so that should help to minimize tracking error as well.\n\nNonetheless, keep a careful eye on how these new Bitcoin ETFs perform right out of the gate. Maybe I'm overthinking things here, but it seems like getting a perfect 1:1 match in terms of performance may be a bit trickier than many people think due to the inherent volatility of Bitcoin.\n\nSpot Bitcoin vs. spot Bitcoin ETF\n\nIt might sound crazy to suggest this, but these new spot Bitcoin ETFs may not be the right choice for all individual investors. I would characterize this as the \"spot Bitcoin vs. spot Bitcoin ETF\" conundrum. In short, would you rather buy Bitcoin directly (via a cryptocurrency exchange), or would you rather buy Bitcoin indirectly (via an ETF)? Theoretically, the new Bitcoin ETFs should make owning Bitcoin cheaper and more convenient than if you bought it directly from a crypto exchange, so this question should be easy to answer.\n\nThat being said, longtime crypto investors may decide to keep on using a cryptocurrency exchange like Coinbase Global (NASDAQ: COIN) to buy Bitcoin. Or they might decide to use one of the many decentralized crypto exchanges to buy Bitcoin directly for their crypto wallets. In the latter case, they won't be relying on a financial intermediary to hold their crypto.\n\nAfter all, a classic rallying cry in the crypto world has always been, \"Not your (cryptographic) keys, not your crypto.\" Remember: With the new Bitcoin ETFs, you will only be holding Bitcoin indirectly. The big Wall Street firms will be in charge of the cryptographic keys required to buy and sell Bitcoin. At the end of the day, they own the Bitcoin, not you.\n\nWill Bitcoin go mainstream?\n\nThe new Bitcoin ETFs will become extremely popular with a broad cross-section of the population. Buying Bitcoin will now be so easy that anyone with a brokerage account will be able to do it. You won't need to create crypto wallets, or memorize cryptographic keys, or jump through any of the other hoops that have sometimes been required to buy Bitcoin over the past decade.\n\nOverall, the new Bitcoin ETFs should be good for the individual investor. But keep in mind that, just because Wall Street is telling you to run out and buy these new Bitcoin ETFs, you don't have to. There are still plenty of other alternatives, including buying Bitcoin directly."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcyNDM0L2xhdW5jaC1zcG90LWJpdGNvaW4tZXRmLWJlZ2lubmluZ9IBSWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3MjQzNC9sYXVuY2gtc3BvdC1iaXRjb2luLWV0Zi1iZWdpbm5pbmc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "The launch of the spot bitcoin ETF is just the beginning - The Block",
        "content": "Okay the bitcoin spot ETF is here. Now what?\n\nThe debut of the new funds was met with much fanfare and liquidity, with day two of trading seeing $3.1 billion in trading volumes, as noted by my colleague RT Watson.\n\nAmong issuers of new spot bitcoin funds, BlackRock led the way with $564 million traded on Friday, while Fidelity saw $431 million of volume. That's according to data from Yahoo Finance compiled by The Block.\n\nLiquidity during these early days is likely to be welcomed by issuers and market participants, adding further fuel to this significant milestone in the maturation of the asset class and gaining acceptance among Wall Street giants.\n\nAdvocates for this financial instrument have anticipated that it could replicate the impact of the first gold spot ETF on the precious metal, opening Bitcoin BTC -6.41% to a broader investor base and causing its price to surge.\n\nRELATED INDICES See crypto indices\n\nHowever, it's crucial to recognize that this change will unfold gradually. While the ETF represents a pivotal step, it's advised not to overly fixate on flows and volumes in these initial stages, given the deliberate – some might say painstakingly slow — pace of Wall Street.\n\nThe saying \"if you build it, they will come\" holds true, but it will require time.\n\nConsider the fact that various market participants, notably Vanguard, currently prohibit their clients from purchasing spot Bitcoin ETFs on their platforms. Vanguard, being the world's largest retirement plan provider, exemplifies the cautious approach adopted by major players in the industry. Meanwhile, firms like UBS and Citi only plan to allow \"some\" customers to trade bitcoin ETFs, according to reporting out of CoinDesk.\n\nEven clients of JPMorgan Chase and Fidelity, including myself, encounter a risk disclosure pop-up when placing an order. On the financial adviser front, barriers still exist. I've received messages from numerous individuals stating that their advisors are either unwilling to provide exposure to bitcoin ETFs or are entirely opposed to adding such exposure. This shouldn't be too surprising, given that such a product wasn't even on their radar, according to data compiled by issuer Bitwise. In fact, less than half of advisors anticipated an ETF in 2024. Even when they are ready to offer exposure, they are going to have to put in the work of reworking their portfolio methodologies, secure approvals from management, etc. These are months-long processes, not weeks long.\n\nLet's celebrate the approval for the meaning, but realize that much of the hard work has only just begun."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWtlZXAtZHJvcHBpbmctYmVjYXVzZS1ldGZz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Will Bitcoin keep dropping because of the ETFs? - Cointelegraph",
        "content": "The Securities and Exchange Commission (SEC) approved a spate of Bitcoin ETFs on Jan. 10, leading to speculation about how markets might react in the weeks ahead.\n\nBitcoin (BTC) surged to $49,000 in the hours following the announcement before sinking to just more than $43,000 as of Jan. 12 — impulsive moves that perhaps few observers found surprising. Yet, with Bitcoin's halving set to occur in April, there is little agreement about what might happen next.\n\nFor some analysis, we asked some Cointelegraph staffers and authors for their thoughts. (Keep in mind that the last time we asked for predictions, some were off by up to five figures — so don't consider this investment advice unless you're looking for tips to lose money.)\n\nCointelegraph: The ETF approvals are behind us. When January ends, will we look back on this as a \"buy the news\" or \"sell the news\" event?\n\nTom Blackstone, reporter:\n\nThe price of Bitcoin ended up barely breaking through resistance by Dec. 31, ending at $42,265. That's $2,265 above the upper range of where I thought it would be a few months ago, so my prediction was off a bit.\n\nRelated: This is why Bitcoin won’t crash 30% after the ETF decision\n\nHistory shows that halving years show very high price increases compared to the years before them, So I expect Bitcoin to be much higher by the end of this year, though June would be much too soon for a rally to come. By the end of the year, I expect it to hit a new all-time high. I don't think the ETF news will have much of an effect beyond the first two months or so after the decision is made.\n\nCT: Where do you think the price of Bitcoin will stand on June 30?\n\nTB: I think it will be above $47,000.\n\nLucas Kiely, chief investment officer at Yield App:\n\nWe may see some “sell-the-news” action, but only from some short-term traders. The HODLers are not selling — and certainly not before Bitcoin's halving, which has been the catalyst for a huge rally every single time in the past. The number of long-term holders sits at around 76%, which is higher than at any other point in its history.\n\nWe will see a minor pullback, but it’ll be nothing to write home about. It may take a little while for it to surpass the $50,000 threshold. But by June, the halving will be out of the way, and the price should be higher. The magnitude will depend on many factors, of course, not least the macroeconomic backdrop. We also know it usually takes time for the halving to impact the price, so we may need to be a little patient in waiting for a new all-time high.\n\nBTC price prediction for June 30? By the end of June, I expect Bitcoin to sit somewhere between $50,000 and $60,000.\n\nChristos Makridis, associate research professor at ASU and founder/CEO of Dynamic AI:\n\nThe Bitcoin ETF is a big step for prices of digital assets — even beyond BTC — for this year. Beyond the growing institutional recognition and adoption of digital assets, we are likely to see an even further increase in economic and political uncertainty. At least historically, there is a strong negative correlation between uncertainty and the price of both BTC and ETH, which will likely get amplified during the election cycle of 2024. Current price momentum for digital assets are likely to continue and people will look to them as a haven in the midst of uncertainty and active central bank and federal decision-making, further driving their appreciation in price.\n\nBTC Price on June. 30? I wouldn’t be surprised if BTC passes $50,000.\n\nRay Salmond, head of markets:\n\nBitcoin's long-term price action is likely to be influenced by the size and consistency of inflows to the ETFs, and the corresponding reports at the end of the first and second quarters.\n\nIt will be interesting to see how institutions reposition their portfolio allocations to BTC and what sort of consumer and retail products emerge over the coming year. In the short term, attention is likely to pivot back toward Bitcoin's halving in April, and the impact this has historically had on price.\n\nPersonally, I’d be content with seeing Bitcoin consolidate in the $50,000 to $56,000 price range for the next two or so months. Eventually flipping $58,000 to support and gaining further strength going into the halving would be great.\n\nBTC Price on June. 30? Between $55,500 and $69,420, but there are too many factors that can't be considered that could occur.\n\nDaniele Servadei, founder and CEO of Sellix:\n\nIt's inevitable that Bitcoin will surge beyond $100,000, driven by an influx of retail investors. This marks a pivotal moment for Bitcoin as it not only simplifies the investment process by eliminating the need for direct dealings with cryptocurrency exchanges but also signifies a major leap towards mainstream acceptance and regulatory clarity in the United States. (Ethereum, on the other hand, may not mirror Bitcoin's ascent.)\n\nBTC Price on June. 30? $140,000\n\nRudy Takala, editor:\n\nThe top of Bitcoin’s range was set at $49,000 when the ETFs launched. Once we establish a post-ETF bottom, I would assume we'll see it trade in an increasingly constricted range until it's ready to break out — possibly making it safer to short the higher end of that range until that happens. That will be particularly true if market mania continues shifting to Ethereum.\n\nRelated: What will Bitcoin do if the Justice Department takes aim at Binance?\n\nIn 2020 — the last halving year — Bitcoin's price increased 500%, and then it obviously doubled in 2021. The same pattern this year would put the year-end price somewhere above $200,000. That seems absurd at the moment, and the difference in market capitalization compared to 2020 would be equally absurd. But it does look bullish for the year.\n\nBTC Price on June. 30? Above $47,000.\n\nJ.W. Verret, associate professor at George Mason Law School\n\nI won’t sell the news because the only rational way to invest in Bitcoin is to think in five to 20 year horizons. Over that horizon, the “to the moon” meme is reasonable. In a short horizon, I don’t have real-world usage numbers to work with because there isn’t much. Short-term price predictions are just guesses about how many fellow speculators want to jump into the pool with me in the next six months based on no new information.\n\nLong-term, I believe the U.S. dollar has no future, that AI will prefer decentralized money, and that remote work lends itself to crypto incentives. Bitcoin is the best bet right now on that future.\n\nBTC Price on June. 30? If you force me to estimate, I’d say price movement dips during tax season’s regular sell off then continues up past current prices and toward $50,000.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ob25nLWtvbmctbmVlZHMtc3BlZWQtYXBwcm92YWwtMDkzMDAwNzE1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Hong Kong needs to speed up approval of spot cryptocurrency exchange-traded funds after US launch, industry ... - Yahoo Finance",
        "content": "Hong Kong should soon follow the United States' lead in authorising spot cryptocurrency exchange-traded funds (ETFs), bolstering the city's ambition to become a major virtual-asset hub in Asia, according to industry insiders.\n\nWhile the city's Securities and Futures Commission (SFC) in December said it was prepared to authorise retail access to spot virtual asset ETFs, the actual launch of such products has already fallen behind the US, according to Wang Yi, the head of quantitative investment at CSOP Asset Management, which currently runs two cryptocurrency futures ETFs.\n\nUS-listed spot bitcoin ETFs saw US$4.6 billion worth of shares trade hands on Thursday, according to a Reuters report that cited LSEG data, as investors jumped into the landmark products approved by the US securities regulator on Wednesday.\n\nDo you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge, our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team.\n\nEleven spot bitcoin ETFs - including BlackRock's iShares Bitcoin Trust, Grayscale Bitcoin Trust and ARK 21Shares Bitcoin ETF, among others - began trading on Thursday, following the US Securities and Exchange Commission's landmark approval that is expected to help bring the cryptocurrency industry closer to the more regulated world of traditional finance.\n\nBlackrock representatives ring the opening bell with guests at the Nasdaq MarketSite in New York on January 11, 2024, as spot bitcoin exchange-traded funds began trading. Photo: Bloomberg alt=Blackrock representatives ring the opening bell with guests at the Nasdaq MarketSite in New York on January 11, 2024, as spot bitcoin exchange-traded funds began trading. Photo: Bloomberg>\n\nThe successful US launch of spot bitcoin ETFs is expected to help move Hong Kong regulators closer to authorising similar cryptocurrency funds to operate in the city.\n\nStory continues\n\nSpot cryptocurrency ETFs enable investors to gain exposure to virtual assets without directly buying any crypto tokens.\n\nThese funds \"give the crypto industry more legitimacy and also opens up more collaboration opportunities with mainstream finance\", said RJ Ke, a researcher with ethereum scaling start-up Taiko. \"Hong Kong is likely to accelerate bitcoin ETF applications in the coming months.\"\n\nAround 10 fund management firms are preparing to launch spot virtual asset-backed ETFs in Hong Kong, according to Chinese media Caixin's interview on Wednesday of Livio Weng, chief operating officer at crypto trading app operator HashKey Group. Weng said that up to eight companies were at an \"advanced stage\" to launch.\n\nBitcoin jumped about 3.4 per cent to US$47,500, following the spot crypto ETF approvals in the US. That was nearly three times the level that the original cryptocurrency reached in November 2022, when failed crypto exchange FTX filed for bankruptcy to send bitcoin's price below US$17,000.\n\nHong Kong needs to launch spot virtual asset ETFs as soon as possible to \"ensure that the city remains competitive in the global cryptocurrency market and strengthen its position as a global financial centre\", said Mao Shixing, also known as \"Discus Fish\", who is the co-founder and chief executive of digital asset custody solutions provider Cobo.\n\nMao said the US approvals could impact other jurisdictions because \"the SEC is one of the most influential and reputable financial regulators in the world\", adding that the agency's initiatives \"often serve as important references for financial regulators in other countries and regions\".\n\n\"However, each country and region has its own independent stance and regulatory objectives,\" he said.\n\nEchoing the Cobo head's view, Donald Day, chief operating officer at digital asset platform VDX, said the SEC's decision would make its peers \"seriously consider whether similar ETFs would be permissible and desirable\".\n\nDay pointed out that the SFC's statement in December about being prepared to authorise such funds has \"in principle opened a pathway for issuers to launch spot crypto ETFs in Hong Kong\".\n\nWith the US, there are now nine markets around the world that have allowed the operation of spot crypto ETFs. The other markets include Canada, Germany, Switzerland, and tax havens such as the Cayman Islands in the Caribbean and Jersey near the coast of northwestern France, according to market analytics firm CoinGecko.\n\nMainland China, however, is unlikely to follow suit.\n\nIn December, China's Ministry of Industry and Information Technology said it will draft a national Web3 development plan to suit the country's needs. But the announcement did not mention cryptocurrencies even though Beijing maintains its support for Hong Kong's ambition to become a major virtual-asset hub.\n\nThe Chinese government banned banks from handling bitcoin in 2013 and forced cryptocurrency exchanges to move offshore in 2017. In 2021, the country's regulators reiterated the state's prohibition on all financial institutions from engaging in crypto-related activities.\n\nChina's state media recently emphasised the risks involved in spot cryptocurrency ETFs.\n\nThe US approval of spot bitcoin ETFs \"would make the cryptocurrency market even more frantic, providing fertile ground for illegal transactions such as money laundering\", according to a report by the International Financial News, a newspaper under the People's Daily, which cited Shanghai Jiao Tong University assistant professor Li Nan.\n\nThis article originally appeared in the South China Morning Post (SCMP), the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2024 South China Morning Post Publishers Ltd. All rights reserved.\n\nCopyright (c) 2024. South China Morning Post Publishers Ltd. All rights reserved."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzEzLzEtdG9wLWNyeXB0b2N1cnJlbmN5LWJ1eS1iZWZvcmUtc29hcnMtMTAwMC13YWxsLXN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "1 Top Cryptocurrency to Buy Now Before It Soars 1,000%, According to Wall Street Analysts - The Motley Fool",
        "content": "The cryptocurrency industry has been in turmoil for more than two years. It started with a rotation away from risk assets as recession fears rippled through the economy in late 2021. Then the collapse of the Terra blockchain ecosystem set in motion a series of bankruptcies and forced liquidations that dragged the market down even further.\n\nIn total, the value destruction exceeded $2 trillion when the market finally hit bottom. But Bitcoin (BTC -7.27%) brought the cryptocurrency market roaring back to life in recent months as two potential tailwinds caught investors' attention: the pending approval of spot Bitcoin exchange-traded funds (ETFs) and the reduction in Bitcoin mining rewards later this year.\n\nThe first catalyst has already come to fruition. The U.S. Securities and Exchange Commission approved 11 spot Bitcoin ETF applications on Wednesday, including proposals from two of the three largest asset managers in the world, BlackRock and Fidelity. That could elicit a wave of interest among retail and institutional investors, and the resulting increase in demand could drive the price of Bitcoin higher.\n\nIndeed, certain Wall Street analysts expect Bitcoin to triple or quadruple in value by 2025, and another analyst believes Bitcoin could increase 10-fold in value during the next five years.\n\nThe approval of spot Bitcoin ETFs could boost demand\n\nThe SEC began approving Bitcoin futures ETFs in October 2021. Those products invest in futures contracts rather than the cryptocurrency itself, so they do not track its price exactly. Case in point, the ProShares Bitcoin Strategy ETF returned 39% in the past six months, but Bitcoin increased 54% during that time.\n\nSpot Bitcoin ETFs will invest directly in Bitcoin and closely track its price. The appeal of such products is direct exposure to Bitcoin without the hassle of cryptocurrency exchanges and blockchain wallets. Investors can simply buy shares of a spot Bitcoin ETF through existing brokerage accounts. That could boost demand among retail and institutional traders.\n\nTo add detail, Bitcoin's price is determined by supply and demand, but the only variable of consequence is demand because its total supply is fixed at 21 million coins, of which about 19.6 million have been created. So, if the accessibility provided by spot Bitcoin ETFs translates into greater demand among retail and institutional investors, the price of Bitcoin could soar in the coming months and years.\n\nSeveral Wall Street analysts see that as a likely outcome -- especially in combination with the upcoming reduction in mining rewards -- given that reputable financial institutions like BlackRock and Fidelity are participating as ETF issuers. Indeed, Bernstein analyst Gautam Chhugani believes Bitcoin could hit $150,000 by 2025, implying 210% upside. Standard Chartered Bank analyst Geoff Kendrick says Bitcoin could reach $200,000 by 2025, implying 313% upside. And Fundstrat analyst Tom Lee says $500,000 is achievable by 2029, implying 1,000% upside.\n\nThe reduction in Bitcoin mining rewards could reduce selling pressure\n\nBitcoin mining rewards are cut in half every time 210,000 blocks are added to the blockchain, which happens about once every four years. The next Bitcoin halving event will occur in April 2024. Analysts believe that will lead to a substantial reduction in selling pressure, simply because miners will see Bitcoin inflows fall by 50%, meaning they will only have half as much cryptocurrency to sell.\n\nTo quantify that, MicroStrategy former Chief Executive Officer Michael Saylor believes selling pressure will fall from $12 billion annually to $6 billion annually after Bitcoin mining rewards are cut in half in April. That reduction in selling pressure will be tantamount to an increase in demand, potentially pushing the price of Bitcoin higher.\n\nIndeed, Saylor predicted in 2022 that Bitcoin would reach $500,000 during the next decade, implying about 1,000% upside. However, he was more recently quoted as saying Bitcoin could hit $5 million at some point in the future. That implies 10,230% upside, a seemingly absurd figure. But there is a historical precedent for halving events driving the price of Bitcoin higher.\n\nThe chart below lists the dates of past halving events and it details the returns generated by Bitcoin during the subsequent two-year periods.\n\nBitcoin Halving Event Date Bitcoin Return (2 Years Later) 2012 2,964% 2016 922% 2020 348%\n\nHere's the bottom line: Two catalysts could send Bitcoin soaring in the coming months and years. That makes the present a good time to buy a small position. But investors should remember that cryptocurrency is a young, volatile, and risky asset class. Bitcoin has fallen by 45% or more four times in the past five years, and a similar retreat is possible (if not probable) at some time in the future."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctbG93LWNhbi10aGUtYml0Y29pbi1wcmljZS1nb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "How low can the Bitcoin price go? - Cointelegraph",
        "content": "Bitcoin (BTC) price is down by roughly $4,000 since the approval of Bitcoin spot exchange-traded funds (ETF) in the U.S., signaling a growing “sell-the-news” sentiment in the market. Meanwhile, technical chart patterns hint at the possibility of a continued sell-off in the coming days or weeks.\n\nWhat could happen next, and how low could the Bitcoin price go?\n\nBitcoin’s maximum pain target is $34,850\n\nAs seen on the daily chart below, Bitcoin’s price trajectory shows consolidation within a bullish channel.\n\nBTC/USD daily price chart. Source: TradingView\n\nThe 50-day exponential moving average (50-day EMA; the red wave) has provided support near $42,120, with prices oscillating above it as of Jan. 14. However, the relative strength Index (RSI) hovers near the mid-line, indicating a lack of strong bullish momentum.\n\nIn addition, the RSI has recently formed lower highs as opposed to Bitcoin's higher highs, a sign of growing bearish divergence.\n\nTherefore, if the BTC price breaks below the 50-day EMA, it could seek the next support near the bullish channel’s lower trendline. This trendline coincides with Bitcoin’s 200-day EMA (the blue wave) near $34,850, a low not seen since the Q4, 2023-consolidation phase.\n\nBankers will crash Bitcoin to $25,000–$30,000\n\nHowever, market commentators such as Crypto Poseidonn see a Bitcoin price crash toward the $25,000–$30,000 range, noting that this is where most recent buyers accumulated BTC.\n\nIn the first scenario, investors that have acquired Bitcoin between $25,000 and $30,000 on ETF approval expectations will not profit much because bankers will likely not pay them a substantial premium over these prices.\n\nTherefore, as Bitcoin approaches $30,000, the bankers may buy from investors, establishing a new market bottom.\n\nBTC/USD daily price chart. Source: Crypto Poseidonn/TradingView\n\nHowever, the market may correct below $25,000 in the second scenario, allowing new institutional investors to acquire even more BTC with leverage.\n\nAnother analyst, Rhaonnor, argues that the market has already priced in the Bitcoin ETF rally, suggesting that the range between $24,000 and $32,000 should hold.\n\nHowever, not everyone agrees as trader il Capo of Crypto expects this level to possibly crack before the ultimate price target of $12,000.\n\n“Interest rates were increasing during 2004-2007 and when the FED pivoted, the market started dropping to new lows,” the trader explained his reasoning on X last month. “Now we are in a similar situation.\"\n\nCan Bitcoin resume its upward trajector?\n\nBitcoin’s ability to hold its prices above the 50-day EMA will determine whether more upside is to come in the short term.\n\nBTC price could further climb toward $50,000 or $60,000 in the coming weeks, as predicted by Lucas Kiely, chief investment officer at Yield App, and Christos Makridis, the founder/CEO of Dynamic AI. He added:\n\nWe will see a minor pullback, but it’ll be nothing to write home about. It may take a little while for it to surpass the $50,000 threshold. But by June, the halving will be out of the way, and the price should be higher.\n\nRelated: Bitcoin ETFs attract $1.4B in two trading sessions\n\nInterestingly, Bitcoin’s prevailing bull pennant pattern indicates a possible price rally toward the $50,000–60,000 range, as shown below.\n\nBull pennants are bullish continuation patterns that get resolved after the price breaks above the upper trendline and rises by as much as the previous uptrend’s height.\n\nBTC/USD daily price chart. Source: TradingView\n\nThe pattern shows that the BTC price can reach $56,200 by March 2024. Nonetheless, a break below the pennant’s lower trendline would bring the bearish targets mentioned above.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5zY21wLmNvbS90ZWNoL3RlY2gtdHJlbmRzL2FydGljbGUvMzI0ODI4Mi9ob25nLWtvbmctbmVlZHMtc3BlZWQtYXBwcm92YWwtc3BvdC1jcnlwdG9jdXJyZW5jeS1leGNoYW5nZS10cmFkZWQtZnVuZHMtYWZ0ZXItdXMtbGF1bmNoLWluZHVzdHJ50gGXAWh0dHBzOi8vYW1wLnNjbXAuY29tL3RlY2gvdGVjaC10cmVuZHMvYXJ0aWNsZS8zMjQ4MjgyL2hvbmcta29uZy1uZWVkcy1zcGVlZC1hcHByb3ZhbC1zcG90LWNyeXB0b2N1cnJlbmN5LWV4Y2hhbmdlLXRyYWRlZC1mdW5kcy1hZnRlci11cy1sYXVuY2gtaW5kdXN0cnk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Hong Kong must step up spot crypto ETF approvals after US launch, insiders say - South China Morning Post",
        "content": "The successful US launch of spot bitcoin ETFs is expected to help move Hong Kong regulators closer to authorising similar cryptocurrency funds to operate in the city.\n\nEleven spot bitcoin ETFs – including BlackRock’s iShares Bitcoin Trust, Grayscale Bitcoin Trust and ARK 21Shares Bitcoin ETF, among others – began trading on Thursday, following the US Securities and Exchange Commission’s landmark approval that is expected to help bring the cryptocurrency industry closer to the more regulated world of traditional finance.\n\nUS-listed spot bitcoin ETFs saw US$4.6 billion worth of shares trade hands on Thursday, according to a Reuters report that cited LSEG data, as investors jumped into the landmark products approved by the US securities regulator on Wednesday.\n\nWhile the city’s Securities and Futures Commission (SFC) in December said it was prepared to authorise retail access to spot virtual asset ETFs , the actual launch of such products has already fallen behind the US, according to Wang Yi, the head of quantitative investment at CSOP Asset Management, which currently runs two cryptocurrency futures ETFs.\n\nSpot cryptocurrency ETFs enable investors to gain exposure to virtual assets without directly buying any crypto tokens.\n\nThese funds “give the crypto industry more legitimacy and also opens up more collaboration opportunities with mainstream finance”, said RJ Ke, a researcher with ethereum scaling start-up Taiko. “Hong Kong is likely to accelerate bitcoin ETF applications in the coming months.”\n\nAround 10 fund management firms are preparing to launch spot virtual asset-backed ETFs in Hong Kong, according to Chinese media Caixin’s interview on Wednesday of Livio Weng, chief operating officer at crypto trading app operator HashKey Group . Weng said that up to eight companies were at an “advanced stage” to launch.\n\nBitcoin jumped about 3.4 per cent to US$47,500, following the spot crypto ETF approvals in the US. That was nearly three times the level that the original cryptocurrency reached in November 2022, when failed crypto exchange FTX filed for bankruptcy to send bitcoin’s price below US$17,000.\n\nHong Kong needs to launch spot virtual asset ETFs as soon as possible to “ensure that the city remains competitive in the global cryptocurrency market and strengthen its position as a global financial centre”, said Mao Shixing, also known as “Discus Fish”, who is the co-founder and chief executive of digital asset custody solutions provider Cobo.\n\nMao said the US approvals could impact other jurisdictions because “the SEC is one of the most influential and reputable financial regulators in the world”, adding that the agency’s initiatives “often serve as important references for financial regulators in other countries and regions”.\n\n“However, each country and region has its own independent stance and regulatory objectives,” he said.\n\nEchoing the Cobo head’s view, Donald Day, chief operating officer at digital asset platform VDX, said the SEC’s decision would make its peers “seriously consider whether similar ETFs would be permissible and desirable”.\n\nDay pointed out that the SFC’s statement in December about being prepared to authorise such funds has “in principle opened a pathway for issuers to launch spot crypto ETFs in Hong Kong”.\n\nGermany , With the US, there are now nine markets around the world that have allowed the operation of spot crypto ETFs. The other markets include Canada Switzerland , and tax havens such as the Cayman Islands in the Caribbean and Jersey near the coast of northwestern France, according to market analytics firm CoinGecko.\n\nMainland China, however, is unlikely to follow suit.\n\nThe Chinese government banned banks from handling bitcoin in 2013 and forced cryptocurrency exchanges to move offshore in 2017. In 2021, the country’s regulators reiterated the state’s prohibition on all financial institutions from engaging in crypto-related activities.\n\nChina’s state media recently emphasised the risks involved in spot cryptocurrency ETFs.\n\nThe US approval of spot bitcoin ETFs “would make the cryptocurrency market even more frantic, providing fertile ground for illegal transactions such as money laundering”, according to a report by the International Financial News, a newspaper under the People’s Daily, which cited Shanghai Jiao Tong University assistant professor Li Nan."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWJ1eWluZy1idGMtd2hpY2gtYmV0dGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Spot Bitcoin ETFs and Buying BTC: Which Is Better? - CCN.com",
        "content": "Key Takeaways\n\nAfter 11 years of rejection, the SEC finally approved 11 spot Bitcoin ETFs on January 10.\n\nThe approval will allow investors to gain exposure to Bitcoin’s price movements without owning BTC itself.\n\nIn this article, we outline some of the big differences for investors.\n\nBitcoin (BTC) has once again caught the eye of your everyday investor following the approval of 11 spot Bitcoin exchange-traded funds on January 10. This, understandably, leaves investors wondering if they should invest directly in the digital currency or gain exposure through a the newly-approved ETFs. Both options have unique pros and cons to consider.\n\nBear in mind, the SEC has recently approved 11 spot Bitcoin ETFs. Although, Bitcoin futures ETFs had already been given the green-light and were available on the market.\n\nDirect Ownership\n\nBuying Bitcoin directly allows you to own the actual cryptocurrency. This gives you full control over your investment and the potential for very high returns if you’re quick off the mark. However, investing in Bitcoin requires setting up a cryptocurrency wallet and account on an exchange, which can be complicated for beginners. Investors will also have to pick between centralized and decentralized exchanges—another decision that requires a little research.\n\nA spot Bitcoin ETF provides much easier access to Bitcoin exposure for investors. Investing in a Bitcoin ETF is as straightforward as buying any stock or fund in your brokerage account. However, with an ETF you only own shares of a fund invested in Bitcoin rather than Bitcoin itself.\n\nHigher Risk vs. More Security\n\nAs a still emerging asset, Bitcoin carries higher volatility and security risks compared to a regulated Bitcoin ETF. But with higher risk comes the potential for higher rewards. Direct ownership means capturing all of Bitcoin’s upside compared to an ETF that charges management fees, which can reduce your total returns.\n\nOn the other hand, Bitcoin ETFs offers protections against fraud or theft that come with buying Bitcoin directly or on an exchange. However, Bitcoin ETFs have counterparty and operational risks related to the fund provider’s ability to manage the product. While these are minor risks, they simply don’t exist with Bitcoin itself.\n\nTax Differences\n\nInvesting in a Bitcoin ETF over the cryptocurrency itself will be similar to holding Bitcoin itself in most large jurisdictions.\n\nIn the US, selling your Bitcoin ETF position triggers a taxable event, either as long-term or short-term capital gains, following the same tax rules as cryptocurrency trades. While buying and holding Bitcoin ETF shares incurs no taxes, selling them after holding for over 12 months subjects you to long-term capital gains tax (0% to 20%), and selling within 12 months incurs short-term capital gains tax (10% to 37%).\n\nPlease, bear in mind that your tax burden will depend on the jurisdiction in which you pay.\n\nLiquidity and Access\n\nOne major advantage Bitcoin has over a Bitcoin ETF is that as an asset traded 24/7 globally, offering constant liquidity. Meanwhile, Bitcoin ETFs can only be traded during market hours. So, if you’re looking to minimize losses from a sudden market downturn, perhaps ETFs are not the right investment option for you.\n\nHowever, if you want to buy your ETF shares and forget about them until you want to cash out, an ETF might be the better choice. It will give you exposure to Bitcoin’s price movements without having to remember a complicated set of private keys (or risk losing them).\n\nSo Which Should You Buy?\n\nUltimately, whether a spot Bitcoin ETF or buying Bitcoin directly makes more sense comes down to your personal risk tolerance and investment goals. For suitable investors, owning Bitcoin directly provides higher return potential despite higher risks. More conservative investors may prefer gaining exposure through a regulated Bitcoin ETF."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFja3JvY2stY2VvLWxhcnJ5LWZpbmstYml0Y29pbi1jdXJyZW5jedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "BlackRock CEO doubts Bitcoin will ever become a currency - Cointelegraph",
        "content": "BlackRock CEO Larry Fink doubts the practicality of using Bitcoin (BTC) for everyday transactions, reiterating it should be publicly perceived as purely an asset class.\n\nIn an interview with CNBC on Jan. 11, Fink stated his belief in Bitcoin, viewing it as an alternative form of wealth storage rather than a contender to replace national currencies.\n\n“I don’t believe it’s ever going to be a currency. I believe it’s an asset class.”\n\nBlackRock CEO Larry Fink appearing on CNBC on Jan. 12. Source: CNBC/YouTube\n\nHowever, he does believe that central bank digital currencies (CBDCs) will come to fruition in the near future.\n\n“I think we’re going to create digital currencies, we’re going to use technology for it. We’re going to use a blockchain,” he stated.\n\nAccording to recent data from Cointelegraph, over 100 countries are exploring the development of CBDCs, while 39 countries have either a pilot, proof-of-concept or launched CBDC initiatives.\n\nRelated: Ether price jumps 20% vs. Bitcoin as BlackRock boosts Ethereum ETF bets\n\nYet, when questioned about his stance on ARK Invest CEO Cathie Wood’s most recent Bitcoin (BTC) valuation predictions ranging from $600,000 to $1 million, Fink indicated price wasn’t his primary concern right now.\n\n“I haven’t even thought about it,” Fink stated, explaining that it hasn’t been a top priority for him, as he is mainly focusing on offering “an instrument that can store wealth” through its newly approved spot Bitcoin exchange-traded fund (ETF).\n\n“I think if it gets even close to that high, gold will represent even a bigger value. And let’s be clear, if you think it’s digital gold, there’s going to be a reference point between gold and Bitcoin.”\n\nMeanwhile, in a separate interview with Fox Business on the same day, Fink clarified that the Bitcoin ETF will contribute to legitimizing an industry that has faced skepticism from the beginning.\n\n“The advent of the Bitcoin ETF is an example that we’re legitimizing it; we’re creating more safety,” he stated.\n\nThis follows news on Jan. 10 that the United States Securities and Exchange Commission had approved BlackRock’s spot Bitcoin ETF application and 10 others to launch in the country.\n\nSince its Bitcoin ETF approval, BlackRock has a record of 576 ETF approvals to just one rejection.\n\nMagazine: Expect ‘records broken’ by Bitcoin ETF: Brett Harrison (ex-FTX US), X Hall of Flame"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMTQvYml0Y29pbi10dW1ibGVkLWFmdGVyLWV0ZnMtbGF1bmNoZWQtd2hhdC1pdC1tZWFucy1mb3ItY3J5cHRvLW1pbmVycy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin tumbled after ETFs launched. What it means for crypto miners - CNBC",
        "content": "Investors in bitcoin mining stocks are closely watching the price of the cryptocurrency after the Securities and Exchange Commission's move to allow spot bitcoin ETFs became a sell-the-news event. After the ETFs received regulatory approval last week, the flagship currency briefly touched $49,000. As the week went on, however, bitcoin wiped out its earlier gains and notched a modest weekly loss of 0.01%. Crypto mining companies are now feeling the squeeze in this latest bitcoin sell-off – and that's evident in the big week-to-date declines for Marathon Digital and Riot Platforms , both of which lost more than 20%. First, the hash rate – the amount of computing power the Bitcoin network uses to process transactions – has been hitting all-time highs almost every week and hurting miners' margins, according to Reginald Smith, analyst at JPMorgan. The network hash rate has increased more than 30% over the last four months, he said, rising alongside bitcoin's 157% ascent in 2023. Second, investors are watching bitcoin's price in the wake of the ETFs' debut because if the crypto doesn't rise to a range of $50,000 and $55,000 soon, smaller miners may not have sufficient capital to grow and may have difficulty maintaining their operations. \"Miners who are at the lower end of the cost curve with limited amounts of debt and plenty of liquidity between bitcoin and cash on their balance sheets are going to be ones that fare the best in 2024,\" said Chase White, an analyst at Compass White. \"But it could be a hard time in the middle of the year as miners play the prisoner's dilemma game of who needs to turn off their machines and who doesn't.\" \"The older, less efficient miners are way less profitable, but they're still just profitable enough to stay online, hurting everybody's margin,\" he said. \"If [the bitcoin price] gets to $45,000 or below only the newest, most efficient miners with the … lowest cost power are going to be able to stay online.\" A dynamic in focus This dynamic between the bitcoin price and the mining companies is coming into focus in anticipation of the Bitcoin halving, when the reward for mining the flagship crypto is cut in half, as designed in the Bitcoin code, to reduce its supply. Because of the supply cut, the halving historically sets the stage for big price rallies in the following six to nine months. However, the reduction in the reward also means miners' revenue takes a hit. Overall, analysts are fairly optimistic that bitcoin will rise as expected due to three key catalysts: the ETF, the halving and potential interest rate cuts. \"The catalyst of the ETF and, a little bit later in the year, the potential for rate cuts, could lead bitcoin to run a lot faster than the global hash rate can run, which could alleviate a lot of this problem,\" White said. \"But it needs to rise above $50,000 for that to be the case, and we think we can get there.\" Compass White's year-end price target right now for bitcoin is $75,000. White said private miners will likely struggle the most because it's harder for them to access capital than the publicly traded miners, which can sell stock in at-the-market programs. He named Riot Platforms, Iris Energy , Cipher Mining and Bitfarms as some of his picks. JPMorgan's top pick is Iris Energy. The firm is neutral on Cipher, CleanSpark and Riot, although Smith said he's incrementally constructive on Riot, which is more actively traded and he sees as a long-term winner. Last week, Iris Energy and Cipher dropped more than 16% each. In a note earlier in the week, Smith suggested there may be weakness after the ETF approval – likely driven by technical selling pressure, rather than fundamental miner economics, since institutional investors now have other ways to express a view on bitcoin with the introduction of ETFs. \"We would view any sell-off [in mining stocks] as a buying opportunity, as the ETF does not directly impact mining economics or change competitive dynamics, and we remain bullish on bitcoin and bitcoin miners in 2024,\" he wrote."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tZmFsbHMtOS1kcm9wcGluZy1iZWxvdy00MmstYW1pZHN0LWNvbmNlcm5zLWFib3V0LWdidGMtZmxvd3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin falls 9%, dropping below $42K amidst concerns about GBTC flows - CryptoSlate",
        "content": "Bitcoin (BTC) prices fell significantly on Jan. 12 as Bitcoin ETFs headed into the weekend after their first two days of trading on U.S. markets.\n\nThe price of Bitcoin fell as low as $41,730 at 10:25 p.m. UTC on Friday, marking a 24-hour loss of approximately 9%. As of 11:25 p.m. UTC, Bitcoin’s price had partially recovered to $42,850 for a market capitalization of $840 billion.\n\nBitcoin last saw similarly low prices on Jan. 3. At that time, the price of BTC started to rise as investors began to anticipate upcoming spot ETF approvals.\n\nThe crypto market was down 5.3% over the 24 hours ending at 11:25 p.m. on Friday. Bitcoin (BTC) was down 7.7%, Solana (SOL) was down 9.2%, Avalanche (AVAX) was down 9.1%, Cardano was down 6.2%, XRP was down 5.5%, and Ethereum (ETH) and BNB were down 3.9%.\n\nGBTC redemptions may have caused price slide\n\nThe reason for BTC’s price drop is unclear. Spot Bitcoin ETFs have attracted significant demand, with reports of over $4 billion in volume on the first day of trading, and that demand should drive up Bitcoin prices.\n\nHowever, there are other factors at play. SkyBridge Capital founder Anthony Scaramucci suggested that Bitcoin’s falling price may be due to sales of shares from Grayscale’s GBTC fund, which was converted to a spot Bitcoin ETF on Thursday. CNBC’s Ran Neuner similarly suggested that GBTC Bitcoin could re-enter the supply without being invested in Bitcoin ETFs. Neuner wrote:\n\n“I doubt that the ETF providers have this much demand as quickly.“\n\nBloomberg’s James Seyffart contested this explanation. He identified –$95 billion of GBTC outflows on the first day of trading, calling this “just a fraction” of what many expected.\n\nOther negative developments may have also affected investor sentiment, indirectly impacting Bitcoin trading and supply. Those events include Vanguard’s decision to exclude spot Bitcoin ETFs from its platform, U.S. lawmaker backlash against the SEC’s failure to secure its X account, and Senator Elizabeth Warren’s objection to the SEC’s ETF approval decision.\n\nBitcoin Market Data At the time of press 12:14 am UTC on Jan. 15, 2024, Bitcoin is ranked #1 by market cap and the price is down 1.28% over the past 24 hours. Bitcoin has a market capitalization of $840.19 billion with a 24-hour trading volume of $33.99 billion. Learn more about Bitcoin › Bitcoin $42,871.50 -1.28% Crypto Market Summary At the time of press 12:14 am UTC on Jan. 15, 2024, the total crypto market is valued at at $1.68 trillion with a 24-hour volume of $77.05 billion. Bitcoin dominance is currently at 49.92%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNydW1ibGVzLWFmdGVyLXNwb3QtZXRmLWFwcHJvdmFsLWJ1dC1pY3AtdGlhLW1udC1zZWktYW5kLWFsdGNvaW5zLXJlYm91bmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin price crumbles after spot ETF approval, but ICP, TIA, MNT, SEI and altcoins rebound - Cointelegraph",
        "content": "There was a lot of hype built around the spot Bitcoin (BTC) exchange-traded funds, but when regulatory approval did not result in an upside move, traders may have decided to book profits, resulting in a sharp pullback to $41,500.\n\nSome analysts have turned bearish and are projecting targets of $25,000 and lower on Bitcoin. While anything is possible in the markets, levels near $38,000 are likely to attract long-term investors who will keep an eye on the Bitcoin halving and the institutional inflows into the spot Bitcoin ETFs in the coming weeks.\n\nCrypto market data daily view. Source: Coin360\n\nBloomberg ETF analyst Eric Balchunas said in a X (formerly Twitter) post on Jan. 13 that the newly launched ETFs witnessed inflows of $1.4 billion, while the Grayscale Bitcoin Trust (GBTC) saw an outflow of $579 million. Still, the net inflows in two trading sessions across the ETFs were $819 million.\n\nCould the inflows into Bitcoin ETFs reverse the slide in Bitcoin and altcoins? Let’s look at the charts of the top 5 cryptocurrencies that may outperform in the near term.\n\nBitcoin price analysis\n\nBitcoin has been all over the place in the past few days. The failure to sustain the price above $48,000 may have tempted short-term traders to book profits, which started a sharp fall on Jan. 12.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe bulls and the bears are witnessing a tough battle near the support line of the ascending triangle pattern. Although buyers have managed to defend the support line on a closing basis, they have failed to start a meaningful recovery. This suggests that the bears are maintaining their pressure.\n\nThe 20-day exponential moving average ($43,933) has started to turn down, and the relative strength index (RSI) is just below the midpoint, indicating that the bears are attempting a comeback.\n\nIf the price maintains below the triangle, the BTC/USDT pair could slump to $40,000 and then to $37,980. Buyers will have to propel the price above $44,700 to regain control.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe 20-EMA has turned down on the 4-hour chart, and the RSI is in the negative territory, indicating that the bears have the upper hand. If the price breaks below $42,000, the selling could pick up, and the pair may plummet to $41,500 and then to $40,000.\n\nIf bulls want to prevent the downside, they will have to push the price above the 20-EMA. That will clear the path for a rally to $44,700, which remains the crucial overhead resistance for the bulls to overcome.\n\nInternet Computer price analysis\n\nInternet Computer (ICP) bounced off the 20-day EMA ($12.11) on Jan. 8 and again on Jan. 13, indicating that the bulls are fiercely defending the level.\n\nICP/USDT daily chart. Source: TradingView\n\nThe upsloping moving averages indicate an advantage to buyers, but the negative divergence on the RSI suggests that the bullish momentum may be slowing down. A break and close above $14.21 could open the doors for a retest of the high at $16.30. If this level is cleared, the next stop is likely to be $18.\n\nThe 20-day EMA remains the critical support to watch out for on the downside. If this level is taken out, the advantage will tilt in favor of the bears. The ICP/USDT pair may then plunge to $9.36.\n\nThe pair has been consolidating between $12 and $14 for some time. This suggests indecision between the bulls and the bears. If buyers kick the price above $14, the pair could accelerate toward $16.30.\n\nContrarily, if the price skids below the moving averages, it will suggest that the bears are selling on rallies. The price may then retest the support at $12. A break below this level will open the doors for a slide to $10.\n\nCelestia price analysis\n\nCelestia (TIA) has been in a strong uptrend for several days, indicating that every minor dip is being purchased.\n\nTIA/USDT daily chart. Source: TradingView\n\nThere is a minor psychological resistance at $20, where the TIA/USDT pair may witness a pullback. If buyers do not allow the price to slip below $17.29, it will indicate that the bulls are trying to flip the level into support. That will improve the prospects of a break above $20. The pair may then ascend to $25.\n\nConversely, if the price turns down sharply and slumps below $17.29, it will suggest that the traders are aggressively booking profits. The bears will then sense an opportunity and try to yank the pair to the 20-day EMA ($14.89).\n\nThe pair picked up momentum after breaking above the $17.29 resistance. Hence, this remains the key level to watch out for on the downside. Any pullback is likely to find support at the 20-EMA.\n\nIf the price rebounds off the 20-EMA, it will suggest that the sentiment remains positive and traders are buying on dips. The pair may then start the next leg of the uptrend toward $23. The short-term advantage will favor the bears if they yank the pair below $17.29. The next support is at the 50-SMA.\n\nRelated: Google Play Store in India blocks Binance, OKX in response to FIU notice\n\nMantle price analysis\n\nMantle (MNT) broke above the ascending channel pattern on Jan. 10 and rallied sharply to $0.85 on Jan. 11, but the long wick on the day’s candlestick shows profit-booking at higher levels.\n\nMNT/USDT daily chart. Source: TradingView\n\nThe price has reached the breakout level from the channel, where buyers are expected to step in. Both moving averages are sloping up gradually, indicating that bulls have the upper hand, but the negative divergence on the RSI warrants caution.\n\nIf the price rebounds off the breakout level from the channel, the buyers will again try to kick the MNT/USDT pair to $0.85. This level is likely to act as a major hurdle, but if crossed, the pair could surge to $1.\n\nThe bulls tried to stall the correction at the 20-EMA, but the bears had other plans. They sold the bounce near $0.78 and pulled the price to the 50-SMA. Any recovery attempt is likely to face selling at the 20-EMA. The bulls will have to shove the price above the overhead resistance zone between the 20-EMA and $0.78 to signal strength.\n\nInstead, if the price continues lower and breaks below the 50-SMA, it will indicate that the uptrend may be over. The pair then risks a fall to $0.65 and eventually to $0.58.\n\nSei price analysis\n\nSei (SEI) has formed a symmetrical triangle pattern, indicating indecision between the bulls and the bears.\n\nSEI/USDT daily chart. Source: TradingView\n\nGenerally, the symmetrical triangle acts as a continuation pattern, but on rare occasions, it may behave as a reversal pattern.\n\nThe rising 20-day EMA ($0.64) and the RSI in the positive zone indicate that buyers have the edge. If bulls thrust the price above the resistance line, it will mark the resumption of the uptrend. The pattern target of this setup is $1.10.\n\nThis positive view will be invalidated if the SEI/USDT pair continues lower and plunges below the triangle. That will signal a potential trend change and the start of a deeper correction toward the 50-day SMA ($0.43).\n\nThe moving averages have flattened out, and the RSI is near the midpoint, indicating a balance between supply and demand. It is difficult to predict the direction of the breakout from a triangle. Hence it is better to wait for the price to rise above or fall below the triangle before initiating large bets.\n\nIf the price stays above the moving averages, the bulls will try to push the pair to the resistance line. On the other hand, if the price slips below the moving averages, the pair may drop to the support line.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JsYWNrcm9jay1zY29vcHMtdXAtMTE1MDAtYnRjLWR1cmluZy1kaXAtYXMtZXRmLWxlYWRzLXRoZS1wYWNrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "BlackRock scoops up 11,500 BTC during dip as ETF leads the pack - CryptoSlate",
        "content": "BlackRock has reportedly bought a staggering 11,500 Bitcoin from the available supply during the latest dip since the launch of its spot Bitcoin ETF.\n\nThis amount is significant, considering that only 900 BTC are issued daily. The purchase by BlackRock effectively represents about 13 days’ worth of Bitcoin production being absorbed by a single player.\n\nThe asset manager’s CEO, Larry Fink, recently said his views on Bitcoin have evolved significantly over the years, and he now sees it as a “viable asset class.”\n\nSupply crunch\n\nBased on data, the iShares Bitcoin Trust (IBIT) Spot ETF managed only around 25% of the trading volume over the same two-day period. From this, one could infer that approximately 46,000 BTC were removed from the system over the past two days, with influences from other players like Grayscale Bitcoin Trust (GBTC).\n\nIf this trend continues, the Bitcoin market could face a severe supply crunch. With an estimated 46,000 BTC being absorbed in two days, which equates to 23,000 BTC per day, this rate is about 25.5x the daily production of Bitcoin.\n\nThe substantial uptake by U.S. ETFs, not to mention the additional demand from retail investors and other global ETFs, suggests a tightening of available Bitcoin supply.\n\nDespite the fluctuations in Bitcoin’s price, the underlying asset remains resilient. Despite the high fees associated with GBTC, the successful launch of the Bitcoin ETF is a strong indication of growing institutional interest. It could herald a new era of scarcity in the Bitcoin market.\n\nETF inflows hit $819M\n\nThe first two trading sessions following the approval of new Bitcoin exchange-traded funds (ETFs) experienced substantial inflows totaling $1.4 billion. After accounting for outflows from GBTC, the net total inflows across all Bitcoin-related products amounted to $819 million.\n\nA breakdown of this activity shows a remarkable volume of 500,000 individual trades, contributing to a total trading volume of $3.6 billion. BlackRock’s iShares Bitcoin Trust (IBIT) led the pack in this initial surge, which garnered $497.7 million in total flows.\n\nThe Fidelity Advantage Bitcoin ETF (FBTC) was close behind, amassing $422.3 million. Bitwise (BITB) also significantly impacted, attracting $237.90 million in investments.\n\nIn contrast, the Grayscale Bitcoin Trust (GBTC), a pre-existing product, saw an outflow of $579 million during the same period. This shift is partly attributed to investors opting for the new Bitcoin ETFs offering lower fees.\n\nThis trend aligns with earlier forecasts by ETF analysts, who anticipated that Bitcoin ETFs could attract around $10 billion in their first year of operation. It’s worth noting that GBTC is one of the largest holders of Bitcoin, managing over $27 billion.\n\nBitcoin Market Data At the time of press 12:14 am UTC on Jan. 15, 2024, Bitcoin is ranked #1 by market cap and the price is up 0.06% over the past 24 hours. Bitcoin has a market capitalization of $840.62 billion with a 24-hour trading volume of $21.04 billion. Learn more about Bitcoin › Bitcoin $42,892.93 0.06% Crypto Market Summary At the time of press 12:14 am UTC on Jan. 15, 2024, the total crypto market is valued at at $1.69 trillion with a 24-hour volume of $55.15 billion. Bitcoin dominance is currently at 49.68%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yaW90LXRlcmF3dWxmLWNsZWFuc3BhcmstbWluZXJzLWJpdGNvaW4taGFsdmluZy1jb2luc2hhcmVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Riot, TeraWulf and CleanSpark best-positioned miners for Bitcoin halving — CoinShares - Cointelegraph",
        "content": "Bitcoin mining firms Riot, TeraWulf, and CleanSpark are the best-positioned within the industry to handle the significant cost increases expected following the Bitcoin halving event in April, according to analysis by asset manager CoinShares.\n\nAs a result of halving, CoinShares predicts that the cost of production and cash costs will increase from approximately $16,800 and $25,000 per Bitcoin in the third quarter of 2023 to $27,900 and $37,800, respectively. The average cost of production post-halving for crypto miners is projected to be $37,856.\n\nAverage cost of production per Bitcoin post-halving across miners. Source: CoinShares\n\nThe halving reduces the block reward given to miners by half, thereby slowing down the rate of new Bitcoin creation as part of the network supply control deflationary policy. The next halving, estimated to take place in April 2024, will reduce the Bitcoin block reward to 3.125 BTC. The cost of mining, however, remains the same or may even increase due to miners’ expansion of operations to remain profitable.\n\n\"[...] we think Riot, TeraWulf and Cleanspark are best positioned going into the halving. One of the main problems miners have is large SG&A [selling, general, and administrative expenses] costs. For miners to break even, the halving will likely force them to cut SG&A costs, otherwise they could continue to run at an operating loss and having to resort to liquidating their HODL balances and other current assets.\"\n\nCoinShares analysis assumes Bitcoin price at $40,000 post-halving, noting that below this point, mining firms will “likely eat into their runway,” meaning miners would end up using financial reserves or operational buffers to remain in business.\n\nIn this scenario, Riot appears to be the best positioned to navigate the halving event “due to their cost structure and long runway.” However, the company is not shielded from challenges if the Bitcoin price falls below $40,000.\n\n“Overall, unless the price of Bitcoin remains above $40,000, we believe that only Bitfarms, Iris, CleanSpark, TeraWulf and Cormint will continue to operate profitably.”\n\nCoinShares points out that while most miners are improving their fleet efficiency — measuring energy consumption against mining output — the direct cost structure is not improving since they “will need to increase their power draw and energy consumed to mine the same amount of Bitcoin.”\n\nAccording to CoinShares’ analysis, electricity costs per Bitcoin pre- and post-halving form about 68% and 71% of miners’ total cost structure.\n\n“The more rigs a miner has for self-mining, the larger the data centre needed on a megawatt basis. This large capital expenditure is either funded by cash, equity or debt, of which the latter can hurt miners’ all-in cost of production due to higher interest expense and put them at risk during Bitcoin downturns,” reads the analysis using Core Scientific as an example.\n\nIn an effort to return to solvency, Core Scientific closed an oversubscribed $55-million equity financing round on Jan. 8. The mining company intends to relist on Nasdaq after bankruptcy proceedings are completed.\n\nMagazine: This is your brain on crypto — Substance abuse grows among crypto traders"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vQ3J5cHRvY3VycmVuY3kvd2h5LXRoZS1iaXRjb2luLWV0Zi1pbmZsb3dzLWFyZS1hLWh1Z2UtZGlzYXBwb2ludG1lbnQtMjAyNDAxMTMv0gFsaHR0cHM6Ly93d3cuZm9yZXhsaXZlLmNvbS9jcnlwdG9jdXJyZW5jeS93aHktdGhlLWJpdGNvaW4tZXRmLWluZmxvd3MtYXJlLWEtaHVnZS1kaXNhcHBvaW50bWVudC0yMDI0MDExMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Why the bitcoin ETF inflows are a huge disappointment - ForexLive",
        "content": "On Thursday -- just 30 minutes after the launch of the first US spot ETFs -- bitcoin touched a 21-month high of $49,051.\n\nThe peak of the hype in the first half hour is exactly what you would have expected but in the two days that followed, it's fallen 12%, raising some big questions about what comes next.\n\nFirst off, there was no way the results were going to match the hype. US investors already have plenty of ways to access bitcoin, including via Coinbase and other exchanges, the BITO futures ETF and many other highly-correlated products. There's something to be said about a pure spot ETF that owns the underlying asset but how big is the market for it really?\n\nThe results from the first two days are sobering.\n\nI had conservatively estimated at least $4 billion in inflows into the 11 ETFs based on the experience in Canada, where the BTCC ETF attracted $421 million in inflows in the first two days of trading.\n\nConsider:\n\nThe US is 10x bigger than Canada by population\n\nThe US is even larger when adjusting for GDP and FX\n\nInternational investors would be much more inclined to buy a US ETF than a Canadian one\n\nThe fees around 0.2% are much lower than the 1.5% in Canada\n\nThe hype was much larger for the US ETFs\n\nAgain, because of all that I thought inflows of $4 billion were very conservative.\n\nSo what are the results?\n\nJust $1.4 billion is sitting in the 10 truly new ETFs -- a drop in the bucket of the $840 billion market cap of bitcoin.\n\nEven worse, the Grayscale GBTC ETF, which converted from a closed end fund, saw $579m in outflows and the pre-existing BITO futures ETF saw $151m in outflows so the net inflows were just $652 million. That's scarcely 50% more than the Canadian one. In fact, after the first two days of trading, the Canadian ETF at $421 million would rank in third place, only scarcely behind the Fidelity FBTC at $422m and Blackrock's IBIT at $498 million.\n\nCanada bitcoin ETF AUM\n\nNow, some are trying to spin the individual ETF AUM numers as a success against the long history of 3000 ETFs but comparing these launches to the no-hype, no-demand launches of the myriad of ETFs out there is entirely disingenous. This was the event that spurred a 50% rally in bitcoin's price; all for just 0.077% of its market cap and got wall-to-wall coverage on CNBC.\n\nTo see just how disappointing this is, you only have to go back to some pre-launch estimates.\n\nFor some more-credible estimtates:\n\nStandard Chartered predicted $100 billion of flows into bitcoin ETFs by end of this year.\n\nof flows into bitcoin ETFs by end of this year. Bloomberg predicted $50 billion by year end and as much as $4 billion in day one\n\nEven if you ignore the $30 billion which should flow out of the high-cost GBTC into the 10 low-fee ETFs, those numbers now look wildly optimistic.\n\nA crypto ETF launch is like opening weekend at a box office -- especially ETFs as well-advertized as these ones -- your opening weekend is highly predictive of the total take-home.\n\nAgain, the Canadian ETF is instructive. It's $421m two-day total only doubled at the end of two months, finished the year at $741m and didn't sustainably rise above $1 billion until this year (it's at $2b currently).\n\nIf the new ETFs follow that path, they would have just $2.4 billion by year end... and that's excluding GBTC, BITO, Coinbase and BTCC.U outflows.\n\nThe BITO futures ETF brought in $1.1 billion in its first two days in 2021, almost double the to $652m net of these new ETFs. It didn't get above $1.4 billion until October of 2023.\n\nLooking at the 25 largest ETF launches ever, none of them have had meaningful flows beyond the first day since the stone ages of ETFs.\n\nNo ETF launch since early 2000s has had big follow-up flows\n\nAnd here's a reminder of how bitcoin did after BITO:\n\nNow some are arguing that it will take longer for institutional money to show up and that the post-launch fall in bitcoin wasn't exactly conductive to inflows. I agree there was also plenty of talk about sell-the-fact so maybe the tide turns if/when bitcoin prices start to rise but at this point, but I'm going to need to see it to believe it.\n\nSo far, I wouldn't classify this launch as anything less than disastrous."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWdvbGQtY29ycmVsYXRpb24tc3VyZ2VzLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Gold on steroids? Bitcoin, gold correlation surges in 2023 — Fidelity - Cointelegraph",
        "content": "The correlation between Bitcoin (BTC) and gold increased during 2023, according to a recent report from asset manager Fidelity.\n\nFidelity’s analysis shows Bitcoin’s price decoupled from its previously inverse relationship with interest rates and even rallied despite global rates increasing worldwide, which usually leads to a drop in demand for risk assets. Over the past twelve months, gold prices have followed the same pattern:\n\n“But this past year, we saw a complete decoupling of this relationship as real rates continued to rise (with inflation subsiding and treasury yields screaming higher at one of the fastest paces in history), with bitcoin not only holding steady, but then rallying! Could this be due to an idiosyncratic event, such as the anticipation of a spot ETP? Perhaps. But we do not think so, because gold has also been showing similar behaviors recently.”\n\nScreenshot showing the price of Bitcoin vs. forward real rates. Source: Fidelity\n\nIn 2023, gold experienced significant fluctuations but showed strong performance against several currencies overall. Gold’s price in United States dollars jumped 14.6% in 2023, with notable variations among different currency pairs. The asset performance was primarily driven by geopolitical risks and central bank demand. Bitcoin, meanwhile, gained 156% in 2023.\n\n“Historically, bitcoin has been relatively noncorrelated to gold over the longer term, but recently has shown an increase in correlation as both have rallied”\n\nThe investment company speculated on the reasons for the increased correlation between the commodities, stating that investors might be watching the United States’ growing fiscal deficit or even anticipating a change in interest rates:\n\n“We can only speculate as to what these real asset markets may be saying, but one possible explanation is that both Bitcoin and gold are saying that the bond market may be wrong or that both assets are sniffing something else out, such as the United States’ increasingly large and structural fiscal deficits. Perhaps the bitcoin market may be anticipating more debt monetization by the Federal Reserve in the future, or anticipating rate cuts, given that our research shows that Bitcoin’s price is highly correlated not to consumer price inflation, but rather inflation in the money supply itself and various liquidity metrics.”\n\nFidelity’s analysis also points to a tighter supply environment for Bitcoin, as the amount of long-term holders has reached another all-time high of 70%. “It appears to us that the last few years of the bear market have forged some very strong hands in terms of holding period. Even in the face of a 160%+ rally in Bitcoin (at the time of writing in mid-December), we have not observed these long-term and illiquid coins moving in response to the price to take profit.”\n\nMagazine: Lawmakers’ fear and doubt drives proposed crypto regulations in US"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NhbXNvbi1tb3ctYmVsaWV2ZXMtYml0Y29pbi13aWxsLXN1cmdlLXRvLTEtbWlsbGlvbi13aXRoaW4tZGF5cy1vci13ZWVrcy1vbmNlLXN1cHBseS1jcnVuY2gtaGl0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Samson Mow believes Bitcoin will surge to $1 million 'within days or weeks' once supply crunch hits - CryptoSlate",
        "content": "JAN3 CEO and Bitcoin bull Samson Mow believes that Bitcoin will see a significant supply shock in the coming days that could potentially cause its price to surge to $1 million within a matter of ‘days or weeks.’\n\nThe forecast hinges on a perceived supply shock driven by demand from the recently approved Bitcoin ETFs and a series of market adjustments currently unfolding.\n\nSupply shock\n\nThe launch of Bitcoin ETFs has already attracted billions in trading volume. Concurrently, BlackRock’s acquisition of 11,500 BTC has notably reduced the available market supply within the first two days of trading.\n\nThe purchase is equivalent to buying 13 days’ worth of Bitcoin supply, which currently stands at around 900 BTC/day. Experts predict that the demand for BTC will rise exponentially, especially if the ETFs continue to see significant inflows.\n\nBased on CryptoSlate’s analysis of the available BTC supply, if institutions continue to buy BTC at a similarly aggressive rate, it would only take around 120 days for the supply to dry up, making Bitcoin more scarce than it has ever been in its history.\n\nAdding complexity to the market dynamics is the upcoming Bitcoin Halving, an event that historically impacts the price significantly by reducing the rate at which new BTC are created. The reward for mining new blocks will be halved to 3.125 BTC from 6.25 BTC in approximately 90 to 120 days.\n\nThis, combined with the existing demand exceeding supply, could lead to an unprecedented price surge as demand hits new record highs, while supply drops to its lowest level in history.\n\nMax pain theory\n\nMow believes that markets will likely follow the “Max pain theory” — adapted from traditional financial markets, it suggests a scenario where Bitcoin’s price movements could result in the maximum financial loss for the largest number of market participants.\n\nThe theory, though not formally defined in the realm of crypto, typically refers to the price level at which most options contracts expire worthless, causing significant losses to holders. In Bitcoin’s case, this could translate into rapid and extreme price fluctuations, potentially catching many traders and investors off guard.\n\nMow believes that one key aspect of this theory in the Bitcoin market is the potential for a short squeeze in the coming days. A short squeeze occurs when the price of Bitcoin unexpectedly surges, forcing those who bet against it (short sellers) to buy back at higher prices to limit losses, further driving up the price.\n\nThe concept of max pain also ties into the unpredictability of Bitcoin’s price movements and market psychology. Bitcoin has a history of defying conventional market expectations, and a scenario that causes the maximum financial pain to the most significant number of market participants is consistent with its volatile and unpredictable nature.\n\nAccording to Mow, a quick rise to $1 million would disrupt the strategic plans of many, including nation-states and companies looking to invest in Bitcoin. It could also affect the usability of the Lightning Network due to high fees and break the Stock-to-Flow (S2F) model that many use to predict Bitcoin’s value.\n\nMow also commented on an additional number of events that would occur if Bitcoin hit $1 million price point too quickly, including:\n\nEl Salvador misses the window to issue Bitcoin bonds\n\nMajor economists, including Christine Lagarde and Jerome Powell, would lose their jobs for failing to recognize the inevitable hyperbitcoinization\n\nMichael Saylor and MicroStrategy would not be able to achieve its goal of obtaining 1% of the supply\n\nAmong the most significant impacts would be on the legacy financial system, which Mow believes is unprepared for a rapid reorganization around Bitcoin.\n\nBitcoin Market Data At the time of press 12:14 am UTC on Jan. 15, 2024, Bitcoin is ranked #1 by market cap and the price is down 2.04% over the past 24 hours. Bitcoin has a market capitalization of $823.32 billion with a 24-hour trading volume of $16.62 billion. Learn more about Bitcoin › Bitcoin $42,008.63 -2.04% Crypto Market Summary At the time of press 12:14 am UTC on Jan. 15, 2024, the total crypto market is valued at at $1.65 trillion with a 24-hour volume of $46.95 billion. Bitcoin dominance is currently at 49.73%. Learn more about the crypto market ›\n\nMentioned in this article"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9uZXh0LXdlZWtzLWJpdGNvaW4tcHJpY2UtYW5hbHlzaXMtaGVyZXMtd2h5LWJ0Yy1wcmljZS1tdXN0LXRlc3QtMzhrLWZvci11cHdhcmQtcmVjb3Zlcnkv0gGBAWh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9uZXh0LXdlZWtzLWJpdGNvaW4tcHJpY2UtYW5hbHlzaXMtaGVyZXMtd2h5LWJ0Yy1wcmljZS1tdXN0LXRlc3QtMzhrLWZvci11cHdhcmQtcmVjb3ZlcnkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Next Week’s Bitcoin Price Analysis: Here’s Why BTC Price Must Test $38K For Upward Recovery - Coinpedia Fintech News",
        "content": "Shayan is a digital nomad and a professional journalist. He delivers high-quality engaging articles to Coinpedia through his in-depth research and analysis.\n\nLast week, expectations were high that Bitcoin would rise above $48K and stabilize near $50K by the weekend. Contrary to these predictions, Bitcoin faced a significant correction, dropping towards $41K, even after the SEC’s approval of a spot BTC ETF. Despite this setback, Bitcoin has somewhat recovered, currently testing the $43K level. Analysts now suggest that further decline might occur this week, with $38K being a critical point for a potential robust recovery.\n\nBitcoin’s Short-Term Sentiment Is Overheated\n\nHolders of long positions are increasingly liquidating as the BTC price consistently faces rejection above $43,500. Consequently, Bitcoin experienced over $11 million in liquidations, with nearly $8 million in bullish positions being liquidated, according to Coinglass data.\n\nOn-chain data shows the Bitcoin market cooling down after overheating near $46K, with net unrealized profit moving from the denial to the optimism zone at 47.6%. This indicates most short-term holders sold off between $43K-$49K, leaving long-term holders to support the BTC price.\n\nThe MVRV ratio has decreased from 1.69 to 1.38, suggesting the market value is heading toward Bitcoin’s realized value. A further decline in BTC price might be expected as the MVRV ratio has not yet stabilized.\n\nAdditionally, Bitcoin’s AASI (Active Address Sentiment Indicator) was already overheated as the orange line was hovering near the red line. The AASI is developed by comparing Bitcoin’s 28-day price change percentage (orange line) with its 28-day change in active addresses. This indicator gives a short-term sentiment of the market.\n\nWhen its orange line hits the upper boundary, marked by a red dotted line, it signals an overheated short-term market sentiment. This overheating occurs because the pace of price increase surpasses the growth rate of active addresses. However, the orange line needs to dip toward the green line to initiate further accumulation by buyers near the dip, potentially plunging BTC price toward $38K.\n\nWhat’s Next For BTC Price?\n\nBitcoin has shown significant volatility recently, as it faced multiple rejections between $42,500-$43,500, indicating buying at lower levels and selling during rallies. As of writing, BTC price trades at $42,930, declining by over 0.57% from yesterday’s rate.\n\nBears are currently aiming to send the price below the ascending support line, suggesting market rejection at higher levels. If the price declines below $40K, the next focus for the bulls will be to halt the decline at $38K level.\n\nA rebound from the $38K level is expected as it might lead the bulls to attempt pushing the price above the crucial resistance at $44,700 quickly. Achieving this could see the BTC price gaining its momentum and this might trigger a new bullish trend next week. In such a scenario, BTC price is expected to fully capitalize and aim for a surge toward $48K.\n\nConversely, if the price falls below the $38K, it could trigger more selling, potentially driving the price down to $35K-$36K."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yb2xsdXBzLWNvcnBvcmF0ZS1kZW1hbmQtYml0Y29pbi0yMDI0LWNyeXB0by1idXNpbmVzcy10cmVuZHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Rollups, corporate demand, and Bitcoin-tied solutions among 2024's crypto business trends - Cointelegraph",
        "content": "Crypto businesses are looking forward to less turbulent times after a long crypto winter, with institutional demand and growing Bitcoin adoption helping to drive innovation in the crypto space. Trends to look for this year include scalability and compliance solutions, industry participants told Cointelegraph.\n\nTransaction speeds and costs are challenges for both the Ethereum and the Bitcoin networks. Not by chance, rollup projects are expected to be in high demand in 2024, said Axelar’s CEO Sergey Gorbunov. He believes rollup development kits are \"something to watch in 2024.\"\n\n“We’re beginning to see abstraction for the Web3 developer that is similar to what consumer-facing developers in SaaS enjoy,” explained Gorbunov about the growing offer of tools for developers working on blockchain scaling solutions.\n\nRollups are a type of layer-2 blockchain designed to improve scalability. They combine multiple transactions into a single batch outside the main blockchain (off-chain). This significantly reduces the amount of data that needs to be processed and stored on the main chain (on-chain), resulting in faster and cheaper transactions.\n\nAccording to Gorbunov, projects currently “moving to scale across this landscape include DeFi innovators like Frax and Lido – and leading DEXs like dYdX, PancakeSwap and Uniswap.”\n\nDecentralized infrastructure is another area expected to grow over the next few months. “Decentralizing frontends and backends is a critical issue, including when it comes to decentralized web-hosting and cloud-storage systems,” said Frank Hu, chief operating officer of ByteTrade Lab.\n\nBehind these trends is the increasing involvement of institutional investors and traditional corporations within the crypto space. According to a November survey by Coinbase, 64% of current institutional crypto investors expected to increase their allocations in the next three years, and 45% of investors without crypto allocations planned to start investing within the same period.\n\nInstitutional investors seek exposure to crypto through a range of products. Source: Coinbase 2023 Institutional Survey\n\nSandra Carter, chief operating officer of Unstoppable Domains, sees projects offering interoperability between Web2 and Web3 as a potential growth area. “There are so many people, brands, and organizations in Web2 that are yet to move over to Web3 or even know about it. They need to take those first steps, and [crypto] businesses will make that easier and more accessible because they know that there is so much value locked up in Web2 that Web3 can unleash,” she noted.\n\nThe approval of spot Bitcoin exchange-traded funds (ETFs) will also serve as a business driver in 2024. According to Mauricio di Bartolomeo from lending protocol Ledn, variations of Bitcoin ETF, such as leveraged and short ETFs, are expected to flood the market over the next few months. The hype surrounding the cryptocurrency is also predicted to boost its use as collateral on crypto loans.\n\nFurthermore, one of the crypto industry’s foundations is also being disrupted — social media platforms. “Crypto has always been driven by social media,” said the co-founder of DSCVR, Juan Bruce, who believes it is only a matter of time before decentralized social media platforms find the product-market fit that will replace the traditional ones.\n\n“Teams, including ours, are building social platforms that aren’t just on chain but enable crypto transactions in a social context for users and projects,” Bruce told Cointelegraph.\n\nGrowth prospects, however, are not immune to challenges. Carter believes the regulatory landscape will still play a significant risk for crypto businesses in 2024.\n\n“There are so many variables when it comes to regulations, and while there are victories and signs of hope [such as Ripple’s and Grayscale’s court victories], there are specific individuals who are dead-set on stopping crypto from entering the mainstream. The U.S. wants to be competitive in blockchain technology, but regulators are doing their utmost to prevent or control that as best they can.”\n\nMagazine: MakerDAO’s plan to bring back ‘DeFi summer’ — Rune Christensen"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1vdXRsb29rLWNyeXB0by1pbnZlc3RpbmctYW5hbHlzaXMtc2VjLWFwcHJvdmVzLXNwb3QtZXRmLTIwMjQtMdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price Outlook: Bulls Target $100K After SEC Approves Spot ETFs - Markets Insider",
        "content": "The SEC approved 11 spot bitcoin ETFs this week.\n\nThe cryptocurrency is up 70% since October, and bulls believe the watchdog's announcement could drive it even higher.\n\nMany expect bitcoin's price to pass six figures by the end of 2024.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nAfter months of speculation, the Securities and Exchange Commission finally gave its seal of approval to 11 spot bitcoin ETFs Wednesday – and crypto bulls have pinpointed the regulator's move as a potential catalyst to push its price above six figures for the first time.\n\nUK bank Standard Chartered and Fundstrat perma-bull Tom Lee are among the names who charted a path for bitcoin to pass $100,000 in the run-up to the SEC's announcement, while other analysts called January 10 a \"watershed moment\" and a \"'game changer' for crypto\".\n\nMarket reaction has been muted so far, with the large-cap token ticking up under 1% Thursday – but that could be a classic case of investors \"buying the rumor and selling the news\". Bitcoin has jumped 70% since late October as chatter surrounding the SEC's decision started to intensify, and is currently trading at its highest price in nearly two years.\n\nIt'd still have to double in price again to reach $100,000 – but some believe that milestone could be reached by the end of 2024, with regulated spot ETFs likely to draw big-name institutional investors into the crypto space.\n\nAdvertisement\n\nSix-figure price targets\n\nStandard Chartered is one high-profile firm that's particularly bullish on bitcoin. Earlier this month, strategists at the bank predicted that spot ETFs could drive between $50 billion and $100 billion worth of inflows for the token this year – and set a $200,000 price target for the end of 2025.\n\nMeanwhile, Fundstrat's Lee said in a CNBC interview the day the SEC announced its decision that he's expecting the token to climb to between $100,000 and $150,000 over the next 12 months – and to soar to $500,000 over the next five years.\n\n\"There's a finite supply, and now we have a potentially huge increase in demand with a spot bitcoin [ETF] approval – so I think in five years something around half a million would be potentially achievable,\" Lee told the outlet.\n\nUniversity of Sussex economist Carol Alexander, who successfully called bitcoin's slump in 2022 and surprise resurgence last year, isn't setting her sights so high – but still expects the cryptocurrency to be priced between $70,000 and $100,000 at the end of December.\n\nAdvertisement\n\n\"I think it's an excellent thing for bitcoin bulls in the short term — I've never been as bullish as this,\" she told Business Insider in an interview Wednesday.\n\nWords of caution\n\nNot all of the financial world is convinced by those lofty price targets, though.\n\nFormer PIMCO CEO Mohamed El-Erian said in a post on X Thursday that while the SEC's approval could be a \"game changer\" for cryptocurrency, it wasn't likely to promote bitcoin's usage more widely.\n\n\"As notable as all these factors are for anchoring crypto in the investment world, they do not significantly propel its role as a potential global currency,\" he wrote. \"The outlook here remains more constrained.\"\n\nAdvertisement\n\nEven the SEC itself appears skeptical about bitcoin's potential as an investment. In a separate statement Wednesday, chair Gary Gensler called the token \"primarily a speculative, volatile asset that's also used for illicit activity including ransomware, money laundering, sanction evasion, and terrorist financing.\""
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3RoaXMtYnRjLWNvcmUtZGV2ZWxvcGVyLXNhaWQtYml0Y29pbi1oYWQtZmFpbGVkLWV4YWN0bHktOC15ZWFycy1hZ28v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "This BTC core developer said Bitcoin had 'failed' exactly 8 years ago - CryptoSlate",
        "content": "Eight years ago, on Jan. 14, 2016, early Bitcoin developer Mike Hearn famously declared he had sold all his BTC because the flagship cryptocurrency had “failed” and would only “trend downward” in the long term.\n\nHowever, years later, Bitcoin has defied almost all of the somber predictions of its early developer and continued to thrive — cementing its status as “digital gold.”\n\nIn his 2016 blog post, Hearn said he was giving up on Bitcoin due to concerns over centralization, technical limitations, and governance issues.\n\nHearn’s post, laden with foreboding, suggested that Bitcoin was on the brink of technical collapse and irrelevance. However, the years following his departure have painted a vastly different picture.\n\nCentralization and Tech Limitations\n\nOne of Hearn’s primary concerns was the centralization of Bitcoin mining in China. Since then, the landscape has shifted dramatically.\n\nFollowing China’s crackdown on cryptocurrency mining, the industry saw a mass exodus, leading to a more geographically distributed and decentralized mining network. This diversification has assuaged fears of single-point failures and control, reinforcing the foundational principle of decentralization in Bitcoin’s design.\n\nHearn also pointed to various technical limitations related to the Bitcoin block size. However, the community implemented a fix in the form of the Segregated Witness (SegWit) protocol a year later in 2017.\n\nThis upgrade increased the block capacity and efficiency, alleviating some scalability concerns. Furthermore, the development of second-layer solutions, most notably the Lightning Network, has revolutionized Bitcoin’s transaction capabilities, offering faster transaction times and lower fees.\n\nGovernance, Censorship and Adoption\n\nAnother main reason behind Hearn’s departure was disagreements with other core developers over the proverbial direction Bitcoin was heading in.\n\nHearn had wanted to increase the Bitcoin block size, but other core developers had been against the idea. He spoke of the impasse in his post and said it would lead to censorship and centralization.\n\nHowever, over the years, the Bitcoin community has become more decentralized as it spread out across different forums and social media. The rise of independent news outlets focused on crypto has also significantly contributed to transparency and the free flow of information in the industry.\n\nMeanwhile, Hearn’s foreboding predictions about Bitcoin failing to achieve mainstream adoption are becoming less and less likely as even institutions have begun dipping their toes in the crypto pond.\n\nContrary to the bleak outlook, Bitcoin’s journey in the past eight years has seen increased institutional adoption and recognition as a legitimate financial asset. Major financial institutions and corporations have integrated Bitcoin into their portfolios and services, while countries facing economic instability have turned to it as an alternative financial system.\n\nAs Bitcoin continues towards mainstream adoption, the digital asset remains a subject of intense debate and speculation. The challenges highlighted by Hearn have not been entirely eradicated but have been met with innovative solutions and a community-driven approach to development and governance."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tcHJpY2UtZHJvcHMtdG8tYXJvdW5kLTQyMDAwLWFmdGVyLXNwb3QtZXRmLXRyYWRpbmctYmVnaW5zL2FydGljbGVzaG93LzEwNjgzMDY0MC5jbXPSAYsBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL3RlY2gvdGVjaG5vbG9neS9iaXRjb2luLXByaWNlLWRyb3BzLXRvLWFyb3VuZC00MjAwMC1hZnRlci1zcG90LWV0Zi10cmFkaW5nLWJlZ2lucy9hbXBfYXJ0aWNsZXNob3cvMTA2ODMwNjQwLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin price drops to around $42,000 after spot ETF trading begins - The Economic Times",
        "content": "Elevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website Indian School of Business ISB Professional Certificate in Product Management Visit Indian School of Business ISB Product Management Visit MIT MIT Technology Leadership and Innovation Visit\n\nThe price of Bitcoin nosedived to around $42,000, plunging almost 10 per cent, after the spot Bitcoin exchange-traded funds (ETFs) started trading in the US.Bitcoin reached a high of $46,000 last week and surged to a two-year high of $49,000 last week, when bitcoin ETFs began trading in the US.Shares of crypto exchange Coinbase tumbled 7.4 per cent after the bitcoin ETF news, reports Coindesk.Bitcoin has posted a massive 80 per cent rally since early October.\"The recent dynamics in bitcoin have not lived up to the expectations set by many bitcoin maximalists, with the asset failing to break the $50k mark, and the hype surrounding ETFs showing signs of cooling down,\" according to Crypto research firm Swissblock.\"The critical question now is whether the market can sustain upward momentum,\" it said in its market report.Research firm CryptoQuant predicted last month that Bitcoin would fall to as low as $32,000 after an ETF approval.The US Securities and Exchange Commission (SEC) last week approved a number of spot Bitcoin ETFs and with the decision, the world's largest cryptocurrency joined the global financial system.The approval of spot Bitcoin exchange-traded funds (ETFs) in the US not only symbolises a maturing market but also signifies support from regulatory authorities, according to industry experts.Spot Bitcoin ETFs have the potential to develop into a $100 billion product, according to some analysts."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLXByaWNlLXRhbmtzLWFub3RoZXItOC1zY2FyYW11Y2NpLWJsYW1lcy1ncmF5c2NhbGUtZnR4LWZvci10aGlzLXJvdXQv0gFpaHR0cHM6Ly9jb2luZ2FwZS5jb20vYml0Y29pbi1idGMtcHJpY2UtdGFua3MtYW5vdGhlci04LXNjYXJhbXVjY2ktYmxhbWVzLWdyYXlzY2FsZS1mdHgtZm9yLXRoaXMtcm91dC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin (BTC) Price Tanks Another 8%, Scaramucci Blames Grayscale/FTX For This Rout - CoinGape",
        "content": "The world’s largest cryptocurrency Bitcoin (BTC) continues to face selling pressure after the Bitcoin ETF approval. In the last few hours, the BTC price tanked by a further 8% slipping all the way to $42,500 levels, as of press time. Some market analysts have also called the Bitcoin ETF launch a failure.\n\nWhat’s Behind the Bitcoin Price Rout?\n\nThe recent dip in Bitcoin prices, is partly due to substantial sales of Grayscale Bitcoin Trust (GBTC) shares, as noted by Anthony Scaramucci, founder of SkyBridge Capital. In an interview with Bloomberg Television, Scaramucci revealed an observed trend of significant Grayscale selling, pointing to holders converting their shares from a trust to an ETF format. The U.S. Securities and Exchange Commission’s recent approval of ETFs prompted many to shift to these lower-fee alternatives, resulting in sell-offs to realize losses.\n\nadvertisement\n\nGrayscale Bitcoin Trust, with its inception in 2013, witnessed a record-breaking first-day turnover of $2.3 billion on Thursday, marking a historic moment for ETFs. Despite being a popular avenue for Bitcoin exposure, the trust’s shareholders, facing losses, opted to move towards cost-effective alternatives. Following Bitcoin’s surge to a two-year high above $49,000 on Thursday, the cryptocurrency faced a decline below $43,000 on Friday.\n\nGrayscale’s managing director of research, Zach Pandl, however, has defended his company’s position. He added that the sale of one Bitcoin product to acquire another should not have an impact on the Bitcoin price.\n\nThe shares of GBTC experienced a 5.2% decline, closing at $38.58 on Friday. While GBTC shares had an impressive 300% surge in the previous year, Bitcoin’s increase during the same period was nearly 160%, showcasing the trust’s significant role in Bitcoin investment strategies.\n\nFTX Also Behind the Bitcoin Selling?\n\nInterestingly, Scaramucci also pulls out an FTX angle behind the recent Bitcoin price selling. He added that the bankruptcy estate of FTX added to the cryptocurrency’s downward pressure. FTX, once among the largest crypto exchanges, filed for bankruptcy in 2022 amidst a broader market crash, and the estate is currently liquidating substantial crypto assets.\n\nThis sell-off, coupled with the recent approval of Bitcoin exchange-traded funds (ETFs), has contributed to heightened selling activity in the market. Scaramucci anticipates that the supply overhang, driven by FTX’s bankruptcy estate selling, will likely conclude in the next six to eight trading days.\n\nAdditionally, he noted a noteworthy development regarding the Wall Street marketing of ETFs. A quiet period, during which Wall Street refrained from marketing these ETFs, is likely to conclude in approximately eight days. This signals a potential shift in dynamics as Wall Street begins actively promoting and marketing Bitcoin ETFs, introducing a new phase to the market landscape."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tb25leS9wZXJzb25hbC1maW5hbmNlL2JpdGNvaW4tZXRmcy1hcHByb3ZlZC1ieS1zZWMtd2hhdC1zLWluLWl0LWZvci15b3UtMTE3MDUxMjgzNTIwNTcuaHRtbNIBeWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tb25leS9wZXJzb25hbC1maW5hbmNlL2JpdGNvaW4tZXRmcy1hcHByb3ZlZC1ieS1zZWMtd2hhdC1zLWluLWl0LWZvci15b3UvYW1wLTExNzA1MTI4MzUyMDU3Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs approved by SEC: What’s in it for you? | Mint - Mint",
        "content": "In a landmark decision, the US Securities and Exchange Commission (SEC) recently approved applications for exchange-traded funds (ETFs) that are primarily based on bitcoin. This move, following applications from several US-based fund management firms, marks a significant shift in the financial landscape. It's been over a decade since the first proposal for a Bitcoin ETF was submitted. It marks the SEC's longstanding hesitancy and an implicit acknowledgment of cryptocurrencies as viable investment assets.\n\nSo, what does this mean for individual investors?\n\nFor those bullish on bitcoin, there's now an avenue to invest up to $250,000 (little more than ₹2 crore) annually through the Liberalized Remittance Scheme (LRS), encompassing all overseas expenditures, including travel, education, and investments. Looking ahead, there's potential for Indian mutual funds to introduce products allowing investment in these US-based ETFs. Such 'feeder funds' would facilitate investments in the Indian rupee, with the same currency used for redemptions, and wouldn't count against the LRS limit.\n\nIt's worth noting that when comparing asset class returns year-over-year, bitcoin has often outperformed traditional options like equities, gold, and fixed income. However, investing wisely requires understanding both the risks and rewards. The nature of cryptocurrencies adds a layer of complexity, especially in defining their role. While gaining acceptance as a potential currency, cryptocurrencies lack the sovereign backing that defines traditional fiat currencies. Only a few countries, like El Salvador, have officially adopted bitcoin, and widespread acceptance remains uncertain.\n\nTraditional staple asset classes like equities and fixed income, along with diversifiers like gold, have well-established investment foundations. Equities represent tangible business performance--topline, bottom-line, and earnings per share. Fixed income offers fixed returns. Gold, while lacking these features, has a long-standing reputation as a value store. Cryptocurrencies, by contrast, lack regulatory support, official exchanges, and legal frameworks, adding layers of risk.\n\nOne key risk in cryptocurrency investments is the absence of a redressal mechanism in case of disputes, thefts, or technical failures. ETFs managed by established firms would not face such risks.\n\nIt's crucial for investors to thoroughly understand what they're investing in and why. Cryptocurrencies aren't traditional assets like stocks, bonds, or gold, and their investment logic differs significantly. While bitcoin's value may rise, investors must assess their risk appetite and understand the nuances of this unique asset class. Remember Sam Bankman and the FTX debacle?\n\nJoydeep Sen is a corporate trainer (financial markets) and author."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvc2VjLWhhY2tlZC1iaXRjb2luLWV0ZnMtZ28tbGl2ZS12ZW5lenVlbGEtc2h1dHMtZG93bi1wZXRyby1ob2RsZXJzLWRpZ2VzdC1qYW4tNy0xMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Venezuela shuts down Petro, SEC's X account hacked, Bitcoin ETFs go live: Hodler's Digest, Jan. 7-13 - Cointelegraph",
        "content": "Top Stories This Week\n\nSpot Bitcoin ETF receives official approval from the SEC\n\nThe U.S. Securities and Exchange Commission has officially approved the United States’ first regulated spot Bitcoin exchange-traded funds. On Jan. 10, the regulator approved applications from ARK 21Shares, Invesco Galaxy, VanEck, WisdomTree, Fidelity, Valkyrie, BlackRock, Grayscale, Bitwise, and Franklin Templeton — just one day after a false announcement posted from the SEC’s official Twitter account wreaked havoc on markets. The first day of trading reached more than $4.5 billion in total volume across ten ETFs, with Grayscale Bitcoin Trust as a top performer, handling $2.3 billion in volume on day one.\n\nSEC did not have 2FA enabled: X safety team on fake Bitcoin ETF post\n\nThe U.S. SEC did not have two-factor authentication enabled on its main X account, allowing a hacker to gain access to it and publish a false approval of a spot Bitcoin exchange-traded fund (ETF). According to X (formerly Twitter), an unidentified actor gained control of the phone number associated with the account and used that to gain access to the SEC’s official X page. This type of hack is commonly known as a SIM swap. The security breach was followed by requests from senators calling on the SEC to provide a report to Congress within the next few days. The Federal Bureau of Investigation is investigating the security incident.\n\nVenezuela’s unlucky petro coin to shut down Jan. 15 after 6 years: Report\n\nVenezuelan national cryptocurrency the Petro will cease to operate on Jan. 15, according to press reports. The coin was created in 2018 to help the country evade United States sanctions but was never widely used. The state-run, oil-backed crypto was launched after the country’s fiat currency, the bolivar, declined sharply under pressure from United States sanctions and after Bitcoin had already gained a firm foothold in the country. The Petro was not a central bank digital currency (CBDC). The Central Bank of Venezuela announced plans to create a CBDC in 2021, but those plans never came to fruition.\n\nSam Bankman-Fried retains new counsel ahead of sentencing hearing\n\nFormer FTX CEO Sam “SBF” Bankman-Fried has filed notice in federal court that he has retained a new counsel before his sentencing hearing for seven criminal charges. In a Jan. 9 filing, Torrey Young and Marc Mukasey of Mukasey Young LLP said they represented Bankman-Fried. SBF’s legal team also filed a sealed document, which could suggest a possible appeal to his November conviction. A jury found Bankman-Fried guilty on seven charges of fraud, conspiracy to commit fraud and conspiracy to commit money laundering last October. His sentencing is scheduled for March 28, overseen by Judge Lewis Kaplan in New York.\n\nUSDC issuer Circle files for IPO in the United States: Report\n\nCircle Internet Financial, the issuer of USD Coin, has filed for an initial public offering (IPO) in the United States, according to Reuters. The company expects the IPO to proceed after the U.S. Securities and Exchange Commission completes the review process, adding that this is still subject to market conditions. In 2021, Circle announced plans to go public through a merger with blank-check company Concord Acquisition Corp, initially valued at $4.5 billion. The transaction was later called off.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $43,619, Ether (ETH) at $2,528 and XRP at $0.57. The total market cap is at $1.7 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are Ethereum Name Service (ENS) at 72.21%, Ethereum Classic (ETC) at 45.25% and Sui (SUI) at 37.28%.\n\nThe top three altcoin losers of the week are Klaytn (KLAY) at -20.20%, THORChain (RUNE) at -10.88% and SATS (100SATS) at -10.64%.\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n“’Order granting [spot Bitcoin ETFs] accelerated approval’ it’s over. Thank God.”\n\nEric Balchunas, ETF analyst at Bloomberg\n\n“Our bull case, and we think the probability of the bull case has increased with this SEC approval, our bull case is $1.5 million by 2030.”\n\nCathie Wood, CEO of ARK Invest\n\n“While we approved the listing and trading of certain spot Bitcoin ETP shares today, we did not approve or endorse Bitcoin.”\n\nGary Gensler, chairman of the U.S. Securities and Exchange Commission\n\n“We believe that tokenisation has the potential to revolutionise the way investments are managed and traded.”\n\nVictor Jung, head of digital assets at Hamilton Lane\n\n“The steps taken today are a significant improvement over the SEC’s track record of regulation by enforcement.”\n\nPatrick McHenry, U.S. representative\n\n“We believe crypto values are American values. Blockchain technology has demonstrated the potential to enhance financial inclusion […] and provide new wealth-building opportunities outside of Wall Street.”\n\nKristin Smith, CEO of the Blockchain Association\n\nPrediction of the week\n\nBitcoin price sells-off after ETF approval — Have investors turned bearish?\n\nBitcoin price dropped by 6.8% between Jan. 11 and Jan. 12, confirming bears’ theory of a sell-the-news-style event occurring after the approval of a spot Bitcoin exchange-traded fund (ETF). The much-anticipated event ensued after a 75% rally in the 90 days leading to the initial trading on Jan. 11. This partially explains the lack of excitement and the subsequent price correction down to $43,180.iN\n\nTraders are now questioning whether investors are becoming bearish after multiple failed attempts to break above $47,000 in the last week. On one hand, there is some rationale behind the fear, meaning market makers and whales that tried to front-run the spot ETF issuers by buying ahead of the launch might be forced to sell at a loss — if this hypothesis is valid. Furthermore, Bitcoin miners might feel pressured to sell some of their holdings given that the halving is less than 100 days away.\n\nThere’s uncertainty about how spot Bitcoin ETFs will perform after weekends due to possible market volatility. Inadequate information about how the ETFs work might lead to panic sell, contributing to recent price declines in the cryptocurrency market.\n\nFUD of the Week\n\nApple India blocks Binance, 9 other crypto exchanges weeks after FIU notice\n\nApple’s App Store in India has blocked Binance, KuCoin, Bitget, Huobi, OKX, Gate.io and MEXC crypto exchange apps weeks after the Indian government issued a noncompliance notice against nearly a dozen off-shore crypto exchanges. These exchange applications are no longer accessible to new users in India. The Indian Ministry of Finance’s Financial Intelligence Unit issued a notice to the exchanges in late December for illegally operating in the country.\n\nVanguard users threaten to close accounts after firm blocks spot Bitcoin ETFs\n\nAsset manager Vanguard said it won’t offer the new spot Bitcoin ETFs on its brokerage platform as they do not align with its traditional offerings, pushing some customers toward the exit door. “Spot bitcoin ETFs will not be available for purchase on the Vanguard platform,” it said in a statement to The Wall Street Journal. The company, however, has significant indirect exposure to Bitcoin as it is one of the largest shareholders of MicroStrategy. The stock is also available through at least five mutual funds offered by Vanguard.\n\nEthereum devs air concern over Vitalik’s plan to increase gas limit\n\nEthereum co-founder Vitalik Buterin is advocating for a “modest” 33% gas limit increase to potentially improve network throughput. His proposal includes increasing the gas limit to 40 million from the current 30 million, claiming it would allow more transactions for each block, theoretically increasing the overall throughput and capacity of the network. Ethereum developers, node operators and users, however, have yet to agree on that suggestion, which may have adverse effects on the network.\n\nTop Magazine Pieces of the Week\n\nMakerDAO’s plan to bring back ‘DeFi summer’ — Rune Christensen\n\n“We want to bring back DeFi summer, but this time, it’s not going to end, and it’s not going to go to zero.”\n\n6 Questions for 20-year-old Sellix founder Daniele Servadei\n\nDaniele Servadei, the 20-year-old founder of payments firm Sellix, spoke to Cointelegraph about his experience in the cryptocurrency industry.\n\nWeb3 Gamer: 1 trillion Notcoins farmed, Neopets meets ICP, Trickshot Blitz is awesome\n\nThe Sandbox co-founder expects a Web3 gaming boom with traditional companies joining in, while Neopets co-founder urges industry innovation."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaXRjb2luLWFuZC1ldGhlcmV1bS1lY2hvLXByZXZpb3VzLWJ1bGwtbWFya2V0LXBhdHRlcm5zLXdpdGgtNTAwLTEwMDAtc3VyZ2VzL9IBamh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaXRjb2luLWFuZC1ldGhlcmV1bS1lY2hvLXByZXZpb3VzLWJ1bGwtbWFya2V0LXBhdHRlcm5zLXdpdGgtNTAwLTEwMDAtc3VyZ2VzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin and Ethereum Echo Previous Bull Market Patterns with 500%-1,000% Surges - CryptoPotato",
        "content": "Bitcoin (BTC) and Ethereum (ETH) are currently following a pattern similar to previous years, during which their prices surged by 500% and 1,000%, respectively, according to the latest research report by Coinbase Research and Glassnode.\n\nThe observation draws parallels between the ongoing crypto market cycle and the period from 2018 to 2022, characterized by substantial price increases in both cryptocurrencies.\n\nBitcoin Halving’s Potential Impact on Crypto Markets\n\nAnalysts highlight various cyclicality metrics, such as net unrealized profit/loss and supply in profit, which mirror past trends. These metrics indicate that the present state of the crypto markets doesn’t mirror the euphoric conditions seen during the peak of 2023. It suggests there might still be potential for the market to experience further surges.\n\nDespite acknowledging the potential positive impact of the forthcoming Bitcoin halving, Coinbase Research is cautious.\n\nThe paper noted a lack of robust supporting evidence and characterized the relationship between the halving and market performance as somewhat speculative.\n\nThe research points out that, with only three halving events historically, there isn’t a fully established pattern, especially considering previous events were influenced by factors like global liquidity measures.\n\nThe upcoming Bitcoin halving, projected to occur in April 2024 based on current mining rates, will reduce the block reward from 6.25 to 3.125 BTC.\n\nAnalyzing Ethereum’s Market and Upcoming Upgrade\n\nIn 2023, the Ethereum (ETH) price surged by over 90%, driven by several factors, such as the success of the Shapella upgrade and the increasing likelihood of approval for spot crypto ETFs. Market participants were encouraged by these developments, contributing to the increase in the ETH value.\n\nLooking ahead, analysts are focusing on the upcoming Ethereum upgrade named Cancun. It is expected to enhance scalability and security to make layer-2 transactions as cost-effective as possible.\n\nThe successful implementation of Cancun could potentially lead to a significant increase in the number of processed transactions on the Ethereum network.\n\nCoinbase’s analysis notes that Bitcoin and Ethereum have undergone two cycles, encompassing both bull and bear markets. The ongoing cycle, initiated in 2022, closely mirrors the patterns observed in the preceding ones."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vcmVmcmVzaG1pYW1pLmNvbS9ldmVudC9iaXRjb2luLWJydW5jaC1taWFtaS8yMDI0LTAxLTE0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Brunch Miami - Refresh Miami",
        "content": "A local meetup for Bitcoiners, by Bitcoiners. Come and enjoy delicious food and even better conversations! Every Sunday from 10am-3pm+\n\nA local meetup for Bitcoiners, by Bitcoiners. Come enjoy delicious food and even better conversations. There’s always something to learn at Bitcoin Brunch!\n\nEvery Sunday from 10am-3pm; sometimes later if the vibes are right\n\nNaomi’s Garden Website & Menu\n\n“My mother Naomi, she cooked for 4 and fed 40. Now her name feeds thousands and her generosity continues” – Yaron Yemini (Featured in the Miami Herald & the New Tropic )\n\nFor collaborative inquiries, please contact [email protected] / [email protected]\n\nFollow the Bitcoin Brunch Network on Twitter\n\nJoin the Global Bitcoin Brunch Network Telegram\n\nLooking to start a Bitcoin Brunch in your area? Already have one? We’d love to collaborate! Submit a brunch, or contact us on any social channel! https://linktr.ee/bitcoinbrunch"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmcy1jb3VsZC1iYWQtY3J5cHRvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Why Spot Bitcoin ETFs Could Be Bad for Crypto - CCN.com",
        "content": "Key Takeaways\n\nAfter years of delay and denial, the SEC has finally approved the first 11 spot Bitcoin ETFs.\n\nThese new financial products offer investors an easy way to get exposure to Bitcoin.\n\nBut their launch (and likely success) complicates the narrative that Bitcoin is the future of money.\n\nThe long-awaited approvals of spot Bitcoin exchange-traded funds (ETFs) by the SEC this week is being hailed as a milestone event that will open cryptocurrencies to mainstream investors. But while the newfound accessibility is a boon for short-term prices, these ETFs may undermine the founding principles that make cryptos like Bitcoin (BTC) unique and interesting in the first place.\n\nThis Is Not Decentralization, to Put It Mildly\n\nBy packaging Bitcoin into a regulated financial product traded on stock exchanges, ETFs effectively turn the cryptocurrency into just another asset class for portfolio diversification. Great for your run-of-the-mill investor, sure. But for those who saw Bitcoin as the future of money, excitement about ETFs is kind of missing the point.\n\nFundamentally, this financialization clashes with Bitcoin’s original purpose as a decentralized digital currency outside the traditional financial system. It concentrates ownership under a few large asset managers (BlackRock etc.) instead of a broad network of distributed users. And it places trust in intermediary institutions over the sovereignty of individuals.\n\nThe iShares Bitcoin Trust $IBIT begins trading on @Nasdaq TODAY 💥, underpinned by @BlackRock 's 20+ years of experience and supported by the same technology and risk management expertise offered to institutional investors: https://t.co/GFqpaInEar . https://t.co/k8T5SqwKlE — BlackRock_News (@BlackRock_News) January 11, 2024\n\nFor anyone familiar with crypto’s ethos of decentralization and disintermediation, this is not part of the master plan. But what’s the problem? ETFs themselves aren’t changing anything about Bitcoin itself. The high ideals of crypto aren’t going anywhere, right?\n\nBitcoin Go Up\n\nImportantly, while ETFs provide an easier on-ramp for new investors, they also shift the narrative around Bitcoin itself.\n\nExcitement over these new funds is focused almost entirely on the potential for price appreciation, rather than enthusiasm for the technology or ideals behind cryptocurrencies. The innovations around digital wallets, blockchain-based transactions, and self-custody get overshadowed when Bitcoin becomes merely something to trade.\n\nAnd let’s be clear: the excitement around spot Bitcoin ETFs is because of a lack of patience, understanding and buy-in from “normal people” about self-custody. It is because of the alternative that exchange-traded funds look so exciting. No more remembering private keys and seed phrases, just add ETF shares to your brokerage account, and done.\n\nThis shift threatens to turbocharge a narrative change that has already been underway for several years. As it continued to outperform expectations, Bitcoin went from a revolutionary monetary system into just another speculative asset class. Instead of using Bitcoin as decentralized peer-to-peer cash, most investors will simply buy and sell paper claims on the coins.\n\nThe aspects that made Bitcoin unique become abstracted away, as market participants care more about chasing profits than advancing a new financial paradigm.\n\nIt’s true that the first application for a spot Bitcoin ETF was made in 2013. If, hypothetically, it had been approved, the ETF would exist in a world less primed to regulate the cryptocurrency (in part, because everyone knew a lot less about it). But, we’re in 2024, and Bitcoin is now a finance story, not a tech one. Perhaps if approval was granted earlier things could have been different. C’est la vie.\n\nUS Lawmakers Are Already Coming for Bitcoin\n\nSome argue that increased investment inflows will help fund Bitcoin’s development in the long run. But much of that capital will flow towards centralized institutions antithetical to Bitcoin’s ethos. And as volatile price swings draw more speculative manias, the likelihood of overregulation only increases.\n\nPerhaps the Bitcoin dream is already on its way to being over. In December, US lawmakers took aim at the decentralization and pseudonymity that has long been a core tenet of Bitcoin and the broader cryptocurrency industry.\n\nFor the sake of our national security, crypto firms should have to follow the same anti-money-laundering rules as other financial institutions. And I’ve got a bipartisan bill to make it happen. pic.twitter.com/k1Qz3ylYVz — Elizabeth Warren (@ewarren) December 8, 2023\n\nSenator Elizabeth Warren and Rep. Sean Casten introduced legislation in their respective chambers that would subject cryptocurrency entities like wallet providers, miners, and validators to stringent anti-money laundering rules that currently apply to traditional financial institutions. Crypto industry advocates argue that imposing centralized oversight runs counter to cryptocurrencies’ raison d’être, but lawmakers believe tighter regulation is necessary to combat illicit financing and national security threats.\n\nWith bipartisan support growing, Congress may soon vote to approve controls that could fundamentally alter the legal and practical reality around digital assets. One thing is fairly certain though, the new holders of ETF shares probably won’t be the ones complaining. Many of them never cared in the first place."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzEzLzI0Ny1wZXJjZW50LWJpdGNvaW4tcHJpY2UtZXhwbG9zaW9uLWluY29taW5nLXNheXMtcmljaC1kYWQtcG9vci1kYWQtYXV0aG9yLWhlcmVzLWhpcy1vdXRsb29rL9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xMy8yNDctcGVyY2VudC1iaXRjb2luLXByaWNlLWV4cGxvc2lvbi1pbmNvbWluZy1zYXlzLXJpY2gtZGFkLXBvb3ItZGFkLWF1dGhvci1oZXJlcy1oaXMtb3V0bG9vay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "247% Bitcoin Price Explosion Incoming, Says Rich Dad Poor Dad Author – Here’s His Outlook - The Daily Hodl",
        "content": "Robert Kiyosaki predicts a six-figure price for Bitcoin (BTC) as regulators green light a series of spot exchange-traded funds (ETF) in the US.\n\nKiyosaki tells his 2.5 million followers on the social media platform X that he believes Bitcoin will skyrocket by 247% from its current level of $43,133 at time of publishing.\n\nThe Rich Dad Poor Dad author believes it will not take long for BTC to hit his big price target.\n\n“BITCOIN ETF. Yay! Glad I bought years ago. Bitcoin to $150,000 soon. Gold to the moon as central banks buy, store, and never sell. Silver to crash as silver stackers sell to pay bills, caused by rising inflation. Great news for silver stackers. Time to buy more as silver crashes.\n\nIt’s all good news except for losers who save fake fiat US dollars. I will be buying more gold, silver and Bitcoin with fake dollars.”\n\nThe Rich Dad Poor Dad author further says that he has acquired additional Bitcoin worth nearly $230,000 at the current market rate, owing to concerns over inflation in the US.\n\n“INFLATION or DEFLATION? What if the PhDs at the White House, the U.S. Treasury and the Federal Reserve put the economy into HYPERINFLATION? I hope not… but what if our leaders f**ck up, the dollar collapses and we have HYPERINFLATION?\n\nThat’s why I bought five more Bitcoin today. What are you going to do? Trust yourself, not our leaders. They’re losers with PhDs.”\n\nBitcoin is trading at $42,635 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9iaXRjb2luLXByaWNlLWRyb3AtYmVsb3ctNDNrLWhlcmVzLXdoYXQtbmV4dC1mb3ItYnRjLXByaWNlL9IBZGh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9iaXRjb2luLXByaWNlLWRyb3AtYmVsb3ctNDNrLWhlcmVzLXdoYXQtbmV4dC1mb3ItYnRjLXByaWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price Drop Below $43K ; Here’s What Next For BTC Price - Coinpedia Fintech News",
        "content": "Nidhi is a Certified Digital Marketing Executive and Passionate crypto Journalist covering the world of alternative currencies. She shares the latest and trending news on Cryptocurrency and Blockchain.\n\nBitcoin prices went down in the last two days after spot ETFs got approved. The prices kept going down, and today they went a bit below $43,000. What caused this drop in the Bitcoin market? Bitcoin expert Benjamin Cowen shared some thoughts about where the cryptocurrency market might be headed. He mainly focused on the idea that the price of Bitcoin could go down for a bit.\n\nCowen explained that he looks at certain lines on a chart to figure out what might happen next. One line is called the 20-week Simple Moving Average, and another is the 21-week Exponential Moving Average. These lines help him see trends in the market.\n\nCurrently, these lines suggest that Bitcoin might face a challenge around the $36,000 mark. Cowen pointed out that historically, around mid-January, the price of Bitcoin tends to go through a bit of a correction or drop.\n\nHe mentioned that predicting exact prices is tough, but he said it’s crucial to keep an eye on a level around $42,000. Cowen reminded viewers that predicting short-term price action is challenging but suggested monitoring the 20-week SMA, which sits at $42,000. A weekly close below this level could increase the likelihood of revisiting the bull market support band.\n\nCowen shared some historical examples to show that Bitcoin has gone through similar patterns before. He talked about the possibility of a slow rise in price followed by a dip, similar to what happened in the past.\n\nThe video also touched on something called logarithmic regression bands, which are fancy words for more lines on a chart. According to Cowen, Bitcoin is getting close to a level that could be important, so he suggested being cautious about a possible drop in price."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9idGMtdHVtYmxlcy1iZWxvdy00NGstYml0Y29pbi0xNzIxMDI4NTkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "BTC Tumbles Below $42K, Coinbase and Miners Plunge as Bitcoin ETF Mania Becomes 'Sell the News' Rout - Yahoo Finance",
        "content": "Bitcoin tumbled below $42,000 in a Friday sell-off with cryptocurrency-focused stocks plummeting as Thursday's bitcoin ETF euphoria turned into a market rout.\n\nThe $42,000 level is a significant support where prices may bounce from with potential buyers stepping in, crypto research firm Swissblock said.\n\nBitcoin [BTC] dropped below $42,000 on Friday, plunging almost 10%, as the euphoria over the bitcoin ETFs approved this week gave way to a massive rout.\n\nBitcoin had been as high as $46,000 earlier Friday and surged to a two-year high of $49,000 on Thursday, when bitcoin ETFs began trading in the U.S. But the heady prices didn't last long.\n\nShares of Coinbase (COIN), the crypto exchange that provides vital custody services to most of the ETF issuers, lost 7.4% on Friday. Bitcoin miners Marathon Digital (MARA), Hut 8 (HUT) and Riot Platforms (RIOT) all sank at least 10%; Marathon fared worst, slumping 15%.\n\nRead more: Grayscale, BlackRock Top Bitcoin ETF Volume Ranking as Products Debut\n\nThe declines happened a day after spot bitcoin exchange-traded funds (ETFs) began trading, marking a significant milestone for the industry. Bitcoin ETFs are traditional financial vehicles that may give retail and institutional investors alike easier exposure to bitcoin's price.\n\nFriday's price declines may not be a surprise; research firm CryptoQuant predicted last month that bitcoin would fall to as low as $32,000 in the next month after an ETF approval, being a \"sell the news\" event.\n\nNotably, previous landmark events such as Coinbase's stock market listing in April 2021 and ProShares' futures-based bitcoin ETF (BITO) debut in October 2021 happened near a significant peak in crypto prices, possibly foreshadowing cooling prices ahead.\n\nRead more: Bitwise, Fidelity, BlackRock See Biggest Bitcoin ETF Inflow in Preliminary Tally\n\nWhat's next for bitcoin price\n\nBitcoin posted a massive 80% rally since early October without significant pullbacks to a hit a two-year high as anticipation increased to a fever pitch into Thursday's spot bitcoin ETF launch, a significant milestone for the digital asset industry that expands investor access to the largest crypto asset.\n\nStory continues\n\nCrypto research firm Swissblock noted in a Friday market report that the last leg of the bitcoin rally to $49,000 into Thursday's bitcoin ETF launch showed signs of running out of fuel, with sellers stepping in above the $47,500 price level.\n\nBitcoin price momentum (Swissblock)\n\n\"The recent dynamics in bitcoin have not lived up to the expectations set by many bitcoin maximalists, with the asset failing to break the $50k mark, and the hype surrounding ETFs showing signs of cooling down,\" Swissblock analysts wrote. \"The critical question now is whether the market can sustain upward momentum.\"\n\nThe $42,000 price level forms a significant liquidity zone where bitcoin may bounce from as buyers might enter the market, the report explained. If this support level falters, the next key zone to watch is the \"CME gap\" at $40,000, it added.\n\nUPDATE (Jan. 13, 12:56 UTC): Adds analyst comment about price action."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tYml6LWJpdGNvaW4tZXRmcy10b2tlbml6YXRpb24tcmlwcGxlLWJ1eWJhY2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Crypto Biz: Bitcoin ETFs debut, asset tokenization, Ripple's buyback and more - Cointelegraph",
        "content": "Ten years after Cameron and Tyler Winklevoss first applied to launch the Winklevoss Bitcoin Trust in 2013, a spot Bitcoin (BTC) exchange-traded fund (ETF) has finally launched in the United States. The U.S. Securities and Exchange Commission approved nine ETF applications from several major asset management firms on Jan. 10.\n\nMarket analysts anticipate an investment inflow of around $10 billion to the ETFs in 2024. The historic decision cements the status of Bitcoin as a legitimate asset and sets the stage for a range of derivative investment products, including potential leveraged and short Bitcoin ETFs.\n\nAside from that, the decision can potentially strengthen Bitcoin’s role within the decentralized finance (DeFi) space, particularly as a collateral asset, creating opportunities to further integrate the crypto industry with traditional financial markets.\n\nHowever, the ripple effects of this development may be felt far beyond financial markets.\n\nThe nod from the U.S. regulator represents a landmark moment for BTC’s broader adoption and recognition, symbolizing a shift transcending the cryptocurrency and its underlying blockchain technology. Moments like these can reshape our economic system, alter perceptions of trust and open up a new yet-to-be-imagined world of possibilities.\n\nAs expected, crypto enthusiasts had been on a rollercoaster over the past few days. For those who may have missed something amid the Bitcoin ETF frenzy, this week’s Crypto Biz also explores Brevan Howard and Hamilton Lane tokenizing assets, Ripple’s buyback, Core Scientific’s oversubscribed equity offering and Grayscale’s funds rebalance.\n\nSpot Bitcoin ETF trading volume surpasses $1.6 billion within minutes of launch\n\nBitcoin spot exchange-traded funds (ETFs) were off to a remarkable start as trading officially began on Jan. 11 with a total volume of around $1.6 billion just minutes after the opening bell. The movement comes on the heels of the United States Securities and Exchange Commission’s approval of the first spot Bitcoin ETFs. As of the opening of trading, Grayscale (GBTC), BlackRock (IBIT), Fidelity (FBTC) and Ark (ARKB) topped the list of BTC ETFs traded.\n\nBrevan Howard, Hamilton Lane to tokenize assets through Libre protocol\n\nBrevan Howard and Hamilton Lane will be the first asset managers to tokenize assets on the upcoming Web3 infrastructure provider Libre protocol — backed by Brevan Howard’s WebN and Nomura’s Laser Digital. Libre is scheduled to go live in the first quarter of 2024, offering asset tokenization and smart contracts through the Polygon network, supporting collateralized lending and automated rebalancing of separately managed accounts. As for Brevan Howard, known for its focus on macroeconomic trading strategies, Libre will allow tokenization of its portfolio of illiquidity assets, whereas Hamilton Lane will use the protocol for fixed-income products.\n\nRipple Labs to buy back $285 million stake in tender offer: Report\n\nRipple Labs is planning a tender offer to buy back a $285 million stake in the company from early investors and employees. The company plans to spend $500 million in the process. The budget includes the cost of converting restricted stock units to common shares. According to Reuters, investors will only be able to sell 6% of their holdings. The transaction will place the company’s valuation at $11.3 billion. Additional buybacks are anticipated as Ripple aims to provide an exit for early investors. Ripple’s CEO Brad Garlinghouse said the company has no plans to go public anytime soon in the U.S., where it is based, due to the country’s uncertain regulatory environment.\n\nRipple to buy back $285 million of its shares, valuing company at $11 bln - sources https://t.co/qK0NXKYRLt pic.twitter.com/maaeoF0TXN — Reuters (@Reuters) January 10, 2024\n\nGrayscale drops MATIC, adds AVAX, XRP in funds rebalance\n\nAsset manager Grayscale has rebalanced weights for three of its crypto funds, removing tokens such as Polygon’s (MATIC) and adding Avalanche (AVAX) and XRP (XRP), according to an announcement on Jan. 5. The new allocations are part of Grayscale’s quarterly review and impact its Digital Large Cap Fund (GDLC), DeFi Fund and Smart Contract Platform Ex-Ethereum Fund (GSCPxE Fund). Although MATIC was dropped from GDLC’s new composition, it remains in the GSCPxE Fund basket. As for Grayscale’s DeFi Fund, changes include the removal of the Curve DAO (CRV) token from the portfolio.\n\nBitcoin miner Core Scientific completes $55 million equity offering\n\nBitcoin miner Core Scientific has closed a $55 million equity financing round as it returns to solvency. According to the Jan. 8 announcement, the $55 million equity offering expired the week before and was oversubscribed. CEO Adam Sullivan stated that the funds raised, combined with the full repayment of their debtor-in-possession financing, positions the company to exit Chapter 11 bankruptcy by the end of January. As per the company’s latest financial disclosure from November 2023, Core Scientific had $2.3 billion in assets against $559 million in liabilities, resulting in a net equity of $1.8 billion. The company also intends to reenter the Nasdaq stock exchange following the completion of its bankruptcy proceedings.\n\nCrypto Biz is your weekly pulse on the business behind blockchain and crypto, delivered directly to your inbox every Thursday."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzE0L2ZvcmdldC1iaXRjb2luLWV0ZnMtYnV5LXRoaXMtbm8tYnJhaW5lci1ldGYtaW5zdGVhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Forget Bitcoin ETFs: Buy This No-Brainer ETF Instead - The Motley Fool",
        "content": "The first exchange-traded funds tracking the spot price of Bitcoin (BTC -6.98%) began trading last week after the U.S. Securities and Exchange Commission gave the go-ahead. Investors will no longer need to pay sky-high transaction fees at a cryptocurrency exchange like Coinbase. Instead, numerous low-fee Bitcoin ETFs now provide no-fuss access to the digital asset.\n\nThe SEC approved 11 separate Bitcoin ETFs, many of which are waiving fees for some time as they battle for market share. One of those ETFs is Grayscale Bitcoin Trust, which operated under a more complex structure with high fees before it converted to an ETF following SEC approval. Fees on these new Bitcoin ETFs will range from 0.2% to 1.5% excluding waivers.\n\nA speculative asset\n\nWith Bitcoin now available in ETF format backed by well-known players including Fidelity and BlackRock, the digital currency gains some much-needed legitimacy. The cryptocurrency industry has been rocked by fraud and scandal over the past few years. Trusting a cryptocurrency exchange after FTX was revealed to be a fraud and Binance pleaded guilty to Federal money laundering charges is likely a tough sell for many investors.\n\nWhile it's now much easier and cheaper to invest in Bitcoin, that doesn't mean the pioneer cryptocurrency is a good investment. After nearly 16 years of existence, Bitcoin has yet to find a wide-scale, real-world use outside of criminal enterprises. And as a gold-like asset meant to protect investors against inflation, it suffers the same shortcomings as the shiny yellow metal.\n\n\"...the one thing I'm pretty sure of is that it doesn't produce anything,\" said billionaire investor Warren Buffett in 2022 regarding Bitcoin. \"Assets, to have value, have to deliver something to somebody,\" Buffett continued.\n\nAn ETF alternative\n\nInvestors can use these new Bitcoin ETFs to speculate on the price of Bitcoin, but as long-term investments, they carry incredibly high risks. Sticking a speculative asset backed by nothing but the Greater Fool Theory in a different type of investment vehicle doesn't reduce risk.\n\nFor investors who want to own assets that produce something, an ETF that tracks the S&P 500 is a great option. There are plenty available, but the Vanguard S&P 500 ETF (VOO -0.22%) is one of the most popular.\n\nThe Vanguard S&P 500 ETF aims to replicate the performance of the S&P 500 index, which contains 500 of the largest U.S.-listed companies. Buying a share of the ETF buys you a small stake in each of those companies. Unlike Bitcoin, which does nothing, a company generates cash flow by selling products and services, then uses that cash flow to invest in assets that will generate even more cash flow. Some companies pay investors a dividend, giving them a direct share of its profits.\n\nThe Vanguard S&P 500 ETF gives investors a highly diversified mix of stocks for a rock-bottom expense ratio of 0.03%, nearly seven times lower than the cheapest Bitcoin ETF. Since inception in 2010, the Vanguard S&P 500 ETF has delivered an annualized return of just under 14%. That's historically high, so returns going forward may not be quite as lucrative. But as U.S. companies grow sales and expand profits in the years ahead, this ETF allows investors to share in that success.\n\nThe cryptocurrency industry has entered a new era with the approval of the first Bitcoin ETFs. While investors can now buy Bitcoin with the same ease with which they buy stocks, and without the excessive fees, Bitcoin is no better as an investment than before the ETF approval. I agree with Buffett: Bitcoin is a purely speculative asset with no intrinsic value. Long-term investors would do well to choose the Vanguard S&P 500 ETF instead."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LndoYXRiaXRjb2luZGlkLmNvbS9wb2RjYXN0L3RoZS1hcnJpdmFsLW9mLWJpdGNvaW4tZXRmc9IBTWh0dHBzOi8vd3d3LndoYXRiaXRjb2luZGlkLmNvbS9wb2RjYXN0L3RoZS1hcnJpdmFsLW9mLWJpdGNvaW4tZXRmcz9mb3JtYXQ9YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "The Arrival of Bitcoin ETFs with James Seyffart & Alex Thorn - What Bitcoin Did",
        "content": "James Seyffart is an analyst for Bloomberg Intelligence covering ETFs, and Alex Thorn is the Head of Firmwide Research at Galaxy. In this interview, we explore the implications of the recently launched Bitcoin ETFs. We delve into the mechanics of ETF trading, analyse how ETFs might reduce Bitcoin's volatility, and speculate on the future introduction of Ethereum ETFs and their potential effects.\n\n- - - -\n\nThere’s an old joke about waiting ages for a bus only for three to finally arrive at once. Well, after a decade of submissions, arguments and delays, 11 Bitcoin spot ETFs were given the green light by the SEC on Wednesday 10th January, then launched onto the market on Thursday 11th January where they attracted $4.6 billion in investment. This broke records for ETF investment. I have had the chance to speak to Alex Thorn and James Seyffart about this seismic event.\n\nBut what exactly are Bitcoin ETFs, and how do they function? In essence, these financial instruments allow investors to buy and sell shares that represent a certain amount of Bitcoin, so individuals can invest in Bitcoin without the complexities of directly buying, storing, and securing the asset. The value of each share is pegged to a fraction of a Bitcoin, making it more accessible to retail traders and opening the door for a broader audience to participate in the Bitcoin market.\n\nOne of the most intriguing aspects of Bitcoin ETFs is their potential to dampen the volatility of Bitcoin's spot market. A substantial portion of Bitcoin will now be held in advisor accounts, which are not prone to frequent trading. This shift could lead to more stability in the market, as Bitcoin is placed in \"stronger hands.\" Bitcoin ETFs might also alter the pattern of surges in altcoin prices, as Bitcoin becomes less readily available for quick trades into other cryptocurrencies.\n\nThe revolutionary nature of Bitcoin and its potential to empower individuals cannot be overstated. We reflected on the need for broader support from institutions and investors to unlock Bitcoin's full potential. Regulatory challenges, such as proposed AML legislation, pose significant hurdles that could impact competitiveness, market growth and restrictions on Bitcoin's use. It's crucial therefore for ETF issuers to promote the true value of Bitcoin and oppose restrictive legislation."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0ZnMtYXR0cmFjdC0xLWJpbGxpb24tdHdvLXRyYWRpbmctc2Vzc2lvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs attract $1.4B in two trading sessions - Cointelegraph",
        "content": "The newly launched spot Bitcoin (BTC) exchange-traded funds (ETFs) have seen inflows totaling $1.4 billion in the first two trading sessions, according to Bloomberg ETF analyst Eric Balchunas.\n\nA total of 500,000 trades were made on the funds, amounting to a volume of $3.6 billion, according to data from Bloomberg. Trading volume considers the outflows and inflows from the funds. Balchunas suggested the numbers may be adjusted due to transactions awaiting accounting settlement.\n\nLATEST: With two days in the books, the Nine Newborns have taken in +$1.4b in new cash, overwhelming $GBTC's -$579m of outflows for net total of +$819m. $IBIT now leading pack w/ half a bil, Fidelity close second tho. The newborns' $3.6b in trading volume on 500k indiv trades… pic.twitter.com/b7U5DjENaw — Eric Balchunas (@EricBalchunas) January 13, 2024\n\nThe data reveals Grayscale’s ETF, the Grayscale Bitcoin Trust (GBTC), experienced an outflow of $579 million during the period. After deducting the outflows from GBTC, the net total inflows across the products stood at $819 million. The initial activity is in line with previous predictions from ETF analyst James Seyffart, who believes Bitcoin ETFs could attract around $10 billion in their first year.\n\nGBTC outflows could be explained by holders converting shares after redemption was opened after the United States Securities and Exchange Commission (SEC) granted the ETF approval through a ruling change. SkyBridge Capital founder Anthony Scaramucci told Bloomberg that some GBTC holders are booking losses and switching to lower fee options.\n\nGBTC is one of the largest holders of Bitcoin (BTC), managing over $27 billion worth of the cryptocurrency as per data from the blockchain analytics platform Arkham Intelligence. Shares of GBTC have been traded since 2013 but were not redeemable for Bitcoin until Jan. 11.\n\nTopping the week’s performance was BlackRock’s iShares Bitcoin Trust with $497.7 million total flows, followed by Fidelity Advantage Bitcoin ETF amassing $422.3 million and Bitwise attracting $237.9 million.\n\nAfter a 75% rally in the 90 days leading up to ETFs approval, Bitcoin price experienced a 6.8% decline between Jan. 11 and Jan. 12, confirming a sell-the-news-style event following the SEC green light, according to Cointelegraph’s market analysis. The cryptocurrency trades at $42,856 at the time of writing, a 0.77% decline over the past 24 hours.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xMy9jcnlwdG8tYmVhci1pc3N1ZXMtdXJnZW50LWJpdGNvaW4td2FybmluZy1zYXlzLWJ0Yy10by1wdW1wLWJlZm9yZS1yZXZlcnNpbmctYW5kLWR1bXBpbmctaGVyZXMtaGlzLW91dGxvb2sv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzEzL2NyeXB0by1iZWFyLWlzc3Vlcy11cmdlbnQtYml0Y29pbi13YXJuaW5nLXNheXMtYnRjLXRvLXB1bXAtYmVmb3JlLXJldmVyc2luZy1hbmQtZHVtcGluZy1oZXJlcy1oaXMtb3V0bG9vay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Crypto Bear Issues Urgent Bitcoin Warning, Says BTC To Pump Before Reversing and Dumping – Here’s His Outlook - The Daily Hodl",
        "content": "A widely followed crypto trader is warning that Bitcoin (BTC) could soon undergo an abrupt bearish trend reversal within days.\n\nPseudonymous trader and crypto bear Capo tells his 792,900 followers on the social media platform X that Bitcoin could soon collapse to as low as $30,000.\n\n“Update.\n\nBTC reached $48,000-$50,000 and ETH $2,500-$2,600. A last pump to $50,000 is possible. Then BTC should go sideways while altcoins pump more (money flowing to low caps). After a few days, the entire market should reverse and dump.”\n\nLooking at his chart, the trader uses the Elliott Wave theory, which states that the main trend of an asset’s price moves in a five-wave pattern while a correction occurs in a three-wave pattern.\n\nAccording to Capo, the fifth wave could catapult Bitcoin to $50,000, which may lead to capital rotation into altcoins. The analyst also says that Bitcoin might then fall to the $30,000 to $31,000 range, which could hold as support and lead to a possible price bounce above $33,000.\n\nEarlier this week, Capo predicted that the crypto market would rally on the news of the U.S. Securities and Exchange Commission (SEC) approving spot Bitcoin exchange-traded funds (ETFs). He predicted that the crypto market would top out after the rally, see a bearish trend reversal and print new cycle lows.\n\n“After this, which should take a few days, the market should reach a very important local top. That’s when I will start opening swing short positions, aiming for new lows.”\n\nBitcoin is trading for $42,596 at time of writing, down nearly 7.44% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xNC9hbmFseXN0LXByZWRpY3RzLWFicnVwdC1iaXRjb2luLWJ1bGxpc2gtcmV2ZXJzYWwtc2F5cy1idGMtbWF5LXdpdG5lc3Mtc2hvcnQtc3F1ZWV6ZS1hZnRlci1yZWNsYWltaW5nLXRoaXMtbGV2ZWwv0gGVAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzE0L2FuYWx5c3QtcHJlZGljdHMtYWJydXB0LWJpdGNvaW4tYnVsbGlzaC1yZXZlcnNhbC1zYXlzLWJ0Yy1tYXktd2l0bmVzcy1zaG9ydC1zcXVlZXplLWFmdGVyLXJlY2xhaW1pbmctdGhpcy1sZXZlbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Analyst Predicts Abrupt Bitcoin Bullish Reversal, Says BTC May Witness Short Squeeze After Reclaiming This Level - The Daily Hodl",
        "content": "A closely followed crypto strategist believes that Bitcoin (BTC) is on the verge of a big rally to a new two-year high.\n\nPseudonymous analyst Credible Crypto tells his 364,900 followers on the social media platform X that Bitcoin is primed for a bullish reversal.\n\nAccording to the analyst, BTC’s abrupt corrective move to a seven-day low of $42,449 flushed out overleveraged traders, putting BTC in a position to rally to $55,000 – a level last seen in December 2021.\n\n“Lows taken, funding reset back to neutral, perpetual premium flat again, and a bit of an open interest flush from some levered longs. This is where I want to watch for a reversal back to the upside.”\n\nCredible Crypto notes that Bitcoin could witness a short squeeze if BTC moves above $44,000.\n\nA short squeeze happens when traders who borrow an asset at a certain price in hopes of selling it for lower to pocket the difference are forced to buy back the assets they borrowed as momentum moves against them, triggering further rallies.\n\nSays Credible Crypto,\n\n“If we can get back above $44,000, shorts should squeeze and take care of the rest, sending us back to $47,000+.”\n\nCredible Crypto is not the only analyst who believes that BTC can ignite a rally above $47,000. Trader Justin Bennett tells his 110,700 followers on the social media platform X that Bitcoin is currently consolidating within a wide range for now.\n\n“BTC just tested $41,240 support.\n\nStill a matter of whether it can reclaim $44,000 for a run at $48,000.\n\nRange-bound for now.”\n\nAt time of writing, Bitcoin is worth $43,052.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvLm5ld3Mvc3BvdC1iaXRjb2luLWV0ZnMtc2hvdy1zdHJvbmctcGVyZm9ybWFuY2UtYXBwcm92YWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Spot Bitcoin ETFs show strong performance after approval - crypto.news",
        "content": "Two days after approval, spot Bitcoin exchange-traded funds (ETFs) are receiving an impressive amount of inflow, according to data from BitMEX Research.\n\nThe analytics company reported a total net inflow of $532 million for spot Bitcoin ETFs, with BlackRock IBIT leading the pack at $498 million. Fidelity’s FBTC followed at $422 million, and 21 Shares’ ARKB posted a net inflow of $105 million.\n\nBitcoin Spot ETF Flow – Day 2 UPDATE\n\n\n\nFlow number for Blackrock now in. Blackrock had $386m of inflow. This gives Blackrock almost $500m of inflow in the first 2 days, likely putting it in the lead https://t.co/N0jYEQpgdg pic.twitter.com/xGzY8jvblO — BitMEX Research (@BitMEXResearch) January 13, 2024\n\nHowever, not all funds experienced gains. Grayscale’s GBTC saw a sizeable outflow of $579 million, including a $484 million outflow on the second day alone, as reported by Bloomberg analyst James Seyffart on X.\n\nBitwise posts impressive second day performance\n\nInterestingly, Bitwise was noted as the victor of the first day despite GBTC leading in terms of assets. Nonetheless, BitMEX Research suggested that GBTC might face significant outflows in the coming days, weeks, and months due to its hefty 1.5% fee.\n\nETF Day 1 Flow – UPDATE\n\n\n\nFinally the GBTC number is out. GBTC has $95m of outflow\n\n\n\nTotal net flow for the day into the new ETFs was $625.8m\n\n\n\nBitwise was the victor for day 1 pic.twitter.com/HFsqhjtvEt — BitMEX Research (@BitMEXResearch) January 12, 2024\n\nAs of the time of writing, other smaller players, including Hashdex and Valkyrie, were still waiting on precise data, while Fidelity had a solid second day, reeling in $195 million. BlackRock also reported a considerable $386 million inflow on the second day, taking its two-day total to nearly $500 million, which potentially places it in the lead.\n\nWhile these numbers are undoubtedly striking, Bloomberg analyst Eric Balchunas noted that today’s actions in GBTC won’t be reflected in the flow data until Tuesday night, reminding us that these numbers should capture Thursday’s action.\n\nImp note, most of this flow data comes T+0 but cr/rd recording takes time to get into shares out regardless, hence why IBIT could see blob of money tonight. Also, GBTC is T+1 so NONE of the activity from yest will be reflected in flows till Fri at earliest and poss Tue night. — Eric Balchunas (@EricBalchunas) January 12, 2024\n\nAs the dust settles, it will be intriguing to see how these numbers evolve and shape the narrative of spot Bitcoin ETFs.\n\nYou might also like: Grayscale moves $183m in BTC amid ETF fee competition\n\nSpot Bitcoin ETF approval sparks cutthroat competition\n\nThe U.S. Securities and Exchange Commission’s (SEC) approval of 11 spot Bitcoin ETFs this week, which included BlackRock’s iShares Bitcoin Trust and Grayscale Bitcoin Trust, has been a game-changer for the digital asset industry. This struggle has been ongoing for a decade in the race to attract investors.\n\nOne day after their approval, Bitcoin ETFs saw an impressive $4.6 billion in traded shares, marking a watershed moment in the cryptocurrency industry and pushing it closer to broader acceptance as a viable investment.\n\nHowever, this landmark approval also triggered a brutal battle for market dominance, with some firms cutting their fees below the U.S. ETF industry’s standard even before the launch.\n\nAs a case in point, after its ETF started trading, Valkyrie reduced its fees twice, finally settling at 0.25%, and waived these charges for the first three months. Franklin Templeton slashed its bitcoin ETF fee to a yet-unseen low of 0.19% and waived fees entirely on the product’s first $10 billion in assets until August.\n\nThe launch of these ETFs drove the price of Bitcoin (BTC) to its highest level since December 2021, with Bitcoin last standing at $46,303, marking an increase of 0.77%.\n\nAnalysts advise caution\n\nInvestors and market participants were keenly observing the price difference between buying and selling an ETF, commonly known as bid-ask spreads. ETFs with narrower spreads are typically considered more appealing.\n\nHowever, some traditional asset managers like Merrill Lynch and Vanguard have said they have no plans of allowing spot Bitcoin ETF trading, suggesting caution and reminding the crypto community that many still perceive cryptocurrencies as risky.\n\nDespite this cautiousness, several crypto asset managers who went all in on Bitcoin ETFs recorded impressive inflows on the first day of the product’s listing. Bitwise, for instance, reported that $240 million flowed into its spot Bitcoin ETF.\n\nFidelity and BlackRock received $227 million and $111.7 million, respectively. Franklin Templeton and 21 Shares registered inflows of $50.1 million and $65.3 million, respectively.\n\nValkyrie reported an inflow of $29.44 million on its first trading day alone, celebrating what CEO Leah Wald termed “a successful trading day.”\n\nRead more: Robinhood opens all 11 spot Bitcoin ETFs for trading\n\nFollow Us on Google News"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vYmxhY2tyb2NrLWNlby1sYXJyeS1maW5rLXNlZXMtYS1jYXNlLWZvci1zcG90LWV0aGVyZXVtLWV0Zi1idXQtd2lsbC1pdC1nZXQtYXBwcm92YWwtODQyNTc2OdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Blackrock CEO Larry Fink Sees A Case For Spot Ethereum ETF, But Will It Get Approval? - Investopedia",
        "content": "Key Takeaways Blackrock CEO Larry Fink said he \"sees value\" in an Ethereum ETF in a recent interview.\n\nBlackrock, Fidelity, VanEck, and others have already filed for spot Ethereum ETFs, with some of the final deadlines for decisions from the U.S. Securities and Exchange Commission (SEC) scheduled for May.\n\nA spot Ethereum ETF approval may be more problematic than was the case with bitcoin, as there is the potential for Ethereum's underlying crypto asset to be classified as a security.\n\nBlackrock (BLK) CEO Larry Fink may have generated momentum for a spot Ethereum exchange-traded fund (ETF). However, the approval for such a product will likely face a big regulatory hurdle.\n\n\"I see value in having an Ethereum ETF. As I said, these are just stepping stones towards tokenization,\" Fink said in an interview with CNBC Friday morning, just a day after the first spot bitcoin ETFs began trading in the U.S.\n\n\n\nWhy Fink's Comments Matter To An ETH ETF?\n\nBlackrock originally changed how people thought about whether a spot bitcoin ETF would even be possible when the financial titan filed for their own offering in June 2023. They now have their own spot Ethereum ETF proposal as well. Many of the other same financial institutions, such as Ark, and Fidelity, that saw their spot bitcoin ETF products launch on Thursday, have also filed for spot Ether ETFs with the SEC.\n\n\n\nVanEck is first in line for the potential approval of their spot Ethereum ETF product, with a final deadline for a decision from the SEC set for May 23rd.\n\n\n\nETH ETF May Face Regulatory Hurdles\n\nWhile ether is often lumped in with bitcoin (BTCUSD) as the two major blue chip crypto projects, there are concerns that a spot ether ETF approval could be a more complex proposal. Much of the uncertainty around such a financial product has to do with the potential classification of ether (ETHUSD), which is the underlying crypto asset of the Ethereum system, as a security.\n\nWhen asked whether the approval of a spot bitcoin ETF could open the door for other crypto asset ETF approvals, such as a spot Ethereum ETF, SEC Chair Gary Gensler stated, \"I look at what we did this week as its cabined to one non-security, commodity called bitcoin.\"\n\nThat said, Brown Rudnick Partner Preston Byrne says there may not be many regulatory roadblocks to a spot Ethereum ETF approval. \"So far, the only American regulator to assert that Ethereum is a security in an enforcement action is the NYAG's office,\" Byrne told Investopedia. \"Ethereum's possible status as an unregistered security is a minority view, especially given the fact that the Ethereum Foundation's 2014 sale of Ether is now well past the statute of limitations. I would expect diligent lawyering to address the point in required statutory investor disclosures, but would not expect too much more regulatory interference beyond that.\"\n\nBloomberg ETF Analyst Eric Balchunas has pegged the odds of a spot Ethereum ETF approval by May at 70%.\n\nNotably, futures-based Ether ETF products are already available for trade in the U.S. market. However, these offerings have not gained much traction and originally launched without much interest from traders."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvYml0Y29pbi1wcmljZS1zbGlwcy02LXRvLTQzNTAwLXNlbGwtdGhlLW5ld3Mtc3RyYXRlZ3ktYWN0aW9uL9IBXmh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvYml0Y29pbi1wcmljZS1zbGlwcy02LXRvLTQzNTAwLXNlbGwtdGhlLW5ld3Mtc3RyYXRlZ3ktYWN0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price Slips 6% to Hit $43500, Is Sell-the-News Strategy in Action? - CoinGape",
        "content": "After a decade-long wait, the First spot Bitcoin ETFs started trading in the US Market on Thursday witnessing a $4.5 billion in trading volume on its listing day. While this development triggered a notable uptick across the crypto market, the underlying asset BTC continues to suffer in uncertainty.\n\nOn Friday, the Bitcoin price experienced a swift 6% sell-off, plummeting to a daily low of $43,623. This decline occurred just one day following the launch of Spot Bitcoin ETFs, sparking debates about the validity of the ‘sell-the-news’ theory.\n\nadvertisement\n\nHealthy Retracement May Strengthen BTC Recovery\n\nA rising trendline acts as the first line of defense for Bitcoin buyers\n\nThe falling BTC price may witness demand pressure at $40000 and $37000 support level\n\nThe intraday trading volume in Bitcoin is $15.3 Billion, indicating a 2.1% loss.\n\nThe largest cryptocurrency by market cap Bitcoin has been under a strong recovery since mid-September when the price rebounded from $25,000. In just 4 months, the coin price recorded nearly 96% growth to hit a high of $49,000. While the recent launch of Spot Bitcoin ETF was expected to intensify the recovery trend the asset showed a struggle to sustain above the $48,000 mark.\n\nVeteran trader Peter Brandt recently shared some thought-provoking views on Bitcoin and its evolving market dynamics.\n\nBrandt, with his deep experience in stocks and futures, observes that a rush by the general public to buy into a market often signals a prime time for seasoned traders to sell off their holdings.\n\nHe points out that a core value of Bitcoin has been its independence from governmental control, standing apart from traditional financial systems that have failed in various ways. Yet, there’s an irony in how many in the Bitcoin community now see regulatory bodies and ETFs as key to their financial success.\n\nBrandt suggests that the potential approval of Bitcoin ETFs could turn into a quintessential ‘buy the rumor, sell the news’ scenario, reflecting a pivotal shift in the crypto market\n\nIs Bitcoin Price Poised For A Major Fall?\n\nFollowing a vigorous four-month rally, it was anticipated that Bitcoin price would undergo a period of retracement, a natural step to consolidate and rejuvenate its bullish momentum. As per the Fibonacci retracement tool, the BTC price is above the 23.6% FIB level, which is considered healthy for an established trend. Using the same tool, the falling BTC price may witness sufficient support at $40000 and $37000 which aligns with the 38.2% and 50% FIB levels.\n\nAny correction below this level would start to reflect weakness in market participants and strengthen the concerns of the Sell-the-News Scenario\n\nBollinger Band : A flattish upper boundary in the Bollinger band indicator reflects weakness in bullish momentum.\n\n: A flattish upper boundary in the Bollinger band indicator reflects weakness in bullish momentum. Relative Strength Index: The daily RSI drop below 50% indicates the rising selling pressure in the market.\n\nRelated Articles"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9iaXRjb2luLXByaWNlLXN1ZmZlcnMtcG9zdC1zcG90LWV0Zi1ibHVlcy1kcm9wcy03LXRvLTQzMjAwL9IBZGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9iaXRjb2luLXByaWNlLXN1ZmZlcnMtcG9zdC1zcG90LWV0Zi1ibHVlcy1kcm9wcy03LXRvLTQzMjAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price Suffers Post-Spot ETF Blues, Drops 7% To $43,200 - NewsBTC",
        "content": "The introduction of Bitcoin (BTC) exchange-traded funds (ETFs) has triggered a significant sell-off, leading to a sharp decline in the Bitcoin price.\n\nAfter gaining approval and commencing trading on Thursday, the ETFs have prompted a “sell the news” event, causing Bitcoin’s value to plummet from its initial trading price of $46,500 at the time of approval to a low of $43,200 within a matter of hours on Friday.\n\nOver the past 24 hours, Bitcoin, the largest cryptocurrency by market capitalization, has experienced a 7% drop. Its gains over the past 30 days have been limited to a mere 4%, erasing much of the progress made during that period.\n\nAdditionally, as selling pressure continues to mount following the approval, there are indications that the Bitcoin price may face further downward pressure.\n\nBitcoin Price Under Pressure\n\nCryptoQuant analyst J.A. Maartunn observed significant sell orders in Bitcoin’s two-week chart on Wednesday. Notably, three clusters of sell orders were positioned between $46,100 and $48,000, comprising stacks of 755, 1,031, and 794 BTC, respectively.\n\nAccording to the CryptoQuant analyst, such patterns are typically associated with market tops, unless these orders are later withdrawn or executed.\n\nThis influx of sell orders may help explain the lackluster response to the ETF approvals until now, as it appears that selling pressure has been building up. However, the situation has intensified even further.\n\nAccording to Maartunn, additional sell orders were detected on Friday, indicating that the seller is not yet finished. Two substantial sell orders have been placed just above the current Bitcoin price: one for 894 BTC at $44,000 and another for 1,071 BTC at $45,100.\n\nThese developments suggest that market participants are taking advantage of the ETF news to offload their Bitcoin holdings, leading to increased selling pressure and a subsequent price decline.\n\nThe market’s stabilization following this period of heightened selling pressure remains uncertain. The introduction of ETFs was believed to bring about heightened institutional interest and potentially drive up the Bitcoin price.\n\nHowever, it is important to note that the impact of these ETFs is expected to unfold over the long term, rather than being evident within days, weeks, or even months. It will likely take years to fully gauge the effects and consequences of ETF integration on the Bitcoin market.\n\nBitcoin’s Bullish Structure Remains Intact\n\nAmidst the ongoing selling pressure, several support lines may potentially halt the downtrend and bring positive news for the Bitcoin price and BTC bulls.\n\nAlthough Bitcoin has already lost its $44,000 support level, there is another crucial threshold at $42,700 that could prevent further decline. If this level holds, there is a chance for Bitcoin to regain the $43,000 mark and reverse the downward momentum.\n\nIf the $42,700 support is breached, additional support lines come into play. These include $42,300, $41,700, and $41,200, which act as the last barriers before a potential test of the $40,000 support level. The $40,000 mark holds significance as it represents the final support before a potential dip towards $38,000.\n\nHowever, there is a positive aspect for Bitcoin bulls to consider. The current bullish structure of the cryptocurrency remains intact as long as the dip does not breach the $29,900 mark.\n\nThis level marked the beginning of the current bullish uptrend, and its preservation would ensure the maintenance of the overall positive market structure.\n\nFeatured image from Shutterstock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd2FtdS5vcmcvc3RvcnkvMjQvMDEvMTMvdS1zLXNheXMteWVzLXRvLW5ldy1iaXRjb2luLWZ1bmRzLXBhdmluZy10aGUtd2F5LWZvci1tb3JlLWFtZXJpY2Fucy10by1idXktY3J5cHRvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "U.S. says yes to new bitcoin funds, paving the way for more Americans to buy crypto - WAMU 88.5",
        "content": "Privacy Overview\n\nThis website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93YXMtdGhlLXNwb3QtYml0Y29pbi1ldGYtYXBwcm92YWwtc2VsbC10aGUtbmV3cy1ldmVudC1idGMtdHVtYmxlZC1ieS03ay1pbi0yLWRheXMv0gFvaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3dhcy10aGUtc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1zZWxsLXRoZS1uZXdzLWV2ZW50LWJ0Yy10dW1ibGVkLWJ5LTdrLWluLTItZGF5cy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Was the Spot Bitcoin ETF Approval Sell-the-News Event? BTC Tumbled by $7K in 2 Days - CryptoPotato",
        "content": "Arguably the most anticipated development in the cryptocurrency industry over the past decade became reality earlier this week when the US Securities and Exchange Commission greenlighted numerous spot Bitcoin ETFs.\n\n11 such products reached the markets on Thursday, and the volumes exceeded $4 billion on the first trading day. Amid this, BTC faced mindblowing volatility that included a price dump from over $49,000 to under $42,000.\n\nWas it Bound to Happen?\n\nBitcoin skyrocketed to over $49,000 for the first time in nearly two years on Thursday, just hours after the ETFs went live on the US markets. Hours later, the asset fell by three grand. On Friday, the landscape worsened as the cryptocurrency plummeted to $41,500. This meant that the asset lost more than $7,000 in just over a day.\n\nAhead of the ETF approvals, many experts speculated on whether BTC’s price had been priced in, given the fact that it shot up by more than 150% in 2023. The sell-the-news camp was quite active, with numerous predictions that the cryptocurrency would fall after the ETFs reached the markets.\n\nSo far, they seem to have a point. In fact, history shows that something similar happened in August 2023. Europe’s first spot Bitcoin ETF launched on Euronext Amsterdam, and BTC’s price slumped by $1,500 within the first few days.\n\nBack in late 2021, the SEC greenlighted several futures Bitcoin ETFs, and the effects were similar, with a massive price decline in the following weeks and months.\n\nGrayscale Behind This?\n\nAfter the ETFs launched on Thursday, the volumes shot up to over $4 billion, with Grayscale’s one taking the main stage with the most substantial numbers. However, this could actually be the reason behind the price falls, which is what SkyBridge Capital’s founder, Anthony Scaramucci, suggested.\n\n“There seems to be a lot of selling of Grayscale,” he said, which could be somewhat understandable, given Grayscale’s higher-than-average fees of 1.5%. Just for reference, most ETF competitors offer somewhere between 0.25% and 0.4%.\n\nGrayscale’s GBTC Trust saw the light of day over a decade ago and had become the largest Bitcoin fund with an AUM of over $28 billion. It was converted into a spot Bitcoin ETF, alongside the other approvals, and actually registered the largest opening day turnover with volumes of $2.3 billion.\n\n“The second thing we are seeing is the bankruptcy estate of FTX is unloading into the ETF announcement. There is a heavy volume of selling in Bitcoin right now. I do expect the supply overhang to be done in the next six to eight trading days,” – Scaramucci concluded."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzE0L2FudGhvbnktc2NhcmFtdWNjaS1zYXlzLWxhdGVzdC1iaXRjb2luLWNvcnJlY3Rpb24tZnVlbGVkLWJ5LWdyYXlzY2FsZS1nYnRjLXNlbGwtb2ZmLXJlcG9ydC_SAYABaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMTQvYW50aG9ueS1zY2FyYW11Y2NpLXNheXMtbGF0ZXN0LWJpdGNvaW4tY29ycmVjdGlvbi1mdWVsZWQtYnktZ3JheXNjYWxlLWdidGMtc2VsbC1vZmYtcmVwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Anthony Scaramucci Says Latest Bitcoin Correction Fueled by Grayscale (GBTC) Sell-Off: Report - The Daily Hodl",
        "content": "Skybridge Capital founder Anthony Scaramucci says that Bitcoin’s (BTC) recent correction is likely due to investors selling off their holdings in Grayscale Bitcoin Trust (GBTC).\n\nShares of GBTC were converted from a trust into an exchange-traded fund (ETF) after receiving approval from the U.S. Securities and Exchange Commission (SEC) last week.\n\nScaramucci says that his trading desk reported that GBTC holders booked losses on their shares in order to hold ETFs with lower fees, Bloomberg reports.\n\n“There seems to be of lot of selling of Grayscale.”\n\nThe hedge fund manager also says that the estate of former crypto exchange FTX, which went bankrupt after a dramatic collapse in late 2022, took the opportunity to sell off its holdings during the hype of the Bitcoin ETF approval. Although BTC has been selling off in the last few days, Scaramucci thinks that the situation will change in about a week’s time.\n\n“The second thing we are seeing is the bankruptcy estate of FTX is unloading into the ETF announcement… There is a heavy volume of selling in Bitcoin right now. I do expect the supply overhang to be done in the next six to eight trading days…\n\nOne last thing, there has been a quiet period for Wall Street. Wall Street has not been able to market these ETFs and that will start in about eight days as well.”\n\nAt time of writing, Bitcoin is trading for $43,039.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGFpbHljb2luLmNvbS9taWNoYWVsLXNheWxvci1zb3VuZHMtYWxhcm0tb24tYml0Y29pbi1zY2FtLWVwaWRlbWljL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Michael Saylor Sounds the Alarm on Bitcoin Scam Epidemic as AI Poses Growing Threat to Crypto Space - DailyCoin",
        "content": "A rising tide of deepfake scams has targeted figures like MicroStrategy’s Michael Saylor.\n\nSaylor’s security team has dismantled 80 fraudulent videos every 24 hours.\n\nThe rapid evolution of AI has presented a double-edged sword for the crypto community.\n\nIn a worrying trend, Bitcoin enthusiasts are targeted by sophisticated scams that utilize deepfakes to impersonate prominent figures. Michael Saylor, the chairman of MicroStrategy and one of the world’s largest Bitcoin holders, recently sounded the alarm about a deluge of fake YouTube videos featuring him promoting Bitcoin giveaways.\n\nMicroStrategy’s Michael Saylor Warns of Fake Giveaways\n\nSaylor’s security team, he revealed, is engaged in a daily battle against these imposters, taking down an average of 80 fraudulent videos every 24 hours. The videos typically depict Saylor urging viewers to scan a barcode and send Bitcoin for double the amount back, a classic scam tactic designed to lure unsuspecting victims.\n\n\"There is no risk-free way to double your #bitcoin, and @MicroStrategy doesn't give away $BTC to those who scan a barcode…Don't trust, verify,\" Saylor emphasized this in a recent X (formerly Twitter) post.\n\nSaylor is not the first victim of these AI-powered scams. In November 2023, deepfakes of Ripple CEO Brad Garlinghouse promoting fake XRP giveaways surfaced online. These incidents highlight the growing sophistication of AI and its potential for misuse in the digital realm.\n\nHow AI Threatens Crypto and What You Can Do\n\nThe rapid advancement of AI presents both opportunities and challenges for the cryptocurrency community. While its applications in areas like blockchain security and data analysis are promising, the ability to create hyper-realistic forgeries poses a significant threat.\n\nIndustry leaders and users must adopt a cautious approach to combat this emerging threat. Verifying the source of information and remaining skeptical of unrealistic promises are crucial steps in safeguarding crypto holdings. Additionally, avoiding sending funds to unknown addresses or platforms, especially those offering exorbitant returns, is essential.\n\nOn the Flipside\n\nExercising due diligence could mitigate the impact of these scams, shifting the onus from the technology to individual discernment.\n\nAs a double-sword, AI-driven solutions can adapt and evolve to counter deepfake threats, paving the way for innovative safeguards within cryptocurrency.\n\nWhy This Matters\n\nBeyond the immediate concern for individual investors, this escalating sophistication underscores the pressing need for heightened vigilance and collective action to fortify the foundations of trust within the crypto ecosystem.\n\nTo learn more about Michael Saylor’s intriguing maneuver of offloading MicroStrategy shares to acquire Bitcoin, read here:\n\nMichael Saylor Offloads MicroStrategy Shares to Buy Bitcoin\n\n\n\nCurious about the dawn of Spot Bitcoin ETFs? Delve into the details as all spot Bitcoin ETFs open for trade for the first time. To learn more, read here:\n\nAll Spot Bitcoin ETFs Open for Trade for the First Time"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGYtaHlwZS1vdmVyLWJpdGNvaW4tYnRjLXByaWNlLWR1bXBlZC10by0yMDI0LWxvd3Mtb2YtNDEtNWstd2Vla2VuZC13YXRjaC_SAWhodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRmLWh5cGUtb3Zlci1iaXRjb2luLWJ0Yy1wcmljZS1kdW1wZWQtdG8tMjAyNC1sb3dzLW9mLTQxLTVrLXdlZWtlbmQtd2F0Y2gvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "ETF Hype Over? Bitcoin (BTC) Price Dumped to 2024 Lows of $41.5K (Weekend Watch) - CryptoPotato",
        "content": "The highly volatile moves after the approval of the first US spot Bitcoin ETFs continued in the past 24 hours, with a massive dump to under $41,600.\n\nThe altcoins have suffered just as badly, with SOL, ADA, AVAX, and others slumping by more than 5-6% in the same timeframe.\n\nBTC’s Volatility Returns\n\nBitcoin and the entire cryptocurrency industry had a very eventful week, in which the US SEC was expected to approve the first spot BTC ETFs in the country. While that indeed transpired on Wednesday, it didn’t go without its own set of hiccups, including a hack on the previous day with fake news, deleted and reposted statements, as well as controversial words from the agency’s chairman – Gary Gensler.\n\nNaturally, this all resulted in enhanced volatility, with multiple massive price movements from BTC. After the ETFs reached the US markets on Thursday, the asset first soared to a 21-month peak at over $49,000 before it crumbled by three grand in minutes.\n\nThe landscape was less volatile on Friday, but only during the Asian and European trading hours. As the US trading hours were coming to an end, the primary digital asset slumped to under $41,600 for just the second time since the start of 2024.\n\nAlicia Bakery CMO - A really good agency Did you like this market update?\n\nThis is all you need not to miss any price action in the raging crypto markets. Start receiving this recap, for free, every day: Invalid email address Your privacy is guranteed. Thanks for subscribing, you will get your first report in the next hours!\n\nAs of now, it has reclaimed some ground and stands close to $43,000. Its market cap, though, is down to $843 billion, and so is its dominance – 50% on CMC now. The metric had soared to over 53% earlier this week.\n\nAlts See Red\n\nAlthough most altcoins are in the red now, some have suffered less than others. Such is the case with Ethereum, which is down by a more modest 2.6% to $2,550. Binance Coin, Ripple, Dogecoin, and Toncoin have also declined by less than 5%.\n\nAt the same time, assets like SOL, ADA, AVAX, MATIC, BCH, DOT, and ATOM have slumped by more than 5% and up to 11% in the case of BCH.\n\nThe total crypto market cap has seen $80 billion gone in a day and is down under $1.7 trillion on CMC."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzE0L3doYXQtY2F0aGllLXdvb2QtYW5kLWFyay1pbnZlc3QtdGhpbmstYWJvdXQtYnRjL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Here's What Cathie Wood and Ark Invest Think About Bitcoin Today - The Motley Fool",
        "content": "Bitcoin (BTC -6.62%) has arguably been one of the most talked-about topics in the financial world recently as the first spot Bitcoin ETF launched on Jan. 10. Yet, despite the widespread coverage, the decentralized nature of Bitcoin can make it difficult to evaluate its current position and keep track of developments. That's where Cathie Wood and her team at Ark Invest come in.\n\nEvery month, they compile a report that sheds light on the latest Bitcoin-related developments, providing both short-term and long-term information that can help us gain better insight into the world's most valuable cryptocurrency. With another month passing, it's time to dive into what the experts had to say in their latest analysis.\n\nAn encouraging short-term outlook\n\nAfter a solid end to 2023, Bitcoin surpassed key indicators that Ark Invest and its analysts track closely. While these indicators are often used for technical analysis and day trading, they can still benefit investors implementing a buy-and-hold strategy.\n\nOne of the most intriguing discoveries detailed in the report was that Bitcoin's resurgence as the year closed resembles patterns preceding previous bull markets. As described in the report, Bitcoin's reclamation of these critical technical levels insinuates that it is forming an \"early to-mid\" stage of a bullish trend.\n\nAdding to the short-term analysis, Ark found that long-term holders (investors who have not moved their coins in more than 155 days) are beginning to take profits. Known for their stubbornness to sell, they provide valuable insight into the dynamics of the Bitcoin market compared to day traders who buy and sell at much greater frequencies. Although not extreme, which is why Ark Invest remains bullish, the realization of profits at this scale hasn't happened since the spring of 2023.\n\nWhile Bitcoin's 50% jump in the last three months of 2023 led to some long-term holders beginning to sell, Ark Invest thinks it is far from reaching a peak. The report highlighted that at the end of December, 90% of the total Bitcoin supply was sitting at a profit.\n\nSince all data on the blockchain is public and accessible, Ark can analyze when and at what price each investor purchased or sold. With this data, Ark found that the last time profit levels were this high was when Bitcoin was $58,900 in November 2021.\n\nImplications of this can vary, but analysts believe this is generally a positive development since greater profitability at lower price points \"suggests that market participants are comfortable holding\" until higher prices are reached. This implies that although the profits are starting to be obtained, the selling pressure could remain low until the investors feel incentivized enough to sell their Bitcoin.\n\nLong-term trends continue to solidify\n\nAt its core, Bitcoin operates as a decentralized network where users can make transactions, and miners are the backbone of this system. Bitcoin could not function without miners, so the report evaluated the 7-day average miner revenue in recognition of this dynamic.\n\nThe thinking goes that as long as miners remain incentivized to continue fulfilling their role, the more robust Bitcoin becomes. Fortunately, miners have been raking in profits as a surge in transactions occurred on the network in Q4; Ark's report found that average revenue increased by 26% in December compared to November and jumped over 200% compared to the prior year (December 2022).\n\nWhat's more noteworthy is that this profit growth has attracted more miners to join the network. The report measured this influx by examining \"mining difficulty,\" revealing a doubling since December 2022.\n\nAn increase in mining difficulty is a positive sign for Bitcoin's security as it implies a growing number of miners are actively participating, investing resources, and competing to validate transactions. Ultimately, this competitive environment enhances the overall robustness of the network, making it more resistant to malicious attacks and ensuring the integrity of every transaction.\n\nWhile the short-term outlook for Bitcoin looks encouraging, the significance of these security metrics cannot be overstated. They are the foundation of Bitcoin's long-term value proposition. Sustained growth is essential for Bitcoin's long-term value as it reinforces Bitcoin's claim as the most secure and decentralized blockchain. The more secure and decentralized Bitcoin is, the more reliable and valuable it should become with time."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy1hLXRpbWVsaW5lLW9mLWV2ZW50cy1sZWFkaW5nLXRvLXNwb3QtYml0Y29pbi1ldGYtYXBwcm92YWwtaW4tdGhlLXVzL9IBZ2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9oZXJlcy1hLXRpbWVsaW5lLW9mLWV2ZW50cy1sZWFkaW5nLXRvLXNwb3QtYml0Y29pbi1ldGYtYXBwcm92YWwtaW4tdGhlLXVzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Here’s a Timeline of Events Leading to Spot Bitcoin ETF Approval in The US - CryptoPotato",
        "content": "Earlier this week, a long wait for the launch of a spot Bitcoin exchange-traded fund (ETF) in the United States ended after the Securities and Exchange Commission (SEC) approved 11 products for listing and trading on several national exchanges.\n\nThe journey began ten years ago, and there are industry participants who laid the foundation for the SEC’s decision, which now represents a major step toward legitimizing the crypto asset class.\n\nThe First Application and Rejection\n\nIn 2013, Cameron and Tyler Winklevoss, co-founders of the crypto exchange Gemini, applied with the SEC to launch a spot Bitcoin ETF for the first time. The same year, crypto asset management firm Grayscale Investments launched its Bitcoin Investment Trust (GBTC), an open-ended private Bitcoin trust.\n\nAfter several adjustments to their application, the SEC rejected the Winklevoss twins’ request in 2017 on the grounds that bitcoin markets were not mature enough. Within the same period, Grayscale, which had filed with the Commission to convert GBTC into a spot Bitcoin ETF the year before, withdrew its application, citing underdevelopment of the regulatory environment.\n\nThe Winklevoss brothers went on to file a second application for a Bitcoin ETF in 2018 but encountered another rejection from the SEC within a month. At the time, the agency said BTC markets were prone to manipulation.\n\nThe Grayscale Court Ruling\n\nTwo years later, Grayscale transformed GBTC into an SEC-reporting entity with its shares trading on pink sheets, asset manager VanEck filed a proposal with the SEC to launch a spot Bitcoin ETF, and rival firm Bitwise withdrew an application filed in 2019 for a similar product.\n\nIn 2021, Bitwise filed another request, the SEC rejected VanEck’s proposal, and Gary Gensler replaced Jay Clinton as SEC chair. The same year, Grayscale filed another application with the SEC, but the agency approved the first U.S. futures Bitcoin ETF instead.\n\nBy 2022, the Commission had rejected applications from several asset managers, including SkyBridge, Fidelity, Bitwise, and Grayscale. Since Grayscale would not have the SEC’s decision, it dragged the agency to court, and in 2023, a federal appeals judge ordered the latter to reevaluate the application.\n\nThe False Approval\n\nBefore the landmark Grayscale ruling, asset managers like Ark Invest, BlackRock, Fidelity, and Invesco had filed applications with the SEC to launch spot Bitcoin ETFs. While it appeared the SEC would reject the requests as it had done in the past years, the agency’s decision not to appeal the court’s ruling increased the likelihood that the opposite would be the case.\n\nBy the end of 2023, a total of 13 asset managers had filed for spot Bitcoin ETFs, and the deadline for the SEC’s decision was set on January 10.\n\nAs optimism around the SEC’s decision grew, the agency’s X account was compromised on January 9, 2024, and a tweet announcing the approval of all the applications was posted. However, the news was debunked within an hour as Gensler revealed that the post was unauthorized and the products had not been approved yet.\n\nA Landmark Decision\n\nAmid market volatility and speculation surrounding the spot Bitcoin ETF approvals, the SEC finally greenlighted the products on January 10. By the next day, the 11 ETFs started trading on several securities exchanges and amassed $4 billion in volumes with 700,000 trades."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2NyeXB0b2N1cnJlbmN5LW5ld3MvYXJnZW50aW5hcy1maXJzdC1iaXRjb2luLXJlbnRhbC1jb250cmFjdC1hZnRlci1taWxlaXMtbWVnYWRlY3JlZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Argentina's First Bitcoin Rental Contract After Milei's Megadecree - Altcoin Buzz",
        "content": "The groundbreaking agreement, inked in the city of Rosario, introduces a novel approach to real estate transactions.\n\nPresident Milei’s mega-decree, aimed at fostering economic innovation and freedom, has already begun to reshape traditional practices. Let’s discover more about it.\n\nLandmark Bitcoin Rental Agreement in Rosario\n\nThe recent Bitcoin rental contract in Rosario stands as a tangible outcome of this transformative policy. The contract outlines that the tenant will pay the equivalent of 100 USDT in Bitcoin each month. This introduces a crypto-based framework to the local real estate landscape.\n\nNEW: As a result of President Javier Milei's megadecree. The first of its kind rental contract in #Bitcoin has been signed in Rosario, Argentina. 🇦🇷 \"The agreement clarifies that an amount in ₿itcoin equivalent to 100 USDT will be paid month by month.\" pic.twitter.com/jMiVuuEpjv — Simply Bitcoin (@SimplyBitcoinTV) January 13, 2024\n\nThe decision to denominate the rental amount in Bitcoin reflects a growing acceptance of digital currencies as a legitimate means of conducting everyday transactions. It not only showcases the resilience of cryptocurrencies but also means a departure from conventional fiat-based systems. The inclusion of USDT as the benchmark for the Bitcoin equivalent provides stability and clarity.\n\nThis landmark event has the potential to set a precedent for future real estate transactions in Argentina and beyond. The innovative nature of the Bitcoin rental contract aligns with President Milei’s vision for a more dynamic economy. So, the use of Bitcoin in real estate contracts could potentially open doors for international investment and collaboration.\n\n“After the repeal of the Rental Law, in Rosario (Argentina), the first contract in Bitcoin was signed: a tenant will pay a monthly amount in Bitcoin equivalent to 100 USDT”#Crypto #Adoption https://t.co/2bKUTKtRmM — ₳ Bïrd Called Px (@AbirdcalledPx) January 10, 2024\n\nIn conclusion, the signing of the first Bitcoin rental contract in Rosario, Argentina, post-President Milei’s mega-decree, marks a historic moment in the evolution of cryptocurrency adoption\n\nDisclaimer\n\nThe information discussed by Altcoin Buzz is not financial advice. This is for educational, entertainment, and informational purposes only. Any information or strategies are thoughts and opinions relevant to the accepted levels of risk tolerance of the writer/reviewers and their risk tolerance may be different than yours. We are not responsible for any losses that you may incur as a result of any investments directly or indirectly related to the information provided. Bitcoin and other cryptocurrencies are high-risk investments so please do your due diligence. Copyright Altcoin Buzz Pte Ltd."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xNC9iaXRjb2luLWluLXZlcnktZWFybHktaW5uaW5ncy1vZi1zdHJ1Y3R1cmFsLWJ1bGwtcnVuLWFzLWJ0Yy1zaG93aW5nLW5vLXNpZ25zLW9mLWRpc3RyaWJ1dGlvbi1zYXlzLWx5bi1hbGRlbi_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjQvMDEvMTQvYml0Y29pbi1pbi12ZXJ5LWVhcmx5LWlubmluZ3Mtb2Ytc3RydWN0dXJhbC1idWxsLXJ1bi1hcy1idGMtc2hvd2luZy1uby1zaWducy1vZi1kaXN0cmlidXRpb24tc2F5cy1seW4tYWxkZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin in Very Early Innings of Structural Bull Run As BTC Showing No Signs of Distribution, Says Lyn Alden - The Daily Hodl",
        "content": "Macroeconomics guru Lyn Alden believes that the ongoing Bitcoin bull market is still intact as long-term holders refuse to sell even after BTC’s year-long rally.\n\nIn a new interview on crypto influencer Natalie Brunell’s YouTube channel, Alden says that BTC is in the very early stages of its structural bull run.\n\nThe macro guru highlights that she’s still not seeing signs that long-term BTC holders are selling their coins even though Bitcoin is up about 160% in the last 12 months.\n\n“So far, we’ve not really seen any sign of distribution. So when Bitcoin goes through major bull runs, normally some of those older holders start to sell into that market strength. Maybe they want to rebalance, maybe they want to consume… so you see some of that distribution as new buyers come in and that process hasn’t even started yet based on any sort of on-chain analysis you look at.\n\nI still think we’re very early in this structural bull run, but I do think it’s important not to take a bull run for granted. It’s not necessarily owed to you just because the halving is happening or just because it’s on that cycle. I think it’s probably still likely over the next two years but it is important to manage your expectations and risk accordingly.”\n\nEarlier this month, Alden said Bitcoin’s cycles are correlated to global liquidity and that BTC could rally to as high as $200,000 before the end of 2025.\n\nAt time of writing, Bitcoin is worth $43,010.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vYXUuZmluYW5jZS55YWhvby5jb20vbmV3cy93aGF0LWJpdGNvaW4tZXRmLW1lYW5zLWZvci1hdXNzaWVzLWFuZC13aHktdGhleS1zaG91bGQtYmUtY2FyZWZ1bC0yMjU5MjEwMjQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "What bitcoin ETF means for Aussies and why they should be careful - Yahoo Finance Australia",
        "content": "It's now a lot easier to buy bitcoin after the US market regulator last week approved the listing and trading of a number of spot bitcoin exchange-traded funds (ETFs). So, what does this mean for future of the cryptocurrency, and is now a good time for Aussies to buy in?\n\nFirst, an admission. I bought a small amount of bitcoin about a month ago. First, it went down, but just recently, it went up again. I’m actually ahead (narrowly at time of writing). But, as the next chart shows, pretty much everyone who has bought bitcoin is ahead right now, thanks to a huge surge in its price.\n\n(Source: supplied) (Jason Murphy)\n\nAs the chart shows, the price has only briefly been higher in AUD terms. The only Aussies who are behind are the ones who bought bitcoin when it was above $70,000, for a few brief months back in 2021.\n\nADVERTISEMENT\n\nThere were slightly more opportunities to buy it higher than its current price in USD terms, but still, 90 per cent of all the weird nerds who ever bought bitcoin are now miles ahead. You don’t have to like them, but you have to respect them.\n\nAlso by Jason Murphy:\n\nNightmare on Main Street\n\nThe reason for bitcoin’s recent rise is that it has gone mainstream. ETFs have been set up on the New York Stock Exchange, meaning people can buy bitcoins in the same places they buy stocks. That is expected to finally confer a certain amount of legitimacy on bitcoin – think of it as an 18th birthday party showing bitcoin is respectable and grown up now.\n\nAt the same time, the ETF will make it easier for people to buy bitcoin. They don’t even need a new trading account. They can pile money into the ETF and it buys bitcoin on their behalf.\n\nThe combination of factors is hoped- by bitcoin enthusiasts (which I’m not) and speculators (which I am, albeit in a small value) - to push the price of bitcoin up.\n\nStory continues\n\nI’ve ridden the wave of bitcoin enthusiasm in the past, as the next chart shows. While I don’t believe in bitcoin in the same way as some hardcore people for whom it is a faith, I’ve been careful not to let my scepticism get in the way of a good trade. There’s no money in betting against the crowd in the short run.\n\n(Source: supplied) (Jason Murphy)\n\nSo, is this the right time to throw your life savings at bitcoin? Is it going to go vertical again? Never say never, but remember, the embrace of bitcoin by the global financial system could be kind of a death grip. Why? Because bitcoin was originally envisaged as an alternative to that system.\n\nIn 2008, bitcoin’s pseudonymous creator, Satoshi Nakamoto, conceived of it as permitting people to trade “without going through a financial institution”. But the main bitcoin ETF is owned by Blackrock, pretty much the biggest financial institutions there is.\n\nBitcoin didn’t turn out quite like Nakamoto expected. It’s not a currency. It’s not used much to buy and sell. It’s more like bonds or gold – a place to park money, and a thing on which to speculate. Lots of financial assets are like that these days. Even things like copper, which is way more useful than bitcoin, nevertheless attract a lot of traders trading it for financial reasons.\n\nSo, the development of an ETF could boost the market for bitcoin by bringing in a lot of traders and patient investor money. Or undermine it by revealing that the global financial system isn’t threatened by it, quite the opposite: the system sees it as just another financial product to be bought and sold. So, the establishment of the ETF could be an opportunity or a threat for the average bitcoin investor.\n\nAustralians need to be especially careful. Australians who buy into bitcoin face risks at the moment, because our dollar is at relative lows against the USD. Usually, we trade a bit higher than we have been trading recently, as the next chart shows.\n\n(Source: supplied) (Jason Murphy)\n\nIf our dollar appreciates against the USD – say we go back to 80 US cents, then it’s likely the value of bitcoin will fall in AUD terms. Bitcoin is not pegged to the US dollar, of course, but more bitcoin trade happens in USD than AUD so it’s unlikely to follow our currency if we appreciate. And the Aussie dollar could certainly appreciate against the greenback if the US stops hiking rates and moves to a cutting phase.\n\nThe inflationary impulse is all but over now across the world, meaning the next interest rate is almost certainly down, not up, in both the US and Australia. But US inflation is down to 3.4 per cent over the past year, compared to 4.3 per cent in Australia, meaning they may see rate cuts before us.\n\nIf the Fed starts cutting rates before the Reserve Bank of Australia, then the AUD is very likely to rise against the USD, and any bitcoin investments will require even stronger growth in the USD value of the asset to hold their value.\n\nWith bitcoin, more than ever, it’s buyer beware.\n\nFollow Yahoo Finance on Facebook, LinkedIn, Instagram and Twitter, and subscribe to our free daily newsletter."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tYnRjLXByaWNlLXRvLXRvdWNoLTFtLWluLWRheXMtdG8td2Vla3Mtc2Ftc29uLW1vdy_SAVNodHRwczovL2NvaW5nYXBlLmNvbS9iaXRjb2luLWJ0Yy1wcmljZS10by10b3VjaC0xbS1pbi1kYXlzLXRvLXdlZWtzLXNhbXNvbi1tb3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin (BTC) Price to Touch $1M in Days to Weeks - Samson Mow - CoinGape",
        "content": "There is deep attention on the Bitcoin (BTC) price at the moment following the approval and launch of the spot Exchange Traded Fund (ETF) tracking the product.\n\nBitcoin (BTC) Price Prediction\n\nWith expectations that the digital currency will benefit from the spot Bitcoin ETF emergence, Samson Mow, a market expert and founder of investment firm Jan3 has tipped Bitcoin price to touch $1 million in days or weeks in alignment with his prior bullish call for the top coin.\n\nadvertisement\n\nTaking to his official X account, Samson Mow sparked a debate when he declared that Max Pain Theory is still in play for Bitcoin. According to a definition of this concept by Upstox, the Max Pain Theory “states that on expiry day, the price of the underlying index/stock moves toward a point that results in maximum loss (pain) to the highest number of options buyers. Alternatively, it also means a minimum loss to option sellers.”\n\nHere, the high-value holders of Bitcoin push the selloff to the point where the asset becomes quite profitable to buy. The spot Bitcoin ETF emergence served as a “sell the news” moment last week as the withdrawal of shares from Grayscale Bitcoin Trust (GBTC) forced the price of the coin to a low of $42,460.16 in the past week.\n\nSamson Mow is optimistic that the $1 million Bitcoin (BTC) price will materialize but the starting point is to be determined at a later date.\n\nMy main prediction is the run up to $1M happens in days to weeks. Starting point TBD. — Samson Mow (@Excellion) January 14, 2024\n\nBitcoin price is changing hands at a price of $42,788.46, down by 3.24% in the past 24 hours as its market capitalization has dropped to $838,531,752,412.\n\nSpot Bitcoin ETF Catalyst\n\nSamson Mow is one of the major Bitcoin advocates with an optimistic view about the price of the asset, riding on the potential of the spot ETF product now trading in US Markets.\n\nMow is optimistic that there will be a massive inflow of funds into Bitcoin, drawing on the huge capital base of the key participants in the market including BlackRock Inc., Fidelity Investments, and VanEck among others.\n\nThe spot Bitcoin ETF product, upon launch of trading, had a good start, igniting the optimism that it will draw in more mainstream adoption in the mid-to-long term, hence validating this price forecast from Samson Mow and others."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LnRyYWRpbmd2aWV3LmNvbS9jaGFydC9CVENVU0QvbHMxVTF5MGQtQml0Y29pbi1zLUZpbmFsLU1ha2UtT3ItQnJlYWstTW9tZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's Final Make Or Break Moment for COINBASE:BTCUSD by VictorCobra - TradingView",
        "content": "The information and publications are not meant to be, and do not constitute, financial, investment, trading, or other types of advice or recommendations supplied or endorsed by TradingView. Read more in the Terms of Use."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9sZWF2aW5nLWJlaGluZC1sYXN0LXllYXJzLWNoYW9zLWNyeXB0b3MtYmVnaW4tYS1uZXctbGlmZS9hcnRpY2xlc2hvdy8xMDY3OTUzNDguY21z0gGJAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2xlYXZpbmctYmVoaW5kLWxhc3QteWVhcnMtY2hhb3MtY3J5cHRvcy1iZWdpbi1hLW5ldy1saWZlL2FtcF9hcnRpY2xlc2hvdy8xMDY3OTUzNDguY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "Leaving behind last year's chaos, cryptos begin a new life - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvYi9ibG9ja2NoYWluLWV0Zi5hc3DSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Blockchain ETF: Meaning, Criticism, and Example - Investopedia",
        "content": "What Is a Blockchain ETF?\n\nA blockchain exchange-traded fund (ETF) is a fund that invests exclusively in a basket of blockchain-based companies. The companies held by a blockchain ETF have business operations in blockchain technology or invest or profit from the blockchain.\n\nBlockchain ETFs are distinct from cryptocurrency ETFs, which invest in a basket of digital currencies such as bitcoin. However, a blockchain ETF can provide exposure to some of the technologies that are exploring digital ledger technology.\n\nKey Takeaways Blockchain ETFs are exchange-traded funds that invest in a basket of companies which use blockchain technology for operations.\n\nSome of these funds are actively managed, whereas others are passive and track an index\n\nBlockchain isn’t just used with cryptocurrencies. It has the potential to be the way all information is recorded and stored.\n\nLike any breakthrough technology, there is no guarantee blockchain will live up to its potential and become widely used across multiple industries.\n\nUnderstanding Blockchain ETFs\n\nA blockchain is a shared ledger that stores all information regarding a transaction (date, time, dollar amount, etc.). This ledger is decentralized, meaning it is not kept in one location but distributed across a network that can be viewed by the public. The information in the ledger is also incorruptible.\n\nProponents believe that blockchain technology can enable people to communicate crucial data in a safe, tamper-proof manner. Just about anything can be recorded and stored on a blockchain network.\n\nBlockchain ETFs give investors a chance to make money from this technology, which has the potential to revolutionize business and be used by everyone. These funds invest in various companies making money from blockchain in some form. Some of them are actively managed while others are passively managed and simply track a specific index.\n\nBlockchain ETFs offer dual benefits—pooled investments in baskets of stocks like that of a mutual fund, and real-time trading with tick-by-tick price changes like that of a stock.\n\n9 The number of blockchain ETFs traded on the U.S. markets, according to ETF.com.\n\nApplications of Blockchain Technology\n\nBlockchain is best known for maintaining a secure and decentralized record of all cryptocurrency transactions. This technology isn’t just limited to digital currencies, though. Blockchain can potentially be used in any situation where data recordkeeping is required.\n\nBlockchain technology can be used to deliver information in a quick, secure, and transparent fashion, even between mutually distrustful parties. Those characteristics have led some proponents to predict that blockchain could end up being as groundbreaking as the internet was.\n\nIt's called blockchain because information is stored in blocks that form a chain.\n\nHow Blockchain Works\n\nA blockchain can in some way be compared to spreadsheets. It is essentially a database where information is entered and stored. Where a blockchain differs from a spreadsheet is in how the data is structured and accessed.\n\nThe blockchain process essentially takes the following steps:\n\nAn authorized participant enters information about a transaction into a block, which then must be authenticated by the technology. The block is sent to every participant in the network. An authorized “node” validates each block, assigning a hexadecimal number called a hash, and adds the block to the existing chain of validated transactions. This update is communicated and available for all to see on the network.\n\n\n\nDifferent Services/Industries That Blockchain Is Used in\n\nThousands of cryptocurrency systems run on a blockchain. But that’s not the technology’s only use. Companies in many other industries have explored pilots using blockchains and similar ledger technology to store data for other types of transactions. Proponents believe that it can speed transaction times, demand less oversight and resources, and is harder to hack and manipulate.\n\nThose benefits have prompted several big-name companies to invest in blockchain. Industries that have seen a use for blockchain include:\n\nFood . When food gets transported, it risks getting contaminated. Blockchain could enable companies to track each step of the journey food takes and determine what the produce might have come in contact with. Among other things, this makes it much easier to identify the causes of outbreaks and sicknesses and stop them from happening again.\n\n. When food gets transported, it risks getting contaminated. Blockchain could enable companies to track each step of the journey food takes and determine what the produce might have come in contact with. Among other things, this makes it much easier to identify the causes of outbreaks and sicknesses and stop them from happening again. Banking and finance . In theory, blockchain could lead customer banking and investing transactions to be completed in minutes or seconds, including on holidays, evenings, and so on. Banks could become more efficient and risks would be reduced.\n\n. In theory, blockchain could lead customer banking and investing transactions to be completed in minutes or seconds, including on holidays, evenings, and so on. Banks could become more efficient and risks would be reduced. Healthcare. Blockchain has been touted as the way forward for medical records. In theory, it would enable healthcare providers to record and store medical information safely. The only way to gain access would be through a private key, made available to a handful of specified individuals.\n\nIt is also believed that blockchain would make voting impossible to tamper with. If true, that could reduce election fraud and boost voter turnout.\n\nBlockchain ETFs vs. Bitcoin ETFs\n\nThe terms bitcoin and blockchain are sometimes used interchangeably, despite being two different things: Bitcoin is a cryptocurrency, while blockchain is the underlying database technology.\n\nBlockchain is not tied to any one specific company or product. it is a technology that can be used across various industries. Blockchain ETFs invest in various companies listed on the stock market, many of which also have other operations outside of blockchain, rather than a specific coin. This makes them more diversified and less volatile.\n\nAnother notable difference is regulation and availability. Bitcoin and other virtual currencies have been heavily scrutinized by government authorities. For many years, the Securities and Exchange Commission (SEC) resisted applications by companies seeking to launch a cryptocurrency ETF, citing fears of market manipulation. The first bitcoin futures ETF in the United States was approved in Oct. 2021, and the first bitcoin spot ETF in Jan. 2024.\n\nCryptocurrency ETFs come with additional risks due to the inherent volatility of digital currency. In addition, they may have higher expense ratios due to the cost of custodying digital assets.\n\n\n\nBlockchain ETF Invests in companies that develop or make money form blockchain technology\n\nNeither banned nor under scrutiny\n\nNot tied to a particular company, meaning greater diversity, less risk, and less potential upside Bitcoin ETF Governments are skepitcal and investing regulations are tight\n\nExposure to a currency known for volatile price swings and making or losing investors lots of money\n\nMay have high expense ratios due to the cost of custodying and trading cryptocurrency.\n\nCriticism of Blockchain ETFs\n\nBlockchain ETFs are a relatively recent phenomenon. As such, it is difficult to determine trends or derive conclusive results from their performance.\n\nMany blockchain ETFs have witnessed positive returns.However, investors are still concerned with the long-term prospects of blockchain ETFs. As is the case with any breakthrough technology, there is no guarantee blockchain will live up to its potential and become widely used across multiple industries.\n\nBlockchain ETFs also come with the inherent risk of investing in technology-based startups, at least while the blockchain concept is still evolving, and hitting regulatory roadblocks across the globe.\n\nExample of Blockchain ETFs\n\nTwo popular blockchain ETFs include the Siren Nasdaq NexGen Economy (BLCN) ETF and the Amplify Transformational Data Sharing (BLOK) ETF.\n\n\n\nBLCN\n\nThe Siren Nasdaq NexGen Economy seeks to replicate the returns of the Siren Nasdaq Blockchain Economy Index, an index made up of global companies committed to blockchain development. The fund is described as passive but does have some discretion in selecting companies.\n\nAs of Jan. 2024, BLCN, which was one of the first ETFs to focus on blockchain technology, had $71.8 million in assets under management and a five-year annualized return of 4.38%. Its top holdings are Galaxy Digital Holdings, Coinbase Global, Inc., and Microstrategy Inc., with an expense ratio of 0.68%.\n\n\n\nBLOK\n\nThe Amplify Transformational Data Sharing ETF is an actively managed fund investing in companies developing or using what it calls “transformational data sharing technologies.” It has no underlying index and carries an expense ratio of 0.75%.\n\nThe fund, as of Jan. 2024, has assets under management of $850 million and a five-year annualized return of 17.55%. BLOK invests 47% of its assets in technology services and 19% in financial services. Its top holdings, as of Oct. 2023, are Coinbase Global, Inc., Microstrategy, Inc., and Marathon Digital Holdings, Inc.\n\nHow Do I Invest in Blockchain? There are several ways to invest in blockchain. Methods include buying a few stocks that are involved in its development, buying shares in a blockchain ETF, or investing in cryptocurrencies, either directly or via a trust.\n\nWhy Invest in a Blockchain ETF? If you believe blockchain will live up to its potential and want to spread your bets, a blockchain ETF makes sense. Investing in a basket of stocks limits upside, but also the chance of heavy losses.\n\nWhat Is the Best Blockchain ETF? There isn’t a best blockchain ETF, just as there isn’t a best mutual fund or stock. What’s best for one person may not work for another, and performance can vary from one period to the next. Look at what each ETF hopes to achieve, whether it is active or passive, the track record of its asset manager, the type of companies it invests in, and the expense ratio.\n\nThe Bottom Line\n\nBlockchain ETFs give investors a way to potentially make money from blockchain technology. These ETFs spread their bets on a number of companies at the forefront of blockchain, a technology that some people believe could be as groundbreaking as the internet.\n\nBlockchain is best known for maintaining a secure and decentralized record of all cryptocurrency transactions. But it isn’t just limited to that. Many industries need to record, safely store, and track data, and blockchain has been touted as an effective way to do this.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmFzaWFmaW5hbmNpYWwuY29tL3VzLWJpdGNvaW4tZXRmcy10dXJuLW92ZXItNC02LWJpbGxpb24tb24tZmlyc3QtZGF5LW9mLXRyYWRpbmfSAV9odHRwczovL3d3dy5hc2lhZmluYW5jaWFsLmNvbS91cy1iaXRjb2luLWV0ZnMtdHVybi1vdmVyLTQtNi1iaWxsaW9uLW9uLWZpcnN0LWRheS1vZi10cmFkaW5nL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 13 Jan 2024 08:00:00 GMT",
        "title": "US Bitcoin ETFs Turn Over $4.6 Billion on First Day of Trading - Asia Financial",
        "content": "Despite the SEC’s watershed approval for digital funds, some traders say they will still be avoiding what they called a “speculative, volatile asset”\n\nUS-listed bitcoin exchange-traded funds (ETFs) saw $4.6 billion worth of shares trade hands in their first session, according to LSEG data released on Friday, as investors leapt in after the landmark products were approved by the US securities regulator.\n\nThe products mark a watershed moment for the cryptocurrency industry that will test whether digital assets, still viewed by many professionals as risky, can gain broader acceptance as an investment.\n\nEleven spot bitcoin ETFs – including BlackRock’s iShares Bitcoin Trust, Grayscale Bitcoin Trust, and ARK 21Shares Bitcoin ETF, among others – began trading Thursday morning, kicking off a fierce competition for market share.\n\nGrayscale, BlackRock and Fidelity dominated trading volumes, the LSEG data showed.\n\nAlso on AF: China Bank Lending at Record High But Recovery Still Elusive\n\nThe green light from the US Securities and Exchange Commission for the products finally came late on Wednesday, following a decade-long tussle with the crypto industry.\n\nSome executives called out bitcoin as a high-risk investment, and Vanguard, the largest provider of mutual funds, said it had no plans to make the new batch of spot bitcoin ETFs available on its platform to its brokerage clients.\n\nThe SEC had earlier rejected all spot bitcoin ETFs on investor protection concerns. SEC Chair Gary Gensler said in a statement that the approvals were not an endorsement of bitcoin, calling it a “speculative, volatile asset.”\n\nThe regulatory nod sparked intense competition for market share among the issuers, some of whom slashed the fees for their products well below the US ETF industry’s standard even before Thursday’s launch.\n\nEstimates for how much spot bitcoin ETFs could reel in vary widely. Analysts at Bernstein estimated that flows will build up gradually to cross $10 billion in 2024, while Standard Chartered analysts this week said the ETFs could draw $50 billion to $100 billion this year alone. Other analysts have said inflows could be $55 billion over five years.\n\nCrypto Risk Fears\n\nSome analysts cautioned that the euphoria around the approval might be premature. The broader investment community still views cryptocurrencies as risky, with scandals such as the implosion of crypto exchange FTX in 2022 adding to investors’ wariness.\n\nA Vanguard spokeswoman said the firm had no plans to launch its own crypto investment products, and that its focus remains on core asset classes such as stocks, bonds and cash, which it views “as the blocks of a well-balanced, long-term investment portfolio”.\n\nSpeaking at a webinar on Thursday, Sharmin Mossavar-Rahmani, head of the Investment Strategy Group and chief investment officer of Wealth Management at Goldman Sachs, said cryptocurrencies had no place in an investment portfolio.\n\n“When you think about it, where is there any value to something like bitcoin?” she said. “We don’t think it is an asset class to invest in.”\n\nStill, some expect the products to pave the way for even more innovative crypto ETFs, including spot ether products.\n\nReuters with additional editing by Sean O’Meara\n\nRead more:\n\nSouth Korea Warns Against Brokering US Bitcoin ETFs Locally\n\nUS Approval For Bitcoin ETFs, a Game-Changer For Crypto\n\nIndia to Keep Strict Crypto Oversight Despite Global Changes\n\nHong Kong Crypto Futures ETFs Raise $74m Ahead of Debut\n\nNotorious Crypto Fund HyperVerse May Have Created Fake CEO"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9zZWMtYml0Y29pbi1ldGYtYXBwcm92YWwtYml0Y29pbnMtZGVjYWRlLWpvdXJuZXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "SEC Bitcoin ETF Approval: A Look at Bitcoin's Over a Decade-Long Journey to Get Here - CCN.com",
        "content": "Key Takeaways\n\nThe SEC’s approval of 11 spot Bitcoin ETF applications is a significant milestone for the cryptocurrency industry.\n\nThe launch of Bitcoin ETFs is expected to expand Bitcoin adoption, not replace existing methods.\n\nThe approval of Bitcoin ETFs marks a turning point for BTC legitimacy and acceptance in the mainstream financial landscape.\n\nThe United States Securities and Exchange Commission (SEC) on Wednesday, January 10. It approved the first Bitcoin exchange-traded fund (ETF), a decision that has been sought by the cryptocurrency industry for over a decade.\n\nThis significant development marks a turning point for both Bitcoin’s legitimacy and its acceptance in the financial landscape.\n\nBitcoin’s Long Journey to Spot ETF Approval: A Timeline\n\nLet’s delve into the timeline of Bitcoin’s evolution:\n\n2016: The Winklevoss brothers refine their application, specifying the exchange where the product would be traded and amending it to name State Street as administrator . Grayscale submits an application to convert its Bitcoin trust into a spot Bitcoin ETF.\n\nThe Winklevoss brothers refine their application, specifying the exchange where the product would be traded and amending it to name State Street as administrator . Grayscale submits an application to convert its Bitcoin trust into a spot Bitcoin ETF. 2017: The SEC rejects the Winklevoss application , citing concerns about the maturity of Bitcoin markets. Grayscale withdraws its initial attempt to convert its trust into an ETF, citing a lack of regulatory clarity.\n\nThe SEC rejects the Winklevoss application , citing concerns about the maturity of Bitcoin markets. Grayscale withdraws its initial attempt to convert its trust into an ETF, citing a lack of regulatory clarity. 2018: The SEC rejects the Winklevoss twins’ second application for a spot Bitcoin ETF. It cites insufficient safeguards against manipulation by cryptocurrency exchanges.\n\nSEC Commissioner Disagrees with Agency’s Winklevoss Bitcoin ETF Rejection https://t.co/DNJJi3wjke — CCN (@CCNDotComNews) July 27, 2018\n\n2020: Grayscale transforms its Bitcoin trust into an SEC-reporting entity. This allows its shares to trade on the over-the-counter market, known as the “pink sheets.” While not an ETF, it becomes the first publicly traded Bitcoin fund in the U.S.\n\nGrayscale transforms its Bitcoin trust into an SEC-reporting entity. This allows its shares to trade on the over-the-counter market, known as the “pink sheets.” While not an ETF, it becomes the first publicly traded Bitcoin fund in the U.S. 2021: Canada becomes the first country to approve a spot Bitcoin ETF . Gary Gensler takes over as SEC Chair in April.\n\nCanada becomes the first country to approve a spot Bitcoin ETF . Gary Gensler takes over as SEC Chair in April. October 2021: The SEC approves the ProShares Bitcoin Trust, listed on the Chicago Mercantile Exchange (CME), marking the first U.S.-listed futures-based Bitcoin ETF. It quickly accumulates over $1 billion in assets, setting a record for the fastest asset accumulation for any ETF.\n\n– 2021: The first U.S.-listed Bitcoin ETF, the ProShares Bitcoin Strategy ETF, is launched. – 2023: SEC Approves the 2x Bitcoin Strategy ETF from Volatility Shares. – 2023: @Grayscale wins appeal against the SEC to convert Bitcoin Trust to ETF. Bitcoins ETF has come this far? — 🆃🅴🅲🅷 S͢p͢y͢c͢e͢ (💜,🧡) ✍ || 🌙$XC (@aysteveo) October 24, 2023\n\nOctober 2021: Grayscale resubmits its application to the SEC to convert its Bitcoin trust into a spot Bitcoin ETF.\n\nGrayscale resubmits its application to the SEC to convert its Bitcoin trust into a spot Bitcoin ETF. 2022: The SEC rejects several applications for spot Bitcoin ETFs from issuers like SkyBridge, Fidelity, and Bitwise. It also rejects Grayscale’s application, prompting the company to sue the SEC.\n\nThe Last 12 Months\n\n📢Updated List from my post back in June! 🐂Bullish News over the past 2 months!\n\n✅ #BlackRock files for a #Bitcoin spot ETF\n\n✅ #Fidelity , Charles Schwab & Citadel launch their #Crypto exchange\n\n✅ Deutsche Bank applies for Crypto Custody license\n\n✅ Fidelity files for BTC Spot… https://t.co/XoQKSS1IuO — Tony Edward (Thinking Crypto Podcast) (@ThinkingCrypto1) July 15, 2023\n\nAugust 2023: A federal appeals court in Washington D.C. rules in favor of Grayscale. It finds that the SEC failed to adequately justify its rejection of the company’s spot Bitcoin ETF application. Europe’s first spot Bitcoin ETF begins trading on the Euronext Amsterdam stock exchange.\n\nA federal appeals court in Washington D.C. rules in favor of Grayscale. It finds that the SEC failed to adequately justify its rejection of the company’s spot Bitcoin ETF application. Europe’s first spot Bitcoin ETF begins trading on the Euronext Amsterdam stock exchange. October 2023: The SEC decides not to appeal the court’s ruling in the Grayscale case and is required to reexamine the application.\n\nThe SEC decides not to appeal the court’s ruling in the Grayscale case and is required to reexamine the application. January 10, 2024: In a landmark decision, the SEC approves 11 proposals from issuers including BlackRock, Fidelity, and VanEck to launch spot Bitcoin ETFs. This marks a significant step in the legitimization of Bitcoin as an investment asset and opens up the door for broader institutional adoption of the cryptocurrency.\n\nBitcoin ETFs Will Expand BTC Adoption, Not Replace Existing Methods\n\nThe launch of Bitcoin ETFs has sparked debate about their potential impact on existing methods of accessing Bitcoin, such as Coinbase and cold wallets. Some argue that ETFs will simply cannibalize these other avenues, while others believe they will attract new investors and expand Bitcoin adoption overall.\n\nETFs: a new way to access crypto.\n\nComing to a financial institution near you. pic.twitter.com/7zl68t1eP0 — Coinbase 🛡️📞 (@coinbase) January 10, 2024\n\nHistorical parallels suggest the latter scenario is more likely. According to Matt Hougan, CIO at Bitwise Investments and former CEO of ETF.com, when gold ETFs first emerged , many feared they would compete with traditional gold ownership methods, such as bars and coins. However, the opposite occurred. Demand for physical gold surged, tripling from 293 tonnes in 2003 to 1,107 tonnes in 2022.\n\nIn a document shared with CCN.com, Hougan explains that the reason for this unexpected outcome was straightforward: the ETF launch helped legitimize gold as a mainstream investment, attracting a wider pool of investors. While some opted for ETFs, others still preferred physical gold ownership.\n\nHougan expects a similar dynamic with Bitcoin ETFs.\n\nHe said: “I suspect we’ll see the same thing here. Many investors will find their way to bitcoin ETFs, even as the number of investors accessing bitcoin through Coinbase and holding it in cold wallets soars. There will likely be some cannibalization, but I suspect the pie will grow so much that no one will care.”\n\nIn essence, the launch of Bitcoin ETFs is not about replacing existing methods. Rather, it could be about growing Bitcoin’s reach and accessibility to a wider range of investors. Just as gold ETFs expanded gold’s influence, Bitcoin ETFs could do the same for Bitcoin, making it an even more prominent player in the financial world."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbmdhcGUuY29tL3Zhbmd1YXJkLW1heS1yZWNvbnNpZGVyLWJpdGNvaW4tc3RhbmNlLWFuYWx5c3Qtc3VnZ2VzdHMv0gFRaHR0cHM6Ly9jb2luZ2FwZS5jb20vdmFuZ3VhcmQtbWF5LXJlY29uc2lkZXItYml0Y29pbi1zdGFuY2UtYW5hbHlzdC1zdWdnZXN0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Vanguard May Reconsider Bitcoin Stance, Analyst Suggests - CoinGape",
        "content": "Vanguard, a renowned investment firm, is speculated to shift its longstanding anti-Bitcoin stance, according to insights from Bloomberg’s senior analyst Eric Balchunas. Despite Vanguard’s current direction, Balchunas hints at possibly reevaluating this policy in the foreseeable future, aligning with the firm’s expanding advisory services and the need for diverse investment portfolios.\n\nVanguard’s Current Position and Industry Response\n\nVanguard’s current approach towards Bitcoin and cryptocurrencies remains firmly resistant. The firm has recently made headlines by restricting customer access to the newly introduced spot Bitcoin Exchange-Traded Funds (ETFs). This decision aligns with their past actions, notably removing Bitcoin futures ETFs from their platform. According to a Vanguard spokesperson, this move aligns with the company’s core values, focusing on products and services catering to long-term investors’ needs.\n\nadvertisement\n\nThis stance, however, has not gone without consequence. Recent reports indicate that some Vanguard customers have started transferring their funds to other firms, seeking investment opportunities in the burgeoning cryptocurrency market. Despite these developments, Vanguard continues to uphold its cautious approach towards digital assets, reflecting the cautious perspective of its founder, Jack Bogle, who in 2017 labeled Bitcoin as a “plague.”\n\nWhile Vanguard maintains its conservative stance, Eric Balchunas of Bloomberg foresees a gradual change in the company’s philosophy. Balchunas notes that the growing emphasis on wealth growth and the necessity for diversified investments could nudge Vanguard towards reconsidering alternative asset classes like Bitcoin and other cryptocurrencies. This shift, he suggests, would be a strategic move to broaden their advisory business and cater to an evolving investment landscape.\n\nBalchunas’s perspective is noteworthy, given the increasing institutional interest in cryptocurrencies. This trend is seen in contrast to Vanguard’s current trajectory, but it highlights the dynamic nature of investment strategies in response to market demands and opportunities.\n\nContrasting Actions: Investment in MicroStrategy\n\nIntriguingly, Vanguard’s investment portfolio presents a contrasting picture. Despite its skepticism towards cryptocurrencies, the firm has significantly invested in MicroStrategy shares. MicroStrategy, known for its substantial Bitcoin holdings, is a key crypto player. As of September 2023, Vanguard holds over 1 million shares in MicroStrategy, valued at approximately $547 million, making it the second-largest institutional shareholder with an 8.24% ownership share.\n\nThis investment is particularly notable given MicroStrategy’s status as the leading public holder of Bitcoin, with an estimated 190,000 BTC valued near $6 billion. Vanguard’s substantial stake in a company deeply entrenched in cryptocurrency raises questions about its investment strategy and potential openness to digital assets.\n\nRead Also: Spot Bitcoin ETF: Here’s How Many Coins BlackRock Currently Holds"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vOTliaXRjb2lucy5jb20vYml0Y29pbi1uZXdzLXN1bW1hcnktamFuLTE1LTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Makes History | This Week in Crypto – Jan 15, 2024 - 99Bitcoins",
        "content": "﻿ Spot Bitcoin ETFs are approved but start with a hiccup, one stablecoin is going public and Bitcoin lifts off toward the moon, only to get lost in space?! These stories and more, this week in crypto.\n\nBitcoin Makes History\n\nOn Wednesday, The US SEC finally approved 11 spot Bitcoin ETFs in a process that began in 2013 when the Winklevoss twins first sought approval. Trading volumes exceeded $4bn across the New York Stock Exchange, Nasdaq and CBOE on the first trading day. Grayscale’s bitcoin ETF accounted for half of that volume with $1bn of it coming in the first hour after markets opened. BlackRock’s iShares bitcoin ETF claimed the bulk of the other half with its first day trading of $1bn.\n\nFake Tweet Rocks Markets\n\nA day before the approvals were announced, a fake tweet resulting from a hack of the SEC’s X account stated that all Bitcoin ETFs had been approved, causing upheaval in crypto markets. The account was hacked through an associated phone number, and was possible because the account wasn’t utilizing two-factor authentication. The post was quickly exposed as a fraud, but not before leading to $90 million in Bitcoin liquidations.\n\nBitcoin Dives as Euphoria Ends\n\nAfter the first ETFs began trading in the US, Bitcoin briefly topped $49,000 for the first time since December 2021. Next day however, Bitcoin’s price dropped below $42,000, plunging nearly 10%, as the euphoria over ETF approvals gave way to a ‘sell the news’ rout.\n\nSEC: We Don’t Support Bitcoin\n\nSEC Chair Gary Gensler indicated that the ETF approvals were granted reluctantly, emphasizing that the decision does not reflect the commission’s endorsement of Bitcoin itself. Gensler said that last year’s Grayscale court decision forced the commission’s hand, but it doesn’t signal support for Bitcoin or any other crypto asset; a category that he still views as speculative and volatile.\n\nUSDC Issuer Files for IPO\n\nCircle, the creator of stablecoin USDC, has filed for an initial public offering, to take the company public. The IPO is expected to take place after the SEC completes its review process. With a $25 billion market cap, USDC holds the spot as the second-largest stablecoin after Tether, which boasts a market cap of $95 billion.\n\nNew Ethereum Improvements Proposed\n\nIn an Ask-Me-Anything session, Ethereum co-founder Vitalik Buterin recommended a modest 33% increase in the gas limit to boost network capacity and reduce user expenses. However, the proposal comes with some risks, as larger blocks may lead to increased energy consumption, raising the potential for chain splits and abandoned blocks.\n\nX Discontinues NFT Profile Pictures\n\nSocial media platform X has discontinued its NFT profile picture service that allowed subscribers to use Ethereum-based NFTs as profile images. Previously known as Twitter, X embraced NFTs and bitcoin tipping in September 2021, expanding its NFT offerings by October of the following year with “NFT Tweet Tiles.”\n\nHouston, We Have a Problem\n\nThe Peregrine 1 space mission recently took off carrying a Bitcoin genesis block commemorative plaque, and a special Bitcoin token engraved with a private key for 1 BTC. The mission? To place those items on the surface of the moon, as a symbol that Bitcoin highlights remarkable progress in terms of technological advancement. Unfortunately, it seems there’s a problem with the rocket’s propulsion system, making it uncertain as to whether Bitcoin will ever reach the Moon safely.\n\nThat’s what’s happened this week in crypto, see you next week."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXRvLTM0MDAwLWFuYWx5c3QtcHJlZGljdHMtbmV4dC1tb3ZlLWZvci1idGMv0gFdaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9iaXRjb2luL2JpdGNvaW4tdG8tMzQwMDAtYW5hbHlzdC1wcmVkaWN0cy1uZXh0LW1vdmUtZm9yLWJ0Yy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin To $34,000? Analyst Predicts Next Move For BTC With This Chart Pattern - NewsBTC",
        "content": "Bitcoin had a surprisingly underwhelming price performance over the past week despite the United States Securities and Exchange Commission (SEC) approving the trading of spot BTC ETFs. The price of the flagship cryptocurrency almost broke into $49,000 at the peak of this positive news but has since retraced back below $43,000.\n\nAli Martinez, a popular crypto analyst on the X platform, has offered insight into the current market climate of Bitcoin, highlighting that the cryptocurrency’s price may face further downward pressure over the coming weeks.\n\nAnalyst Forecasts 20% Price Drop For BTC\n\nIn a recent post on X, the crypto pundit shared an update on his analysis of the Bitcoin’s price chart on the three-day timeframe. On January 4, Martinez initially identified an ascending parallel channel, which seems to be governing the Bitcoin price action since September 2023.\n\nIn price analysis, an ascending parallel channel is a technical analysis pattern that features two parallel upward-sloping trend lines. While it is mostly a bullish chart pattern, the ascending parallel channel can signal a short-term bearish move or even a trend reversal.\n\nBTC price in an ascending parallel channel on the three-day timeframe | Source: Ali_charts/X\n\nMartinez noted in his post that the current setup appears to be holding true after the Bitcoin price faced rejection from the parallel channel’s upper boundary at $48,000. Following this price correction, the analyst has predicted $34,000 at the channel’s lower boundary as the natural next stop for the premier cryptocurrency.\n\nA downward move to $34,000 would represent a significant 20% decline from Bitcoin’s current price point. However, according to Martinez’s analysis, it might not be looking all gloomy for the world’s largest cryptocurrency.\n\nOn the bright side, the analyst expects a quick recovery for the Bitcoin price after the downward spiral to $34,000. Martinez said that the pioneer crypto could make a rebound back to the upper boundary at $57,000.\n\nBitcoin Price Overview\n\nAs of press time, the Bitcoin price stands at $42,909, reflecting a negligible 0.6% decline in the past 24 hours. The premier cryptocurrency has struggled to hold above $43,000 since experiencing a massive downturn to below $42,000 on Friday.\n\nMeanwhile, BTC’s profits since the turn of the year have been cut back to a mere 1.6%, putting the bullish future of the coin into question. Bitcoin is down by nearly 3% on the weekly timeframe, according to data from CoinGecko.\n\nNevertheless, BTC maintains its position as the largest asset in the cryptocurrency sector, with a market capitalization of roughly $841 billion.\n\nBitcoin price hovers around $43,000 on the daily timeframe | Source: BTCUSDT chart on TradingView\n\nFeatured image from iStock, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8xNS92ZW5lenVlbGEtZW5kcy1jb250cm92ZXJzaWFsLXBldHJvLWNyeXB0b2N1cnJlbmN5LXJlcG9ydHMv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDI0LzAxLzE1L3ZlbmV6dWVsYS1lbmRzLWNvbnRyb3ZlcnNpYWwtcGV0cm8tY3J5cHRvY3VycmVuY3ktcmVwb3J0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Venezuela Ends Controversial Petro Cryptocurrency: Reports - CoinDesk",
        "content": "Any remaining petros are being converted to bolivars, the ailing local currency, according to one report. The final nail in the coffin for the Petro was a corruption scandal over financial irregularities around using crypto assets for oil operations which led to the resignation of the petroleum minister Tareck El Aissami and a crackdown on bitcoin mining operations, AFP reported."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vdS50b2RheS9ibGFja3JvY2stdG8tYmVjb21lLWJpdGNvaW5zLWJpZ2dlc3QtaG9sZGVyLXRvcC1hbmFseXN0LXByZWRpY3Rz0gFUaHR0cHM6Ly91LnRvZGF5L2JsYWNrcm9jay10by1iZWNvbWUtYml0Y29pbnMtYmlnZ2VzdC1ob2xkZXItdG9wLWFuYWx5c3QtcHJlZGljdHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "BlackRock to Become Bitcoin's Biggest Holder, Top Analyst Predicts - U.Today",
        "content": "Advertisement\n\nInvestment giant BlackRock is on track to surpass MicroStrategy as the largest holder of Bitcoin.\n\nThis prediction, based on the current acquisition rates of Bitcoin by BlackRock, has been supported by industry analyst Eric Balchunas.\n\nBalchunas, while expressing some skepticism about the pace of this development, acknowledged the inevitability of BlackRock's ascendancy in the Bitcoin space. \"Good point. Doubt it will happen that fast but it will happen,\" he wrote.\n\nThe top corporate holders of Bitcoin\n\nAs of now, the landscape of corporate Bitcoin holdings is dominated by several key players. Leading the pack is MicroStrategy, Inc. (MSTR), with a massive holding of 189,150 Bitcoins, valued at approximately $8.12 billion.\n\nMarathon Digital Holdings (MARA) and Tesla, Inc. (TSLA), holding 13,726 and 9,720 Bitcoins respectively, closely follow MicroStrategy.\n\nOther notable names include Coinbase Global (COIN), Hut 8 Mining Corp (HUT), and Block, Inc. (SQ).\n\nThe blockbuster launch of BlackRock's Bitcoin ETF\n\nEarlier this week, BlackRock successfully launched its Bitcoin ETF, a move hailed by CEO Larry Fink as \"step one in the technological revolution in the financial markets.\"\n\nThe BlackRock Spot Bitcoin ETF, which began trading on the Nasdaq, rapidly acquired 11,439 Bitcoins, valued at nearly $500 million, within just two days.\n\nThis ETF not only marks a major milestone for BlackRock but also reflects the growing interest and acceptance of cryptocurrencies among traditional financial institutions.\n\nFink's vision extends beyond just ETFs, with an eye on the potential tokenization of real-world assets, a concept gaining traction among those keen on blockchain technology."
    },
    {
        "id": 96,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTE1L2JpdGNvaW4tYnRjLXBvc3RzLXdvcnN0LXN0cmVhay1pbi1hLW1vbnRoLW9uLXNwb3QtZXRmLWhhbmdvdmVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin (BTC) Posts Worst Streak in a Month on Spot ETF Hangover - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    }
]