[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LnVzbmV3cy5jb20vbmV3cy90b3AtbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0L2FuYWx5c2lzLWJydWlzZWQtYnktc3RvY2stbWFya2V0LWNoaW5lc2UtcnVzaC1pbnRvLWJhbm5lZC1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Analysis-Bruised by Stock Market, Chinese Rush Into Banned Bitcoin - U.S. News & World Report",
        "content": "By Vidya Ranganathan and Summer Zhen\n\nSHANGHAI/HONG KONG (Reuters) - Dylan Run, a Shanghai-based finance sector executive, started moving a bit of his money into cryptocurrencies in early 2023, when he realized that the Chinese economy and its stock markets were going downhill.\n\nCrypto trading and mining has been banned in China since 2021. Run used bank cards issued by small rural commercial banks to buy cryptocurrencies through grey-market dealers, and capped each transaction at 50,000 yuan ($6,978) to escape scrutiny.\n\n\"Bitcoin is a safe haven, like gold,\" says Run.\n\nHe now owns roughly 1 million yuan worth of cryptocurrencies, accounting for half of his investment portfolio, compared with just 40% in Chinese equities.\n\nHis crypto investments are up 45%. China's stock market, meanwhile, has been sinking for 3 years.\n\nLike Run, more and more Chinese investors are using creative ways to own bitcoin and other crypto assets that they believe are safer than investing in crumbling stock and property markets at home.\n\nThey operate in a grey area. While cryptocurrency is banned in mainland China and there are strict controls on capital movement across the border, people are still able to trade tokens such as bitcoin on crypto exchanges such as OKX and Binance, or through other over-the-counter channels.\n\nMainland investors can also open overseas bank accounts to buy crypto assets.\n\nAfter Hong Kong's open endorsement of digital assets last year, Chinese citizens are also using their $50,000 annual forex purchase quotas to move money into cryptocurrency accounts in the territory. Under Chinese rules, the money can only be used for purposes such as overseas travel or education.\n\nChina's economic downturn \"has made investment on the mainland risky, uncertain and disappointing, so people are looking to allocate assets offshore\", said a senior executive of a Hong Kong-based cryptocurrency exchange, who declined to be identified due to sensitivity of the topic.\n\nBitcoin and crypto assets have attracted such investors, he said: \"Almost everyday, we see mainland investors coming into this market.\"\n\nAs retail investors make a dash for cryptocurrencies, China's brokers and other financial institutions aren't far behind. Starved of growth opportunities at home, many of them are exploring crypto-related businesses in Hong Kong.\n\n\"If you are a Chinese brokerage, facing a sluggish stock market, weak demand for IPOs, and shrinkage in other businesses, you need a growth story to tell your shareholders and the board,\" said the exchange executive.\n\nThe Hong Kong subsidiaries of Bank of China, China Asset Management (ChinaAMC) and Harvest Fund Management Co are all exploring businesses in the territory that deal in digital assets.\n\nILL-GOTTEN\n\nAccess to bitcoin isn't that difficult on the mainland, according to Reuters' checks of online crypto exchanges and interviews with retail investors.\n\nExchanges such as OKX and Binance still offer trading services for Chinese investors, and guide them to use fintech platforms such as Ant Group's Alipay and Tencent's WeChat Pay to convert yuan into stablecoins with dealers, to trade cryptocurrencies.\n\nOKX and Binance did not reply Reuters requests for comment.\n\nCrypto data platform Chainalysis says crypto-related activities in China have bounced, and its global ranking in terms of peer-to-peer trade volume jumped to the 13th place in 2023, from 144 in 2022.\n\nDespite being banned, the Chinese crypto market recorded an estimated $86.4 billion in raw transaction volume between July 2022 and June 2023, dwarfing Hong Kong, which witnessed $64 billion in crypto trading, Chainalysis said. And the proportion of large retail transactions of $10,000-$1 million is nearly twice the global average of 3.6%.\n\nMuch of China's crypto activity \"takes place through over-the-counters or through informal, grey market peer-to-peer businesses,\" Chainalysis said in the report.\n\nBrick-and-mortar crypto exchange stores, have sprouted in Hong Kong's busy business and shopping streets. These offline shops are lightly regulated.\n\nAt Crypto HK, a popular crypto store in the Admiralty district, customers can buy cryptocurrencies with a minimum HK$500 ($64) and are not required to provide any identity documents.\n\nThe underground crypto market in China is thriving.\n\nMichael Wang, a dealer who helps individuals buy digital assets, says daily volumes run into several million yuan or even dozens of millions.\n\nCharlie Wong, a 35-year-old buy-side equity analyst, bought bitcoin via the Hashkey Exchange, an officially recognised marketplace in Hong Kong.\n\n\"It is hard to find opportunties in traditional fields. Chinese stocks and other assets perform poorly ... the economy is undergoing a crucial transition,\" he said.\n\nChina's crackdown on the property sector over the past three years has battered prices of homes, which were traditionally the mainstay in household savings portfolios. The stock market has fared even worse, with the benchmark CSI 300 Index down by half its value since early 2021.\n\nBitcoin, by contrast, has leapt 50% since mid-October, and is known for its wild swings.\n\nWong believes Chinese officials are cognisant of how disruptive bitcoin can be and yet aware of its huge potential, and hence their endorsement of crypto trading in Hong Kong, to keep a toehold in the crypto business booming in financial centres such as Singapore and New York.\n\nHong Kong, though autonomously governed, is a Chinese special administrative region.\n\nChainalysis reckons the developments \"have created speculation that the Chinese government may be warming to cryptocurrency and that Hong Kong may be a testing ground for these efforts.\"\n\n($1 = 7.1659 Chinese yuan renminbi)\n\n($1 = 7.8197 Hong Kong dollars)\n\n(Additional reporting by Shanghai Newsroom; Editing by Vidya Ranganathan and Kim Coghill)"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93aHktYml0Y29pbi1kb2dlY29pbi1ldGhlcml1bS1mZWxsLTAyNDYwNDI4MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin, Dogecoin, and Etherium Fell Today - Yahoo Finance",
        "content": "Several major cryptocurrencies slumped on Tuesday as investors grappled with the implications over capital inflows to the crypto market following the U.S. Securities and Exchange Commission's (SEC's) landmark approvals of the first spot Bitcoin (CRYPTO: BTC) exchange-traded funds (ETFs) almost two weeks ago on Jan. 10, 2024.\n\nWhen all was said and done during today's regular trading session, the price of Bitcoin had fallen 2.2%, Ethereum (CRYPTO: ETH) was down 6.4%, and Dogecoin (CRYPTO: DOGE) had declined 5.9%.\n\nCompany card for Bitcoin CRYPTO:BTC\n\nExcitement is waning for spot Bitcoin ETFs\n\nThe price of Bitcoin, in particular, has declined around 20% from its post-ETF approval highs of around $49,000 as the excitement surrounding the approvals has seemed to wane. That marked a three-year high on Jan. 11, the day after the SEC's formal approval of 11 competing spot Bitcoin ETFs hit the wires.\n\nTo be fair, Bitcoin is also still up more than 70% over the past year. The bulk of that gain came in a multi-month rally that began in Oct. 2023 after the SEC declined to appeal a federal court's ruling in August that prevented crypto-asset manager Grayscale Investments from converting its popular Grayscale Bitcoin Trust into an ETF.\n\nMany investors considered this a huge deal for the cryptocurrency market in general. ETFs are a much more accessible medium for investors putting their capital to work in cryptocurrency assets, after all, compared to setting up separate crypto accounts or wallets with a crypto-specific broker. ETF shares can be bought and sold throughout the normal trading day through virtually any broker, similar to how retail investors can easily buy and sell publicly traded stocks.\n\nCrypto-industry watchers also mused that once the first spot Bitcoin ETFs were finally approved, it would not only serve as validation for crypto assets as a mainstream investment medium but could also present an enormous windfall for ETF providers as capital surged into crypto assets. According to research from data analytics firm CryptoQuant, the capital influx stemming from spot Bitcoin ETFs has the potential to increase the overall cryptocurrency market capitalization by a total of more than $1 trillion over the long term.\n\nStory continues\n\nThis is more than a simple \"sell the news\" event\n\nWhile some investors are undoubtedly taking their quick crypto profits off the table given the massive rally, I think this situation is more than a simple \"sell the news\" event.\n\nAccording to a report from digital asset manager CoinShares this morning, for example, crypto funds saw inflows of \"only\" $1.25 billion in the first week after the launch of the first Bitcoin ETFs. That influx turned to an outflow of $21 million last week, however, as some large institutional investors took advantage of the rally to pare their own positions.\n\nBut even that surprising news requires more perspective. As Bloomberg Intelligence's senior ETF analyst Eric Balchunas pointed out on X this week, the outflows have been primarily fueled by more than $2.2 billion in withdrawals from Grayscale's spot bitcoin ETF alone. Among those large sellers was the estate of former cryptocurrency exchange FTX, which liquidated around $1 billion of its holdings as part of its bankruptcy proceedings.\n\nThat could signal a light at the end of this tunnel for crypto bulls, however. There's certainly plenty of work to be done for the cryptocurrency market to gain true acceptance as a mainstream investment option. But it's also not exactly common to see a bankrupt cryptocurrency exchange liquidating its massive positions on the heels of what otherwise should have represented a watershed moment for the crypto asset class.\n\n\n\nOnce the dust settles surrounding the recent spot Bitcoin ETF approvals, I won't be the least bit surprised if the crypto market's outflows turn back to inflows as more investors begin dipping their toes into the crypto pool. If that happens, this pause in Bitcoin's rally might just prove to be short-lived.\n\nShould you invest $1,000 in Bitcoin right now?\n\nBefore you buy stock in Bitcoin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Bitcoin wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 22, 2024\n\nSteve Symington has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin and Ethereum. The Motley Fool has a disclosure policy.\n\nWhy Bitcoin, Dogecoin, and Etherium Fell Today was originally published by The Motley Fool"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50Lzk5ZTQwNmYwLWM1YWYtNGE2Ny05OTM3LWFmYjFlYTg4NTU2NdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin price falls 15% following launch of ETFs - Financial Times",
        "content": "Print this page\n\nBitcoin has lost 15 per cent of its value over the past two weeks, as some investors use the much-hyped launch of bitcoin exchange traded funds earlier this month to take profits and exit their holdings of the volatile cryptocurrency.\n\nThe price of bitcoin sank as much as 3 per cent on Tuesday, dipping below $39,000 for the first time since early December, before recovering slightly in afternoon trading.\n\nThe recent losses have unwound part of a huge rally late last year, which came amid fevered speculation that the launch of mainstream stock market funds tracking the world’s leading crypto token would draw in new investors to bitcoin.\n\nBut the flows into the ETFs — many launched by big Wall Street players such as BlackRock — have underwhelmed and investors who bought them have been left with hefty losses.\n\nThe 10 new funds launched on January 11, after they were approved by the US Securities and Exchange Commission, had collectively pulled in $4.7bn by the end of Tuesday, according to crypto investment group CoinShares. Bitcoin traded at $46,100 on the day the ETFs were launched, but has fallen steadily since.\n\nAt the same time, $3.4bn has left Grayscale’s fund, the world’s largest bitcoin investment vehicle, since it converted to an ETF alongside the new launches.\n\nAnalysts think much of the money in the 10 new funds is likely to have come from investors exiting Grayscale, which charges much higher fees than its competitors.\n\n“What people didn’t realise is that you would have an enormous exit from Grayscale,” said Douglas Comin, a senior crypto options trader at XBTO. “If you scratch the surface, you see that most inflows are not new money, it’s just investors moving from Grayscale to another ETF.\n\n“These ETFs were super highly anticipated, and now we see that [a bitcoin bull run] is not going to materialise, at least not as quickly as the market wanted,” he added.\n\nThe conversion of Grayscale’s 10-year-old bitcoin trust has allowed some of its investors — who have for years only been able to sell shares in the trust at a large discount to the price of bitcoin — to exit their holdings altogether. The fund’s overall size has fallen from $28bn earlier this month to $22bn by close of trading on Monday.\n\n“ETFs bring liquidity, and while they enable people to come in, they also enable people to exit,” said Varun Paul, director of market infrastructure at blockchain platform Fireblocks. “Some investors are exiting positions after buying bitcoin a long time ago, so they’re in the money.”\n\nGrayscale reduced its 2 per cent management fee to 1.5 per cent as it prepared to launch its ETF, but that rate remains considerably more expensive than its competitors.\n\nIn contrast, BlackRock charges just 0.12 per cent. However, that figure will rise to 0.25 per cent in the next year if its ETF pulls in $5bn in assets under management. The US group has drawn in $1.7bn to date."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0L2ZpZGVsaXR5LWFuZC1ibGFja3JvY2stYXJlLWRvbWluYXRpbmctdGhlLWJpdGNvaW4tZXRmLWZsb3ctcmFjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Spot-ETF Flow Race Dominated by Fidelity, BlackRock (FBTC, IBIT) - Bloomberg",
        "content": "Less than two weeks after US regulators fired the starting gun for ten spot Bitcoin exchange-traded funds, it’s increasingly looking like a two-horse race for new assets.\n\nBlackRock’s iShares Bitcoin Trust (ticker IBIT) and the Fidelity Wise Origin Bitcoin Fund (FBTC) are leading the field with about $1.9 billion and $1.6 billion of inflows, respectively, according the latest available data compiled by Bloomberg. That’s roughly a combined 70% of spot Bitcoin ETF inflows so far Bloomberg Terminal ."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMjMvYml0Y29pbi1icmVha3MtYmVsb3ctMzkwMDAtYXMtcG9zdC1ldGYtdHVtYmxlLWNvbnRpbnVlcy5odG1s0gFgaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjQvMDEvMjMvYml0Y29pbi1icmVha3MtYmVsb3ctMzkwMDAtYXMtcG9zdC1ldGYtdHVtYmxlLWNvbnRpbnVlcy5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin trims its losses after breaking below $39,000 to lowest level in 7 weeks - CNBC",
        "content": "The price of the cryptocurrency was last lower by nearly 2% at $39,362.00, trimming earlier losses but still adding to its 4% decline from the previous day .\n\nBitcoin extended its recent declines on Tuesday, falling further below $40,000 to its lowest level since the beginning of December.\n\nSome have pointed to short-term selling pressure from exits from the Grayscale Bitcoin Trust (GBTC), which has seen about $2 billion in outflows since Jan. 19 while BlackRock's iShares Bitcoin Trust and Fidelity's Wise Origin Bitcoin Fund have each seen more than $1 billion in inflow.\n\n\"The outflow from GBTC should not matter that much as bitcoin's inflow into other ETFs have offset the outflow by $1.2 billion so far,\" said Yuya Hasegawa, crypto market analyst at Japanese bitcoin exchange Bitbank. \"It seems that the seemingly large amount of daily outflows from GBTC is affecting the market in a psychological way.\"\n\nInvestors have been waiting out this correction, which was expected by many as a \"sell the news\" phenomenon following the well-telegraphed approval of bitcoin ETFs. Expectations around the event emerged last summer intensified in August, pushing the bitcoin price steadily higher.\n\nNow, traders are sitting on large unrealized profits and analysts say bitcoin's price has a long way to fall before reversing higher. In the near term, $36,000 is the support level to watch, chart analysts have said. Still, chart experts say a new all-time high for bitcoin is still in sight for this year.\n\nThe move in bitcoin continued to pull the rest of the crypto market lower. Ether , fell 7% to $2,170.55. Solana slid 7% along with the token tied to decentralized finance protocol Uniswap. Ripple's XRP fell 5% and dogecoin lost 6%.\n\nCrypto-related equities were under pressure as well. Microstrategy , which has long traded as a proxy for the bitcoin price, lost 4%, while the biggest miners, Marathon Digital and Riot Platforms , each fell about 2%. Coinbase slipped 4%, in part due to a downgrade by JPMorgan, which cited concerns of crypto rally fizzle.\n\nDon't miss these stories from CNBC PRO:"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjMvYml0Y29pbi11bmRlci0zOWstYXMtZXRmLWRlYnV0LWNvbnRpbnVlcy10by1iZS1hLXNlbGwtdGhlLW5ld3MtZXZlbnQv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8yMy9iaXRjb2luLXVuZGVyLTM5ay1hcy1ldGYtZGVidXQtY29udGludWVzLXRvLWJlLWEtc2VsbC10aGUtbmV3cy1ldmVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Under $39K as ETF Debut Continues to Be a ‘Sell-the-News’ Event - CoinDesk",
        "content": "Part of the recent selling pressure on bitcoin has been traced back to sales from the FTX bankruptcy estate, which has dumped some 22 million shares of Grayscale’s GBTC in the past few weeks, as CoinDesk reported. On-chain analysis firm CryptoQuant was among the few contrarian bets that speculated that the ETF approval would be a sell-the-news event."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nYnRjLXNoZWRzLWFzc2V0cy1yaXZhbC1iaXRjb2luLTIzMzcyOTcwMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "GBTC Sheds Assets as Rival Bitcoin ETFs Add Investors - Yahoo Finance",
        "content": "ETF Investing Tools\n\nThis week has continued the dueling spot bitcoin ETF narratives of Grayscale GBTC shedding assets at a fast clip but inflows to nine other products rising.\n\nTuesday outflows of $515 million brought this week’s total to over $1.15 billion. The Grayscale Bitcoin Trust ETF (GBTC) has lost nearly $4 billion in assets in the eight trading days since the Securities and Exchange Commission approved the new products. Its rivals gained $409 million in assets on Tuesday to raise their weekly inflows to $963 million. They have received nearly $5 billion in inflows since their Jan. 11 unveilings. Wednesday totals were unavailable at the time of publication.\n\nStill, Bloomberg Senior ETF Analyst Eric Balchunas struck an optimistic tone about what he has called “The Great GBTC Gouge,” in a post on X/Twitter.\n\n“Total rolling net flows down to +$983m as Nine loses a bit of ground despite $GBTC flows being slightly less bad,” Balchunas wrote, noting that BlackRock’s iShares Bitcoin Trust (IBIT) and the Fidelity Wise Origin Bitcoin Fund (FBTC) inflows continued at a $1 billion per week pace that only Vanguard’s VOO could match.\n\nHe added that both were a “near lock” to reach $2 billion in inflows by the week’s end.\n\n“Also this shows volume and discount (which were really low for GBTC yest) may emerge as best predictors of the flow coming later (vs the transfer number ppl report each morning),” Balchunas wrote.\n\nThe opposing trends have formed quickly since the SEC reversed a decade of objections on Jan. 10 to give a thumbs-up to 11 products based primarily on the spot price of bitcoin, including a Grayscale proposal to convert its GBTC trust into an ETF. Analysts have speculated that many Grayscale customers sold their shares to take profits after investing at a low price during the extended crypto bear market, which began in late 2021, or to move into competing products that charge a lower fee.\n\nGrayscale charges 1.5%, while Bitwise, among others, has waived its fee for the first six months on the first $1 billion of assets. On Monday, GBTC had dropped more than 13% of its outstanding shares. Balchunas and fellow Bloomberg analyst James Seyffart have predicted that the company would lose around 25% of its shares.\n\nStory continues\n\nBitcoin's Price Fade\n\nBitcoin’s was recently trading slightly above $40,100, a roughly 1.7% gain over the past 24 hours. But the price of the largest cryptocurrency by market capitalization has dropped about 20% since the approvals. Bitcoin dipped below $16,500 last January before rallying with a good portion of the gains coming later in the year amid rising hopes for a spot bitcoin ETF approval.\n\n“GBTC continues to bleed assets as investors swap out of the relatively expensive fund into cheaper alternatives,” etf.com analyst Sumit Roy wrote. “Selling by arbitrageurs, who bought the fund at a discount to its net asset value, has also likely contributed to the outflows.”\n\nHe added: “Bulls argue that inflows will pick up once the GBTC outflows are exhausted. A more bearish interpretation would be that most of the money flowing out of GBTC is flowing into these other spot bitcoin ETFs, so the modest $1 billion of net inflows for spot bitcoin ETFs that we’ve seen so far already reflects the true demand for spot bitcoin ETFs.\n\nGrayscale \"Dominating Trading Volume\"\n\nIn a statement emailed to ETF.com, Grayscale’s John Hoffman, Grayscale’s managing director of sales & distribution, wrote that GBTC had “launched as the world’s largest spot Bitcoin ETF,” and “been dominating trading volume.”\n\n“Broadly speaking, large capital markets ETFs are used in a variety of investing strategies, and we anticipate GBTC’s diverse shareholder base will continue to deploy strategies that impact inflows and outflows,” he wrote.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjQvMDEvMjQvYml0Y29pbi13cmVzdGxlcy13aXRoLTQwMDAwLWFzLWl0LXRyaWVzLXRvLXJlY292ZXItcmVjZW50LWxvc3Nlcy1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin wrestles with $40,000 as it tries to recover recent losses - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin wrestles with $40,000 as it tries to recover recent losses: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Core Scientific CEO Adam Sullivan discusses the company's reorganization and re-listing of shares on the Nasdaq."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvYml0d2lzZS1iZWNvbWVzLWZpcnN0LXNwb3QtYml0Y29pbi1ldGYtcHJvdmlkZXItdG8tcHJvdmlkZS13YWxsZXQtYWRkcmVzcy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI0L2JpdHdpc2UtYmVjb21lcy1maXJzdC1zcG90LWJpdGNvaW4tZXRmLXByb3ZpZGVyLXRvLXByb3ZpZGUtd2FsbGV0LWFkZHJlc3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitwise Becomes First Spot Bitcoin ETF Provider to Provide Wallet Address - CoinDesk",
        "content": "Not including any flows today, Bitwise holds 11,858 bitcoins worth roughly $474 million at the current bitcoin price just under $40,000. The asset manager is the most successful crypto-native ETF issuer so far with $518 billion of inflows in the past eight days. Only spot ETFs from BlackRock and Fidelity have seen more inflows, roughly $1.8 billion and $1.5 billion, respectively."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjMvYml0Y29pbi1pbmRpY2F0b3Itd2hpY2gtc2lnbmFsZWQtbGF0ZS0yMDIzLXJhbGx5LWlzLWFib3V0LXRvLWZsYXNoLWJlYXJpc2gtc2lnbmFsL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzIzL2JpdGNvaW4taW5kaWNhdG9yLXdoaWNoLXNpZ25hbGVkLWxhdGUtMjAyMy1yYWxseS1pcy1hYm91dC10by1mbGFzaC1iZWFyaXNoLXNpZ25hbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Indicator, Which Signaled Late 2023 Rally, Is About to Flash Bearish Signal - CoinDesk",
        "content": "The green band crossed above the red band in mid-October, when bitcoin traded near $28,000, signaling a bullish trend ahead. The cryptocurrency consistently rallied in the subsequent weeks, consistently trading above the red band to reach a high of nearly $49,000 on Jan. 11."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0Ly1hbGFtZWRhLWdhcC1rZWVwcy1iaXRjb2luLXZvbGF0aWxlLWV2ZW4td2l0aC1ldGZzLWJvb3N0aW5nLXRyYWRpbmctdm9sdW1l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price (BTC) Stays Volatile Even With Spot ETFs Boosting Trading Volume - Bloomberg",
        "content": "A dearth of liquidity in the digital-asset market continues to roil Bitcoin, even with the first US exchange-traded funds to hold the cryptocurrency logging billions of dollars in trading volume since their debut.\n\nThe ability to easily or quickly buy and sell the digital currency hasn’t improved since the 10 funds began trading Jan. 11, traders say. Liquidity is especially important in a relatively new market such as crypto, where a single large trade can have an outsized impact on an asset price, raising the risk of manipulation."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvY3J5cHRvLXdoYWxlcy1odW50LWZvci1iYXJnYWlucy1hcy1iaXRjb2luLXByaWNlcy1zbGlkZS1kYXRhLXNob3dzL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvY3J5cHRvLXdoYWxlcy1odW50LWZvci1iYXJnYWlucy1hcy1iaXRjb2luLXByaWNlcy1zbGlkZS1kYXRhLXNob3dzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Crypto Whales Hunt for Bargains As Bitcoin Prices Slide, Data Shows - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjczOTI0L2JpdGNvaW4tcHJpY2UtY29ycmVjdGlvbi1pbmRpY2F0b3JzLWJpdGZpbmV40gFUaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjczOTI0L2JpdGNvaW4tcHJpY2UtY29ycmVjdGlvbi1pbmRpY2F0b3JzLWJpdGZpbmV4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin price falls below $39,000 as indicators suggest risk of a deeper correction, according to Bitfinex - The Block",
        "content": "The bitcoin price has fallen below the $39,000 mark, leading to an increased risk of a further price correction from the short-term holder cohort, Bitfinex analysts said. \"The tendency of short-term holders to react more acutely to short-term market fluctuations means there is a possibility of a further substantial price correction, with critical support levels only at $38,000 and $36,000,\" they noted.\n\nAccording to Tuesday's Bitfinex Alpha Report, bearish sentiment appears to be prevailing in the market. \"The next crucial price levels for bitcoin that could provide support are estimated to be between $38,000, which is close to the short-term holder realized price for bitcoin at $38,307, and $36,000,\" the report stated.\n\nBitfinex analysts tracked metrics for unrealized and realized profit and loss for short-term bitcoin holders, identifying that over half of the profits accumulated by this cohort have been wiped out. \"Many holders, especially those who acquired bitcoin less than a month ago, are now exiting the market at a loss,\" the analysts added.\n\nMarket volatility causes spike in liquidations\n\nRELATED INDICES See crypto indices\n\nAs a result of the heightened market volatility, total liquidations of leveraged crypto positions in the past 24 hours have surpassed $330 million.\n\nThe majority of the liquidations involved long positions, leading to a loss of over $290 million, while short positions contributed only around $39 million to the total liquidations, according to Coinglass data.\n\nThe bitcoin price has dropped more than 4.5% in the past 24 hours, falling below the $39,000 mark. The world’s largest cryptocurrency by market capitalization is now trading at $38,894 as of 5.17 a.m. ET, according to The Block’s Prices Page."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDI0LzAxLzIzL2JpdGNvaW4tYnJpZWZseS1mYWxscy1iZWxvdy0zOTAwMC1hcy1wb3N0LWV0Zi1zZWxsaW5nLXByZXNzdXJlLWNvbnRpbnVlcy1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin briefly falls below $39,000 as post-ETF selling pressure continues - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin briefly falls below $39,000 as post-ETF selling pressure continues: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Mathew McDermott, global head of digital assets at Goldman Sachs, explains what the approval of spot bitcoin ETFs in the United States means for the bank."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjUvdGVzbGFzLWJpdGNvaW4taG9sZGluZ3MtcmVtYWluLXVuY2hhbmdlZC1pbi1xNC_SAV9odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI1L3Rlc2xhcy1iaXRjb2luLWhvbGRpbmdzLXJlbWFpbi11bmNoYW5nZWQtaW4tcTQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Tesla’s Bitcoin Holdings Remain Unchanged in Q4 - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0L2JpdGNvaW4tcy1idGMtcG9zdC1ldGYtc2x1bXAtcGF1c2VzLWFzLWNoYXJ0cy1zaWduYWwtcGl2b3RhbC10ZXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's Post-ETF Slump Pauses as Charts Signal Pivotal Test - Bloomberg",
        "content": "Bitcoin paused a retreat that began after US exchange-traded funds for the largest digital asset began trading on Jan. 11 and now faces a pivotal test if key charts are right.\n\nThe token rose as much as 3.4% on Wednesday before paring some of the gain to trade at $40,180 as of 6:55 a.m. in New York. It’s down almost 20% from an intraday peak of $49,021 when the ETFs went live, as fanfare about the products gives way to uncertainty over the eventual scale of demand for them."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjMvYm90dG9tLWZpc2hpbmctaW4tYml0Y29pbi1oZXJlLWFyZS10aGUta2V5LXNpZ25zLXRvLXdhdGNoLWZvci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bottom Fishing in Bitcoin? Here Are the Key Signs To Watch for - CoinDesk",
        "content": "Bottom Fishing in Bitcoin? Here Are the Key Signs To Watch for\n\nSavvy traders are looking for signs of capitulation in the spot and perpetual futures market, and renewed demand for calls when calling market bottom and trend reversal higher.\n\nBy Omkar Godbole Jan 23, 2024 at 8:01 a.m. UTC"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDI0LTAxLTIzL2JpdGNvaW4tcy0yMC1wb3N0LWV0Zi1zbGlkZS10aHJlYXRlbnMtZXhjaGFuZ2UtdHJhZGVkLWZvbW_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's 20% Post-ETF Slide Threatens Exchange-Traded FOMO - Bloomberg",
        "content": "It can seem silly to apply some traditional market terminology to crypto, such as when a “bear market” is declared because an asset or index has fallen 20% from a recent peak. Historically, a move like that is enough to mark a big regime shift in the stock market, but just another day in the office for the volatile world of crypto trading.\n\n\n\nYet the latest 20% drop in Bitcoin from its recent high is worth some scrutiny. In fact, it could be the most-scrutinized dip of that size in recent memory, given how much hype accompanied the run-up to the launch of exchange-traded funds that invest direct in the original cryptocurrency.\n\n\n\nThere are an assortment of reasons being offered for the drop, including the old standby cliché of “buy the rumor, sell the news” when it comes to ETFs, and some of the usual macro suspects: Interest rates have crept higher in the new year, so has the dollar. Even the ghost of FTX is in the mix! The bankrupt exchange’s estate has been dumping its position in the newly converted Grayscale Bitcoin Trust ETF, and those outflows are destined to be used to pay off creditors rather than recycled into competing Bitcoin ETFs with lower fees.\n\n\n\n\n\nRegardless of what catalysts caused the 20% drop, the key question now is whether the tumble itself will prove to be its own catalyst to frost over the green candles that seemed to have been marking the end of the latest crypto winter. Let’s face it, FOMO – fear of missing out – has always been one of the most important drivers in crypto moonshots.\n\n\n\nA recent survey by Deutsche Bank showed that more than one-third of respondents expect Bitcoin to drop below $20,000 by year end, and most consumers expressed concern about the potential collapse of a major cryptocurrency by 2026.\n\n\n\nIn other words, missing out is not exactly the main fear these days in the post-FTX crypto landscape, regardless of how much cheaper, safer and more-convenient the ETFs make it to gain exposure to Bitcoin.\n\n\n\nSo for the moment, all the breathless predictions that the launch of the ETFs would send Bitcoin to a new record high – or even to $100,000, as some forecast – seem a little suspect.\n\n\n\nBut after all, tomorrow is another day and the Bitcoin hype machine is poised to pivot to a new talking point: The upcoming halving, when supply of new tokens gets cut in half. How much that’s able to get the FOMO juices flowing again could be the ultimate near-term test of the potential demand for the new ETFs."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMjMvY29yZS1zY2llbnRpZmljLWhpdHMtbmFzZGFxLWFzLXdhbGwtc3RyZWV0LWdvZXMtYmlnLWluLWJpdGNvaW4tbWluaW5nLS5odG1s0gFvaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjQvMDEvMjMvY29yZS1zY2llbnRpZmljLWhpdHMtbmFzZGFxLWFzLXdhbGwtc3RyZWV0LWdvZXMtYmlnLWluLWJpdGNvaW4tbWluaW5nLS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Core Scientific returns to Nasdaq as Wall Street shows renewed love for bitcoin mining - CNBC",
        "content": "Just over a year after the crypto winter sent bitcoin miner Core Scientific spiraling into bankruptcy, the Texas-based company is back on the Nasdaq. Trading is scheduled to resume Wednesday morning.\n\nCore, which has operations in five U.S. states — Texas, North Dakota, North Carolina Georgia, and Kentucky — mines for bitcoin and other cryptocurrencies by packing data centers full of specialized computers that crunch math equations to validate transactions and create new tokens. The process requires expensive equipment, technical expertise and a lot of electricity.\n\nAs recently as 2021, Core was one of the largest publicly traded crypto mining firms in the U.S., hitting the market in July of that year via a special purpose acquisition company in a deal that valued it at roughly $4.3 billion. However, bitcoin lost over 60% of its value in 2022, meaning all that digital currency Core was producing was suddenly worth a lot less while operating costs remained high.\n\nWithout sufficient cash on hand to repay the financing debt owed on equipment it was leasing, Core was forced to enter bankruptcy in December 2022. The stock had fallen more than 98%.\n\n\"When bitcoin prices declined and power prices increased, obviously that hurt our levered free cash flow position, as well as hurt our balance sheet, since we were carrying bitcoin on balance sheet,\" Core CEO Adam Sullivan told CNBC in an interview.\n\nRather than liquidating, Core continued to operate and reached a deal with senior security noteholders who hold the bulk of the company's debt.\n\nThe restructuring plan announced Tuesday has slashed $400 million in debt from Core's balance sheet by \"converting equipment lender and convertible note holder debt to equity,\" the company said in a statement.\n\nCore said the new credit facility along with projected operating cash flow will allow the company to \"emerge and continue executing its multi-year growth plan.\"\n\n\"We went through a very successful Chapter 11 bankruptcy process,\" Sullivan said. \"It accomplished exactly what we wanted to accomplish, which was reducing debt and giving us time to pay down any remaining debt on our balance sheet over the course of five years.\"\n\nAlso helping Core as it reenters the public market is an expansive footprint of mines across the country, and investors' renewed enthusiasm toward bitcoin, which jumped 150% in 2023.\n\nEven in bankruptcy, Core invested in developing its infrastructure. In 2023, the company minted 13,762 bitcoin from its fleet of mines, or around $540 million at the token's current price. That doesn't include the profit Core generates from mining coins on behalf of other companies.\n\nCore is in the process of deploying tens of thousands of more mining rigs with the goal of increasing its capacity by more than 50% over the next four years.\n\n\"Our focus is not going to be on the market leadership position, it's going to be on being the most efficient bitcoin mining company and looking at all of our assets inside of our portfolio, so that we can ensure that we're refining power into the highest value compute that we can,\" he said.\n\nThe public markets have been going big in mining since bitcoin started rebounding. Marathon Digital soared more than 590% in 2023 while Riot Blockchain jumped more than 350% and CleanSpark gained over 400%.\n\nChardan Research said in a note on Jan. 8 that Marathon's \"acquisition of hosting facilities signals a shift in management's strategy from asset-light to owner-operator,\" a move that it called a \"meaningful improvement.\"\n\nHeadwinds remain.\n\nBitcoin miners have pared back gains in the last few weeks as the price of bitcoin has fallen, and in April, a market-moving event dubbed the \"halving\" will cut the prize that miners receive in half.\n\nThe halving, which happens roughly every four years, is written into bitcoin's code and is designed to stave off inflation. Though it will immediately impact miner profits, it's also historically proven to be a catalyst for a run-up in the price of bitcoin. During the crypto market's previous bull market run, the world's largest cryptocurrency rose more than 560%.\n\nThere are also new potential opportunities for miners to collect fees, as a startup ecosystem is built on top of bitcoin's base chain, Bernstein said in a note on Jan. 17.\n\n\"It is not surprising that listed U.S miners are investing aggressively to 'land grab' a higher share\" of the $900 billion bitcoin network, the analysts wrote. The firm added that bitcoin miners are \"best positioned to benefit from growing institutionalization and financialization of bitcoin,\" including the buildout of the bitcoin-based payment infrastructure called the Lightning Network, as well as the rising popularity of nonfungible tokens and ordinals minted on bitcoin.\n\n\"We expect 2024 to be a break-out inflection year for crypto,\" Bernstein analysts wrote. \"We recommend achieving Bitcoin exposure via Bitcoin miners.\" The firm said Riot and CleanSpark are its preferred picks.\n\nWATCH: Bitcoin in 2024 - Risks and rewards"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzIzL2lzLWdyYXlzY2FsZS10YWtlb3Zlci1iYWl0LWFtaWQtYml0Y29pbi1ldGYtYmF0dGxlL9IBZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzIzL2lzLWdyYXlzY2FsZS10YWtlb3Zlci1iYWl0LWFtaWQtYml0Y29pbi1ldGYtYmF0dGxlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Is Grayscale Takeover Bait Amid Bitcoin ETF Battle? - CoinDesk",
        "content": "\"A strategic acquisition of a firm such as Grayscale makes a ton of sense for the right traditional ETF issuer assuming the price is palatable,\" said Nate Geraci, president of the ETF Store, an advisory firm. \"While only two weeks old, the spot bitcoin ETF category is already wildly competitive and has clearly turned into a scale game given how low expense ratios are. A traditional ETF issuer could quickly boost assets under management, gain business operating expertise, and also acquire some 'crypto street cred' by targeting the right crypto-fund native firm.\""
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9idXktYml0Y29pbi1ldGZzLWNvbnNpZGVyLTItMTEzMDAwODkxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy the New Bitcoin ETFs? Consider These 2 Risks - Yahoo Finance",
        "content": "According to every key benchmark, the new spot Bitcoin (CRYPTO: BTC) exchange-traded funds (ETFs) appear to be a remarkable success. In just the first few days, they attracted more than $1 billion in assets. Trading volume has been \"insane,\" according to market participants. And even though Bitcoin actually fell 12% in the week after the introduction of these ETFs, investor appetite still appears to be very strong.\n\nHowever, there are two Bitcoin ETF risks that you won't hear a lot of people talking about. And either could affect how well your investment performs over time.\n\nTracking error risk\n\nThe primary purpose of the new ETFs is to give you exposure to the performance of Bitcoin. If Bitcoin goes up by 10%, your ETF should go up by 10%. And if Bitcoin goes down by 10%, your ETF should go down by 10%. While it might be naive to expect an exact 1:1 match in price, the difference should be fairly negligible, right?\n\nAnd yet, over the first week of trading, the performances of the different Bitcoin ETFs have sometimes been all over the place. I first noticed this when watching an analyst on CNBC explain why the price of Bitcoin was down while in the background, all the tickers for the Bitcoin ETFs were flashing different numbers!\n\nFor example, the new offering from BlackRock (NYSE: BLK), the iShares Bitcoin Trust (NASDAQ: IBIT), was down 6%. The new offering from VanEck, the VanEck Bitcoin Trust ETF (NYSEMKT: HODL), was down 7%. And the WisdomTree Bitcoin Trust (NYSEMKT: BTCW), was down 12%.\n\nWhat concerns me is not that the ETFs are down. That's to be expected, with the price of Bitcoin down. What concerns me is that performance can vary so widely. Such discrepancies are known as tracking errors, and they highlight the potential difficulty of tracking Bitcoin. Keep in mind that Bitcoin is a truly global asset that trades 24 hours a day. That makes it harder to track than, say, the S&P 500 index, which trades during regular market hours.\n\nStory continues\n\nCustodial risk\n\nThe other risk is called custodial risk. This is the risk of incurring a loss on your assets in the event of a custodian's insolvency, negligence, fraud, poor cybersecurity standards, or inadequate record-keeping.\n\nThis matters because the custodian for much of the Bitcoin held by the big Wall Street players will be cryptocurrency exchange Coinbase Global (NASDAQ: COIN). In fact, eight of the 11 Bitcoin ETFs have chosen Coinbase as their custodian.\n\nImage source: Getty Images.\n\nTo conceptualize this, imagine Coinbase having a vast digital vault filled with safe deposit boxes where 70% of Wall Street's Bitcoin is being held. In this analogy, each safe deposit box would correspond to a different blockchain wallet and could be opened only with the right cryptographic keys.\n\nThis doesn't sound risky, but to understand what could go wrong, all you have to do is think back to November 2022, when cryptocurrency exchange FTX went belly up. As it turns out, the crypto exchange was commingling customer funds with funds from its own trading desk. And there are plenty of examples from the early days of Bitcoin, when cybercriminals specifically targeted large crypto exchanges such as Mt. Gox in order to steal Bitcoin.\n\nThis is not to say that there excessive risk right now with Coinbase Global. I'm sure that multiple layers of security protect the Bitcoin holdings. But articles musing about the potential for something to go very wrong have already appeared in financial media. What if, for example, cybercriminals decide to target Coinbase as part of some coordinated hacking exploit to steal Wall Street's crypto?\n\nUnderstand what you're buying before you buy it\n\nPerhaps the biggest takeaway here is that it's important to understand what you're buying before you buy it. You don't need in-depth knowledge of how the crypto market works or even how an ETF works, but you should have a basic understanding of the potential risks of buying Bitcoin via an ETF.\n\nThat said, I'm still long-term bullish on Bitcoin. But I'll definitely be keeping a close eye on how Wall Street deals with any potential risks unique to the new spot Bitcoin ETFs.\n\nShould you invest $1,000 in Bitcoin right now?\n\nBefore you buy stock in Bitcoin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Bitcoin wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 16, 2024\n\nDominic Basulto has positions in Bitcoin. The Motley Fool has positions in and recommends Bitcoin and Coinbase Global. The Motley Fool has a disclosure policy.\n\nShould You Buy the New Bitcoin ETFs? Consider These 2 Risks was originally published by The Motley Fool"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9idXktYml0Y29pbi1kaXAtc29saWQtcmV0dXJucy0xMzA3MDA0OTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Buy Bitcoin on the Dip for Solid Returns: 5 Stocks in Focus - Yahoo Finance",
        "content": "The cryptocurrency market started 2024 on a positive note after an impressive rally last year. The much-hyped reformation in the cryptocurrency space took place on Jan 10. The U.S. Securities and Exchange Commission (SEC) approved rule changes to allow the creation of spot bitcoin exchange-traded funds (ETFs). As many as,11 spot bitcoin ETF’s are expected to be launched this year.\n\nThe game-changing decision of the SEC will allow individuals, money managers and other financial institutions to get exposure to the world’s largest cryptocurrency without having to own it. For a long time, the SEC was reluctant to approve the so-called spot bitcoin ETFs. However, the situation changed after the SEC lost a lawsuit to Grayscale in August 2023.\n\nFollowing the news, the price of bitcoin (BTC) jumped above the technical barrier of 47,000 to reach 47.893.70. However, Bitcoin price has since fallen sharply. On Jan 22, Bitcoin traded lower by nearly 3% at $39,854.61, hitting its lowest level since December 2023.\n\nNevertheless, bitcoin continues to hold a lot of potential. The SEC’s latest decision is likely to turn out to be a landmark, positioning the entire crypto space as an integral component of mainstream finance.\n\nTechnically, the Fed is set to initiate the first cut in interest rate in 2024 since March 2020, which saw the advent of the coronavirus pandemic. A lower interest rate regime should be very helpful for high-growth sectors like technology and cryptocurrency. Meanwhile, the largest thrust for the crypto space has come from institutional investors.\n\nMoreover, the next Bitcoin Halving will occur in the first half of 2024. When a halving occurs, the reward for mining new blocks is halved, making it more challenging for miners to earn net Bitcoins. Historically, this event has led to increased scarcity and has driven up the value of Bitcoin due to reduced supply.\n\nStocks in Focus\n\nNVIDIA Corp. NVDA is a semiconductor industry giant and one of the biggest success stories of 2023. As a leading designer of graphic processing units (GPUs), the NVDA stock usually soars on a booming crypto market. This is because GPUs are pivotal to data centers, artificial intelligence, and the creation of crypto assets.\n\nStory continues\n\nNVIDIA’s expected earnings growth rate for the current year is 63.1% (ending January 2025). The Zacks Consensus Estimate for its current-year earnings has improved 1.1% over the last 30 days. NVDA currently carries a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nCoinbase Global Inc. COIN provides financial infrastructure and technology for the crypto economy in the United States and internationally. COIN offers the primary financial account in the crypto space for consumers, a marketplace with a pool of liquidity for transacting in crypto assets for institutions; and technology and services that enable developers to build crypto-based applications and securely accept crypto assets as payment.\n\nCoinbase Global has an expected earnings growth rate of 35.1% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 13.6% over the last 30 days. COIN currently carries a Zacks Rank #2 (Buy).\n\nBlock Inc. SQ is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ’s decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors.\n\nBlock has an expected earnings growth rate of 53.9% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.7% over the last 30 days. SQ currently carries a Zacks Rank #3 (Hold).\n\nRobinhood Markets Inc. HOOD operates a financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds, options, gold, and cryptocurrencies. HOOD buys and sells Bitcoin, Ethereum, Dogecoin, and other cryptocurrencies using its Robinhood Crypto platform.\n\nRobinhood Markets has an expected earnings growth rate of more than 100% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.7% over the last 30 days. HOOD currently carries a Zacks Rank #3.\n\nCME Group Inc.’s CME options give the buyer of the call/put the right to buy/sell cryptocurrency futures contracts at a specific price at some future date. CME offers Bitcoin and ether options based on the exchange's cash-settled standard and micro-Bitcoin and Ethereum futures contracts.\n\nCME Group has an expected earnings growth rate of 2.5% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 0.3% over the last seven days. CME currently carries a Zacks Rank #3.\n\nThe chart below shows the price performance of five above-mentioned stocks in the past month.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCME Group Inc. (CME) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nBlock, Inc. (SQ) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nRobinhood Markets, Inc. (HOOD) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1yZWdhaW5zLTQway_SAVlodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI0L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWJpdGNvaW4tcmVnYWlucy00MGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Regains $40K - CoinDesk",
        "content": "A Donald Trump-labeled crypto wallet holds over $1 million of a TRUMP meme coin , having been worth only $7,100 on receipt. Issuance of the token has nothing to do with Trump directly, but some are using the tokens as a speculative bet on his ongoing presidential campaign. The tokens have a market capitalization of over $85 million on Wednesday, data shows. Sending tokens to a popular entity’s wallet is sometimes used as a strategy for attracting eyeballs by meme coin makers. The value of Trump’s wallet has shot up to $2.5 million, holding over $750,000 each in ether and wrapped ether and tiny amounts of several other tokens, most of which were likely sent to the wallet unsolicited."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tb3N0LWxpcXVpZC1zcG90LWJpdGNvaW4tZXRmLTE0MDAwMDIyOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "GBTC: The Biggest Spot Bitcoin ETF Arrives - Yahoo Finance",
        "content": "Bitcoin\n\nThe U.S. Securities and Exchange Commission approved ETFs that invest directly in bitcoin after the market closed on Jan. 10. And like that, the market wasted no time rolling out eight new products on Jan. 11. At $37.07 per share on Jan. 19, the Grayscale Bitcoin Trust (GBTC) had about $24 billion in assets under management. GBTC trades an average of more than 37 million shares daily and charges a 1.50% management fee.\n\nThe other seven ETFs that hold Bitcoin are:\n\nWhile the ETFs have different expense ratios, GBTC ranks as the most liquid product. Liquidity is critical for investors and traders as it provides the tightest bid-offer spreads and the most correlation to volatile bitcoin prices.\n\nGBTC vs Bitcoin Since Jan. 11\n\nThe day-to-day percentage gains or losses for bitcoin and GBTC from Jan. 12 through Jan. 18 were as follows:\n\nJan. 12: Bitcoin fell 0.1% lower, GBTC fell 0.7%\n\nJan. 16: Bitcoin fell 0.9%, GBTC rose 1.0%\n\nJan. 17: Bitcoin fell 0.1%, GBTC rose 0.6%\n\nJan. 18: Bitcoin fell 3.5%, GBTC fell 2.9%\n\nWe should never expect the same daily results from bitcoin compared to GBTC as bitcoin trades around the clock, while ETFs are only available during stock market trading hours. Over the early days of the leading spot bitcoin ETF, GBTC has done an decent job tracking the cryptocurrency.\n\nBullish on Bitcoin\n\nBitcoin remains in a bullish trend despite the recent pullback.\n\nAfter the cryptocurrency's explosive move to its late 2021 high, an implosive plunge followed. Bitcoin found a bottom in November 2022 and has made higher lows and highs throughout 2023 and into early 2024.\n\nWhile the trend remains bullish, the leading cryptocurrency reacted to the SEC’s approval of spot bitcoin ETFs with “buy the rumor and sell the fact” price action.\n\nStory continues\n\nQualified Spot Bitcoin Approval\n\nSEC Chairman Gary Gensler did not throw his whole-hearted support behind bitcoin when approving the spot ETFs. The Chairman’s comments speak for itself:\n\n“While we approved the listing and trading of certain spot bitcoin [Exchange Traded Product] ETP shares today, we did not approve or endorse bitcoin. Investors should remain cautious about the myriad risks associated with bitcoin and products whose value is tied to crypto.\n\nThough we’re merit neutral, I’d note that the underlying assets in the metals ETPs have consumer and industrial uses, while in contrast, bitcoin is primarily a speculative, volatile asset that’s also used for illicit activity including ransomware, money laundering… sanction evasion and terrorist financing.”\n\nThe approval was far short of any endorsement.\n\nIs GLD a Model?\n\nMany investors and traders believe bitcoin is the new gold, and the highly successful SPDR Gold Trust (GLD) is a model for GBTC and other spot bitcoin products. GLD made gold investing more accessible for a vast swath of the addressable market. Since GLD’s introduction in November 2004, gold prices have made higher lows and highs in a rally that continues in 2024.\n\nMeanwhile, the SEC’s approval comes with an element of validation. The regulation will make more market participants comfortable owning bitcoin-related assets in standard equity accounts.\n\nHeeding Chairman Gensler’s cautionary message is critical. The potential for significant rewards in bitcoin and all cryptocurrencies comes with substantial risks. The explosive and implosive price history is why investors and traders should only invest capital they’re willing to lose.\n\nWhile a compelling case exists for global currencies that governments do not influence, remember that the most powerful aspect of governing is the control of purse strings. Governments and central banks worldwide often control the money supply and will refrain from surrendering it to cryptocurrencies any time soon.\n\nIf the market cap of the cryptocurrency asset class in jumps significantly, expect legislative bodies and leaders to increase regulation and in some cases restrict or even ban the use of cryptos.\n\nWhile the trend is always your best friend and remains bullish, the future remains uncertain, with as many detractors as supporters of this highly volatile asset class.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmRhcmtyZWFkaW5nLmNvbS9hcHBsaWNhdGlvbi1zZWN1cml0eS9tYWNvcy1tYWx3YXJlLXRhcmdldHMtYml0Y29pbi1leG9kdXMtY3J5cHRvd2FsbGV0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "MacOS Malware Targets Bitcoin, Exodus Cryptowallets - Dark Reading",
        "content": "Fresh malware targeting Apple users in the US and Germany is infecting Bitcoin and Exodus cryptowallet applications with a Trojan distributed through pirated software, according to Kaspersky researchers.\n\nThe malware is delivered via cracked applications and can replace Exodus and Bitcoin cryptowallet applications installed on the user's machine with infected versions that steal secret recovery phrases after the wallet is unlocked.\n\nThe report, issued this week, noted the attackers use DNS TXT records to deliver an encrypted Python script to their victims as the second stage of infection.\n\n\"The wallet application replacement process is straightforward because, at this stage, the malware already has root access to the computer, granted during the first stage of infection,\" explains Sergey Puzan, security expert at Kaspersky.\n\nThe malware simply removes the old application from the \"/Applications/\" directory and replaces it with a new, malicious one. After installation and the patching process, the applications become operational, and the user is unaware of the malware running in the background.\n\nWhen users launch these compromised wallet applications, the malware sends data, including seed phrases or wallet passwords, to a command-and-control (C2) server controlled by the attackers.\n\nThis can result in the attackers having full control of a victim's digital wallet.\n\n\"We don't know why the malware specifically targets 'fresh' macOS versions, but it appears this campaign was still in the development process,\" Puzan says. \"We managed to receive functionality updates for the final stage backdoor but received no commands from the server.\"\n\nHe added there are no specific reasons why attackers focus on macOS 13.6 (Ventura) and higher.\n\n\"The only reason malicious actors use cracked versions of applications is to lower the user's guard and prompt them to enter the admin password, thereby granting root access to the malicious process,\" Puzan explains.\n\nHe says the form protection from such threats is to avoid downloading any cracked or modified applications, even from well-known and trusted sources.\n\n\"While this isn't a foolproof method, it significantly reduces the chances of compromise,\" Puzan says.\n\nJohn Bambenek, president at Bambenek Consulting, says while the use of pirated applications as a vehicle for malware isn't a particularly new technique, the selection of macOSX applications with functionality to steal cryptocurrency wallets is unique.\n\n\"As the security to prevent stealing cryptocurrency relies on the privacy of the private wallet key and passphrase, stealing both means the attacker can immediately monetize the victim,\" he explains.\n\nEvolving Threats to Cryptocurrency Wallets\n\nIn 2023, there were numerous malicious campaigns targeting cryptocurrency wallet owners, but the Kaspersky findings indicate that some attackers are now going to greater lengths to ensure they access the contents of their victims' crypto wallets while remaining undetected for as long as possible.\n\n\"While it's challenging to predict the threats we'll face in 2024, the increasing popularity of cryptocurrencies is attracting heightened criminal activity,\" Puzan says.\n\nAdam Neel, threat detection engineer at Critical Start, notes that malicious actors are adapting their techniques to take advantage of cryptocurrency users' behaviors and preferences.\n\n\"They use social engineering tactics, such as offering pirated software, to lure victims into downloading malware,\" he says. \"The malware's ability to replace legitimate wallet applications and continue operating even when the C2 server is unresponsive demonstrates a level of persistence that can be challenging for users to detect and remove.\"\n\nBambenek notes many of the OS-provided protections needed to be explicitly disabled to get these applications on the system in the first place, so the biggest defense mechanism is to avoid pirated software and source applications only from the official app store.\n\n\"For those users who still want pirated applications, they should keep cryptocurrency applications and their private wallets on secure machines that do not have such software downloaded and installed on it,\" he says.\n\nNeel says users must continue to take precautions, especially when storing large amounts of digital currency.\n\n\"Cryptocurrency remains an attractive target for cyber criminals, so malicious actors will be motivated to advance their behaviors and technology,\" he says."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDI0LzEvMjQvMjQwNDkwNDcvZGF0YS1jZW50ZXItYWktY3J5cHRvLWJpdGNvaW4tbWluaW5nLWVsZWN0cmljaXR5LXJlcG9ydC1pZWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "AI and crypto mining are driving up data centers' energy use - The Verge",
        "content": "Data centers could gobble up twice as much electricity by 2026 thanks in large part to cryptocurrencies and artificial intelligence, according to a new report from the International Energy Agency (IEA).\n\nWe rely on data centers to store all our emails, photos, cat videos, and everything else floating around in the cloud. More and more, data centers are cropping up to mine Bitcoin and train AI.\n\nThat’s already triggered backlash over the environmental impact of cryptocurrencies and AI tools like ChatGPT, since all those data centers are responsible for greenhouse gas emissions tied to their electricity use. The world will need a lot more renewable energy to clean up pollution from power grids and satiate skyrocketing electricity demand from data centers at the same time.\n\nThat growth is equivalent to adding an extra country’s worth of electricity demand\n\nData centers, cryptocurrencies, and AI made up around 2 percent of global electricity demand in 2022, using 460TWh of electricity, according to the IEA’s annual electricity report released today. Crypto mining alone is estimated to account for nearly a quarter of that electricity consumption, burning through 110TWh in 2022.\n\nBy 2026, electricity consumption from data centers — including those used for cryptocurrencies and artificial intelligence — could rise up to 1,050TWh depending on the pace the technology develops. That growth is equivalent to adding an extra country’s worth of electricity demand; Sweden under a more modest scenario or Germany at the most.\n\nThe US has the most data centers today, with 33 percent of the world’s approximately 8,000 data centers. It’s also the country with the most Bitcoin mining. The IEA forecasts a “rapid pace” of growth for data center electricity consumption in the US over the next couple of years, rising from roughly 4 percent of US demand in 2022 to 6 percent by 2026. Expanding 5G networks and cloud-based services are other drivers of that growth.\n\nImage: IEA\n\nIreland, with one of the lowest corporate tax rates in the European Union, is expected to see a boom in new data centers. Its 82 data centers already accounted for 17 percent of the country’s electricity consumption in 2022. Another 54 are either under construction or recently approved to start building. By 2026, all those data centers could be responsible for nearly a third of the country’s annual electricity demand.\n\n“The rapid expansion of the data centre sector and the elevated electricity demand can pose challenges for the electricity system,” the IEA report says. The risk isn’t unique to Ireland. In London, data center electricity demands have made it harder to develop more housing. Texas, a hub for Bitcoin mining in the US, has to grapple with new crypto mines (AKA data farms for crypto) adding pressure to its already aging and stressed out power grid.\n\nSince data centers are basically warehouses for computers, 40 percent of their electricity demand comes from computing. Keeping all that equipment cool accounts for another 40 percent of demand, with other IT equipment making up the rest.\n\nImage: IEA\n\nAdding AI into the mix increases data centers’ overall electricity demand. Google Search could use up to ten times more electricity in a scenario fully incorporating AI, the IEA report says. Similarly, it forecasts that the AI industry could burn through ten times as much electricity in 2026 as it did last year."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzIzL210LWdveC1tb3Zlcy1zZWVtaW5nbHktY2xvc2VyLXRvLWJpdGNvaW4tcmVwYXltZW50cy1mb3ItMjAxNC1oYWNrLXZpY3RpbXMv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjQvMDEvMjMvbXQtZ294LW1vdmVzLXNlZW1pbmdseS1jbG9zZXItdG8tYml0Y29pbi1yZXBheW1lbnRzLWZvci0yMDE0LWhhY2stdmljdGltcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Mt. Gox Moves Seemingly Closer to Bitcoin Repayments for 2014 Hack Victims - CoinDesk",
        "content": "Mt. Gox was launched in 2010 and was the world's biggest crypto exchange at the time of the hack in 2014. It was ultimately able to recover around 20% of the stolen funds. In December, some customers reported receiving payouts in yen to their Paypal accounts."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjczOTM2L3Nwb3QtYml0Y29pbi1ldGYtaG9sZGluZ3MtaGl0LTEwMDAwMC1idGPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Nine new spot bitcoin ETFs amass over 100000 BTC - The Block",
        "content": "The nine new spot Bitcoin ETFs now hold more than 100,000 BTC -7.54% ($4 billion) in assets under management, excluding Grayscale’s converted GBTC fund.\n\nThese ETFs are BlackRock (IBIT), Fidelity (FBTC), Bitwise (BITB), Ark 21Shares (ARKB), Invesco (BTCO), VanEck (HODL), Valkyrie (BRRR), Franklin Templeton (EZBC), and WisdomTree (BTCW).\n\nBlackRock’s spot bitcoin ETF (IBIT) leads with 40,213 in holdings, according to data from K33 Research. Fidelity’s FBTC spot bitcoin ETF has the second-highest bitcoin under management among the new funds at 34,152 BTC.\n\nIn total, the new ETF holdings reached 109,221 BTC as of Monday. This excludes Grayscale Bitcoin Trust (GBTC), which has seen the value of its assets under management fall by $2.8 billion over the period.\n\nAssets held by Grayscale’s converted GBTC fund have fallen by over 10% from around 619,220 BTC to 552,680 BTC in the same period, according to CoinGlass data. The 66,540 BTC drop is equivalent to about 60% of the bitcoin now held by the new spot bitcoin ETFs.\n\nDay seven sees $2.1 billion in trading volume and $76 million in net outflows\n\nRELATED INDICES See crypto indices\n\nJan. 22, the seventh day of U.S. spot bitcoin ETF trading witnessed a total trading volume of $2.1 billion — dominated by $1.1 billion in volume for GBTC, according to The Block’s data dashboard.\n\nThe new spot bitcoin ETF products registered $564.5 million worth of inflows on Monday, according to Bloomberg ETF analyst James Seyffart. BlackRock’s IBIT led with its third-largest inflow day, bringing in $272 million. Fidelity’s FBTC was again in second with $159 million, and the rest of the ETFs with inflows came in under $100 million.\n\nHowever, this wasn’t enough to overcome the largest daily outflow for Grayscle’s converted GBTC fund so far — some $640.5 million — causing a net outflow of $76 million yesterday as bitcoin’s price fell below $40,000 for the first time in seven weeks. Bitcoin is currently trading at $39,227, according to The Block’s price page.\n\n“Woof. BAD day for Bitcoin ETFs overall in the Cointucky Derby. GBTC saw over $640 million flow out today. Outflows aren't slowing — they're picking up. This is the largest outflow yet for GBTC. Total out so far is $3.45 billion,” Seyffart said."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTIzL2JpdGNvaW4tYnRjLWhhcy1mYWxsZW4tYWJvdXQtMjAtc2luY2UtdXMtc3BvdC1ldGZzLWJlZ2FuLXRyYWRpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Has Dropped About 20% Since Landmark US Spot ETFs Began Trading - Bloomberg",
        "content": "Bitcoin has fallen over 20% since the Jan. 11 launch of the first exchange-traded funds investing directly in the token as speculators become more cautious about the potential impact of the products.\n\nThe digital asset spiked to $49,021 on the day the ETFs from issuers including BlackRock Inc. and Fidelity Investments went live. Bitcoin traded at $38,975 as of 8:38 a.m. Tuesday in New York, a 20.5% drop from that intraday peak."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0Mzg3L2JpdGNvaW4taG92ZXJzLWp1c3QtdW5kZXItNDAwMDAtYXMtbWFya2V0LXRyYWNrcy1ncmF5c2NhbGUtb3V0Zmxvd3PSAWtodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzQzODcvYml0Y29pbi1ob3ZlcnMtanVzdC11bmRlci00MDAwMC1hcy1tYXJrZXQtdHJhY2tzLWdyYXlzY2FsZS1vdXRmbG93cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin hovers just under $40,000 as market tracks Grayscale outflows - The Block",
        "content": "Bitcoin BTC -7.54% 's price eclipsed $40,000 at different points on Wednesday but largely hovered just below that mark, as market watchers continued to observe the selling off of Grayscale's spot bitcoin ETF.\n\nThe price of the world's largest cryptocurrency by market capitalization was $39,672 at 4:37 p.m. ET, according to The Block's Price Page. While it's up 1.3% over the past 24 hours, bitcoin's price has declined nearly 14% over the past two weeks.\n\nTrying to summarize why the asset has been sliding since the launch of spot bitcoin ETFs earlier this month — the price surpassed $48,000 on the first day the new products started trading — Bitwise executive Matt Hougan said on Tuesday that there has been an \"expectations-led\" sell-off in recent days.\n\n\"This is not strictly speaking an ETF-led sell-off. The ETFs are net buyers of Bitcoin,\" he said. \"This is an ETF expectations-led sell-off. The market front-ran the ETF approval by piling into to both spot bitcoin and bitcoin derivatives.\"\n\nETF trading volume\n\nSo far, total trading volume for all spot bitcoin ETFs is over $20 billion, according to The Block data. Products offered by Grayscale, BlackRock and Fidelity have dominated, accounting for about 90% of the total volume.\n\nRELATED INDICES See crypto indices\n\nMuch of Grayscale's volume has been made up of investors selling the fund, which is a conversion of the firm's flagship GBTC fund.\n\nHougan believes the market expected there would be \"larger net flows into ETFs than we’ve gotten so far.\" Now, the market is \"unwinding that bet,\" he also said, adding that in his opinion \"the market overestimated the short-term impact of ETFs.\"\n\nOn Wednesday afternoon, Bloomberg Intelligence senior ETF analyst Eric Balchunas posted data to X showing that Grayscale's trading volume was on pace to end the day at its lowest level since the new products began trading.\n\nAt the time of his post, Grayscale had generated about $463 million in trading volume, which was significantly lower than previous days. The first day spot bitcoin ETFs traded, Grayscale registered $2.3 billion in trading, the data also showed.\n\n\"GBTC volume down again today.. could be sign of some exhaustion in the selling,\" Balchunas said."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvZG8tYml0Y29pbi1ldGZzLWtpbGwtdGhlLWJ1bGwtY2FzZS1mb3ItY3J5cHRvLWVxdWl0aWVzL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjQvZG8tYml0Y29pbi1ldGZzLWtpbGwtdGhlLWJ1bGwtY2FzZS1mb3ItY3J5cHRvLWVxdWl0aWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Do Bitcoin ETFs Kill the Bull Case for Crypto Equities? - CoinDesk",
        "content": "The same cannot be said for Bitcoin miners, which are facing strong headwinds. First, the Bitcoin hashrate, a measure of network security, is near an all-time high, meaning miners need to marshal ever more computing power to earn new rewards. The Bitcoin halving, likely to occur in April, will cut the block reward in half, meaning there will be less to go around. Bitcoin Ordinals, referred to as “NFTs for Bitcoin,” are causing a rift in the community, so miners can’t rely on added fee revenue from these more novel implementations of the network."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyNC8wMS8yNC9pbmRvbmVzaWFzLWNyeXB0by10YXgtcmV2ZW51ZS1mYWxscy02My1pbi0yMDIzLWRlc3BpdGUtYml0Y29pbnMtc3VyZ2Uv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDI0LzAxLzI0L2luZG9uZXNpYXMtY3J5cHRvLXRheC1yZXZlbnVlLWZhbGxzLTYzLWluLTIwMjMtZGVzcGl0ZS1iaXRjb2lucy1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Indonesia's Crypto Tax Revenue Falls 63% in 2023 Despite Bitcoin's Surge - CoinDesk",
        "content": "It’s worth noting that local exchanges have protested the high tax rates and blamed them for thinner revenues as users seek alternatives. Indonesia’s local exchanges had proposed that crypto transactions should only be subject to income tax, not VAT. The exchanges’ suggestion comes as the country’s Financial Services Authority (OJK) prepares to regulate crypto from January 2025. They believe this adjustment would classify crypto more as a security than a commodity."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3Qvd2h5LXRoZS1iaXRjb2luLWV0Zi1oYW5nb3Zlci13aWxsLWVuZC1zb29uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Why Bitcoin's 'relentless' selling will end in weeks - DLNews",
        "content": "Bitcoin is down 20% since Wall Street launched its ETFs.\n\nAnalysts at K33 blamed a variety of factors for the slump, including CME futures unwinding and the FTX estate selling its GBTC shares.\n\nThese structural problems will soon subside, they said.\n\nBitcoin has tumbled almost 20% since BlackRock, Fidelity, and other firms launched their long awaited spot Bitcoin exchange-traded funds. Although, the cryptocurrency slightly recovered over the past 24 hours.\n\nAnalysts at crypto research firm K33 Research explain the reasons for the decline — and why market participants can expect the selling pressure to ease soon.\n\nStructural selling\n\nLess than two weeks after they launched, new Bitcoin ETFs have seen nearly $1 billion in net inflows — but that hasn’t been enough to keep Bitcoin’s price up.\n\nStructural factors, CME futures outflows, and spot selling are likely to blame, K33′s head of research Anders Helseth and senior analyst Vetle Lunde wrote in a report Monday.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nOpen interest at CME Group, the largest Bitcoin futures venue in the world, has declined by 28% among entities that haven’t issued a Bitcoin ETF, the report said.\n\nOpen interest reflects the total number of outstanding futures contracts held by market participants.\n\n“The market is experiencing structural selling,” K33 said.\n\n“CME traders unsurprisingly [reduced] exposure following the ETF launch” the firm said, and this could continue until it drops another 35% — back to its 2023 average.\n\nJoin the community to get our latest stories and updates\n\nBitcoin is also experiencing spot selling pressure, as traders who entered well ahead of the ETF launch are now taking profit, the analysts said.\n\nGrayscale’s GBTC — which converted into a spot ETF — is particularly relevant to current price action. The ETF has seen nearly $4 billion in outflows since January 11.\n\nThe report blamed some of these flows on the FTX bankruptcy estate, which likely exited its position, worth around $1 billion.\n\nMarket participants arbitraging GBTC are likely also closing their trades, the analysts said.\n\n“Outflows from GBTC are relentless but will, over time, dwindle,” they wrote. “Structural effects should play out with less intensity shortly, stabilising Bitcoin’s price as we enter February,” the analysts added. “Reduced exposure on CME will likely play out rapidly as we approach Friday’s January futures settlement.”\n\nBitwise’s chief investment officer Matt Hougan, who was previously CEO at ETF analytics firm ETF.com and chairman at events firm inside ETFs, echoed K33′s assessment.\n\n“This is an ETF expectations-led sell-off,” he posted on X. “The market front-ran the ETF approval by piling into both spot Bitcoin and Bitcoin derivatives. It expected larger net flows into ETFs than we’ve gotten so far, and is now unwinding that bet.”\n\n“Just as the market overestimated the short-term impact of ETFs, it is underestimating the long-term impact,” he added.\n\nCrypto market movers\n\nBitcoin is up 3.1% in the last 24 hours, trading at $39,960.\n\nEthereum rose 2.1% in the same period, now at $2,228.\n\nAvalanche and Solana are up 12% and 8%, respectively.\n\nWhat we’re reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcmV0cmFjZXMtYnVsbC1tYXJrZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin price often drops 20% in bull markets — but it's becoming less frequent - Blockworks",
        "content": "Bitcoin would be in a bear market going by old-world definitions. Luckily they don’t apply well to crypto.\n\nA parable of legacy finance says that bear markets start when a broad index of stocks, say the S&P 500, sinks 20% or more from recent highs.\n\nBitcoin is practically the exact opposite of something like the S&P 500, but it has done exactly that since spot bitcoin ETFs went live earlier this month.\n\nThe price of bitcoin briefly hit $49,000 moments after BlackRock, Fidelity and eight others launched their funds on Jan. 11.\n\nTwelve days later, bitcoin changed hands for $38,500 — a 21% drop. Anyone holding spot bitcoin ETFs since they went live are well in the red.\n\nRead more: Let’s pour one out for the first-day spot bitcoin ETF investors\n\nThe timing of bitcoin’s recent correction is unfortunate and it may even be the result of Grayscale losing the management fee war.\n\nBut drops of this magnitude are common in bitcoin bull markets. This would be the fourth pullback of this size in our current cycle.\n\n(Calculations of the exact beginning and end of bitcoin market cycles vary, but for the purposes of this article, our current bull market started on Nov. 21, 2022 per analysis from IOSG Ventures.)\n\nPrice discovery is very rarely a straight line\n\nAnalyzing daily bitcoin price movements shows similar retracements occurred in March, June and August 2023. Bitcoin’s price has still doubled its lowest point from last year.\n\nThere have been six bull cycles in bitcoin’s history, not counting the 500-fold explosion in the highly eventful two years following the genesis block in 2009, which included the rise of influential platforms Silk Road and Mt. Gox, as well as the disappearance of Satoshi Nakamoto.\n\nThe first proper bull cycle, between February 2011 and April 2013, included 19 corrections of 20% or more — often extremely close to each other with June 2011 alone seeing four.\n\nThe next cycle, in 2013, was the shortest, running only 150 days. There were five corrections akin to bitcoin’s recent movements and they generally occurred once every two weeks or so.\n\nIn fact, the length of time between 20% corrections is increasing over time. They happened once every 64 days on average during the 2015-2017 bull market, during which time ballooned up to 8,900%.\n\nBitcoin has grown up but it hasn’t yet totally shaken these kinds of corrections\n\nThe next cycle between 2018 and 2019 felt comparable shocks every 73 days, around the same frequency as the 2020-2021 run. Bitcoin more than tripled in about 200 days, from $4,100 to nearly $12,800, to start the decade.\n\nThis time around, bitcoin’s is giving up one-fifth of its value every 102 days on average — 40% more than during the previous two bull markets. This trend is also illustrated well by bitcoin’s historic volatility, which is flatlining over time.\n\nThen again, this kind of analysis only works with the benefit of hindsight. All bull markets, of course, end with a collapse in prices of 20% or more and nobody knows whether this month’s pullback was our cycle’s last.\n\nAt least they’re getting rarer.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzIzL2JldHRlci1idXktaXNoYXJlcy1iaXRjb2luLXRydXN0LW9yLWFjdHVhbC1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Better Buy: iShares Bitcoin Trust or Actual Bitcoin Tokens? - The Motley Fool",
        "content": "All of a sudden, investors have access to exchange-traded funds (ETFs) tracking the real-time value of Bitcoin (BTC -4.70%). American regulators finally approved 11 applications for Bitcoin-tracking ETFs, opening a whole new type of digital asset investments.\n\nMaybe you haven't dipped your toes in the unpredictable cryptocurrency waters yet, but you're thinking about your first Bitcoin investment. Should you dive into the deep end with a direct buy of Bitcoin tokens, or is a robust ETF like the iShares Bitcoin Trust (IBIT -5.82%) a better choice?\n\nThe answer, of course, is that it depends on your needs and preferences. Let me walk you through the pros and cons of these two options for Bitcoin exposure.\n\nWhy iShares Bitcoin Trust ETF may be for you\n\nThis is not the only Bitcoin ETF on the market today, but it's an early leader for several solid reasons.\n\nThe largest and most popular Bitcoin ETF in the early days has already built a $1.2 billion portfolio of Bitcoin holdings. The Fidelity Wise Origin Bitcoin Trust runs a close second with a net asset value (NAV) just north of $1 billion as of Friday, Jan. 19. Beyond Fidelity, it's not a close race. Each of the other nine Bitcoin ETFs is worth less than half of the iShares fund so far.\n\nThe fund trades at a 0.3% discount to its underlying NAV, reflecting the live Bitcoin price of an index called the CME CF Bitcoin Reference Rate-New York Variant (BRR). In turn, the BRR index tracks the average Bitcoin price in U.S. dollars across six leading crypto exchanges. This methodology ensures a stable Bitcoin price, shielded from the sudden price swings you sometimes see in a cryptocurrency (or stock) on a single trading platform.\n\nThe iShares fund is managed by BlackRock, one of the world's largest and most respectable financial asset managers. Investors have relied on the iShares brand of index-trading funds for decades, with 29 ETFs holding at least $20 billion in NAVs.\n\nSuppose you want ultimate stability in a strictly regulated investment vehicle, with the backing of a true financial services giant under a household name brand of ETFs. In that case, the iShares Bitcoin Trust should be right up your alley. And if you're planning to add Bitcoin exposure in an account that doesn't offer direct Bitcoin trading, an ETF may be your only choice. For example, many IRA retirement accounts provide access to stocks, mutual funds, and ETFs, but not to cryptocurrency tokens.\n\nWhy you might prefer buying Bitcoin directly\n\nHere's why making the effort to open an account on an exchange with cryptocurrency trading such as Coinbase Global or Robinhood Markets may be worth it for some people.\n\nAll ETFs charge an annual fee. Most of the new Bitcoin ETFs carry very low fees of 0.3% or less, and most of them are pausing their fee collections for a few months in order to earn more investor attention. The iShares Bitcoin Trust's sponsor fee stands at 0.25%, cut in half for the first year or until the fund's asset value exceeds $5 billion.\n\nThat's not a deal-breaker for most investors. Still, a low fee is more expensive than no fee, and nobody will charge you an annual fee for holding Bitcoin tokens in a digital wallet.\n\nThat digital wallet is another popular selling point. Direct ownership gives you full control over your cryptocurrency assets, much like carrying dollar bills in a leather wallet instead of a bank account.\n\nThe iShares fund comes with a significant market footprint, managing one of the largest Bitcoin portfolios in the world, but it's just 0.16% of the entire Bitcoin asset. The leading cryptocurrency's total market value stands at $804 billion today, with a daily trading volume of $11.7 billion. I wouldn't be surprised to see a Bitcoin logo when I look up \"liquidity\" in a dictionary.\n\nSome investors prefer to keep their holdings as pure and simple as possible. For some, that quest for simplicity will point to the stock-like trading process of an ETF. For others, it means going straight to the source and buying the real thing. True purists like MicroStrategy chairman Michael Saylor will never buy Bitcoin ETFs as long as the digital tokens are readily available.\n\nBrief summary: Which Bitcoin bet is better for you?\n\nIn the dynamic world of cryptocurrency investments, choosing the right path can feel like navigating a labyrinth. Today I explored two distinct paths: the iShares Bitcoin Trust ETF and buying Bitcoin directly. Each alternative offers unique advantages tailored to different investor profiles.\n\nThe iShares Bitcoin Trust ETF might be your beacon if you seek a regulated, stock market-traded avenue into Bitcoin with a diversified risk profile. In some cases, an ETF may be the only available option.\n\nOn the other hand, purchasing Bitcoin directly could be your next step forward if you aim for a more hands-on approach with potentially higher rewards (and risks).\n\nSo, which path should you take? The answer isn't set in stone; it depends on your investment style, risk tolerance, available brokerage account types, and goals. I hope this overview helps you make the best choice for your particular situation. Mind you, this is far from a complete analysis, and you could spend hours getting deeper into the details.\n\nWhatever you do, your favorite Bitcoin investment should be a small part of a diversified investment portfolio. \"Backing up the truck\" to a single investment is never a good idea -- unless that all-in investment involves an inherently diverse instrument such as an index fund."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjQvMDEvMjMvc29sYW5hLWF2YWxhbmNoZS10b2tlbnMtc2xpZGUtYXMtYml0Y29pbi10cmFkZXJzLXRhcmdldC1leWUtc3VwcG9ydC1hdC0zOGsv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyNC8wMS8yMy9zb2xhbmEtYXZhbGFuY2hlLXRva2Vucy1zbGlkZS1hcy1iaXRjb2luLXRyYWRlcnMtdGFyZ2V0LWV5ZS1zdXBwb3J0LWF0LTM4ay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Solana, Avalanche Tokens Slide as Bitcoin Traders Target Eye Support at $38K - CoinDesk",
        "content": "“A considerable price correction even further down from current levels across the market would not be surprising,” Bitfinex added, mirroring sentiment from an increasing cohort of traders who expect bitcoin to fall as low as $38,000 in the coming weeks."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzIzL2NvaW5iYXNlLWRvd25ncmFkZWQtdG8tdW5kZXJ3ZWlnaHQtYml0Y29pbi1ldGYtY2F0YWx5c3QtbWF5LWRpc2FwcG9pbnQtanBtb3JnYW4v0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzIzL2NvaW5iYXNlLWRvd25ncmFkZWQtdG8tdW5kZXJ3ZWlnaHQtYml0Y29pbi1ldGYtY2F0YWx5c3QtbWF5LWRpc2FwcG9pbnQtanBtb3JnYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Coinbase Falls After JPMorgan Downgrades Stock to Underweight on Disappointing Bitcoin ETF Catalyst - CoinDesk",
        "content": "The Securities and Exchange Commission’s (SEC) approval of spot bitcoin ETFs last month was widely expected to presage a new era for cryptocurrencies, with mainstream money expected to flood into the space. The launch of these products allows investors who were prohibited from owning digital assets to now access the sector without having to own the underlying assets themselves."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4td2ViMy1kZWZpLWFkb3B0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "DeFi is Bitcoin's missing ingredient - Blockworks",
        "content": "Bitcoin kicked off the cryptocurrency revolution with Satoshi’s white paper more than 15 years ago. First-mover advantage and strong security make bitcoin a great store of value — to the extent that some nations have made it legal currency — but bitcoin isn’t really used for lending, yield farming and other DeFi services.\n\nThat’s a market that’s worth $50 billion right now, according to DeFiLlama data. Not only are bitcoin holders missing out on a chance to monetize their digital asset, but DeFi projects are missing the vast liquidity bitcoin — and its $850 billion market cap — has to offer. Bringing bitcoin into the Web3 fold is an immediate opportunity that stands to benefit all of Web3.\n\nEarly promise\n\nInitially, technology was the inhibitor to bringing bitcoin into DeFi, but the introduction of Bitcoin’s Taproot upgrade a year ago went some way to changing things. It enabled newer features and options that Ethereum and other chains boast without the need for a layer-2 such as the Lightning Network.\n\nTaproot enabled truer DeFi services and NFTs, including Ordinals — which in turn enabled NFT-like inscriptions on the Bitcoin blockchain and launched with the simple goal to “MAKE BITCOIN FUN AGAIN,” according to its creator Casey Rodarmor. Taproot Wizards, a NFT collection enabled by Ordinals, went further still. Its high-profile creators Eric Wall and Udi Wertheimer promise to make Bitcoin “magic again.”\n\nBut Bitcoin doesn’t need to be fun or magic — it just needs to seize the opportunities that other chains and communities have enjoyed for years.\n\nThe issue is both an educational and a tooling problem. As a result, the Bitcoin community misses out on opportunities to monetize their assets, including using their bitcoin in DeFi for lending, yield farming, liquidity farming, staking and even easy access to NFTs, gaming, emerging services like SocialFi, and more.\n\nThese services are important not just because they encourage owners to hold on to their assets, (rather than selling), which can help maintain price stability, as well as directly monetize through yield, but they encourage bitcoin holders to do so away from centralized exchanges. DeFi protocols offer better prices and also puts security of assets into an individual’s own control, which is in line with keeping to the principles for freedom of money set out by Satoshi.\n\nTechnologies introduced over the last year have taken the opportunities with Bitcoin to new levels. Rather than relying on services enabled by Taproot, Bitcoin chains like Stacks or the likes of Lightning Network, multichain networks have emerged to enable smart contracts to effectively be deployed on Bitcoin.\n\nRead more from our opinion section: Gary Gensler lost the bitcoin ETF battle. Can he win his crypto war?\n\nThis is important because institutional adoption of cryptocurrencies — which will officially begin after this recent approval for the long-anticipated bitcoin ETFs — will drive demand for financial products on Bitcoin, not to mention opportunities to connect Bitcoin to other smart contract financial services such as restaking, DeFi and more.\n\nRestaking is a particularly powerful concept, with Eigenlayer adding the primitive to not only offer additional yield but enhance security. The growth of Lido (a top 10 token), Rocketpool (a top 50 token) and others on Ethereum made liquid staking a red hot topic. Similar offerings on Bitcoin would enable passive bitcoin holders to go after new yield opportunities while also holding their assets for the long term.\n\nNew use cases arise\n\nOne of the hallmarks of Bitcoin is its strong community. This is one area where there has been pushback to building on the blockchain. Ordinals, for example, were initially criticized by so-called Bitcoin maximalists who believe the asset’s sole purpose is to store value. But they became a mainstay, racking up 350,000 daily inscriptions this summer and indicating that there’s strong interest in new types of services on Bitcoin even if the entire community isn’t convinced.\n\nIndeed, just this month, top exchanges Binance, Gate.io and KuCoin listed BRC-20 memecoins based on Ordinals, showing another side to their rising appeal.\n\nOrdinals and memecoins sit on the more playful side of crypto, but their popularity gives a glimpse at the interaction and demand that could be tapped by including Bitcoin in the broader decentralized app ecosystem.\n\nThese opportunities won’t appeal to all bitcoin holders, of course, but more options is always preferential to scant few. Moreover, it stands to strengthen Bitcoin by enabling broader adoption among new audiences, which is ultimately the goal as articulated in Satoshi’s white paper.\n\nInstitutional adoption looks promising, there’s general optimism now that the US has approved a bitcoin ETF, which stands to benefit Bitcoin and add new stakeholders. In the long term, many of these new owners will demand options for putting their digital assets to work, especially those financial institutions. Outside of Bitcoin, the broader crypto industry stands to only benefit by including Bitcoin, particularly in this winter period.\n\nIt’s high time Bitcoin was no longer siloed.\n\nBrandon Truong is lead product contributor for ZetaChain. He previously co-founded social platform Yada (which was acquired in 2020) and spent time building products for BuzzFeed and Udacity.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzI0L3Nob3VsZC15b3UtYnV5LXRoZS1kaXAtb24tYml0Y29pbi1taW5pbmctc3RvY2tzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Should You Buy the Dip on Bitcoin Mining Stocks? - The Motley Fool",
        "content": "After posting stellar triple-digit returns in 2023, Bitcoin (BTC -4.70%) mining stocks are down across the board in early 2024. For example, Marathon Digital Holdings (MARA -7.46%) is down 32%, and Riot Platforms (RIOT -6.82%) is down 35%. Those sharply negative returns are all the more striking, given all the hype around Bitcoin and the new spot Bitcoin exchange-traded funds (ETFs).\n\nOn one hand, this could be a fantastic opportunity to buy the dip in Bitcoin mining stocks. On the other hand, there is likely a fundamental change in market outlook that's causing this sharp correction to the downside. Let's take a closer look.\n\nImpact of the Bitcoin halving\n\nNow that the Bitcoin ETF approval drama is over, the market is starting to wake up to the potential impact of the next Bitcoin halving, scheduled for April 2024. A Bitcoin halving occurs only once every four years and, as a result, is highly anticipated by the market. In three previous halving cycles, the price of Bitcoin has skyrocketed, and many investors are expecting the same pattern this time around.\n\nWhile the investment thesis is fairly clear for Bitcoin itself, it's a bit murkier for Bitcoin miners. The halving reduces the mining reward paid out to Bitcoin miners by one-half. Right now, every time a Bitcoin miner adds a block to the Bitcoin blockchain, they are paid a reward of 6.25 BTC, which is worth roughly $250,000 at today's prices. That might sound like a lot, but much of it goes to owning and operating Bitcoin mining rigs, which consume vast amounts of energy.\n\nIn April 2024, the \"mining reward\" will be slashed to 3.125 BTC. That might not seem like a big deal until you consider how it impacts both the top and bottom lines for Bitcoin miners. Think about it for a second. What would happen if your boss told you your \"paycheck reward\" would be slashed by one-half starting in April? Oh, and you're also expected to work the same number of hours and put in the same amount of work. If you're like most people, you'd probably start looking for new opportunities as soon as possible.\n\nAnd that's why I think there will be a shakeout in the Bitcoin mining industry this year. All other things staying the same, Bitcoin miners will have a much harder time breaking even in 2024. The growing consensus is that the new break-even point will be a Bitcoin price of $40,000. If the price of Bitcoin falls below that level, a lot of Bitcoin miners could go out of business.\n\nThe difficulty of picking winners\n\nIn 2023, all that really mattered was the number of mining rigs a Bitcoin miner could bring online. The more rigs, the more Bitcoin they could mine and the more money they could make. Very easy to understand. You just bought the biggest miners.\n\nBut all that changes in April. The competitive playing field will be stacked in favor of Bitcoin mining companies with the lowest costs, the greatest liquidity, and the least debt. While the absolute number of mining rigs will obviously still matter, the emphasis will be on getting production costs below that magic $40,000 mark. If you're running an entire fleet of highly inefficient machines gobbling up a lot of electricity, you lose.\n\nThat makes buying the dip on Bitcoin miners so risky right now. You really don't know who the new winners will be. There are a lot of factors to take into account. The current consensus is that Riot Platforms, due to its low cost base, will be among the winners.\n\nIs there an alternative to buying specific mining stocks?\n\nInstead of trying to pick winners, it might be easier just to invest in a diversified ETF, such as the Valkyrie Bitcoin Miners ETF (WGMI -6.86%). This fund holds approximately 20 different stocks related to the Bitcoin mining industry. There's no need to pick winners because, theoretically, you're letting a much smarter fund manager figure out the right portfolio blend for you.\n\nNo, you might not get the same type of upside as if you picked a single Bitcoin mining stock, but you also diversify away some of your risk. In theory, this ETF should have the highest allocations to the best Bitcoin miners. If you're expecting a lot of turbulence in the Bitcoin mining industry this year, as I am, this might be a safer way to play Bitcoin mining stocks. That said, the Valkyrie Bitcoin Miners ETF is down 30% to start the year, so it's certainly not without risk.\n\nThe investment narrative around Bitcoin continues to shift. Yes, Bitcoin mining stocks were a slam-dunk investment last year. But if you really dig into the economics of the upcoming Bitcoin halving event, it's easy to see how Bitcoin mining stocks come with much more downside risk this year. As for me, I'm avoiding direct exposure to Bitcoin mining stocks until after the next big miner shakeout."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdHdpc2Utc2hhcmVzLWJpdGNvaW4tZXRmLWhvbGRpbmdzLWFkZHJlc3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitwise publishes bitcoin ETF holdings address after on-chain sleuths uncover BlackRock's - Blockworks",
        "content": "Bitwise has publicly disclosed the address of its bitcoin ETF’s holdings.\n\nIn a post on X, the company said that sharing the address was the “first step toward increasing public transparency.”\n\nLoading Tweet..\n\nWhile the issuer is the first to make this type of announcement, that hasn’t stopped internet sleuths from tracking down the addresses for other issuers, including Grayscale and BlackRock.\n\nRead more: Let’s pour one out for the first-day spot bitcoin ETF investors\n\nOther sleuths have uncovered the addresses for VanEck, WisdomTree and Fidelity among others. Bitwise, prior to its public announcement, was also on that list according to a Jan. 22 post from Arkham on X.\n\nLoading Tweet..\n\nThe bitcoin ETFs had a rocky start following the much-anticipated approval from the Securities and Exchange Commission.\n\nGrayscale, in particular, has seen huge outflows. Though some, as Blockworks previously reported, may stem from the FTX estate unloading its GBTC holdings.\n\nGBTC has around $21 billion in assets, according to the firm’s website on Wednesday.\n\nRead more: SEC’s X account fell victim to SIM swap attack\n\nVolatility is no stranger to the bitcoin ETFs, which only received approval this month.\n\nPrior to the SEC officially paving the way for the launches, an attacker was able to access the SEC’s official X account and make a fake ETF approval post. SEC Chair Gary Gensler then confirmed, via his X account, that the post was not sanctioned or made by the SEC.\n\nThe bitcoin ETFs were then approved the next day.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDI0LzAxLzI0L2dyYXlzY2FsZXMtZ2J0Yy1oYXMtbW92ZWQtbW9yZS10aGFuLTEwMGstYnRjLXRvLWV4Y2hhbmdlLXNpbmNlLXNwb3QtYml0Y29pbi1ldGYtbGF1bmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "GBTC's Bitcoin (BTC) Sales Top 100K Since ETF Launch - CoinDesk",
        "content": "GBTC has seen this massive outflow for any number of reasons, but principally as Grayscale cut its management fee just 50 basis points to 1.50% following the conversion to a spot ETF. That's more than 100 basis points higher than the other nine competing bitcoin ETFs. Grayscale has now seen the departure of more than 10,000 bitcoin per day for several days running. The exit of bitcoin combined with the decline in the price of bitcoin has led to a fall in assets under management (AUM) by more than $1 billion each day this week."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMjMvcmV0YWlsLWludmVzdG9ycy13b3JyeS1iaXRjb2luLXdpbGwtcGx1bmdlLWJlbG93LTIwMDAwLWJhbmstc3VydmV5LXNheXMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Retail investors are worried bitcoin will plunge below $20000 this year, Deutsche Bank survey says - CNBC",
        "content": "Crypto skeptics aren't changing their tune just because they can now buy bitcoin exposure through an exchange traded fund, according to a Deutsche Bank survey. Since the launch of the ETFs on Jan. 11, bitcoin has fallen about 20% to roughly $39,000, according to FactSet. So far, institutions have been slow to adopt the new funds in portfolios and retail investors aren't entirely convinced they need to, London-based Deutsche Bank analyst Marion Laboure said in a note Tuesday. The bank polled 2,000 consumers across the U.S., U.K. and Europe after the Securities and Exchange Commission approved the ETFs earlier this month. It found that more than a third of respondents believe bitcoin will fall below $20,000 by the end of this year. Furthermore, more than half of participants indicated they believe a \"major cryptocurrency\" will collapse entirely in the next two years. Looking at bitcoin specifically, Deutsche said 39% of survey participants think it will stick around in the coming years, while 42% anticipate it will disappear. \"The survey's results clearly indicate a lack of understanding of cryptocurrencies, as two-thirds of consumers possess minimal or no understanding of these digital assets,\" Laboure said. She added that the negative sentiment could be tied to past events, including the collapse of FTX in 2022 as well the SEC's lawsuits against Binance and Coinbase, two of the biggest exchanges in the world. The price of bitcoin rallied in the second half of last year, largely on market expectations that the U.S. would approve its first spot bitcoin ETFs this year, bringing the asset class legitimacy as well as an easy, convenient way for investors to add it to their holdings. Despite bitcoin's January sell-off, the crypto asset still has potential tailwinds in coming months, including an upcoming SEC decision on spot ether ETFs in May and the Bitcoin halving expected in April, Laboure wrote. \"The crypto world is gradually moving towards greater institutionalization as traditional financial players (tradFi) enter the market,\" Laboure said. \"Overall, the evolving ETF landscape and participations of institutional players are helping crypto mature into a more established asset class.\" —CNBC's Michael Bloom contributed reporting."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTIzL3JldGFpbC1pbnZlc3RvcnMtYXJlLWJlYXJpc2gtb24tYml0Y29pbi1hZnRlci1zcG90LWV0ZnMtbGF1bmNoLXN1cnZleS1zaG93c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Retail Investors Bearish on Bitcoin (BTC) After Spot ETFs’ Launch, Survey Finds - Bloomberg",
        "content": "The world’s largest cryptocurrency broke beneath $40,000 yesterday, and many retail investors believe it is heading even lower by year-end, according to a Deutsche Bank Research report.\n\nOver one-third of people surveyed think that Bitcoin will fall below $20,000 by next January, according to the report. About 15% of people said they expect the price will be between $40,000 and $75,000 by year-end."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyNC0wMS0yNS9hbmltb2NhLWJyYW5kcy1zaXUtb24tYml0Y29pbi12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Watch Animoca Brands' Siu on Bitcoin - Bloomberg",
        "content": "00:00\n\nThe. There's so many things I want to talk to you about. Why don't we start with a spot Bitcoin ETF? That pulled some money that arguably was outside the universe back in. But how does that affect you directly? Well, generally speaking, the excitement about sport ETF has sort of galvanized the entire market over the last two actually months. The entire industry has seen an incredible revival, you could say. And there's not actually so much necessarily just inflows into the market. It's confidence as well. It's validating the market. We also have to expect that now you have many thousands of basically sales agents in the U.S. going out, selling a Bitcoin related product, essentially a crypto product, which is again something that validates the space. And Bitcoin is somewhat the reserve currency of the metaverse and web3. Yeah. So as that value rises, basically the entire rest of the ecosystem goes up. So we're now at about $1.6 trillion from a market size, which is pretty amazing. And that sort of flow over hasn't just affected things in the sort of financial markets, but also in culture like with NFT, right? So in December, around the time actually NFT sales over the last month was $1.8 billion, which has been an incredible revival given where it was a year ago. So the entire industry has gone up since you mentioned NetEase. What is turnover, what has turnover look like since bitcoin prices started rebounding in terms of prices, prices and overall transactions? Because there was a really dark spot of last year, there was a dark spot generally speaking. I mean I think it's gone down, you know, at one point it was like something like 300 and $400 million a month in sales and now at $1.8 billion on sort of sales is actually really what's come up. A few things. The market has become also more diversified in the past. All of the NFT sales were very Ethereum focused and now with Bitcoin and Audible's, you have basically a new sort of phase of new type of digital collectibles and sort of digital cultural artifacts that are out there. But yeah, the values of many of these sort of assets, including some of ours, like the Winklevoss twins, have gone up over 600% over the last three months. So broadly speaking, it's been, you know, a really good time. And we think 2024 will also be a very strong year because when you think about last year, I think of 23 as a clean up year for our world, right? It was quite a scandal we had to take care of. And also, I think the sort of cloud over what was going to happen to finance was kind of taken care of. And now we know that kind of Binance is treated much like a big bank dealing with, you know, a penalty and now moving forward. Yeah. So I think that clarity is really what the market wants. So I think all of those together have created a really good platform for in 2024 for web3 and blockchains. Do you think that changes everything negative that's happened? And we're cleaning up your point. We're cleaning up right now and we've obviously had our episode specific episodes locally here. Do you think that's changed the way the government has that this overall blueprint of them looking to develop website? Has that changed in your view? Because you said I mean, I didn't know I went through sort of council. Yeah. And one of the things that's very clear is that Hong Kong has continued to stay steadfast in its direction to become a digital asset hub. And frankly, I think Hong Kong recognizes not only that it's here to stay and that it's the future, but also how does holding differentiate itself against all of these other major financial hubs? How does it say that it's different from a London or New York or a Singapore, for instance? And I think by being a digital assets leader, it's demonstrated that last year at FinTech Week, I know when Apex was here and so on, there was incredible energy and excitement around this. And, you know, I just came back from Davos and actually it was our office that was actually on stage talking about basically digital assets and crypto are probably one of the few government officials that was doing that Web three here in Hong Kong. What are the tangible developments which we should we can expect? Let's freeze it down. What we can expect to see. I mean, I think in the near term, many of the NFT projects in terms of culture and entertainment are continuing to rise. You know, it started off obviously with, you know, our sandbox, but now you've got many other projects here ranging from, you know, the multiverse, ranging from other projects, whether it's, you know, all of X or, you know, meme land with various projects that are see coming here from that angle. But of course, you know, nobody just wants to have you know, nobody wants a USB or the fund with a spot ETF. So expect a lot of smart ETF applications coming in to us for Bitcoin, but also for other token assets. You know, ETHEREUM'S probably next to probably other type of. Why would you say that? Because everyone says Ethereum is next. But yeah, tangibly is that because it's the second biggest or the second biggest? It has the most utility in terms of the ecosystem, but also I think because it's it's recognized as the second largest asset that is out there, but not every market necessarily will be looking at. You know, in the US, for instance, there's unclarity whether the FCC looks at Ethereum as a security or not. Right? Whereas I think in Hong Kong it's much more clearer. So there's an opportunity for markets like Hong Kong to actually be ahead of things like Etherium Spot ETF in comparison to the U.S. But, you know, we'll see how that plays out. Well, your very own, of course, which is sad. Do you is that is that somewhat of a northern north star for you to eventually get a spot ETF for San Juan? I mean, you know, the whole entire sort of crypto market when you think about tokens, $80 billion is traded roughly on a daily basis right now with tokens. There's a lot of liquidity in that space and that includes tokens such as sand or EB coin. Otherwise there is already, you know, with S.F. benchmarks, essentially a gaming index related to game utility tokens. So the next step for that becoming potentially an ETF in the future is, you know, absolutely something that could possibly be in the cards. It's not something that we ourselves will be. Launching, but we'd have to work with obviously financial partners to do that. But we totally expect that in the years to come that will happen. And of course, the other trend that's moving is of course, you know, basically RWA is basically people doing sort of, you know, taking real world assets and tokenizing that that's become very much of a sort of growing trend and will be something that we see developing in the near future. And I think Hong Kong could be one of the main hubs in the world that could be at the center of all this. You know, a fairly dominant theme since you brought up we're talking about Hong Kong is Hong Kong, Middle East. Yes, right. And there's a lot of presence from the Middle East here. I'm just looking around at some of the forums here. I know you guys just did a deal. When was that with Saudi, with Neal, with you in Saudi? When was that over? So that was. Yeah, that was a few months ago. Right close to you. So we've done the deal. Okay. And obviously it's pending closing conditions, but we were working together, doing a bunch of things. Have you received the money? We have not received the money That's been based on the closing conditions, but the process is ongoing and we're working very closely with them. The exciting thing is that, you know, Saudi Arabia in particular wants to become also, you know, with Vision 2030 has a very clear vision as to how the future will go in terms of its development. Gaming is a big, big narrative. And as you may know, Animoca Brands, as you know, has made lots of investments in growth in the gaming area, particularly with Wave three. You know, a population in Saudi is I think over 80% is under the age of 36 or 38. So very young population, active gaming market and neom is really in some ways sort of a parallel to sort of, I guess, the Guangdong sort of special economic zones that I'm thinking of or Shenzen economic Zone experiment, you could say, where they're trying to build an entirely new economy with its own sort of, you know, laws and so on, sort of citizenship. Almost all we can basically sandbox and build many of these sort of new sort of innovations, including web3 and blockchain. Right. So they can do much more easily in Neom than you could do, for instance, in Saudi as a country. Is there a direct revenue impact to your core businesses right now from that deal, or is that completely separate? We'll be able to talk to us about that. Well, I mean, first of all, Saudi generally or the Middle East is a major gaming market. Okay? When you look at not just actually what's happening in Saudi, but also UAE, Prince is a turkey. He's actually a major crypto hub, actually. And, you know, we expect revenue growth to be driven out of these markets. The other thing is, of course, the deployment of projects development, right? We're doing Metaverse projects, for instance, as you know, I can't announce what they are, but, you know, probably in a few months time you'll be seeing some news about some of the projects that we're launching together with Neom in Saudi. And these all have revenue impacts on our business. Talk about your business revenue growth you're targeting this year from last year. You work for the Wall Street Journal. You've been profitable. That's because, I mean, we're hoping to basically double our revenues from last year. Last year was a difficult year in comparison to the year prior. So obviously, you know, 23 was generally down. However, 24 is we expect much of an upswing. And, you know, the the entire sort of you know, our business is doing very well. Cash flow is generally very good. Right. So broadly speaking, you know, I would say that with 23 has sort of, I guess, solidified our position is probably one of the biggest, if not the leader in certainly Web three entertainment and culture. But also, broadly speaking, the exchanges out there have normally dominated the narrative. And in 23, I think a lot of that narrative has gone over to companies more like us or focus on culture and entertainment. So there's more attention on, you know, you know, awesome Uber Labs or anything around end of TVs and particularly gaming. Gaming has become a very strong narrative in terms of the adoption of what three. And one of the big reasons why gamers should be adopting office, because they're already dealing with virtual currency and they're really dealing with digital assets if they don't really own them. And that's basically what Web three can provide. Yeah. So that that that fit will thrive. And of course, we started out this conversation with spot ETFs. You know, certainly the you know, whether or not we do get a flood of institutional money in and you know, one thing that keeps coming up when they ask the question to traditional asset managers, large and wise, you know, with the spot ETF, do you now see yourself adopting or, you know, carving out a piece of your portfolio to that? What they say is I can't model it. So no, no, no, it's the answer. I can model it. What would the response be? Well, I mean, to me, this is the asset class of the future. I think one of the things that one has to understand is the macro of the world right now. But when you look at Web3 three, the opportunity, it is not only to be looked at in terms of the current sort of, you know, what's a cash flow revenue model. It's a new economics paradigm. It's the fact that, you know, what is the one way in which most of the world, particularly the ones who do not have access to, you know, new financial means, have a way in which it could be financially included. And actually web3 is the only way. I mean, even when you think about last year, a whole was the narrative actually who were the ones who got to participate in the growth of the narrative? VCs, investors, people could invest in, you know, companies like I, but everyone else was excluded. And this is basically why with three I think is so amazing because it can help include that Web3 is a people's movement. That's a difference. You know, the original Internet was a people's movement. Web two became more of a corporate movement, and I think people are trying to analyze it in this manner and web3 we're going back to essentially a people's movement."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzI0L2FyZS1zYXlsb3JzLXNhbGVzLWEtcHJlZGljdGlvbi1vZi1iaXRjb2luLXByaWNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Saylor's Sales: A Prediction of Future Bitcoin Prices? - The Motley Fool",
        "content": "MicroStrategy (MSTR -5.06%) founder and chairman Michael Saylor started selling stock in his own company in early January, culled from his portfolio of stock options. Astute investors may have noticed that the sales have been very consistent and are still going on today.\n\nEven keener observers, of course, saw this process coming from a mile away -- actually, from early November 2023. They also know how long Saylor's sales will go on, and why he is doing it.\n\nIn case you missed the early hints, here's why Michael Saylor is converting a massive lot of stock options into MicroStrategy shares, only to sell them immediately on the open market. Spoiler alert: Saylor has not lost faith in his data analytics business. He simply wants to buy some Bitcoin (BTC -4.26%) for himself.\n\nWhy Saylor is selling his converted stock options\n\nThis is not a guess. Saylor stated his plan to execute some of his stock options in 2024 and then sell the resulting shares on the grand stage of MicroStrategy's third-quarter earnings call in November:\n\nI was granted a stock option in 2014 with respect to 400,000 shares, which is going to expire next April if I don't exercise it by then. For almost a decade now at my request, the company has only paid me a $1 salary, and I've chosen not to be eligible for any cash bonuses. Exercising this option will allow me to address some financial obligations, as well as to acquire additional Bitcoin for my personal account.\n\nThose options were about to expire at the end of April anyway, so why not convert them into some cash and a lot of Bitcoin? After all, that's exactly what Saylor has been doing to most of MicroStrategy's cash in recent years.\n\nSaylor went on to explain his trading plan in some detail. As stated on that call and in the regulatory filings that followed, Saylor is converting 5,000 stock options into MicroStrategy shares on every day between Jan. 2 and April 25. This slow and steady approach minimizes Saylor's impact on MicroStrategy's daily trading patterns and volumes. It's a patient and responsible way to take advantage of the only significant compensation MicroStrategy has issued to Saylor in the last decade.\n\nThe story behind Saylor's stock option play\n\nIt should be said that Michael Saylor has a history of controversial business practices. The block of 400,000 stock options was set up to placate activist investor group Apex Capital in 2014. The firm argued that Saylor -- CEO at the time -- was spending too much time on his yachts and golf courses, paying insufficient attention to MicroStrategy's management.\n\nWith a strictly symbolic annual paycheck, no bonuses for the next decade, and a huge block of stock options to his name, Michael Saylor's objectives were strictly aligned with those of common shareholders. The only way to make money under this structure was to increase MicroStrategy's stock value over time.\n\nThis options-based structure wasn't looking good in 2020. By midsummer that year, MicroStrategy's stock price was down 5% from the start of 2014. Saylor's 400,000 stock options were worth a grand total of $47 million that summer. It's hardly a beggar's ransom, but also far from the stellar returns expected by the CEO of a successful software business over nearly seven years.\n\nLater that summer, Michael Saylor invested $250 million of MicroStrategy's cash in Bitcoin, calling the cryptocurrency \"a dependable store of value and an attractive investment asset with more long-term appreciation potential than holding cash.\" MicroStrategy's stock price more than tripled between July 1 and New Year's Eve, right alongside a similar surge in Bitcoin prices.\n\nBitcoin has been good to Michael Saylor over the years. At today's share prices, those 400,000 options are worth approximately $159 million. That should be more than enough to settle Saylor's golf club premiums, put a fresh coat of paint on every yacht, and boost his personal Bitcoin exposure significantly.\n\nBitcoin transformed Saylor's fortunes -- should you follow suit?\n\nMichael Saylor's stock-option settlement worked out in his favor thanks to a bold Bitcoin bet. The man looks like a genius when the largest cryptocurrency is on the rise, but not so much during crypto winters and other market downturns. If those options had expired one year earlier, forcing him to execute the conversion plan in the spring of 2023, MicroStrategy's and Bitcoin's average prices were about half of what they are today.\n\nMy takeaway from Michael Saylor's Bitcoin adventures is not that my entire net worth should be converted into Bitcoin today. Rather, I see the upsides of a successful crypto strategy next to the downsides of more challenging periods. If anything, I'm inspired to take my hands off the Bitcoin wheel for a while (apart from moving my Bitcoin ETF holdings into a different vehicle, as I disclosed last week) and wait for the next crypto winter before increasing my crypto bets.\n\nI respect the longtime Bitcoin advocate's deep devotion to the cause, but he isn't my favorite role model by a long shot. Saylor rides the Bitcoin roller coaster with gusto, but for those of us watching from the ground, it's a clear signal to diversify our tickets and enjoy a steadier ride.\n\nThat's why my Bitcoin investments are a small portion of my total nest egg, and why master investor Warren Buffett wouldn't touch the digital currency with a 10-foot pole."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2didGMtb3V0Zmxvd3MtY3VyYi1hc3NldC1hZHZhbnRhZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "As GBTC outflows continue, will the largest bitcoin ETF be dethroned? - Blockworks",
        "content": "Grayscale Investments’ bitcoin trust continues to see net outflows two weeks after converting to an ETF, shrinking the hefty asset advantage it has over rivals.\n\nStill, analysts believe it could be a while before the Grayscale fund relinquishes its title of the largest spot bitcoin ETF.\n\nThe Grayscale Bitcoin Trust ETF (GBTC) saw $515 million in net outflows on Tuesday, according to Bloomberg Intelligence data — bringing its net outflow total to nearly $4 billion since converting to an ETF on Jan. 11.\n\nRead more: Bitcoin ETF Tracker\n\nGBTC’s assets stood at about $21 billion at midday Wednesday, according to the firm’s website.\n\nMeanwhile, competing bitcoin ETFs by BlackRock and Fidelity had grown their asset bases to about $1.85 billion and $1.6 billion, respectively, as they have notched net inflows daily.\n\nSome foresaw GBTC’s asset bleeding given the fund’s 1.5% fee. The price point was reduced from 2% upon converting to an ETF, though remains significantly higher than competing offerings with expense ratios ranging from 0.19% and 0.39%.\n\nRead more: Why the planned fee for Grayscale’s bitcoin ETF is much higher than others\n\nMatteo Greco, research analyst at Fineqia International, said given GBTC’s pre-ETF structure — restricting redemptions to only allow selling shares on the secondary market at a significant discount — he expected the highest outflow activity to occur within the first few weeks of trading as an ETF.\n\nBut surpassing GBTC’s assets under management will be a “challenging feat,” he told Blockworks, adding that the pace of competitor inflows and GBTC outflows are likely to decelerate.\n\n“Given GBTC’s [public quotation] in 2015, boasting over eight years of competitive advantage, it is anticipated that GBTC will continue to dominate AUM for a considerable duration,” Greco said. “Dethroning GBTC could be a lengthy process.”\n\nThe fund officially launched two years prior in 2013. Grayscale’s court victory over the Securities and Exchange Commission last August served as a catalyst for the long-awaited approval of US spot bitcoin ETFs.\n\n“GBTC has already cemented its place as the go-to bitcoin ETF in the United States for investors who value market-leading liquidity, tight spreads and a decade-long track record of operational success,” a Grayscale spokesperson told Blockworks.\n\nThe fund’s trading volumes totaled nearly $11 billion after eight days of trading, accounting for more than half the volumes seen for such ETFs.\n\nJohn Hoffman, Grayscale’s managing director of sales and distribution, previously said that because large capital markets ETFs are used in a variety of investing strategies, “we anticipate GBTC’s diverse shareholder base will continue to deploy strategies that impact inflows and outflows.”\n\nWhy investors might remain in GBTC\n\nBryan Armour, a director of passive strategies research at Morningstar, said while he expects GBTC’s assets to continue to drop, there remains a portion of investors who are either unaware of other options or uninterested in switching.\n\nArmour added that because many are buying the nine other US spot bitcoin ETFs and selling GBTC, traders can sell those funds at a premium and buy GBTC at a discount via a process called pairs trading.\n\n“Traders will rely on GBTC less as markets normalize and assets grow in the new nine — especially the biggest ones like iShares and Fidelity,” he said. “GBTC will no longer be necessary once order flow becomes two-sided in the new ETFs.”\n\nOther investors are thinking about capital gains, analysts said, as some face large tax bills if they switch to another ETF.\n\nMost customers who bought GBTC in the past would realize a profit upon selling the shares, thereby initiating the taxable event, Greco explained.\n\nRead more: FTX estate sells majority of GBTC holdings: Reports\n\n“Consequently, even if these customers were to transfer their funds to a more cost-effective ETF, they would do so with a reduced amount of BTC, making the transfer less favorable,” Greco added.\n\nThe capital gains grow smaller as bitcoin’s price keeps dropping, Armour said, making it easier for investors to switch. Bitcoin (BTC) was at roughly $39,800 at 3:30 pm ET on Wednesday — down 6.6% in the last week but up 1.3% over the last 24 hours.\n\n\n\n“A declining bitcoin is extra bad for GBTC,” Armour said.\n\nA Grayscale spokesperson noted in a Wednesday statement that the firm lowered its fee — “as promised” — upon uplisting GBTC to NYSE Arca. Grayscale did not comment on whether it is considering decreasing its fee further.\n\n“I don’t expect them to cut their fee significantly because I think it’s too late to compete on price,” Armour said. “They can probably make more money by charging a high fee and riding out a declining asset base.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvYmlnLXF1ZXN0aW9ucy1jYW4tYml0Y29pbi1wYXltZW50cy1tYWtlLWEtY29tZWJhY2sv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Big Questions: How can Bitcoin payments stage a comeback? - Cointelegraph",
        "content": "Bitcoin may not be the go-to digital currency for most of the world’s 8.1 billion population today due to scaling limitations, but there’s a hoard of developers out there hoping that one day it will.\n\nWhen Satoshi Nakamoto invented Bitcoin, it was meant to be a peer-to-peer electronic cash system. For a few years, that worked pretty well. But as the network grew larger and more valuable, most hodlers, which now include firms like MicroStrategy and BlackRock, just seem to want to hoard it all away.\n\nBitcoin payment naysayers point to the network’s slow transaction speeds and sky-high fees during periods of demand and note that its overall uptrend and volatility mean holders are more likely to salivate over future gains than spend their BTC.\n\n“The one issue I still have with Bitcoin, it was meant to always be a currency,” Bloomberg ETF analyst Eric Balchunas told X Hall of Flame recently. “This is a real currency, and it went away. The price is volatile, and it is more like a commodity; it’s like gold.”\n\nBut the big question is: How can Bitcoin payments make a comeback?\n\nBitcoin’s golden years for payments\n\nIn the early years, at least, there was an unmistakable movement toward Bitcoin payments. BitPay reported in 2012 that over 1,000 merchants accepted Bitcoin through their service. Just one year later, it had already ballooned to 10,000 BTC-accepting merchants.\n\nFor a time, it seemed as if everyone was jumping on the Bitcoin payments bandwagon. I remember attending an online gambling conference in 2013 where one of the sponsors, a Bitcoin solutions company, moved $1 million worth of BTC to an attendee’s newly created Bitcoin wallet and back again in seconds. The crowd that had gathered around the phone gasped when they saw the enormous sum arrive — and for a negligible fee.\n\nGold has a $14 trillion market cap with zero merchant adoption.\n\n\n\nSo why do people think Bitcoin can only have value if it’s used for coffee payments? — Dan Held (@danheld) September 12, 2023\n\nHowever, the wheels started to fall off around 2017 amid that year’s massive bull run. Bitcoin’s average transaction fee — the payment that incentivizes a Bitcoin miner to process and confirm a transaction — went from about $0.35 in January to nearly $55 in December 2017, according to data from BitInfoCharts.\n\nA Bloomberg report around that time found that Bitcoin merchant acceptance was “low and getting lower,” with a Morgan Stanley analyst explaining that Bitcoin owners were “reluctant to use the cryptocurrency given its rate of appreciation” and that it was “way easier to trade speculatively than convince new merchants to accept the cryptocurrency.”\n\nAttention shifted to an idea first proposed by Joseph Poon and Thaddeus Dryja in their 2015 white paper called The Bitcoin Lightning Network, a Bitcoin layer-2 network focused on scaling for payments.\n\nLightning Network scales to millions of TXs\n\nMany of the traditional arguments against Bitcoin payments were seemingly solved after the Lightning Network was launched in 2018. However, it has developed its own problems.\n\nThe network is a layer-2 solution for Bitcoin built on top of the Bitcoin blockchain to solve the scaling problem with lightning-fast transactions and low fees.\n\nSimilar to setting up a tab at your local bar, each small Bitcoin transaction is accounted for on the layer-2 network. The Bitcoin mainnet and its high fees only come into play when one party decides to “settle the bar tab,” so to speak.\n\n#Bitcoin Lightning payment at Faro Channelside Bar&Restaurant in Helsinki 🇫🇮 ⚡️ pic.twitter.com/L8wHgfu4s8 — Elina Vuorela (@elina_glow) February 19, 2023\n\nTo utilize the Lightning Network, a Bitcoin user must first deposit a certain amount of Bitcoin onto the network — though the process can be simpler through a centralized Lightning Wallet provider. After that, they can transact back and forth with other users as long as there are enough funds. Transactions are practically instant and cost cents, not dollars.\n\nDavid Marcus, CEO and co-founder of Lightspark — an enterprise gateway provider for the Lightning Network — believes that Bitcoin could become the “TCP/IP” for real-time value transport on the internet.\n\n“The opportunity to reinvent how trillions of dollars of value move every day and make it always-on, low-cost, open, and real-time is incredibly exciting.”\n\nAt @Lightspark, we believe #Bitcoin will become the TCP/IP for realtime value transport on the Internet. The opportunity to reinvent how trillions of dollars of value moves every day and make it always-on, low-cost, open, and realtime is incredibly exciting. — David Marcus (@davidmarcus) January 16, 2024\n\nLightning Network has millions of issues\n\nBut while Lightning is great in theory, it is not so great in practice.\n\nSome, including Bitcoin analyst and Ordinals proponent Eric Wall, argue that the complexity of the Lightning Network for ordinary users promotes the use of custodial wallets — particularly in a high-fee environment, which goes against the Bitcoin ethos of self-custody and decentralization.\n\nWell, agree to disagree. I think technically inept bitcoiners like yourselves (blind leading the blind) force-feeding the Bitcoin community a scaling solution that nearly everyone (even maxis on Nostr) chooses to use custodially is the attack on Bitcoin. Jpegs aren’t the problem pic.twitter.com/edf5rdShBK — Eric Wall | OP_😺 (@ercwl) January 6, 2024\n\nWall demonstrated exactly how difficult the Lightning Network could be in an excruciating thread over two days recently, in which Bitcoin evangelist Brad Mills, who’d lost a bet with Wall about ETH’s price, tried and failed numerous times to pay a simple Lightning invoice for $438.\n\nThe Lightning Network also suffers from a lack of merchant adoption and user awareness. Data from 1ML estimates there are currently 59,511 public payment channels and about 14,670 Lightning nodes on the network.\n\nAt present, there’s about $200 million in Bitcoin locked on the network (it hit an ATH of $234 million). In August 2023, prior to a big jump in the price of Bitcoin, just $78.2 million was publicly routed on the Lightning Network, according to financial services firm and Bitcoin tech company River. However, the 6.6 million transactions that month was a 1,212% increase over the same month in August 2021, so it is growing, albeit from a small base.\n\nBut to put the figures into perspective, credit card provider Visa averaged more than $1 trillion in payment volume per month last fiscal year, with over 4.3 billion cards issued worldwide.\n\nAnd although it can theoretically handle millions of transactions per second, the River report suggested it was only doing around 2.5 transactions per second, fewer than Bitcoin’s on-chain average.\n\n“The Lightning Network, despite its promise, faces capital inefficiencies and security concerns. These factors contribute to why, as we predicted, it’s not yet an effective payment layer for Bitcoin,” argues Eli Ben-Sasson, co-founder and president of StarkWare.\n\nPeople with 8+ years in bitcoin world are still struggling with lightning\n\n\n\nIts hillarious that its been nearly 10 years since the state channel started getting traction\n\n\n\nAnd its still useless\n\n\n\nThere are 0 good state channel apps\n\n\n\n0 after 10 years\n\n\n\nZero. https://t.co/McPhZ0u3VV — Juve (@notjuve) January 2, 2024\n\nInstead, Ben-Sasson believes zero-knowledge proofs (or validity proofs, as he likes to call them) are the missing piece of the equation.\n\nZero-knowledge Bitcoin can make payments happen\n\nBen-Sasson is a household name in Ethereum scaling but was a Bitcoiner before ETH even existed. He discussed scaling Bitcoin with ZK tech with former Bitcoin core devs Greg Maxwell and Mike Hearn at the San Jose Bitcoin conference in 2013.\n\nHe believes upgrading Bitcoin to use ZK-proofs could address network congestion and high fees on the Bitcoin blockchain.\n\n“Bitcoin has the potential to become a fantastic payment method, yet there is a big ‘but.’ It simply cannot achieve this unless it embraces the cryptography it needs to scale,” he argues.\n\n“For as long as it continues to resist scaling solutions, it won’t become a viable payment method.”\n\nA newly formed startup, ZeroSync — sponsored by StarkWare — has been developing ZK-proof-powered tools that allow users to validate the state of the Bitcoin network without downloading the blockchain or trusting a third party for verification.\n\nEli Ben-Sasson discusses SNARKs and STARKs at the BIU Cyber Center in 2019. (BIU Crypto)\n\nThere are also emerging Bitcoin L2 networks that have recently released white papers intending to scale Bitcoin using EVM and/or ZK tech. If they work out, it could certainly be a boon for Bitcoin payments.\n\nBut to scale Bitcoin properly with ZK-proofs would likely require a contentious hard fork to enable it to interact with the technology, and that seems unlikely to happen, says Ben-Sasson.\n\n“I’ve been discussing STARK proofs since 2013. We’re showing every day what they can do in terms of scaling Ethereum, and they could also scale Bitcoin for mass use, including as a means of payment. This isn’t happening because of ideological conservatism in the Bitcoin community.”\n\nHuman Rights Foundation chief strategy officer Alex Gladstein tells Magazine he doesn’t see this taking off either, noting that ZK technology is unlikely to gain the support of a critical mass of the Bitcoin community as it “hurts the ability to audit the supply of Bitcoin” and makes transactions larger.\n\nGladstein doesn’t “think base-layer Bitcoin ends up being used for small payments,” but he does expect people to use Bitcoin as a “savings account” and as a settlement layer for businesses, nations and large institutions.\n\n“For retail commerce or smaller payments, I think people make a tradeoff of some kind and use something like federated eCash, custodial Lightning, a neobank,” he adds.\n\nNo one would chose Argentine pesos over dollars as a savings and payments technology\n\n\n\nBut the result of this at the state level is a loss of sovereignty and the boosting of one government at the expense of the rest\n\n\n\nThis is why Bitcoin stands as such a compelling alternative 💡 — Alex Gladstein 🌋 ⚡ (@gladstein) November 20, 2023\n\nSo, if the Lightning Network is yet to take off and Bitcoiners aren’t keen on adding ZK-proofs, what other options are there?\n\nHal “Running Bitcoin” Finney had an idea\n\nEarly Bitcoin pioneer Hal Finney foresaw all of this happening and came up with his own solution. He postulated that “Bitcoin-backed banks” could issue their own digital currencies backed by Bitcoin.\n\n“Bitcoin itself cannot scale to have every single financial transaction in the world be broadcast to everyone and included in the blockchain. There needs to be a secondary level of payment systems which is lighter weight and more efficient,” said Finney on the Bitcointalk forum in December 2010.\n\nRunning bitcoin — halfin (@halfin) January 11, 2009\n\nHe saw Bitcoin becoming a reserve currency for banks, playing the same role as gold did between the mid-1940s and 1971. (Ever wondered WTF happened in 1971?)\n\n“Bitcoin backed banks will solve these problems. They can work like banks did before nationalization of currency,” he added.\n\nPile of gold bullion coins and bars from Canada, Australia, U.S. and Krugerrand and others. (Unsplash)\n\n“I believe this will be the ultimate fate of Bitcoin, to be the ‘high-powered money’ that serves as a reserve currency for banks that issue their own digital cash. Most Bitcoin transactions will occur between banks to settle net transfers.”\n\nBitcoin transactions between private individuals will be rare, added Finney, who sadly passed away in 2014 as a legend in the Bitcoin community.\n\nHowever, if the 10-year delay in approving spot Bitcoin ETFs, last year’s banking collapses and the much-discussed Operation Choke Point 2.0 in the United States are any indication, mainstream banks will face an uphill battle to even think about holding large swathes of Bitcoin.\n\nCaitlin Long’s Custodia Bank, which seeks to be a bridge between crypto and the U.S. dollar payments system, is engaged in a court battle against the Federal Reserve for denying it a Fed master account. Its case is supported by Wyoming’s attorney general, and a decision is expected around March.\n\nDoes anyone want to pay with Bitcoin anyway?\n\nIt’s entirely possible that in developed economies, efficient electronic payment systems have undercut the demand for Bitcoin payments. Two studies from the U.S. Federal Reserve and the Reserve Bank of Australia found that just 2% of adults actually paid for something using cryptocurrency in 2022; a fraction of those used PayPal, QR or even Buy Now, Pay Later services.\n\nBut there are encouraging signs in developing economies. El Salvador, which famously passed the Bitcoin Law, saw a slow start to Bitcoin payments.\n\nBut things are slowly changing. In November, Bitcoin wallet and API platform Blink partnered with Distribuidora Morazán to launch a pilot program that will onboard 1,000 merchants to Bitcoin payments in 2024.\n\nAnd a survey of 1,280 respondents by a researcher at the Central American University in El Salvador found that 12% of the local population used Bitcoin at least once in 2023 to pay for goods and services.\n\nAn eatery in El Salvador with a sign displaying it accepts Bitcoin. (@SalvaNakamoto)\n\nMeanwhile, recent data from BTC Map had recorded a 174% increase in Bitcoin-accepting vendors worldwide by the end of 2023, reaching 6,126 merchants.\n\nFormer Cointelegraph reporter Joe Hall, in a recent X post, noted there are pockets in the world, such as Cuba, where people prefer to deal in Bitcoin — volatility and all — rather than the local currency.\n\nCuba’s inflation rate was around 40%, while another pro-Bitcoin country, Venezuela, was as high as 439% in 2023. Keeping money in Bitcoin is a good alternative to fiat that’s rapidly losing value.\n\nCuban students being educated in the use, custody and movement of Bitcoin. (@Cuba_BTC)\n\nMaxwell Abbey, the public relations director of Wallet of Satoshi, tells Magazine that Bitcoin is more important than just a payment method to people hit by money printing and inflation.\n\n“The important thing is that Bitcoin was birthed, and the human race now has access to something that has never been possible before: base money whose issuance is outside of the control of any individual, group or nation.”\n\n“The irresistible temptation to debase the currency has been designed away and made impossible.”\n\nRise of the stablecoin\n\nThere are big threats to the adoption of Bitcoin payments in the form of stablecoin payments and central bank digital currencies. And poor people often turn to cheaper layer-1 blockchains like Tron. In emerging markets, Tether on Tron makes up 37% of stablecoin transactions.\n\nBut Gladstein sees stablecoins as only a temporary solution. “Ultimately, commerce, I think, will be denominated in BTC,” he argues.\n\nWhatever happens, Bitcoin is here to stay, whether as “digital gold,” the world’s reserve currency, or as the backing for bank-issued currencies. And it’ll be used to pay for things, but to what extent remains an open question."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvd2h5LXZhbmd1YXJkLXNhaWQtbm8tdG8tYml0Y29pbi_SAVNodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L3doeS12YW5ndWFyZC1zYWlkLW5vLXRvLWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Why Vanguard Said 'No' to Bitcoin - Finance Magnates",
        "content": "After months of speculation and a frenzy of attention that crossed over from crypto Twitter to mainstream financial channels, those long-awaited spot BTC ETFs finally gained approval from the SEC earlier this month, and from there, were almost immediately up and running.\n\nThere was the added last minute drama of the SEC having its X account compromised, resulting in a fake approval post going out a day early, an occurrence which will go down as yet another moment of disruptive madness in Bitcoin Bitcoin While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that Read this Term history, but in the end, the consensus was that we were in uncharted but inevitable territory; stepping across the chasm between a novel, volatile, and frequently misunderstood monetary technology, and the (ostensibly) risk-averse world of orthodox, mainstream finance.\n\nChart from The Block\n\nAfter all, with the investment titan BlackRock on board, what more weighty seal of trad-fi approval could Bitcoin garner? As it turned out, though, there was still some institutional doubt remaining, and not every major player is in agreement about BTC’s prospects, either as an investment choice or for any other purpose, as revealed when customers with Vanguard discovered that the firm had opted not to provide access to those hugely hyped-up new spot ETFs.\n\nIn fact, not only did Vanguard choose not to offer the new BTC products, but it then made the decision to stop offering BTC futures ETFs, which had previously been available on its platform. The upshot being, then, that while other firms were setting about promoting BTC as a necessary component in an up-to-date portfolio, Vanguard was going out of its way to make sure its customers were shepherded well clear of anything blockchain Blockchain Blockchain comprises a digital network of blocks with a comprehensive ledger of transactions made in a cryptocurrency such as Bitcoin or other altcoins.One of the signature features of blockchain is that it is maintained across more than one computer. The ledger can be public or private (permissioned.) In this sense, blockchain is immune to the manipulation of data making it not only open but verifiable. Because a blockchain is stored across a network of computers, it is very difficult to tampe Blockchain comprises a digital network of blocks with a comprehensive ledger of transactions made in a cryptocurrency such as Bitcoin or other altcoins.One of the signature features of blockchain is that it is maintained across more than one computer. The ledger can be public or private (permissioned.) In this sense, blockchain is immune to the manipulation of data making it not only open but verifiable. Because a blockchain is stored across a network of computers, it is very difficult to tampe Read this Term-related.\n\nKeep Reading TradingView Enhances DeFi Tools on Polygon via QuickSwap Partnership\n\nVanguard's Consistent Approach\n\nWhen it comes to the reasons for Vanguard's position on Bitcoin, representatives of the firm have been quoted as saying that Bitcoin products, “do not align with our offer focused on asset classes, such as equities, bonds, and cash, which Vanguard views as the building blocks of a well-balanced, long-term investment portfolio.”\n\nVanguard doesn’t fit with most young wealthy people’s investment philosophy.\n\n\n\nChange = an opportunity or a threat. https://t.co/9oaPZFmdhr — CTO Larsson (@ctoLarsson) January 11, 2024\n\nAnd furthermore, that the purchase of Bitcoin products, “doesn't fit with Vanguard's investment philosophy.”\n\nBut, what does this reference to the firm’s own philosophy actually mean, and is it really the only factor in Vanguard steering clear of Bitcoin and crypto?\n\nSteven Lubka, the Managing Director at the Bitcoin services provider Swan Bitcoin, believes that a reason Vanguard is not offering the new BTC ETFs is because, “they [Vanguard] are against ‘non-productive’ investments, as in, investments without cash flows.”\n\nAnd, so Vanguard opts out of BTC products, which it appears to regard simply as a speculative bet on higher prices in future, “For the same reason they opposed gold.”\n\nThat last point, about gold, references Vanguard’s decision not to offer gold ETFs when other firms were first leaping in. And, as BTC is sometimes directly advocated for as digital gold, just this month, BlackRock’s Larry Fink stated that bitcoin is “no different than what gold represented over thousands of years. It is an asset class that protects you.” Then there is consistency in Vanguard’s approach, regardless of whether the assets under consideration happen to be physical metals or entries on a digital ledger.\n\n\"It is an asset class that protects you.\" - Larry Fink, CEO of BlackRock on #Bitcoinpic.twitter.com/jO1YAj99ju — Michael Saylor⚡️ (@saylor) January 12, 2024\n\nWe can also find evidence of this consistency if we look back to 2020, when Vanguard took a reserved, wait-and-see approach towards ANT (active non-transparent) ETFs, while other firms were, by contrast, keen to include the new products. Notably, State Street took a similar approach to Vanguard, sitting back when others were enthusiastic, and the same is true now when it comes to crypto, as State Street has chosen, for the moment, not to offer spot BTC ETFs.\n\nAll in all then, it would be an unusual shift in approach if Vanguard had chosen to rush into a spot BTC ETF, and it fits comfortably with the Vanguard brand for the firm to visibly step away from crypto when others are riding in on a wave of hype.\n\nThe Impact on Bitcoin\n\nWhen it comes to whether Vanguard might change its approach to crypto, considering the company’s long-term stance, not just towards BTC but also on similar assets, a significant shift appears improbable at this time.\n\nIf such a change were ever to occur, it might require deeper and more long-term mainstream adoption of BTC, although even then, the digital currency might still remain outside the firm’s investment boundaries. However, considering the possibility of increased bitcoin adoption raises another question, which is whether rejection from Vanguard, despite a regulatory greenlight from the SEC, might exercise a drag on Bitcoin’s movement towards greater acceptance.\n\nThat sounds initially plausible, but at the same time, the opposite may be true, as Vanguard’s decision appears to have created even more headlines and debate focused on Bitcoin, thereby pushing the asset further into mainstream awareness. Or as Lubka put it: “It doesn't matter for BTC, if anything it's free publicity. As long as you can still buy it at other brokers, people have all the on-ramps they need.”"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDI0LzAxLzI0L2JpdGNvaW4tbWluZXItaHV0LTgtaGl0cy1vdXQtYXQtc2hvcnQtc2VsbGluZy1yZXBvcnQv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjQvMDEvMjQvYml0Y29pbi1taW5lci1odXQtOC1oaXRzLW91dC1hdC1zaG9ydC1zZWxsaW5nLXJlcG9ydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Miner Hut 8 Hits Out at Short-Selling Report - CoinDesk",
        "content": "The mining firm's Nasdaq-listed stock fell from $9.17 on Jan.18 to $7 a little over 24 hours later after short-selling firm JCapital Research released a report claiming that Hut 8's merger with fellow miner US Bitcoin was a pump and dump waiting to happen."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTIzL3dhbmluZy1iaXRjb2luLWV0Zi1oeXBlLXNldC10by1kcmFnLW9uLWNvaW5iYXNlLWNvaW4tanBtb3JnYW4tc2F5c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Waning Bitcoin ETF Hype to Drag on Coinbase, JPMorgan Says - Bloomberg",
        "content": "The biggest US cryptocurrency exchange could fall victim to a slump in Bitcoin and waning enthusiasm for exchange-traded funds that invest directly in the digital token, according to JPMorgan Chase & Co.\n\n“We think the catalyst in Bitcoin ETFs that has pushed the ecosystem out of its winter will disappoint market participants,” analysts led by Kenneth Worthington wrote in a note on Monday, downgrading Coinbase Global Inc. to underweight from neutral."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vcXouY29tL2xvdHMtb2YtcGVvcGxlLXN0YXJ0ZWQtc2VsbGluZy1iaXRjb2luLWFmdGVyLXRoZS1zZWMtbWEtMTg1MTE5MDM5NdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin sales rose, prices fell after SEC approved ETFs - Quartz",
        "content": "There was a whole lot of excitement around the prospect of exchange-traded bitcoin funds a couple weeks ago, when the US Securities and Exchange Commission announced that it had approved use of the investing tool. Someone even hacked the SEC’s account on the X social media platform to break the news early! But that enthusiasm hasn’t translated to a rise in the cryptocurrency’s price.\n\nThe Financial Times reports that bitcoin prices are down 15% since Jan. 10, the day the SEC gave its blessing for ETFs, which enable lay investors to jump in and out of commodities more easily than if they had to figure out how to buy them directly. The price is now below $40,000 for the first time since early December.\n\nAdvertisement\n\nAdvertisement\n\nPart of the reason for the decline is because Grayscale, the trust that had planned to pioneer bitcoin ETFs, is now losing business to lower-priced competitors. Grayscale charges customers 1.5% of their invested assets; a similar BlackRock ETF charges 0.12%. The Wall Street Journal reports that Grayscale has seen $2.8 billion in outflows over the past couple of weeks.\n\nAdvertisement\n\nThough many people remain interested in bitcoin, very few people own very much of it. That means that big moves have an outsized impact on price. A November working paper from the National Bureau of Economic Research also suggests that bitcoin acts just like a lot of other tradeable assets. When there’s a surge in value—bitcoin is still up nearly 40% since news of the SEC’s pending approval of ETFs began circulating in October—a lot of investors try to get their money back while the getting is still good.\n\nRelated stories\n\nWhat’s the future of crypto regulation?\n\nBitcoin pumped and dumped on false BlackRock spot ETF approval report\n\nAll the things I learned about cryptocurrency from Goop"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYW5hbHlzdHMtdGhyZWUtZmFjdG9ycy1pbXBhY3QtY29pbmJhc2VzLTIyMTcxNDAzOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Analyst's three factors that will impact Coinbase's stock - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has fallen more than 10% since the Securities and Exchange Commission's approval for spot bitcoin ETFs. One company that is exposed to the ups and downs of the crypto market is Coinbase (COIN).\n\nOwen Lau, Executive Director at Oppenheimer, joins Yahoo Finance to discuss the state of bitcoin and the impacts it can have over financial institutions, investors, and the crypto market itself.\n\nWhen asked about the how the price of bitcoin impacts Coinbase, Lau states: \"I would say this is one of the most important factors for now. The other important factor is they are going on a lawsuit with the SEC. So there's still a regulatory overhang. We still don't have clear regulations in the United States right now, even though there are more clarity outside of the United States. So I would call out bitcoin price, the SEC lawsuit and also I think the overall health of the industry are all important factors for Coinbase. \"\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Nicholas Jacobino\n\nVideo Transcript\n\n[AUDIO LOGO]\n\nJOSH LIPTON: Bitcoin extending declines, now trading near $39,000. The optimism over spot Bitcoin ETFs evaporating. And the declines are also hitting crypto-related stocks, including Coinbase. Joining us now is Owen Lowe, Oppenheimer Executive Director and Senior Analyst. Owen, it's good to see you. So some of your colleagues, Owen, making headlines today. They're getting kind of pessimistic, skeptical on Coinbase. And their worry here, as they're watching Bitcoin, they watch these Bitcoin spot ETFs, Owen, maybe a kind of sell-the-news event. Do you share that caution here, Owen?\n\nOWEN LAU: So first of all, thank you for having me. I think in the near term the stock could be volatile because, think about that, if you go back to Coinbase, the stock was up 400% in 2023. And Bitcoin price was also up a lot and there was a sell-the-news event happening after the spot Bitcoin ETF approval. I do think that in the near term there may be some downward momentum on Bitcoin until the next catalyst. So I would say near-term you probably see the stock to be pretty volatile for Coinbase.\n\nStory continues\n\nJULIE HYMAN: Owen, is the Bitcoin price the most important factor for Coinbase's stock price?\n\nOWEN LAU: I would say this is one of the most important factors for now. The other important factor is they are going on a lawsuit with the SEC, so there is still a regulatory overhang. We still don't have a clear regulations in the United States right now, even though there are more clarity outside of the United States. So I would call out Bitcoin price, the SEC lawsuit, and also the, I think, the overall health of the industry are all important factors for Coinbase.\n\nJOSH LIPTON: And Owen, I'm also interested when we talk about Coinbase, the business, and you look at non-trading revenue, Owen. What percentage of that is now the total? And how do you see that sort of evolving from here? Because obviously, they've put a lot of emphasis and priority in diversifying the business, right?\n\nOWEN LAU: Yeah, at the end of the third quarter, I would say around 50%, half of the revenue, came from non-trading. And those revenue came from interest income and also blockchain income, which is the revenue they got from the USDC stablecoin. They have a revenue-sharing agreement with Circle.\n\nAnd then the other smaller revenue items are the staking revenue and also custody revenue. So you're right that Coinbase has been making a lot of effort to diversify away from just trading. So that's why Bitcoin is important, but not the-- I wouldn't say it's like only one Bitcoin-- like only Bitcoin is the, like, predominant factor.\n\nJULIE HYMAN: And then, when we look at the Bitcoin ETFs as well, right? There was a lot of debate ahead of time as to whether this is going to be a boon or neutral, or even negative for Coinbase. So now that the introduction has come and gone, what do you think?\n\nOWEN LAU: So when we look at the fourth quarter trading volume. So when we bake in a lot of the optimism of Bitcoin, spot Bitcoin ETF approval, there are two key things that I think not many people talk about. Number one, Bitcoin price went up a lot. And Coinbase January revenue base part on the price of Bitcoin.\n\nThe second part was about higher trading volume. So what that means is this Bitcoin ETF can bring in new investors, it support higher prices, it also support higher trading volume. That actually benefit Coinbase longer term. So to me, I think it's a net positive for Coinbase longer term because it bring in new investors."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmcy1idXktMTAway1idGMtNy1kYXlz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "9 spot Bitcoin ETFs buy 100K BTC in 7 days after launch - Cointelegraph",
        "content": "Grayscale’s Bitcoin (BTC) exchange-traded fund (ETF) dumped more than 80,000 BTC in the days after its trading launch, but nine other spot BTC ETFs stacked over 100,000 BTC.\n\nNine spot Bitcoin ETFs, including BlackRock’s iShares Bitcoin Trust (IBIT) and Fidelity’s Wise Origin Bitcoin Fund (FBTC), purchased 102,613 BTC in the first seven days after their trading launches on Jan. 11, according to ETF data tracked by Cointelegraph. The amount is worth around $4.1 billion at the time of writing, according to CoinGecko.\n\nThe amount of Bitcoin purchased by spot Bitcoin ETFs in only seven trading days accounts for 53% of all Bitcoin amassed by the giant BTC investor MicroStrategy over the past three years. According to MicroStrategy’s most recent BTC acquisition report, the firm held an aggregate of 189,150 BTC as of Dec. 26, 2023.\n\nAfter starting to buy Bitcoin in August 2020, MicroStrategy crossed the 100,000 BTC mark in roughly 300 days, announcing it held 105,085 BTC in June 2021.\n\nNine #Bitcoin ETFs have amassed over 100,000 BTC in only 7 days of trading.\n\n\n\nSaylor spent 3 years accumulating about 190,000 BTC.\n\n\n\nDo not underestimate the power of the incumbent financial class.\n\n\n\nThey want you to part with your Bitcoin.\n\n\n\nWE ARE NOT FUCKING SELLING — The ₿itcoin Therapist (@TheBTCTherapist) January 23, 2024\n\nAccording to publicly reported data, BlackRock’s IBIT and Fidelity’s FBTC became the largest Bitcoin buyers among spot BTC ETFs since the trading launch, collecting 37,304 BTC and 29,232 BTC, respectively. The Bitwise Bitcoin ETF (BITB) and the ARK 21Shares Bitcoin ETF (ARKB) come next, with 16,451 BTC and 10,630 BTC, respectively.\n\nUnlike other Bitcoin ETFs, the Grayscale Bitcoin Trust ETF (GBTC) — the largest Bitcoin ETF by BTC holdings — has been actively selling Bitcoin since its trading launch, dumping 82,526 BTC. The amount is worth about $3 billion at the time of writing.\n\nRelated: Guessing game on GBTC bleeding stops helps push Bitcoin below $39K\n\nThe massive GBTC selling has triggered a significant drop in the price of Bitcoin, with the cryptocurrency plummeting nearly 20% from above $48,000 on Jan. 11 to as low as $38,700 on Jan. 23, according to data from CoinGecko. At the time of writing, Bitcoin is trading at $39,926, up 1.8% over the past 24 hours.\n\nBitcoin 30-day price chart. Source: CoinGecko\n\nSome industry observers linked GBTC selling to the estate of the collapsed FTX crypto exchange dumping $902 million in GBTC shares.\n\nMany analysts also suggested that GBTC’s high trading fees triggered the outflows. As previously reported, GBTC charges as much as 1.5% for trading fees without waivers, while other ETF sponsors set fees between 0.2% and 0.4%, also offering temporary waivers.\n\nMagazine: Coinbase fights SEC in court, SBF’s parents seek lawsuit dismissal, and Bitcoin ETFs: Hodler’s Digest, Jan. 14-20"
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy90d28tdGhpbmdzLWxpa2VseS10by1kcml2ZS1hLWJpdGNvaW4tcmVjb3Zlcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "These two drivers will fuel Bitcoin's rebound: 'It's happened often before' - DLNews",
        "content": "Bitcoin has recovered slightly after dropping 20% on the back of 10 US spot Bitcoin ETFs launching.\n\nInterest rates and shifting market dynamics will drive a rebound, said analyst Noelle Acheson.\n\nBitcoin rebounded overnight after falling some 20% from its $49,000 high earlier in the month. Two things will drive the cryptocurrency’s recovery, according to analysts.\n\nNoelle Acheson, author of the “Crypto is Macro Now” newsletter and former head of research at Genesis, said on X that the drop experienced over the past two weeks will “likely to be short-term, as ETF-related buying will continue as GBTC exits wane, and as geopolitical tension pushes more savings into a ‘hedge’ asset.”\n\nThe slide in prices showed signs of subsiding overnight.\n\nHaving fallen below the $39,000 mark, Bitcoin is now back trading over $40,000 by 1 pm UK time, up 3% since Tuesday.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\non the BTC drop… I don’t think it’s just GBTC redemptions…\n\n\n\noften, BTC is a better indicator of liquidity sentiment than stocks, in that it is one of THE most sensitive assets to monetary conditions… over the past few days, we’ve seen a steep revaluation of rate cut… pic.twitter.com/qxmWDoL50r — Noelle Acheson (@NoelleInMadrid) January 22, 2024\n\nIn the meantime, “we’re seeing a glimpse of market sanity,” she said as mispriced rates outlooks are being corrected.\n\n“It’s happened often before, and given the tailwinds — ETFs, halving, currency turmoil — the market is likely to recover, especially as dip-buyers step in,” Acheson said.\n\nThe recovery follows the US Securities and Exchange Commission’s approval of 11 spot ETFs earlier this month, bringing Bitcoin exposure to American investors and institutions.\n\nIn the end only 10 of the issuers approved launched spot Bitcoin ETFs, as Hashdex decided not to convert its existing futures ETF into a spot fund.\n\nJoin the community to get our latest stories and updates\n\nThe halving refers to the process in which the network automatically, irreversibly halves the amount of Bitcoin miners can earn from appending blocks of verified transactions to the Bitcoin ledger.\n\nBased on current estimates, the next halving will happen around mid-April.\n\nSell the news\n\nSo why did Bitcoin wobble?\n\nThe arrival of spot ETFs followed “the old Wall Street adage of ‘buy the rumour, sell the news,’” said Chris Kuiper, director of research at Fidelity Digital Assets.\n\nOpen interest, the total number of futures contracts held by market participants, rose towards the end of 2023 in anticipation of ETFs, Kuiper said, and “the speculative fever could also be seen in the spike in perpetual futures funding rates.”\n\nHow long this continues is anyone's guess, but even if we go down from here it still wouldn't mean the long-term bull market trend has been broken. Furthermore, nothing in the core bitcoin investment thesis has been invalidated. — Chris Kuiper, CFA (@ChrisJKuiper) January 23, 2024\n\nThe recent spat of selling and downward trend in prices doesn’t suggest the “long-term bull market trend has been broken,” Kuiper concluded.\n\n“Furthermore, nothing in the core Bitcoin investment thesis has been invalidated,” he added.\n\nFidelity Digital Asset’s research chief had warned that volatility could spike just a week before ETFs were approved and Bitcoin began to drop.\n\nGrayscale’s GBTC has seen near $4 billion in outflows since the fund converted to an ETF, causing a drag on the price of Bitcoin, according to JPMorgan.\n\nInvestors had been locked into GBTC for years, including bankrupt firm’s such as FTX and BlockFi. The conversion to an ETF offered an off-ramp for firms in need of liquidity, and likely explains some of the selling pressure in recent weeks, according to JPMorgan.\n\nGrayscale’s is also feeling the heat from other firms — including Wall Street giants BlackRock and Fidelity — that charge investors a fraction of GBTC’s 1.5% management fee.\n\nBlackRock, the world’s largest asset manager, charges just 0.12%, 138 basis points lower than Grayscale.\n\nHow about interest rates?\n\nWhile the GBTC selloff has been labelled a drag on the price of Bitcoin, another factor was the changing macroeconomic outlook.\n\nIn December, the US Federal Reserve made several dovish signals, which traders took to mean that interest rate cuts were on the horizon. Consequently, the price of Bitcoin went up.\n\nThose hopes are now fading as traders change their outlook on rates. The market prices in a 75% chance of an interest rate cut in March just one month ago, this has since fallen to 50% on the back of hawkish statements from central bankers.\n\nLower interest rates benefit risk assets like Bitcoin as investors take more risk in search of returns.\n\nBitcoin’s 24/7 nature means it can often adjust to changes in outlook and sentiment ahead of other assets. It’s often “a better indicator of liquidity sentiment than stocks, in that it is one of THE most sensitive assets to monetary conditions,” said Noelle Acheson.\n\n“Over the past few days, we’ve seen a steep revaluation of rate cut expectations. Bitcoin is reacting to that, while stocks aren’t,” she said.\n\nEric Johansson is DL News’ News Editor. Adam Morgan McCarthy is a Markets Correspondent at DL News. Tyler Pearson is a Junior Markets Correspondent at DL News. If you’ve got a hot crypto tip, please reach out to us at eric@dlnews.com, adam@dlnews.com and ty@dlnews.com."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9pbnZlc3RpbmcvbmV3cy9iaXRjb2luLWRvd24tMjAtc2luY2Utc3BvdC1ldGZzLWJlZ2FuLXRyYWRpbmctMjQ4MzQy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin down 20% since spot ETFs began trading - InvestmentNews",
        "content": "Bitcoin has fallen almost 20% since the Jan. 11 launch of the first exchange-traded funds investing directly in the token as speculators become more cautious about the potential impact of the products.\n\nThe digital asset spiked to $49,021 on the day the ETFs from issuers including BlackRock Inc. and Fidelity Investments went live. Bitcoin traded at $39,990 as of 6:03 a.m. Tuesday in London, an 18% drop from that intraday peak.\n\nNine new US spot Bitcoin funds started trading on Jan. 11, while the $22 billion Grayscale Bitcoin Trust — or GBTC — converted from a closed-ended structure into an ETF. A net $1.2 billion flowed into the group in the first six days, Bloomberg Intelligence’s Senior ETF Analyst Eric Balchunas wrote on X.\n\nBlackRock’s iShares Bitcoin Trust and the Fidelity Wise Origin Bitcoin Fund garnered most of the influx, while $2.8 billion exited the Grayscale fund, Balchunas said. Among the sellers was the estate of bankrupt crypto exchange FTX, which disposed of the majority of its shares in the Grayscale vehicle.\n\n“Over the past two weeks, Bitcoin has been challenged by tougher macro conditions — evidenced by rallying rates and a strengthening dollar — and significant selling pressure from traders unwinding their GBTC arbitrage positions along with the FTX bankruptcy estate offloading assets,” Sean Farrell, head of digital-asset strategy at Fundstrat Global Advisors LLC, wrote in a note.\n\nThe disposals by FTX potentially remove a supply overhang, suggesting that the “intense selling pressure from GBTC may soon subside,” Farrell added.\n\nBitcoin surged almost 160% last year, outperforming traditional assets such as stocks, amid speculation that the ETFs would catalyze wider adoption of the cryptocurrency by institutional and individual investors. The token has been retreating since the turn of the year and trailing global markets.\n\nTokens such as Ether and BNB were little changed in Asia on Tuesday along with Bitcoin, the largest digital asset, which is roughly $30,000 below its 2021 pandemic-era record of almost $69,000.\n\n“GBTC outflows have created a dynamic in the market that needs to be normalized before we will see true price discovery,” said Leah Wald, chief executive officer of digital asset investment firm Valkyrie Investments."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL3d3dy50aGVibG9jay5jby9wb3N0LzI3NDE0OS9mcmFua2xpbi10ZW1wbGV0b24tZXhwZWN0cy1pdHMtc3BvdC1iaXRjb2luLWV0Zi10by1nYWluLXRyYWN0aW9uLWFzLWZpbmFuY2lhbC1hZHZpc29ycy1iZWNvbWUtbW9yZS1mYW1pbGlhci13aXRoLXByb2R1Y3TSAaABaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjc0MTQ5L2ZyYW5rbGluLXRlbXBsZXRvbi1leHBlY3RzLWl0cy1zcG90LWJpdGNvaW4tZXRmLXRvLWdhaW4tdHJhY3Rpb24tYXMtZmluYW5jaWFsLWFkdmlzb3JzLWJlY29tZS1tb3JlLWZhbWlsaWFyLXdpdGgtcHJvZHVjdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Franklin Templeton expects its spot bitcoin ETF to gain traction as financial advisors become more familiar with product - The Block",
        "content": "While much has been made of spot bitcoin ETF trading volumes and the net inflow of fresh capital after they were approved and began trading earlier this month, the lion’s share of buying and selling has been spread over a select few of those instruments.\n\nFranklin Templeton's spot bitcoin ETF has, so far, not been part of that elite group of products offered by BlackRock, Fidelity and Grayscale, the three of which have accounted for about 90% of total trading volume. But the Wall Street firm, which was founded in 1947, remains confident that its spot bitcoin ETF product will become popular among financial advisors and investors.\n\n\"It’s just a matter of time … as education moves forward about how these assets complement and help deliver potentially better long-term solutions alongside of other assets in their portfolio,\" Franklin Templeton Head of Digital Assets Roger Bayston told The Block. \"That’s something that takes time.\"\n\nFranklin Templeton's core business is partnering with financial advisors and wealth platforms to provide solutions, products and services they can deliver to their clients, said Bayston, who believes his firm will emerge as a \"digital asset provider of choice\" as the investment community becomes more familiar with spot bitcoin ETFs.\n\n\"You have a brand new product that has never existed before. These platforms are doing their fiduciary responsibilities to filter through those providers and find differentiations that end up making sure that their clients have the best long-term results … that’s the process that is occurring right now,\" Bayston said.\n\nAs of Monday, total trading volume for spot bitcoin ETFs registered above $14 billion, according to data posted to X by Bloomberg Intelligence senior ETF analyst Eric Balchunas. Franklin Templeton had accounted for $101 million in trading volume, his data also showed. Spot bitcoin ETFs began trading less than two weeks ago.\n\nRELATED INDICES See crypto indices\n\nFranklin Templeton's confident of standing out\n\nDespite the slow start, Bayston believes Franklin Templeton will eventually stand out among rival providers of the new product, in part, because of its proven commitment to digital assets, which he said has included \"building inside of the public blockchain community.\"\n\n\"That’s a real differentiator, building inside a blockchain community. That helps us understand this infrastructure in places other providers might not,\" he said. \"The idea that we offer deep investment services and research across the entire digital asset space is another differentiator.\""
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmZpbnRlY2huZXh1cy5jb20vZmludGVjaC1uZXh1cy1uZXdzbGV0dGVyLWphbnVhcnktMjMtMjAyNC1ncmF5c2NhbGUtc2Vlcy1tYXNzaXZlLW91dGZsb3dzLW9mLWl0cy1iaXRjb2luLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Fintech Nexus Newsletter (January 23, 2024): Grayscale sees massive outflows of its Bitcoin ETF - Fintech Nexus",
        "content": "It has been almost two weeks since the SEC approved Bitcoin ETFs and we now have some data on the 10 ETFs that have been trading since then.\n\nThe two biggest and oldest names in finance are leading the way: BlackRock and Fidelity. Each fund has attracted more than $1 billion in inflows.\n\nBut the company that led the push for the Bitcoin ETF, Grayscale, is actually doing the worst. The Grayscale Bitcoin Trust (GBTC) has seen $2.8 billion in outflows since the fund converted to an ETF on January 11.\n\nThe cause seems to be around fees. Grayscale has the highest fees even after reducing its 2% fee to 1.5%. Some of the new funds have an introductory offer of no fees. It also seems that FTX has contributed here with the bankrupt crypto platform selling most of its $597 million of GBTC.\n\nGrayscale is still the 800-pound gorilla in the space with $22.9 billion in assets. How long it stays as the leader remains to be seen.\n\nFeatured\n\nGrayscale Led the Fight for Bitcoin ETFs. Now Its Fund Is Bleeding Billions.\n\nwww.wsj.com\n\nThe crypto giant’s $23 billion fund has the most to lose.\n\nFrom Fintech Nexus\n\n> Innovating Customer Experience in the Face of Digital Fraud\n\nBy Fintech Nexus Staff\n\nIn an era where digital fraud is on the rise, trust becomes the cornerstone of customer relationships. Learn how to enhance customer experience without sacrificing security in this new white paper.\n\n> Fintech: JPMorgan’s $300MM gamble on the future of quantum computing in finance\n\nBy Farhad Huseynli\n\nJPMorgan spends $15B a year on tech, has a larger engineering workforce than Google or Amazon, and is under constant threat from hackers.\n\nPodcast\n\nFintech Islands is the biggest fintech event in the Caribbean, it is taking place on January 24-26 in Barbados.\n\n\n\nListen Now\n\nWebinar\n\nJan 23, 2pm EST\n\nIdentity verification is a key part of financial institutions’ and banks’ customer journeys. However, with ongoing compliance…\n\nRegister Now\n\nAlso Making News\n\nGlobal: Call summaries, co-pilots, cores: Use cases for generative AI\n\nMike Abbott, global banking lead at Accenture, shared where he sees banks using the technology most effectively in the year ahead.\n\nUSA: SEC: Fake Bitcoin ETF Announcement Caused by SIM Swap Attack\n\nTwo-factor authentiation on the SEC’s Twitter account had been disabled since July 2023, the regulator revealed.\n\nUSA: ModernFi secures $18.7M to help banks grow their deposit base\n\nThe company provides community and regional banks with end-to-end deposit management capabilities, including a deposit network.© 2023 TechCrunch. All rights reserved. For personal use only.\n\nEurope: Fintech Klarna CEO Signals IPO in US May Happen ‘Quite Soon’\n\nKlarna Bank AB, the Swedish fintech that was once Europe’s most valuable startup, may soon launch a stock market listing in the US, according to Chief Executive Officer Sebastian Siemiatkowski.\n\nUSA: Brex Is Burning $17 Million a Month, Raising Questions About Future Growth\n\nOne of the pandemic-era darlings of the fintech sector is stuck in a rut. Brex, which issues credit cards and manages cash for businesses, burned an average of about $17 million a month in cash in the fourth quarter, the company told staff at an all-hands meeting earlier this month.\n\nLatAm: Brazilian fintech stamps its brand on Orlando soccer stadium\n\nInter&Co, a financial superapp provider based in Brazil, has bought the naming rights of a major U.S. stadium.\n\nUSA: Grow Credit Expands Banking Relationship with Wells Fargo to Support Its Financial Inclusion Capabilities\n\nGrow Credit, the financial inclusion platform behind the Grow API and its innovative payment, retention, and turndown product suites, announces an expanded banking relationship with Wells Fargo to receive depository and treasury services across operations, from collection and disbursement accounts to fund transfers.\n\nTo sponsor our newsletters and reach 220,000 fintech enthusiasts with your message, contact us here."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2pwbW9yZ2FuLWNpdGVzLWRpc2FwcG9pbnRpbmctYml0Y29pbi1ldGYtbGF1bmNo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "JPMorgan downgrades Coinbase, citing 'disappointing' bitcoin ETF launch - Blockworks",
        "content": "JPMorgan analysts downgraded Coinbase to underweight on Tuesday.\n\nThe stock was previously neutral. Analysts said that while they see Coinbase as the “dominant US exchange in the crypto ecosystem,” they’re concerned that the catalyst which pushed bitcoin to highs not seen in nearly two years won’t last.\n\nThe “catalyst in bitcoin ETFs that has pushed the ecosystem out of its winter will disappoint market participants.”\n\nCoinShares data Monday showed outflows of $2.2 billion from just Grayscale’s bitcoin ETF, with multiple media reports claiming that sales of GBTC from the FTX estate led to nearly $1 billion worth of the total sum.\n\nThe downgrade, however, didn’t impact the price target of $80. Coinbase (COIN) currently trades around $122 at time of publication. The stock is up nearly 129% in the past year, though it’s dropped 28% in the past month alone.\n\nThe price target now reflects the analyst views on the stock’s “normalized earnings” rather than their “previous discounted cash flow approach.” Analysts switched their approaches due to the overall crypto market capitalization. The approach allows them to compare Coinbase’s trading volume to the industry’s market cap.\n\nRead more: As bitcoin ETFs continue fight for assets, here’s where they all stand\n\nThis isn’t the first time that analysts have voiced concern about the bitcoin ETFs.\n\n“We have benchmarked bitcoin ETFs to the Gold ETF GLD when it launched to similar market enthusiasm in 2004. Despite the enthusiasm, GLD raised $3.5 [billion] in its first year after launch.”\n\nAnalysts led by Kenneth Worthington found the first week net flows of $1.2 billion to be “disappointing.”\n\nThe Grayscale outflows have now put the overall aggregate net sales below GLD, they noted further.\n\nOutside of bitcoin ETFs, the court battle between the US Securities and Exchange Commission and Coinbase poses a few potential risks, though analysts don’t believe that these risks could impact operations in the near-term.\n\nHowever, if Coinbase isn’t granted a motion to dismiss then it could face a longer legal path against the SEC, and that would also raise the risk that the SEC could win and force Coinbase to stop offering services such as its Wallet or staking.\n\nRead more: Coinbase, SEC set for courtroom face-off tomorrow\n\nThe SEC has alleged that both services violate securities laws. Coinbase and the SEC attended a hearing last week to put forth arguments both for and against the motion to dismiss.\n\nIt’s not all bad news for Coinbase, the analysts note that the exchange is a beneficiary of “greater revenue opportunities” and could even see “higher trading commission potential” and ecosystem engagement.\n\nOutside of the focus on bitcoin ETFs, JPMorgan noted that ethereum staking is on the rise, which could benefit the stock.\n\n“We believe Coinbase’s earnings power is up significantly — largely driven by the bitcoin ETF news which is supporting digital asset levels elsewhere,” they wrote.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vcHJvdG9zLmNvbS9kb2VzLWdyYXlzY2FsZS1oYXZlLWVub3VnaC1nYnRjLXRvLXNlbGwtYml0Y29pbi1pbnRvLW1hcmNoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Does Grayscale have enough GBTC to sell bitcoin into March? - Protos",
        "content": "Crypto asset manager Grayscale has come under fire after bitcoin saw a significant decline in the wake of the Securities and Exchange Commission’s (SEC) decision to green-light 11 spot bitcoin ETFs earlier this month.\n\nIt was hoped that the SEC’s decision would see a bitcoin price pump. However, Wall Street’s “buy the rumor, sell the news” adage was once again proved right and instead of pumping, bitcoin has sold off 15% since pre-approval highs.\n\nThe Grayscale Bitcoin Trust (GBTC) was the first scapegoat in sight. Once the world’s largest hoard, it consistently amassed bitcoin for a decade before it turned into a top bitcoin seller overnight.\n\nAccording to venture capitalist Adam Cochran, GBTC could theoretically sell bitcoin for weeks to come. Indeed, using a simple extrapolation of GBTC’s trailing rate of sales, Cochran noted that it could sell every day through mid-March.\n\nAt the current pace of selling, $GBTC still has enough assets to do this for another 60 days straight.\n\n\n\nWe're paying for that spread trade in blood. — Adam Cochran (adamscochran.eth) (@adamscochran) January 22, 2024\n\nHis prediction, of course, assumes that GBTC will sell all of its 536,694 bitcoin. As an ETF that must not only sell but also buy to track the USD price of bitcoin, this is highly unlikely.\n\nCochran also leaves unspoken the obvious truth that Grayscale is a passive, not active, manager of GBTC’s bitcoin. In other words, Grayscale’s traders don’t make discretionary choices about when or how much bitcoin to buy for GBTC. On the contrary, GBTC simply buys and sells sufficient bitcoin to match its promised ratio of 0.00089382 bitcoin per GBTC.\n\nThroughout the day, as investors choose to buy or sell GBTC shares, Grayscale simply makes daily bitcoin purchases and sales to maintain that ratio.\n\nIn other words, other investors are deciding to sell their GBTC shares, as well as their bitcoin at lower USD prices. Altogether, their choices force Grayscale as the passive fund manager to sell enough of GBTC’s bitcoin to maintain the ratio 0.00089382 bitcoin per GBTC.\n\nAll a big misunderstanding\n\nThis simple reality, however, earns few impressions on X (formerly Twitter). Instead of a pragmatic understanding of passive ETF management, claims about Grayscale’s role as a massive bitcoin seller take center-stage.\n\nGrayscale founder Barry Silbert hasn’t done anything to bolster his credibility by deleting a bunch of old tweets. Worse, a New York Attorney General lawsuit in October 2023 claimed that Silbert lied and schemed to defraud stakeholders in defunct crypto interest-earning program Gemini Earn.\n\nBitcoin has slumped from above $49,000 on January 11 to approximately $40,000 at press time. Many investors believed that the ETF approval would precipitate a windfall of retail and institutional purchases. Instead, existing bitcoin investors mostly just reshuffled between investment products.\n\nRead more: Grayscale bought bitcoin for a decade then became its #1 seller overnight\n\nNow that GBTC has been converted into an ETF, it’s required to have its bitcoin holdings track the value of outstanding shares as closely as possible by buying or selling bitcoin on spot markets. Grayscale swaps bitcoin for USD via Coinbase, for example. It’s unlikely to sell 100% of its bitcoin unless shares or bitcoin literally go to $0.\n\nIt’s somewhat irrelevant, therefore, that Grayscale could sell bitcoin at its current rate into mid-March. Far more relevant to investors is that Grayscale is a passive fund manager.\n\nIn all, Grayscale’s bitcoin sell-off was a convenient, albeit illogical scapegoat for angry bulls. In reality, Grayscale is a passive ETF manager and doesn’t make discretionary trading decisions. As such, it’s unlikely to have any causative effect on bitcoin’s USD price. It must simply buy and sell bitcoin to preserve its promised bitcoin/GBTC ratio.\n\nGot a tip? Send us an email or ProtonMail. For more informed news, follow us on X, Instagram, Bluesky, and Google News, or subscribe to our YouTube channel."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9nb2xkLW91dHBlcmZvcm0tYml0Y29pbi0yMDI0LWJsb29tYmVyZy1hbmFseXN0LXByZWRpY3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Gold will outperform Bitcoin in 2024, Bloomberg analyst predicts - Cointelegraph",
        "content": "Bitcoin is likely to underperform the stock market on a risk-adjusted basis in 2024, while gold may come out ahead, believes Bloomberg senior commodity strategist Mike McGlone.\n\nDespite the bullish narrative around the recent approval of spot Bitcoin exchange-traded funds (ETFs) and the upcoming Bitcoin (BTC) halving, macroeconomic factors may prevent the largest cryptocurrency from reaching new all-time highs in 2024.\n\nIn particular, McGlone believes market expectations that the United States Federal Reserve will cut interest rates, which usually has a boosting effect on risk-on assets like Bitcoin, are largely misplaced.\n\n“The Fed will not ease with the ease it has in the past because of inflation it created with easing too much,” he told Cointelegraph in an exclusive interview.\n\nMcGlone expects the U.S. economy to finally enter a recession this year, which should drive the stock market down. Bitcoin, as a leading indicator for risk assets, Bitcoin is likely to suffer in such an environment.\n\n“When the stock market and beta goes down, Bitcoin goes down more,” McGlone said.\n\nAccording to the analyst, gold and long Treasury bonds will likely be the assets that will come out ahead in this environment.\n\nTo learn more about McGlone’s forecast for 2024, watch the full interview on Cointelegraph’s YouTube channel, and don’t forget to subscribe!"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LnJlZGZpbi5jb20vYmxvZy9iaXRjb2luLWhvbWUtcmVub3ZhdGlvbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Home Renovations with Bitcoin - Redfin Blog",
        "content": "In an era defined by digital innovation and the rise of cryptocurrencies, the use of Bitcoin extends far beyond the realm of traditional finance. Homeowners and design enthusiasts now turn to Bitcoin’s decentralized and borderless nature to fund their home improvement projects.\n\nThis article explores the innovative ways Bitcoin is reshaping the world of home renovation, providing a glimpse into the future where Bitcoin meets interior design and construction. Whether you’re contemplating adding a home feature or a comprehensive overhaul of your living space, the possibilities with Bitcoin are endless.\n\nThree ways to use Bitcoin for home renovation projects\n\n1. Find companies that accept Bitcoin\n\nThe use of Bitcoin in home renovations has become remarkably feasible and convenient, thanks to its surging popularity and widespread acceptance across industries. Builders, like Naples Luxury Builders servicing homes in Naples, for example, recognize the growing demand for cryptocurrency transactions. They readily accept Bitcoin as a payment method for their services. Also, major retailers like The Home Depot have adapted to this evolving trend, now accepting Bitcoin as payment through their Flexa’s checkout systems.\n\n2. Use a crypto-backed loan\n\nCrypto-backed loans, like SALT, are on the rise, letting individuals leverage their cryptocurrency assets for personal or business financial needs. Financing home renovation projects using Bitcoin has become prominent among homeowners with these types of loans.\n\n3. Convert your Bitcoin to traditional currency\n\nThere are various cryptocurrency exchanges and platforms available that convert Bitcoin to cash. These platforms are a great option if desired home renovation companies don’t accept Bitcoin as payment.\n\nHave questions about the housing market? We're here to help. Contact a Redfin agent What to consider when using Bitcoin for home renovations\n\nWhen using Bitcoin for home renovation projects, there are several crucial considerations to bear in mind. Firstly, the volatility of Bitcoin’s value can significantly impact the budget. Monitoring the cryptocurrency market and potentially converting Bitcoin to a stable fiat currency when rates are favorable, is essential. Next, ensure that the contractors and service providers are willing and able to accept Bitcoin payments, as not all may be familiar with this currency. Legal and tax implications also play a vital role, as reporting requirements and tax laws regarding cryptocurrencies vary by region.\n\nAdvantages of using Bitcoin for home renovations\n\nUsing Bitcoin for home renovations can be beneficial for homeowners and contractors alike. From lower fees to secure payments, here are a few benefits.\n\nReduced transaction fees\n\nBitcoin transactions typically have lower fees than traditional financial institutions, especially international payments. This can result in cost savings when transferring funds to contractors or suppliers.\n\nFast and secure payments\n\nBitcoin transactions can be processed quickly, often within minutes, regardless of the recipient’s location. Blockchain technology provides high security and transparency, reducing the risk of fraud or disputes.\n\nPrivacy\n\nWhile Bitcoin transactions are recorded on a public ledger, they are pseudonymous and do not require the disclosure of personal information. This can enhance privacy and security for both homeowners and contractors.\n\nDisadvantages of using Bitcoin for home renovations\n\nIt’s crucial to understand the disadvantages of using Bitcoin for home improvement. Regulatory uncertainties and price volatility are just a few challenges homeowners may face.\n\nPrice volatility\n\nBitcoin’s value is highly volatile, which means its purchasing power can change significantly over a short period. This can make budgeting and cost estimation for a renovation project challenging.\n\nRegulatory uncertainty\n\nCryptocurrency regulations vary by country and region, and they are still evolving. Homeowners must navigate potentially complex legal and tax implications for using Bitcoin for renovations.\n\nLimited adoption\n\nWhile Bitcoin acceptance is growing, it is only universally accepted by some contractors, suppliers, or service providers. Finding professionals who are comfortable with Bitcoin payments can be a hurdle.\n\nUsing Bitcoin for home renovations: Bottom line\n\nBitcoin offers new ways to finance and transact in home renovation, from direct payments to crypto-backed loans. While its volatility, legal aspects, and limited adoption are concerns, its benefits, like lower fees, speed, and privacy, make it attractive for home renovations. As the use of Bitcoin continues to grow, it’s changing the way we think about and finance home renovations and improvement projects.\n\nRedfin does not provide legal, tax or financial advice. This article is for informational purposes only and is not a substitute for professional advice from a licensed attorney, tax professional, or financial advisor."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vY3J5cHRvbmV3cy5jb20vY3J5cHRvY3VycmVuY3kvd2hhdC1pcy1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "What is Bitcoin? BTC Explained For Beginners - Cryptonews",
        "content": "What Is Bitcoin? Everything You Need to Know in 2024\n\nThe Bitcoin network launched in 2009, promising a peer-to-peer electronic cash system. Largely unknown at the time, Bitcoin has since changed the way many of us perceive money, offering a decentralized alternative to traditional assets.\n\nIn this article, we’ll answer the question, “What is Bitcoin?” as well as how Bitcoin works and ways to buy and use BTC in March 2024.\n\nKey Takeaways Bitcoin’s supply is limited to 21 million bitcoins. By comparison, fiat currencies like the USD grow in supply, decreasing their value.\n\nThe Bitcoin blockchain serves as an immutable record of transactions. By contrast, traditional finance requires banks and financial institutions to track transactions accurately.\n\nBitcoin’s value comes in part from its security. The Bitcoin network uses proof of work as both an incentive to keep the blockchain going and a disincentive for bad actors due to the cost involved with proof of work.\n\nUnderstanding the Basics of Bitcoin\n\n\n\nCryptocurrencies like Bitcoin have a storied past dating as far back as the late 1980s and 1990s, including early efforts like eCash and BitGold. Borrowing from and improving upon existing ideas while adding innovations of its own, Bitcoin was the first cryptocurrency to achieve escape velocity.\n\nA cryptocurrency is a digital asset independent of governments or financial institutions, although companies like Ripple manage some cryptocurrencies.\n\nUnlike gold or silver, both of which have a long history as money, Bitcoin is completely digital, an electronic currency created by software. This allowed its anonymous creator(s) to build features similar to gold, namely scarcity and divisibility. Unlike gold, however, Bitcoin can be divided infinitely. Bitcoin’s supply is capped at 21 million bitcoins, with the smallest denomination being a satoshi (one 100 millionth of a bitcoin).\n\nWhat’s a Bitcoin? A single Bitcoin is one of a 21 million capped supply of bitcoins, the cryptocurrency of the Bitcoin network. Bitcoin (singular and capitalized) often refers to the network, whereas bitcoin (lowercase) is used when referring to the currency itself. Bitcoin is a decentralized cryptocurrency, meaning that balance tracking and transactions occur on a distributed network of computers around the world. The code itself is also decentralized, requiring approval by the worldwide network for code changes. In traditional financial systems, we have to trust banks for reconciliation and to ensure no double spending occurs. If you pay out more than you have in your bank account, the result is often reversed transactions or overdraft fees – as determined by the bank. By contrast, the Bitcoin network prevents double-spending by design. More on that in a bit. As a decentralized peer-to-peer payment network, Bitcoin also offers censorship resistance, meaning you can spend your bitcoins for whatever you wish, and no one can close your Bitcoin address due to political beliefs. By comparison, banks and payment services can decline transactions or close accounts without warning. In short, Bitcoin promises financial sovereignty. But how did it start, who made it, and why?\n\nThe Origin and Development of Bitcoin\n\n\n\nIn October 2008, a person or group using the pseudonym Satoshi Nakamoto published the Bitcoin whitepaper, a now-famous document that explained the purpose of the project and how it would work. By January of 2009, Satoshi mined the first Bitcoin block, the Genesis Block.\n\nThe Bitcoin blockchain functions as a ledger, a record of transactions and balances.\n\nOn the Bitcoin blockchain, transactions are grouped into blocks for validation. Think of a block as a box holding the details of who sent what to whom. These blocks each link to a parent block using a cryptographic hash. Simply put, a hash value (a long string of letters and numbers) from the previous block becomes part of the data in the following block, thereby forming a chain. More on how that works in a bit.\n\nBlocks are just data, including transactions. The Genesis Block contained both a transaction and a message. Satoshi sent 50 bitcoins to an unrecoverable address.\n\nIn addition, the first block held a message:\n\n“The Times 03/Jan/2009 Chancellor on brink of second bailout for banks”\n\nThe message was a headline from The Times, a well-read British newspaper. Satoshi’s message serves as a timestamp for the Genesis Block but may also indicate why Satoshi built Bitcoin. The Global Financial Crisis (GFC) had left the financial system teetering on the precipice of the abyss. People were frightened, and many were angry that the actions of governments and banks threatened to destroy modern life.\n\nMany believe Bitcoin was created as an alternative to not just financial institutions, as mentioned in the whitepaper, but as an alternative to traditional currencies entirely.\n\nThe Genesis Block started it all, with each subsequent block linking to it, making an unbreakable chain. Today, over 820,000 Bitcoin blocks have been mined.\n\nThe Mysterious Creator – Who is Satoshi Nakamoto?\n\nLong after Bitcoin’s creation and Genesis Block, we still don’t know Satoshi Nakamoto’s real identity. Satoshi might have been an individual or perhaps a group of people.\n\nSatoshi first mentioned the Bitcoin whitepaper on a cryptography mailing list (metzdowd.com), publishing the PDF on Bitcoin.org, where it still resides at the same URL today. This led many to speculate that Satoshi was a cryptography or coding expert.\n\nAn archived user profile on a peer-to-peer discussion site suggests Satoshi was a 37-year-old male residing in Japan. However, an email address used by Satoshi ([email protected]) suggests a US-based IP address. GMX used different domain extensions for email addresses, depending on location.\n\nAdding to the confusion, Satoshi sometimes used British English, while switching to American English in others. For many speculating about Satoshi’s identity, this inconsistency points to a group rather than an individual. Others suggest the variation may have been an intentional part of operational security for the project.\n\nOver the years, several potential “Satoshis” have emerged in speculative discussions, including:\n\nHal Finney\n\nNick Szabo\n\nDorian Nakamoto\n\nCraig Wright\n\nAdam Back\n\nElon Musk\n\nYonatan Sompolinsky\n\nTo date, the question remains unanswered in the minds of many in the Bitcoin community. Of note, Craig Wright claims to be Satoshi and describes a competing cryptocurrency called Bitcoin Satoshi Vision (BSV) as the original Bitcoin blockchain.\n\nBitcoin wallet addresses presumed to belong to Satoshi currently hold about 1.1 million bitcoins, or nearly $50 billion, assuming the current Bitcoin value of $44,000.\n\nHow Bitcoin Works: The Technology Behind the Currency\n\n\n\nWe briefly covered the Bitcoin blockchain earlier. To understand how Bitcoin works, it’s helpful to trace a transaction and how transactions are recorded.\n\nLet’s say you want to send 0.2 bitcoin (about $9,000 at current BTC price) to someone to buy a used car. Here’s how the transaction flow works on the Bitcoin network.\n\nInitiate the transaction. You open your Bitcoin wallet (an app) and choose the seller’s address.\n\nYou open your Bitcoin wallet (an app) and choose the seller’s address. Broadcast the transaction. Your wallet communicates with the network, broadcasting the new transaction to all nodes. The nodes then check the ledger to be sure you have enough bitcoin to cover the transaction and its associated fees.\n\nYour wallet communicates with the network, broadcasting the new transaction to all nodes. The nodes then check the ledger to be sure you have enough bitcoin to cover the transaction and its associated fees. Miners discover a block. Miners are always working to mine a new block to hold transactions. In the interim, the transaction is stored in the mempool, a digital waiting area for transactions awaiting a block. More on how mining works later.\n\nMiners are always working to mine a new block to hold transactions. In the interim, the transaction is stored in the mempool, a digital waiting area for transactions awaiting a block. More on how mining works later. The winning miner includes the transaction in the block. Once a new block is mined, the transaction is included in the block, and subsequent blocks become “confirmations.” Typically, for high-value transactions, six or more confirmations are considered irreversible. Your wallet address is debited 0.2 bitcoin (plus fees), and the seller’s is credited 0.2 bitcoin.\n\nAt the end of the transaction, the seller receives 0.2 bitcoin in an unspent transaction output (UTXO).\n\nThe miner earned a block reward consisting of a fixed amount of bitcoin plus the network fees associated with the block’s transactions.\n\nBitcoin mining is cost-intensive, making it impractical to reverse a transaction. Because the blocks are linked, and a new block is added every ten minutes on average, a rogue miner who wanted to change a transaction would have to re-mine all the blocks after a given transaction and do so faster than the network mines new blocks.\n\nThe Role of Blockchain in Bitcoin\n\nIn the previous section, we looked at a basic transaction on the Bitcoin network. All transactions are stored in blocks and these blocks are then linked together in sequence, forming a chain.\n\nExcept for the Genesis Block, each block in the Bitcoin blockchain has a parent block. Bitcoin uses SHA-256 encryption to link the blocks together. SHA-256 turns data into a hash value.\n\nHere’s an example.\n\nInput Output Hash To be, or not to be, that is the question. d899dd565cdb385855a5099025cdc90b7eee44fa504d0c1d17ce781c49529a9a\n\nBut if the input changes even slightly, the hash value changes dramatically.\n\nInput Output Hash To be, or not to be, that is the question! 89415f39f627327c5a21e5da0e73ae1f6b1813f1993986622595401c38ec8430\n\nEach new block contains the hash value of the parent block. If a transaction is changed in block 80,000, it will change block 80,000’s hash value and the hash value of every subsequent block. The network would discard this revised version of the chain as invalid because the subsequent blocks are not linked.\n\nThe hash keeps the chain linked, and the Bitcoin network chooses the longest chain.\n\nBlockchain technology allows a constant ledger without a trusted third party. In traditional finance, a bank decides if you have enough money to complete a transaction — and may even decide if you can complete the transaction at all. Generally, the Bitcoin blockchain is permissionless, tracking wallet balances and immortalizing successful transactions on the blockchain.\n\nWhile a miner can choose not to include a transaction in a block, as recently happened with a US-sanctioned Bitcoin address, these transactions will be picked up by another miner in a subsequent block.\n\nThe nearly immutable Bitcoin blockchain, combined with Bitcoin’s scarcity and the belief that others will accept Bitcoin as payment, are what give Bitcoin its value.\n\nEncryption and Security Measures\n\nBitcoin uses encryption in several ways. We discussed how an encryption hash links one block to the next. Hashing is one-way encryption, meaning the source data for the hash can’t be derived from the hash.\n\nEncryption and hashing are also used in Bitcoin wallets. First, let’s look at how Bitcoin wallets work.\n\nBitcoin wallets generate and store two types of keys.\n\nTypes of Wallet Keys\n\nPrivate keys control the assets at a given Bitcoin address on the blockchain. Anyone who has the private keys can control the assets, spending the bitcoins or sending them to another wallet. Private keys are encrypted. The Bitcoin Core wallet, for example, uses Advanced Encryption Standard (AES-256-CBC) to protect the private keys. Most wallets generate the private keys using a seed phrase, a series of 12 to 24 words.\n\ncontrol the assets at a given Bitcoin address on the blockchain. Anyone who has the private keys can control the assets, spending the bitcoins or sending them to another wallet. Private keys are encrypted. The Bitcoin Core wallet, for example, uses Advanced Encryption Standard (AES-256-CBC) to protect the private keys. Most wallets generate the private keys using a seed phrase, a series of 12 to 24 words. Public keys are generated by the private keys using one-way encryption. Public keys then generate Bitcoin wallet addresses. These are the addresses visible in transactions using a block explorer such as blockchain.com. Public keys can also be used for digital signatures, a way to show you have the private key for an address.\n\nWhile a public key is derived from a private key, the private key can’t be derived from the public key or its Bitcoin addresses.\n\nBelow, find an example of the first Bitcoin address, which was owned by Satoshi. The wallet address holds the first Bitcoin transaction (50 bitcoins) as well as several subsequent transactions.\n\nThe private key for this address is only known to Satoshi, however.\n\nAs you can see, Bitcoin transactions are not encrypted, but the technology used to complete a transaction requires encryption. Anyone can see a Bitcoin transaction on a block explorer. What remains unknown, in most cases, is the address’s owner.\n\nPseudonymous vs. Anonymous People often assume the crypto is anonymous, meaning no one can identify you. That’s not accurate. Crypto blockchains use addresses that act as your identity in transactions. This makes crypto pseudonymous rather than anonymous. Often, the real owner of a crypto address can be revealed through their transactions. Encryption appears again in Bitcoin mining. To use a simple explanation, Bitcoin mining consists of guessing a correct hash (the SHA-256 encrypted hexadecimal value) of the block header before other miners. The first miner to guess the hash — plus a randomly generated nonce (number only used once) — gets to add the next block and reap the rewards.\n\nBitcoin Mining Explained\n\n\n\nThe Bitcoin network provides a financial incentive to validate transactions called mining rewards. But the process of mining for rewards paid in bitcoins is also what keeps the network secure.\n\nWe discussed some of the basic structure of the network earlier.\n\nSomeone initiates a Bitcoin transaction. The wallet broadcasts the transaction to the Bitcoin network.\n\nWhile people all over the world are transacting, Bitcoin miners are searching for a block to store those transactions. They’re working to find a new block.\n\nBitcoin mining requires computing power. Essentially, it’s a process of guessing — a lot. Bitcoin network is trying to guess the correct hash and nonce to find the next block.\n\nAs shown below, the current hash rate (number of guesses) is over 542 trillion hashes per second.\n\nAs the hash rate increases with more computing power added to the network, the difficulty of solving for the nonce also increases. The Bitcoin network automatically adjusts the difficulty every 2,016 blocks (about two weeks). The goal is to average one block every ten minutes based on the hash rate.\n\nWhen a miner finds a block, that miner earns block rewards consisting of newly created bitcoins and the fees for transactions in the block.\n\nThe Process of Mining Bitcoin\n\nBitcoin mining is the process of finding new blocks in which to store transactions. The process is called proof of work (PoW).\n\nIn proof-of-work consensus mining, the miners must show they have done work, expending energy (and money) to find a block. The idea comes from Hashcash, a spam-prevention concept pioneered in 1997 by Adam Back, one of the people some think might be Satoshi.\n\nThe PoW process makes it expensive to mine a new block, which in turn makes it extremely difficult to change the transaction in a block that’s been mined. As more blocks are added to the blockchain, the odds approach zero, even if a group of miners controls a significant amount of the network’s hash rate.\n\nWe covered the basic process earlier.\n\nMiners work to solve a nonce.\n\nA nonce is a random number used once, which is appended to a block header’s hash.\n\nThe Bitcoin protocol creates a hash value of the block header, including:\n\nBitcoin version number\n\nA hash of the previous block\n\nMerkle root (a hash of all the transaction hashes in the block)\n\nA nonce\n\nThe only variable miners can change when hashing (guessing) is the nonce. Miners then create hashes of the block header combined with the nonce.\n\nOne recent block (block height 822,140) had a nonce of 3,175,838,978. The winning miner (ViaBTC) earned 7.98439474 BTC, including 6.25 newly minted bitcoins.\n\nWhat is BTC?\n\nThe trading symbol BTC refers to bitcoin.\n\nOnce a miner finds a block, it broadcasts the nonce, which other nodes can verify with a single hash. The block is then added to the chain, and the process begins again. This is proof-of-work consensus (agreement across nodes).\n\nSolo Mining and Mining Pools In the early days of Bitcoin mining, solo miners used CPUs to crank out hashes and guess nonces. As the network grew, the processing power needed to be competitive also increased. Today, Bitcoin miners use Application-Specific Integrated Circuit (ASICs) that are designed to hash at much higher rates. Solo Mining is unlikely to net a reward in today’s competitive mining world, so mining pools have become a popular alternative. As the name suggests, individual miners contribute their hashing power to a pool of miners. Collectively, the pool has a better chance of earning a reward. When it does, the mining reward is split proportionately according to the hashing power contributed.\n\nAcquiring Bitcoin: Buying and Trading\n\n\n\nBecause mining has become so competitive, the easiest way to acquire bitcoin is to buy on an exchange like Coinbase or MEXC. Both platforms offer easy onboarding for new investors and both also offer a way to move your bitcoins off the platform to a self-custody wallet.\n\nFor example, to get started with MEXC, just follow these simple steps.\n\nVisit MEXC to open a new account. To open an account with MEXC simply head over to the official website and tap on ‘Sign Up’. Register your account. Users can register their accounts via their mobile phone numbers or email addresses. Deposit funds in your MEXC account. Depositing funds into your MEXC account is straightforward. Users can buy BTC via bank cards, P2P/OTC trading or via Blockchain transfer. Buy Bitcoin. Tap on the ‘Buy Crypto’ button to view the available methods in your location. For a more streamlined experience some expert traders purchase stablecoins like Tether and then use that to buy BTC via the spot market.\n\nBuy BTC on MEXC\n\nChoosing a Bitcoin Wallet\n\n\n\nAfter you purchase Bitcoin, you may want to move your holdings off the trading platform for safekeeping.\n\nEarlier, we discussed the role of crypto wallets to safeguard your Bitcoin. A wallet holds the private keys that control Bitcoin on the network.\n\nYou can choose from hot wallets or cold wallets.\n\nHot wallets generate and store the private keys on a device that’s connected to the internet. A hot wallet is an app that runs on your phone or computer. For example, Electrum is a popular Bitcoin-only wallet. However, you could also choose a multi-chain wallet that supports Bitcoin, such as Coinbase Wallet. Most hot wallets are free to use.\n\ngenerate and store the private keys on a device that’s connected to the internet. A hot wallet is an app that runs on your phone or computer. For example, Electrum is a popular Bitcoin-only wallet. However, you could also choose a multi-chain wallet that supports Bitcoin, such as Coinbase Wallet. Most hot wallets are free to use. Cold wallets generate and store your private keys offline. A cold wallet is usually a hardware device that can communicate with your computer or mobile device but which does not connect to the internet. Trezor is a popular choice because the device firmware and software suite are both open-source. Coders from around the world have reviewed the code to verify what’s happening under the hood.\n\nHot wallets offer more convenience because you can send Bitcoin in just a few clicks. However, hardware wallets offer more security because nothing leaves your wallet until you confirm the transaction on your hardware device.\n\nConsider your risk level relative to the cost. Hardware wallets are an investment. Many popular Bitcoin hardware wallets range in price from $55 to $200 or more. Top choices like Trezor can pair with hot wallets such as Electrum. This allows you to keep smaller amounts in a hot wallet for convenience while safeguarding larger balances.\n\nUtilizing Bitcoin: From Payments to Investments\n\n\n\nBitcoin’s whitepaper describes Bitcoin as a peer-to-peer electronic cash system. Over the years, however, Bitcoin has become much more than just a payment system. It’s become a hedge against inflation, a store of value, and an investment for many.\n\nBitcoin for purchases: Leading merchants like Newegg, Overstock, and even Microsoft now accept Bitcoin for some purchases.\n\nLeading merchants like Newegg, Overstock, and even Microsoft now accept Bitcoin for some purchases. Bitcoin for payments: Payment apps like Cash App and Strike make it simple to send and receive Bitcoin payments. Some HR and freelance apps like Deel also offer the option of Bitcoin payments for work performed.\n\nPayment apps like Cash App and Strike make it simple to send and receive Bitcoin payments. Some HR and freelance apps like Deel also offer the option of Bitcoin payments for work performed. Bitcoin as an investment: You can buy Bitcoin using an exchange, as described earlier, but Bitcoin spot ETFs (exchange-traded funds) are on the horizon in the US, and Bitcoin spot ETFs are already available in Europe and Canada.\n\nBitcoin in Everyday Transactions\n\nWhile more merchants accept Bitcoin as a payment method, we haven’t reached universal acceptance yet. Traditional currencies still dominate.\n\nPart of the challenge is volatility. A dollar is always a dollar, but Bitcoin’s value in dollars changes by the minute. If the use of Bitcoin grows, we may be able to expect more retailers willing to accept Bitcoin. In this scenario, the value of Bitcoin should increase due to the limited supply, making it more attractive to vendors.\n\nSpending your Bitcoin comes with some considerations, however. Because Bitcoin is not legal tender in most of the world, spending your Bitcoin can become a taxable event. In effect, you have to account for Bitcoin’s value in your local currency at the time of the transaction. If there’s a gain in value compared to your cost basis, you may have to pay taxes.\n\nCrypto tax software apps can help make accounting easier, but the tax ramifications should be considered before purchasing with Bitcoin or another cryptocurrency.\n\nYou’ll also want to consider mining fees. Earlier, we discussed how miners earn the transaction fees for blockers they mine. Those fees can be expensive at times, especially if the network is busy. Mining fees are based on the transaction size in bytes rather than the amount, making Bitcoin a better option for larger transactions because the fees represent a smaller percentage of the transaction.\n\nInnovations like the Lighting Network promise faster transactions and much lower fees by bundling transactions.\n\nInvesting and Speculating with Bitcoin\n\nIn 2011, Bitcoin and the US dollar reached parity. Since then, a dollar is still a dollar (ignoring inflation) and a bitcoin is worth about $44,000.\n\nBitcoin rewarded early investors with staggering returns relative to other investments as well. Between November 2013 and November 2023, Bitcoin produced 3249.016% returns. By comparison, the S&P returned 153.09%. However, many investors think we’re still early in the timeline.\n\nBitcoin can be part of a larger diversified investment portfolio or be used for trading.\n\nInvestment portfolios: You can invest in Bitcoin through trading platforms like MEXC or Coinbase. Because the price of Bitcoin can be volatile, it’s prudent to match your investment to your risk tolerance. The ride gets bumpy.\n\nYou can invest in Bitcoin through trading platforms like MEXC or Coinbase. Because the price of Bitcoin can be volatile, it’s prudent to match your investment to your risk tolerance. The ride gets bumpy. Speculative trading: Bitcoin’s volatility makes it attractive to traders, however. Price changes offer an opportunity to trade the market’s ups and downs rather than buy and hold. Exchanges like Kraken, MEXC, and OKX offer perpetual futures trading in some markets, providing a way to trade with leverage and settle the trade without buying or selling actual bitcoin.\n\nThe Risks and Challenges of Bitcoin\n\n\n\nBitcoin investors who bought at the all-time high of nearly $69,000 are still down significantly in percentage terms. Bitcoin’s volatility brings meaningful risk. Bitcoin is also difficult to value relative to stocks or real estate investments in which you can measure profits or cash flow. This adds to price uncertainty.\n\nHowever, the largest risks facing Bitcoin investors may be regulatory.\n\nIn 1933, President Franklin D. Roosevelt banned private ownership of gold bullion in the US with the stroke of a pen. It’s not hard to imagine something similar applied to cryptocurrencies that compete with fiat currencies worldwide.\n\nWhile bans remain a possibility, restrictive regulations or legislation are more likely possibilities and could affect the value of Bitcoin and other cryptocurrencies.\n\nFor example, a recently proposed bill in the US called the “Digital Asset Anti-Money Laundering Act” would threaten the ability to transact in cryptocurrencies, according to many experts. If similar laws were passed in other major markets, the value of Bitcoin and other digital assets would likely plummet.\n\nFortunately, the bill is considered unlikely to pass.\n\nRead More: Best Crypto Giveaways\n\nCommon Misconceptions and Myths about Bitcoin\n\n\n\nAs a new technology, cryptocurrencies aren’t yet well understood by the public (or its legislators).\n\nHere are some of the most common misconceptions and myths about Bitcoin.\n\nBitcoin is a bubble. While Bitcoin has seen tremendous growth in value, relative to the world’s population, Bitcoin’s value is likely still low. By some estimates, less than 3% of the world’s population uses Bitcoin.\n\nWhile Bitcoin has seen tremendous growth in value, relative to the world’s population, Bitcoin’s value is likely still low. By some estimates, less than 3% of the world’s population uses Bitcoin. There are no real-world uses for Bitcoin. Although Bitcoin can be an investment or a store of value, there are many ways to use Bitcoin as a payment method for everyday transactions. And because Bitcoin is an asset, you can also borrow against it to buy real-world goods and services or invest in traditional real-world assets.\n\nAlthough Bitcoin can be an investment or a store of value, there are many ways to use Bitcoin as a payment method for everyday transactions. And because Bitcoin is an asset, you can also borrow against it to buy real-world goods and services or invest in traditional real-world assets. Bitcoin is printed out of thin air. Bitcoin uses proof of work to mint new bitcoins and validate Bitcoin transactions. The process is energy-intensive and requires a significant financial investment.\n\nBitcoin uses proof of work to mint new bitcoins and validate Bitcoin transactions. The process is energy-intensive and requires a significant financial investment. Another crypto will displace Bitcoin. While newer cryptocurrencies offer some advantages over Bitcoin, like faster transaction times or lower network fees, Bitcoin was first and remains the leading cryptocurrency. More people using and investing in Bitcoin helps Bitcoin hold the top position.\n\nWhile newer cryptocurrencies offer some advantages over Bitcoin, like faster transaction times or lower network fees, Bitcoin was first and remains the leading cryptocurrency. More people using and investing in Bitcoin helps Bitcoin hold the top position. Bitcoin uses too much energy. Bitcoin mining uses more energy than some countries, according to estimates. However, large-scale miners have moved to areas where they can access renewable energy or areas where energy is “trapped” and can’t be transported elsewhere.\n\nBitcoin Regulation and Legal Aspects\n\n\n\nAnother misconception about Bitcoin is it’s an unregulated security and will be banned by regulators like the SEC. While some cryptocurrencies may fit that definition, Bitcoin’s decentralized nature makes it a commodity, similar to gold or silver, rather than a security.\n\nCurrently, Bitcoin trading remains legal in major markets like the US and UK. Many governments treat Bitcoin as property for tax purposes. However, the road ahead could still hold peril. A competing currency shines a light on the falling values of traditional currencies.\n\nProposed legislation like US Senator Elizabeth Warren’s Digital Asset Anti-Money Laundering Act could change the crypto landscape in years to come. Already, many exchanges and Bitcoin mining pools around the world require KYC (Know Your Customer) identity verification before you can transact.\n\nRegulations and future legislation could make trading in Bitcoin or other cryptocurrencies more difficult — or even impossible. To revisit the idea behind Bitcoin, the ability to transact without an intermediary, it’s not too hard to imagine how governments might try to stifle that ability.\n\nEvaluating Bitcoin as an Investment\n\n\n\nInvesting in Bitcoin or other cryptocurrencies can bring more risk compared to traditional investments. However, the potential returns can also be much higher.\n\nBitcoin investing is best suited for:\n\nPeople who can accept price volatility. The ups and downs of the crypto market put penny stocks to shame.\n\nThe ups and downs of the crypto market put penny stocks to shame. Investors with a diversified portfolio. Bitcoin offers exposure to the growing blockchain sector.\n\nBitcoin offers exposure to the growing blockchain sector. People who value the Bitcoin ethos of transacting without intermediaries. At its core, Bitcoin is s peer-to-peer payment system. Privacy and anti-censorship advocates may feel more at home in a crypto world.\n\nAt its core, Bitcoin is s peer-to-peer payment system. Privacy and anti-censorship advocates may feel more at home in a crypto world. Investors who want to hedge against inflation or devaluation. The supply of fiat currencies like the USD and GBP are controlled by governments and central banks. By contrast, Bitcoin has a fixed supply of 21 million bitcoins, which could mean further price appreciation against fiat currencies.\n\nAdvantages and Disadvantages of Bitcoin Investment\n\n\n\nA Bitcoin investment comes with pros and cons to weigh.\n\nPros Bitcoin’s limited supply could bring dramatic price appreciation if demand continues to grow.\n\nBitcoin’s limited supply could bring dramatic price appreciation if demand continues to grow. With nodes across the globe, Bitcoin is decentralized and censorship-resistant.\n\nWith nodes across the globe, Bitcoin is decentralized and censorship-resistant. Bitcoin wallets allow you to travel anywhere in the world while taking your savings with you. Cons Limited acceptance as a payment method could affect Bitcoin’s future value.\n\nLimited acceptance as a payment method could affect Bitcoin’s future value. Market volatility can lead to large paper losses quickly.\n\nMarket volatility can lead to large paper losses quickly. Secure storage requires users to educate themselves on Bitcoin wallets and safety measures.\n\nPractical Aspects of Using Bitcoin\n\n\n\nAs a payment method, Bitcoin offers several ways to transact in daily life.\n\nOnline shopping\n\nPurchasing gift cards\n\nPeer-to-peer transactions\n\nHowever, Bitcoin comes without the consumer protections you’ll find with traditional financial services. You can’t charge back a transaction and if you send bitcoins to an incorrect address, it’s likely gone forever.\n\nAlso, consider the following tips to help ensure secure transactions.\n\nUse QR codes. To ensure accuracy when sending Bitcoin, consider scanning a QR code for the receiving address to avoid typos or extra characters.\n\nTo ensure accuracy when sending Bitcoin, consider scanning a QR code for the receiving address to avoid typos or extra characters. Split your funds between wallets. Use a “spending money” wallet for everyday transactions. This keeps your larger balances separate, hidden from blockchain snoops who can see the balances for Bitcoin wallets.\n\nUse a “spending money” wallet for everyday transactions. This keeps your larger balances separate, hidden from blockchain snoops who can see the balances for Bitcoin wallets. Use a hardware wallet for larger balances. To protect larger balances, consider purchasing a hardware wallet that stores your private keys offline.\n\nTo protect larger balances, consider purchasing a hardware wallet that stores your private keys offline. Keep a safe backup of your wallet. If you lose your wallet or a hardware wallet breaks, you can use the recovery phrase backup to restore access to your bitcoins.\n\nIf you lose your wallet or a hardware wallet breaks, you can use the recovery phrase backup to restore access to your bitcoins. Beware of scams, phishing, and fake websites. Because cryptocurrency is easy to transfer, crypto holders are common targets for scammers, including phishing attempts to get your recovery phrase or fake websites that look like well-known sites.\n\nThe Future of Bitcoin\n\n\n\nBitcoin price predictions are fun, although always speculative. Bitcoin’s future hinges on adoption.\n\nWill more retailers start accepting Bitcoin? Will Bitcoin become a world reserve currency, replacing the dollar? The first situation is bullish for Bitcoin, whereas the second could send prices to the moon and beyond.\n\nThere’s also the possibility of a decline.\n\nOur own market-based Bitcoin price predictions put the future price as high as $150,000 by 2030, more than a 3x increase compared to today’s price. Others in the industry, including Jurrien Timmer of Fidelity Investments, put the target as high as $1 million to $10 million per bitcoin.\n\nBitcoin’s primary strength is in its ability to act as a store of value. Today, everyday transactions on the Bitcoin network remain costly, making it better suited to larger transactions. However, the Lightning Network or similar scaling solutions could make Bitcoin more practical for everyday transactions, dropping transaction fees from dollars to a fraction of a penny and eliminating the long wait between blocks.\n\nClosing Thoughts: Is Bitcoin Right for You?\n\n\n\nBitcoin began the crypto revolution in 2009, but it’s still early for this new technology. Many believe that Bitcoin’s best days are still ahead and that a sizeable opportunity still exists.\n\nThe journey ahead comes with risks but without guarantees, much like any investment. However, Bitcoin has outperformed every other asset class since its launch, suggesting it’s not like any other investment.\n\nConsider your risk tolerance carefully before investing, and never invest more than you can afford to lose. But if you decide to invest in cryptocurrency, Bitcoin makes a logical first step. Bitcoin’s security, bolstered by proof of work and its network effect as the largest cryptocurrency, will likely give it advantages over competing cryptocurrencies for years to come.\n\nVisit MEXC\n\nReferences"
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9iaXRjb2luLXByaWNlLWZvcmVjYXN0LWJpdGNvaW4tY29udGludWVzLXRvLWRyb3AtMTQwNDI4MtIBVGh0dHBzOi8vYW1wLmZ4ZW1waXJlLmNvbS9lbi9iaXRjb2luLXByaWNlLWZvcmVjYXN0LWJpdGNvaW4tY29udGludWVzLXRvLWRyb3AvMTQwNDI4Mg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price Forecast – Bitcoin Continues to Drop - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJpc2tzLTMway1zdXBlcmNoYXJnZWQtaW5mbGF0aW9uLWFydGh1ci1oYXllc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin price risks $30K over 'supercharged' inflation — Arthur Hayes - Cointelegraph",
        "content": "Bitcoin (BTC) has a date with $35,000 or lower at the hands of fresh global macro turmoil, Arthur Hayes says.\n\nIn his latest blog post, “Yellen or Talkin’?” on Jan. 24, the former CEO of crypto exchange BitMEX makes a grim short-term BTC price forecast.\n\nHayes: Bitcoin appreciates 2024 inflation risk\n\nBitcoin may still be 75% up versus a year ago, but it faces a perfect storm of downside volatility catalysts this quarter.\n\nFor Hayes, these come in several guises: the Red Sea conflict between the United States and the Houthis with its impact on global shipping, the U.S. presidential election race and Federal Reserve policy.\n\nThe first of these has clear implications for inflation. Risk assets, including crypto, are looking for a “pivot” by the Fed as soon as March — lowering interest rates and attracting liquidity back to the market.\n\nHigher shipping costs, however, could mean a spike in prices later in the year — something the Fed and Chair Jerome Powell will be keen to mitigate, Hayes explains.\n\n“Due to weather and geopolitics, higher shipping costs could cause a surge in inflation in the third and fourth quarter of this year. As Powell is undoubtedly aware of these issues, he will do everything he can to talk a big game about rate cuts without having to actually cut them,” he writes.\n\n“What might be a mild increase in the rate of inflation due to increased shipping costs could be supercharged by rate cuts and the resumption of QE. The market doesn’t appreciate this fact yet, but Bitcoin does.”\n\nHayes touches on the second piece of the puzzle: the strength of the U.S. regional banking sector.\n\nAs Cointelegraph reported, since the meltdown of March 2023, the U.S. government has offered support in the form of the Bank Term Funding Program (BTFP) — a lifeline that is now due to expire.\n\nHayes thinks that this will come to pass despite the fact that banks’ financial predicaments have not gone anywhere. This and other questions over liquidity, however, depend on Treasury Secretary Janet Yellen’s next moves.\n\n“The only thing that trumps fighting inflation is a financial crisis,” the blog post continues.\n\n“That is why, to get the cuts, QT taper, and the possible resumption of QE the market believes is already in the bag come March, we first need a few banks to fail when the BTFP is not renewed.”\n\nBitcoin should “form support” below $35,000\n\nTurning to Bitcoin, the writing may be on the wall, with turmoil over liquidity and the BTFP, combined with geopolitical risk, meaning that the 20% BTC price dip is the tip of the iceberg.\n\nRelated: All eyes are on $40K Bitcoin price leading into Friday’s $4.5B BTC options expiry\n\n“A 30% correction from the ETF approval high of $48,000 is $33,600,” Hayes predicts.\n\n“Therefore, I believe Bitcoin forms support between $30,0000 to $35,000. That is why I purchased 29 March 2024 $35,000 strike puts.”\n\nHe adds that sub-$35,000 levels now represent an opportunity to buy the dip.\n\nBTC/USD hit $38,500 on Bitstamp on Jan. 23, its lowest since the start of December, before rebounding around $1,700 higher, per data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmxhdzM2MC5jb20vYXJ0aWNsZXMvMTc4ODgzMC9iaXRjb2luLW1pbmVyLXJob2RpdW0tc2Vla3MtdG9zcy1vZi1jaGFuY2VyeS1yb2xsdXAtc3VpdNIBK2h0dHBzOi8vd3d3LmxhdzM2MC5jb20vYW1wL2FydGljbGVzLzE3ODg4MzA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Miner Rhodium Seeks Toss Of Chancery Rollup Suit - Law360",
        "content": "PLEASE NOTE: A verification email will be sent to your address before you can access your trial.\n\nSelect at least one primary interest below to receive curated, daily newsletters designed by senior editors so you can quickly scan the latest news and analysis in your area of practice.\n\nLaw360 may contact you in your professional capacity with information about our other products, services and events that we believe may be of interest.\n\n\n\nYou’ll be able to update your communication preferences via the unsubscribe link provided within our communications.\n\n\n\nWe take your privacy seriously. Please see our Privacy Policy."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzIzL3doZXJlLXdpbGwtYml0Y29pbi1iZS1pbi0zLXllYXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Where Will Bitcoin Be in 3 Years? - The Motley Fool",
        "content": "The launch of the new spot Bitcoin (BTC -4.39%) exchange-traded funds (ETFs) was a watershed moment in the history of crypto. Nearly 15 years after it originally launched, Bitcoin is now readily available to the average investor and could finally be on the cusp of going mainstream.\n\nSo what will happen with Bitcoin over the next three years? Let's take a closer look at the potential impact of the new spot Bitcoin ETFs.\n\n1% Bitcoin\n\nAs a result of the new spot Bitcoin ETFs, both retail and institutional investors will likely decide to allocate at least 1% of their portfolios to Bitcoin. That represents a sea change in thinking because, until recently, Wall Street did not view Bitcoin as a stand-alone asset class. But three years from now, most people will probably think of crypto the same way they think about other alternative asset classes, such as real estate or private equity. Bitcoin will simply be a way to diversify a portfolio and boost overall returns.\n\nMost likely, institutional investors will lead the way. And that could lead to a tsunami of new money flowing into Bitcoin. For example, BlackRock is the largest asset manager in the world, with nearly $10 trillion in assets under management. If even 1% of that money gets allocated to crypto, that could result in billions of dollars flowing into Bitcoin.\n\nAnd don't forget about the role of the retail investor. Financial advisors and private wealth managers will now have a fiduciary duty to tell their clients about the potential benefits of crypto, and to seek out the very best Bitcoin investment products. Within three years, many investors will have likely long forgotten about Bitcoin's previous unsavory reputation.\n\nGlobal adoption\n\nBitcoin will also likely see a significant uptick in global adoption. When Ark Invest came up with a $1.5 million price target for Bitcoin by the year 2030, it was based on the idea that Bitcoin would see huge gains within eight key usage areas. For example, Bitcoin will increasingly be used as a store of value, along the lines of physical gold. And Bitcoin will increasingly be used to send cross-border remittances.\n\nArk Invest also suggests that Bitcoin will play an increasingly important role in the money supply of emerging market nations. El Salvador shocked the world back in 2021 by adopting Bitcoin as legal tender, and I think there could be other, similar stories in the future. There are a lot of exciting Bitcoin-related developments happening in Latin America right now, and I think that this could be a region to watch for Bitcoin adoption.\n\nBitcoin at $250,000?\n\nWhat do all these developments mean for the future price of Bitcoin? Within three years, I think Bitcoin could carry a price tag of $250,000.\n\nThis might sound like a pie-in-the-sky number, but it's backed up by math. For example, when Ark Invest came up with its $1.5 million price target for Bitcoin, that was based on a compound annual growth rate (CAGR) of 75%. That doesn't mean that Bitcoin will go up 75% each year -- but it does mean that Bitcoin is likely to see a consistent upward trend in price.\n\nIf you use a base price of $50,000 (which is where many analysts thought Bitcoin would be trading after initial Bitcoin ETF approval) and use Ark Invest's CAGR number, that means you're likely looking at a price of just under $100,000 by the end of 2024, a price of approximately $150,000 by the end of 2025, and a price of over $250,000 by the end of 2026. (If you continue to extrapolate this over the next few years, that's how you arrive at a figure of $1.5 million by 2030.)\n\nShould you buy Bitcoin now?\n\nWhile past performance is certainly no guarantee or predictor of future performance, it is noteworthy that Bitcoin was the single best-performing asset in the world between 2011 and 2021. And, while 2022 was a disastrous year for Bitcoin holders, it was back to the same success story in 2023, when Bitcoin's 150% returns trounced those of every other major asset class.\n\nAs long as you're aware of the inherent risk and volatility of crypto, it's worth taking a closer look at how Bitcoin could become even just a tiny part of your overall portfolio. The new spot Bitcoin ETF products, while still untested, look to be the safest way to do that for the average investor. That being said, I'm long-term bullish on Bitcoin and am confident that Bitcoin can reach $250,000 within just three years."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9oZXJlcy13aGVuLWJpdGNvaW4tYnRjLXByaWNlLXdpbGwtaGl0LTcway_SAVNodHRwczovL2NvaW5wZWRpYS5vcmcvcHJpY2UtYW5hbHlzaXMvaGVyZXMtd2hlbi1iaXRjb2luLWJ0Yy1wcmljZS13aWxsLWhpdC03MGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Here’s When Bitcoin (BTC) Price Will Hit $70K - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nPopular cryptocurrency analyst Crypto Capital Venture has raised the possibility of Bitcoin facing a period of consolidation, with the price not surpassing $48,000 before the anticipated halving in April 2024. The analysis dives into historical data and chart patterns to present a case for this scenario.\n\nThe analyst begins by pointing out the widespread desire for Bitcoin and the broader crypto market to continue its upward trajectory. However, a cautious tone is set as the analyst suggests a strong likelihood of Bitcoin not breaking the $48,000 barrier soon.\n\nThe analysis focuses on Bitcoin’s chart patterns, referencing a rejection at the 618 Fibonacci level. Despite a recent breakout from a rising wedge with a target around $70,000, he suggests a pullback to the 618 Fibonacci level could be in the cards. This rejection level has historical significance, particularly in the lead-up to the Bitcoin halving events.\n\nAlso Read: Bitcoin at a Crucial Threshold: Will the Altcoins Gain Bullish Momentum?\n\nDrawing parallels to previous market cycles, the speaker highlights instances where Bitcoin faced rejection at the 618 level before consolidating back down. The analysis then extends to the broader market context, referencing the S&P 500’s historical performance around Bitcoin’s previous consolidations.\n\nPointing out data from June 2019 and June 2016, he suggests a pattern where Bitcoin consolidates as traditional markets, such as the S&P 500, reach all-time highs.\n\nWhile hinting at the potential for Bitcoin to defy this historical pattern and experience a bullish breakout to $70,000, he remains cautious about the possibility of a downside scenario. In the event of a retracement, key support levels are identified in the $30,000 to $34,000 range, providing a potential area for Bitcoin to find stability before the halving."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvd2lsbC1iaXRjb2luLXByaWNlLWZhbGwtYmVsb3ctMzAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price : Will Bitcoin Price Fall Below 34k This Month ? - CoinGape",
        "content": "Bitcoin, the pioneer in the cryptocurrency space, has recently taken a downward plunge, testing the $41,000 mark. This downward trend is mirrored in the global crypto market cap, witnessing a 1.65% loss in the last 24 hours, settling at $1.62 trillion. Despite finding stability around $41,000 over the weekend, the market is currently caught in a seesaw battle between bullish and bearish forces, creating an air of uncertainty. Let’s delve into the reason Bitcoin price has plunged, and the possibility of further dropping below $34,00 this month.\n\nMarket Performance of Bitcoin Price\n\nBitcoin slipped below the $40,000 mark, marking levels not seen since early December. The largest digital asset experienced a 4.36% drop in the past 24 hours, trading at $39,056.54 contributing to an approximately 4.8% decrease in the global cryptocurrency market cap, valued at $1.64 trillion. One of the best crypto to buy, Bitcoin is ranked #1 on CoinMarketCap, with a live market capitalization of over $765 billion. The total circulating Bitcoin coins are 19,606,037, while the maximum supply is capped at 21,000,000 BTC coins.\n\nadvertisement\n\nWhy is the Bitcoin Price Declining?\n\nThe market dynamics are influenced by the selling pressure from Grayscale Bitcoin Trust (GBTC). The decline of Bitcoin price was fueled by ongoing attention to outflows from Grayscale’s spot ETF. As the SEC approved 11 spot Bitcoin ETF products in the U.S., some GBTC investors switched to these new ETFs, resulting in significant selling pressure.\n\nReports indicate that GBTC has offloaded over $2 billion worth of Bitcoin on Coinbase, while the defunct cryptocurrency exchange FTX liquidated nearly $1 billion of its GBTC holdings as part of its bankruptcy proceedings.\n\nIs Bitcoin Price Going Down to $34K?\n\nAnalysts have drawn parallels between the current bitcoin price trend and a notable correction observed in January 2021. This historical context suggests that periodic drops are normal and often precede market rebounds. In January 2021, Bitcoin faced a 30% drop within a short period, only to quickly recover and surge to new highs. The possibility of a similar scenario unfolding in January 2024 raises the potential for an optimal buying opportunity if Bitcoin drops to the mid to low $30,000 range.\n\nAdditionally, Bitcoin’s recent false breakout from the $48,000 liquidity zone has left it in a technical stalemate. Positioned between the $43,000 and $40,000 range, Bitcoin faces a consolidation phase influenced by ETF-related selling. With the upcoming halving expected on April 7, 2024, historical patterns suggest a potential significant correction before positioning for a strong rally.\n\nA financial analyst and trader, Seth, highlighted that bitcoin dropped below the 40K mark, causing significant losses for individual investors who bet on the price going up. The community is hoping that the support around this level remains strong, anticipating a daily closing price climb back above 40K.\n\nPresently, the technical constraints lie at the resistance level of $43,118. The potential for a rise hinges on overcoming this resistance and maintaining stability at that level. While there is uncertainty in the short term, historical trends and technical indicators provide insights into the potential for a rebound and upward trajectory after a correction."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0MzU5L2JpdHdpc2UtcHVibGlzaGVzLWRpZ2l0YWwtd2FsbGV0LWFkZHJlc3Nlcy13aXRoLWJpdGNvaW4taG9sZGluZ3MtZm9yLXNwb3QtZXRm0gF1aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjc0MzU5L2JpdHdpc2UtcHVibGlzaGVzLWRpZ2l0YWwtd2FsbGV0LWFkZHJlc3Nlcy13aXRoLWJpdGNvaW4taG9sZGluZ3MtZm9yLXNwb3QtZXRm?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitwise publishes digital wallet addresses with bitcoin holdings for spot ETF - The Block",
        "content": "Crypto-focused fund manager Bitwise said Wednesday that it became the first U.S. bitcoin ETF to publish the digital wallet addresses of its holdings.\n\nBitwise noted that the decision to publish the information stemmed from a priority of on-chain transparency.\n\n\"Now anyone can verify BITB's holdings and flows directly on the blockchain,\" the firm wrote in a Wednesday social media thread.\n\n\"Publishing on-chain addresses is a first step toward increasing public transparency,\" it continued. \"As infrastructure evolves, we hope to do more, such as working with firms like Hoseki to provide real-time cryptographic attestations.\"\n\nBitwise's spot bitcoin ETF\n\nRELATED INDICES See crypto indices\n\nAfter the Securities and Exchange Commission approved the spot bitcoin ETF applications of Bitwise and 10 others, Bitwise saw $238 million in inflows on its first day of trading, The Block previously reported.\n\nBitwise maintains 3.1% of spot bitcoin ETF marketshare and saw $49.8 million in daily volume on of Jan. 23, The Block's Data Dashboard shows."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYnVsbC12cy1iZWFyLXNob3VsZC15b3UtaW52ZXN0LXNwb3QtYml0Y29pbi1ldGZzL9IBXmh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYnVsbC12cy1iZWFyLXNob3VsZC15b3UtaW52ZXN0LXNwb3QtYml0Y29pbi1ldGZzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bull vs. Bear: Should You Invest in Spot Bitcoin ETFs? - ETF Trends",
        "content": "Bull vs. Bear is a weekly feature where the VettaFi writers’ room takes opposite sides to debate controversial stocks, strategies, or market ideas — with plenty of discussion of ETF ideas to play either angle. For this edition of Bull vs. Bear, Elle Caruso and Karrie Gordon debate the hottest topic in 2024 investing thus far: spot bitcoin ETFs.\n\nElle Caruso, staff writer, VettaFi: Hey, Karrie! I’m looking forward to discussing the investment case for spot bitcoin ETFs. Investors had been long awaiting the approval of these funds, which have the potential to be genuinely transformative for the ETF and broader investing industries.\n\nThe iShares Bitcoin Trust (IBIT), the Fidelity Wise Origin Bitcoin Fund (FBTC), the Bitwise Bitcoin ETF Trust (BITB), the ProShares Bitcoin Strategy ETF (BITO), and the Invesco Galaxy Bitcoin ETF (BTCO) have taken in a combined $3.1 billion year to date as investors flock to the space.\n\nIn a recent conversation with VettaFi, Invesco’s Kathy Kriskey said the ideal allocation to crypto is just 1% of the overall portfolio. This is such a small amount in a well-diversified portfolio that it’s hard to see any downside. The crypto exposure sits alongside other alternative investments and helps provide a diversified source of returns and significant growth potential.\n\nThe alternatives bucket in a portfolio, according to Kriskey, ideally holds commodities and crypto. Maybe a small amount of real estate, too, if you’re into that. Commodities will comprise the largest portion of this group, with investors ideally allocating 5-8% of their assets. Any more than 5-8% in commodities and 1% in crypto is unnecessarily risky.\n\nSpot bitcoin ETFs make it easy to get this exposure. Looking at it from a high level, I don’t see what’s not to like about these funds.\n\n‘That’s Likely All We Get for Awhile’\n\nKarrie Gordon, staff writer, VettaFi: I won’t lie; I’ve been enjoying watching the celebrations around the launch of the spot bitcoin ETFs. While it’s easy to get caught up in the hype, I think it’s important to mind the big picture. We need to step back and recognize the extremely significant hurdles digital assets still face.\n\nBlockchain technology, which powers cryptocurrencies like bitcoin, carries enormous potential to revolutionize segments of our increasingly digital world. However, it is also a nascent technology and, despite the hype and promise, may never gain broad adoption. You need to look no further than the disappointment of augmented reality to see one potential path for blockchain uptake.\n\nUnless you’ve intentionally avoided all crypto-related new in the last five years, you’ve likely seen the naysayers and fear-mongering around crypto and blockchain. For a not-insignificant percentage of the population, cryptocurrencies and blockchain technology have become synonymous with bad actors and criminal activity.\n\nWithout serious regulatory guardrails and oversight — something I might add that is antithetical to the entire premise of decentralization — digital assets are likely to remain a niche asset class. In the U.S., I wouldn’t hold your breath for any regulatory framework anytime soon. Our own Todd Rosenbluth, head of research here at VettaFi, agrees.\n\n“That’s likely all we get for a while,” he said, speaking of the recent approval of spot bitcoin ETFs in the New York Times. “The government remains uncertain about cryptocurrency in general.”\n\nIt makes for a muddied and muted outlook for the potential of bitcoin to remain anything other than speculative for investors.\n\nWithout Spot Bitcoin ETFs, Investors Will Invest in Physical Bitcoin\n\nCaruso: You bring up great points, Karrie. However, I think investors who want exposure to bitcoin will find it one way or another. With the recent SEC approval of spot bitcoin ETFs, investors can now compare the different products on the market and make prudent, smarter choices. The various spot bitcoin ETFs have different liquidity profiles and tracking errors, but they all provide safer access to bitcoin via a highly liquid, regulated product. This is something that should give investors and the larger community comfort.\n\nThis is also advantageous for financial advisors. Previously, advisors may not have had access to the funds that their clients were allocating to crypto. Clients wanted crypto exposure, and ultimately, advisors were losing clients due to their inability to deliver that desired exposure.\n\nHowever, spot bitcoin ETFs allow advisors to expose clients to bitcoin in a wrapper that advisors are comfortable with. The products enable direct ownership of bitcoin. But, as I mentioned above, they also offer the benefits associated with the ETF structure.\n\nIt’s Risk All the Way Down\n\nGordon: The SEC maintains its obstructive stance toward crypto in the U.S. in its ongoing refusal to create regulations for this new asset class. So where does that leave blockchain and bitcoin? A purely speculative venture based on a technology that has yet to prove its real-world mettle and worth. And as we all know, speculative investments carry inherently elevated risks.\n\nBitcoin prices reached all-time highs on November 9, 2021, peaking at $67,617. Prices were buoyed by the enthusiasm and optimism of approving the first bitcoin futures ETFs. One year later, prices had plummeted to $15,742 as of November 10, 2022.\n\nFast-forward to now. Bitcoin ETFs launched on January 11, with bitcoin prices spiking at $49,000. As of Tuesday morning, January 23, bitcoin traded at $38,711. All the investors who piled into spot bitcoin ETFs have lost 21% in less than two weeks.\n\nWhat’s more, there is genuine concern that because bitcoin is speculative (not directly linked to any real-world assets), an influx of investors into the space will only exacerbate the already significant volatility.\n\nIs Volatility in Spot Bitcoin ETFs Overplayed?\n\nCaruso: It’s true that bitcoin prices can be highly volatile. However, during the one-year period trailing January 11, there were 202 ETFs that had higher one-year volatility than bitcoin, according to Dave LaValle, Grayscale’s global head of ETFs.\n\nThere’s volatility in crypto, and the ETF wrapper won’t mitigate that volatility; however, it may be overplayed or misunderstood. This makes it imperative for investors to know what they own.\n\nI mentioned tracking error earlier, and I think that’s important to drill down on. Many investors are focused on the fees. However, a few basis points difference in fees has a smaller impact than a substantial difference in tracking error.\n\nIn the first week that the new spot bitcoin ETFs were trading, Fidelity and Invesco’s funds (FBTC and BTCO, respectively) were leagues ahead of the rest regarding minimizing tracking error. Although the data is still fresh, this is worth considering for investors looking to add exposure to the space.\n\nBitcoin Exacerbates the Climate Crisis\n\nGordon: It’s true that many bitcoin ETFs are tracking with minimal errors, which is extremely important for such a volatile asset class. I need to step past the trading mechanisms and look at bitcoin itself, however, for my last point. More accurately, I need to talk about how bitcoins are created.\n\nBitcoin mining has been in the public eye for a few years now for the intense energy drain that mining bitcoins requires. New bitcoins are minted using a proof-of-work model, which requires computers and massive server banks. The Digiconomist estimates that bitcoin uses 137.68 TWh of electricity annually, more than Colombia and Portugal’s 2022 energy use combined.\n\nImage source: Digiconomist\n\nThe vast majority of miners still rely on fossil fuels for energy sources. While increased awareness and efforts are needed to transition bitcoin miners to green energies, progress remains slow. What’s more, the bitcoin blockchain is consuming exponentially more water each year. The blockchain consumed 591.2 gigaliters (GL) in 2020, 1,576.7 GL in 2021, and estimates for 2023 are around 2,237 GL, according to recent research published in Cell Reports Sustainability. In a world of increasing water scarcity and climate crisis, the bitcoin token creation model only serves to tip the scales in the wrong direction.\n\nFor investors with an eye for climate, alternative assets, and opportunity, carbon offsets are an asset class to consider. Carbon credit markets offer similar nascence as crypto. For investors comfortable with a riskier volatility profile akin to that of bitcoin and cryptocurrencies, carbon credits are worth a look. Investors can gain exposure through funds like the Carbon Credits Strategy ETF (NTRL) and the KraneShares Global Carbon Offset Strategy ETF (KSET).\n\nIn a year rife with risk, investing in spot bitcoin ETFs seems counterintuitive to the security most investors seek. For those investors seeking more protections but alternatives to stocks and bonds, the regulated carbon cap-and-trade markets are an asset class to consider. Funds include the KraneShares Global Carbon Strategy ETF (KRBN) and the Carbon Strategy ETF (KARB).\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjc0MjU3L2NvaW5iYXNlLWluc3RpdHV0aW9uYWwtZXhlY3Mtc2F5LWNyeXB0by1jYW4tZ28tbWFpbnN0cmVhbS13aXRoLXNwb3QtYml0Y29pbi1ldGZzLW5vdy1saXZl0gGBAWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI3NDI1Ny9jb2luYmFzZS1pbnN0aXR1dGlvbmFsLWV4ZWNzLXNheS1jcnlwdG8tY2FuLWdvLW1haW5zdHJlYW0td2l0aC1zcG90LWJpdGNvaW4tZXRmcy1ub3ctbGl2ZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Coinbase Institutional execs say 'crypto can go mainstream' with spot bitcoin ETFs now live - The Block",
        "content": "The arrival of spot bitcoin ETFs in the U.S. has opened the door for crypto to reach a wider audience, according to two Coinbase Institutional executives.\n\n\"I think the most interesting bit that's getting a little bit drowned out by some desire to have headlines is it's the first time crypto can go mainstream,\" Head of Coinbase Institutional Brett Tejpaul told The Block in an interview, alongside Coinbase Head of Institutional Product Greg Tusar.\n\n\"And in all the years that Greg and I have been here trying to build the institutional business, this is like the very moment we've been waiting for. So, for us, it's the next chapter of this asset class,\" Tejpaul added.\n\nBringing in traditional asset managers\n\nEarlier this month, 11 spot bitcoin ETFs were approved and have since seen $20 billion in trading volume. Eight products are using Coinbase as a custodian, while traditional finance companies like JPMorgan, Jane Street, Cantor Fitzgerald and Macquarie Capital have been named as authorized participants.\n\n\"What's awesome about it is if you look at the quality of the names, both on the crypto first side, ranging through to more traditional names, you have this mix of asset managers, all of whom are saying they all have, quite significant client demand,\" said Tejpaul.\n\nTejpaul noted that the ETF approvals have reawakened interest in discussions, and everyone's asking the same question: \"Are the other guys thinking about deploying more capital?\"\n\nRELATED INDICES See crypto indices\n\nFocusing on a smooth launch\n\nExcluding Grayscale, the ETFs have grown to $4.4 billion in assets under management after seven days of trading. Including Grayscale, the products combined have seen a net outflow of $87 million. While this has come below some expectations, the Coinbase executives said the focus among all issuers was on ensuring a smooth launch above all else.\n\nTusar said Coinbase had spent a lot of time preparing for one set of operational procedures around an in-kind model, which then had to be pivoted toward the cash creation and redemption model — something the SEC requested in the final weeks, The Block previously reported. \"Despite all of that, I feel like, operationally, this all came off on the first day without a hitch,\" said Tusar.\n\nTejpaul concurred. “You can't underestimate the amount of effort and time that both Coinbase and all the clients were putting into the days and weeks leading up to the launch to make sure that everything went smoothly on both sides, to actually not just Coinbase ourselves, but also everyone working in concert with one another, including, market makers, service providers, etc,\" he said.\n\n\"I think everyone was wanting to de-risk the launch and make sure things were smooth, and then begin to progressively scale from there,\" he said.\n\nTusar added that he expects these products to gather a lot of assets but that it won’t happen overnight. Instead it might take months and even years."
    }
]